{"title": "How DeepMind's AlphaGo Defeated Lee Sedol", "description": "This time around, Google DeepMind embarked on a journey to write an algorithm that plays Go. Go is an ancient chinese board game where the opposing players try to capture each other's stones on the board. Behind the veil of this deceptively simple ruleset, lies an enormous layer of depth and complexity. As scientists like to say, the search space of this problem is significantly larger than that of chess. So large, that one often has to rely on human intuition to find a suitable next move, therefore it is not surprising that playing Go on a high level is, or maybe was widely believed to be intractable for machines. The result is Google DeepMind's AlphaGo, the deep learning technique that defeated a professional player and world champion, Lee Sedol. What it also important to note is that the techniques used in this algorithm are general, and can be used for a large number of different tasks. By this, I mean not AlphaGo specifically, but the Monte Carlo Tree Search, the value network and deep neural networks. The paper \"Mastering the Game of Go with Deep Neural Networks and Tree Search\" is available here: https://storage.googleapis.com/deepmind-data/assets/papers/deepmind-mastering-go.pdf http://www.nature.com/nature/journal/v529/n7587/full/nature16961.html A great Go analysis video by Brady Daniels. Make sure to check it out and subscribe if you like what you see there! https://www.youtube.com/watch?v=dOQsY... The mentioned post on the Go reddit: https://www.reddit.com/r/baduk/comments/49y17z/the true strength of alphago/ Some clarification on what part of the algorithm is specific to Go and how: https://news.ycombinator.com/item?id=11280744 Go board image credits (all CC BY 2.0): Renato Ganoza - https://flic.kr/p/7nX4kK Jaro Larnos - https://flic.kr/p/dDeQU9 Luis de Bethencourt - https://flic.kr/p/4c5RaR", "link": "https://www.youtube.com/watch?v=a-ovvd_ZrmA", "tags": ["DL"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.675, "date_project": "2016-03-15 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 268, "sentences": 11, "sum_nltk": "This time around, Google DeepMind embarked on a journey to write an algorithm that plays Go. Go is an ancient chinese board game where the opposing players try to capture each other's stones on the board.\nAs scientists like to say, the search space of this problem is significantly larger than that of chess.\nThe result is Google DeepMind's AlphaGo, the deep learning technique that defeated a professional player and world champion, Lee Sedol.\nWhat it also important to note is that the techniques used in this algorithm are general, and can be used for a large number of different tasks.\nBy this, I mean not AlphaGo specifically, but the Monte Carlo Tree Search, the value network and deep neural networks.\nThe paper \"Mastering the Game of Go with Deep Neural Networks and Tree Search\" is available here: https://storage.googleapis.com/deepmind-data/assets/papers/deepmind-mastering-go.pdf http://www.nature.com/nature/journal/v529/n7587/full/nature16961.html A great Go analysis video by Brady Daniels.\nThe mentioned post on the Go reddit: https://www.reddit.com/r/baduk/comments/49y17z/the true strength of alphago/ Some clarification on what part of the algorithm is specific to Go and how: https://news.ycombinator.com/item?id=11280744 Go board image credits (all CC BY 2.0): Renato Ganoza - https://flic.kr/p/7nX4kK Jaro Larnos - https://flic.kr/p/dDeQU9 Luis de Bethencourt - https://flic.kr/p/4c5RaR", "sum_nltk_words": 190, "sum_nltk_runtime": 0.004, "sum_t5": "google deepmind has written an algorithm that plays go. the algorithm is based on the technique that defeated a professional player. the algorithm is general and can be used for a large number of different tasks. it is based on the Monte Carlo Tree Search and the value network. a video analysis of the algorithm is available here. a video of the algorithm is available here. a chinese board game. a google spokesman says the algorithm is \"a great example of a", "sum_t5_words": 82, "sum_t5_runtime": 9.054, "language_code": "en", "language": "english", "language_score": "0.9999975280998424", "tags_descriptive": ["Deep Learning (DL)"], "description_lemmatized": "time around google deepmind embarked journey write algorithm play go go ancient chinese board game opposing player try capture others stone board behind veil deceptively simple ruleset lie enormous layer depth complexity scientist like say search space problem significantly larger chess large one often rely human intuition find suitable next move therefore surprising playing go high level maybe widely believed intractable machine result google deepminds alphago deep learning technique defeated professional player world champion lee sedol also important note technique used algorithm general used large number different task mean alphago specifically monte carlo tree search value network deep neural network paper mastering game go deep neural network tree search available httpsstoragegoogleapiscomdeepminddataassetspapersdeepmindmasteringgopdf httpwwwnaturecomnaturejournalv529n7587fullnature16961html great go analysis video brady daniel make sure check subscribe like see httpswwwyoutubecomwatchvdoqsy mentioned post go reddit httpswwwredditcomrbadukcomments49y17zthe true strength alphago clarification part algorithm specific go httpsnewsycombinatorcomitemid11280744 go board image credit cc 20 renato ganoza httpsflickrp7nx4kk jaro larnos httpsflickrpddequ9 luis de bethencourt httpsflickrp4c5rar", "sum_nltk_lemmatized": "time around google deepmind embarked journey write algorithm play go go ancient chinese board game opposing player try capture others stone board scientist like say search space problem significantly larger chess result google deepminds alphago deep learning technique defeated professional player world champion lee sedol also important note technique used algorithm general used large number different task mean alphago specifically monte carlo tree search value network deep neural network paper mastering game go deep neural network tree search available httpsstoragegoogleapiscomdeepminddataassetspapersdeepmindmasteringgopdf httpwwwnaturecomnaturejournalv529n7587fullnature16961html great go analysis video brady daniel mentioned post go reddit httpswwwredditcomrbadukcomments49y17zthe true strength alphago clarification part algorithm specific go httpsnewsycombinatorcomitemid11280744 go board image credit cc 20 renato ganoza httpsflickrp7nx4kk jaro larnos httpsflickrpddequ9 luis de bethencourt httpsflickrp4c5rar", "runtime": 9.076}