{"title": "Simulating Breaking Glass", "description": "There is something inherently exciting about watching breaking glass and other objects. Researchers in computer graphics also like to have some fun and write simulation programs to smash together a variety of virtual objects in slow motion. However, despite being beautiful, they are physically not correct as many effects are neglected, such as simulating plasticity, bending stiffness, stretching energies and many others. Pfaff et al.'s paper \"Adaptive Tearing and Cracking of Thin Sheets\" addresses this issue by creating an adaptive simulator that uses more computational resources only around regions where cracks are likely to happen. This new technique enables the simulation of tearing for a variety of materials like cork, foils, metals, vinyl and it also yields physically correct results for glass. The algorithm also lets artists influence the outcome to be in line with their artistic visions. Pfaff et al.'s research paper \"Adaptive Tearing and Cracking of Thin Sheets\" is available here: http://graphics.berkeley.edu/papers/Pfaff-ATC-2014-07/ Disclaimer: I was not part of this research project, I am merely providing commentary on this work. In Two Minute Papers, I attempt to bring the most awesome research discoveries to everyone a couple minutes at a time. The shattered glass image from the thumbnail was created by Andrew Magill. Music: \"Jolly Old St Nicholas\" by E's Jammy Jams", "link": "https://www.youtube.com/watch?v=A7Gut679I-o", "tags": [], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6719999999999999, "date_project": "2015-08-22 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 213, "sentences": 10, "sum_nltk": "There is something inherently exciting about watching breaking glass and other objects.\nResearchers in computer graphics also like to have some fun and write simulation programs to smash together a variety of virtual objects in slow motion.\nHowever, despite being beautiful, they are physically not correct as many effects are neglected, such as simulating plasticity, bending stiffness, stretching energies and many others.\nPfaff et al.'s paper \"Adaptive Tearing and Cracking of Thin Sheets\" addresses this issue by creating an adaptive simulator that uses more computational resources only around regions where cracks are likely to happen.\nThis new technique enables the simulation of tearing for a variety of materials like cork, foils, metals, vinyl and it also yields physically correct results for glass.\nThe algorithm also lets artists influence the outcome to be in line with their artistic visions.\nPfaff et al.'s research paper \"Adaptive Tearing and Cracking of Thin Sheets\" is available here: http://graphics.berkeley.edu/papers/Pfaff-ATC-2014-07/ Disclaimer: I was not part of this research project, I am merely providing commentary on this work.\nIn Two Minute Papers, I attempt to bring the most awesome research discoveries to everyone a couple minutes at a time.\nThe shattered glass image from the thumbnail was created by Andrew Magill.", "sum_nltk_words": 196, "sum_nltk_runtime": 0.004, "sum_t5": "researchers create adaptive cracking simulator that uses more computational resources. technique enables simulation of tearing for cork, foils, metals, vinyl and cork. paper was published in two minute papers. john sutter: \"i'm just bringing the most awesome research discoveries to everyone a couple minutes at a time\" he says he was not part of this research project, merely providing commentary on this work. sutter: \"i'm not going to lie, i'm", "sum_t5_words": 70, "sum_t5_runtime": 6.415, "language_code": "en", "language": "english", "language_score": "0.9999965837146616", "tags_descriptive": [], "description_lemmatized": "something inherently exciting watching breaking glass object researcher computer graphic also like fun write simulation program smash together variety virtual object slow motion however despite beautiful physically correct many effect neglected simulating plasticity bending stiffness stretching energy many others pfaff et al paper adaptive tearing cracking thin sheet address issue creating adaptive simulator us computational resource around region crack likely happen new technique enables simulation tearing variety material like cork foil metal vinyl also yield physically correct result glass algorithm also let artist influence outcome line artistic vision pfaff et al research paper adaptive tearing cracking thin sheet available httpgraphicsberkeleyedupaperspfaffatc201407 disclaimer part research project merely providing commentary work two minute paper attempt bring awesome research discovery everyone couple minute time shattered glass image thumbnail created andrew magill music jolly old st nicholas e jammy jam", "sum_nltk_lemmatized": "something inherently exciting watching breaking glass object researcher computer graphic also like fun write simulation program smash together variety virtual object slow motion however despite beautiful physically correct many effect neglected simulating plasticity bending stiffness stretching energy many others pfaff et al paper adaptive tearing cracking thin sheet address issue creating adaptive simulator us computational resource around region crack likely happen new technique enables simulation tearing variety material like cork foil metal vinyl also yield physically correct result glass algorithm also let artist influence outcome line artistic vision pfaff et al research paper adaptive tearing cracking thin sheet available httpgraphicsberkeleyedupaperspfaffatc201407 disclaimer part research project merely providing commentary work two minute paper attempt bring awesome research discovery everyone couple minute time shattered glass image thumbnail created andrew magill", "runtime": 6.433}