{"title": "Fluid Simulations with Blender and Wavelet Turbulence", "description": "Creating detailed fluid and smoke simulations in Blender and other modeling software is a slow and laborious process that requires a ton of time and resources. Wavelet Turbulence is a technique that helps achieving similar effects orders of magnitude faster. It is also much lighter on memory and is now widely used in the industry, so it's definitely not an accident that Theodore Kim won an Academy Award (a technical Oscar, if you will) for this SIGGRAPH publication. It is implemented in Blender and is available for everyone free of charge, so make sure to try it out! In Two Minute Papers, I attempt to bring the most awesome research discoveries to everyone a couple minutes at a time. Here is a tutorial and a Blender download link to get you started: http://blender.org/ https://www.youtube.com/watch?v=iV43x... Kim et al.'s Wavelet Turbulence paper is available here: http://www.cs.cornell.edu/~tedkim/wturb/ Disclaimer: I was not part of this research project, I am merely providing commentary on this work.", "link": "https://www.youtube.com/watch?v=5xLSbj5SsSE", "tags": [], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.651, "date_project": "2015-07-28 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 161, "sentences": 6, "language_code": "en", "language": "english", "language_score": "0.9999978243063626", "tags_descriptive": [], "description_lemmatized": "creating detailed fluid smoke simulation blender modeling software slow laborious process requires ton time resource wavelet turbulence technique help achieving similar effect order magnitude faster also much lighter memory widely used industry definitely accident theodore kim academy award technical oscar siggraph publication implemented blender available everyone free charge make sure try two minute paper attempt bring awesome research discovery everyone couple minute time tutorial blender download link get started httpblenderorg httpswwwyoutubecomwatchviv43x kim et al wavelet turbulence paper available httpwwwcscornelledutedkimwturb disclaimer part research project merely providing commentary work", "runtime": 0.008}