{"title": "How DeepMind Conquered Go With Deep Learning (AlphaGo)", "description": "This time around, Google DeepMind embarked on a journey to write an algorithm that plays Go. Go is an ancient chinese board game where the opposing players try to capture each other's stones on the board. Behind the veil of this deceptively simple ruleset, lies an enormous layer of depth and complexity. As scientists like to say, the search space of this problem is significantly larger than that of chess. So large, that one often has to rely on human intuition to find a suitable next move, therefore it is not surprising that playing Go on a high level is, or maybe was widely believed to be intractable for machines. The result is Google DeepMind's AlphaGo, the deep learning technique that defeated a professional player and European champion, Fan Hui. The paper \"Mastering the Game of Go with Deep Neural Networks and Tree Search\" is available here: https://storage.googleapis.com/deepmind-data/assets/papers/deepmind-mastering-go.pdf http://www.nature.com/nature/journal/v529/n7587/full/nature16961.html Wired's coverage of AlphaGo: http://www.wired.com/2016/01/in-a-huge-breakthrough-googles-ai-beats-a-top-player-at-the-game-of-go/ Video coverage from DeepMind and Nature: https://www.youtube.com/watch?v=g-dKX... https://www.youtube.com/watch?v=SUbqy... Myungwan Kim analysis: https://www.youtube.com/watch?v=NHRHU... Photo credits: Watson - AP Photo/Jeopardy Productions, Inc. Fan Hui match photo - Google DeepMind - https://www.youtube.com/watch?v=SUbqy... Go board image credits (all CC BY 2.0): Renato Ganoza - https://flic.kr/p/7nX4kK Jaro Larnos (changes were applied, mostly recoloring) - https://flic.kr/p/dDeQU9 Luis de Bethencourt - https://flic.kr/p/4c5RaR Detailed analysis of the games against Fan Hui and some more speculation: https://www.reddit.com/r/MachineLearning/comments/43fl90/synopsis of top go professionals analysis of/", "link": "https://www.youtube.com/watch?v=IFmj5M5Q5jg", "tags": ["DL"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6819999999999999, "date_project": "2016-01-31 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 228, "sentences": 12, "sum_nltk": "This time around, Google DeepMind embarked on a journey to write an algorithm that plays Go. Go is an ancient chinese board game where the opposing players try to capture each other's stones on the board.\nSo large, that one often has to rely on human intuition to find a suitable next move, therefore it is not surprising that playing Go on a high level is, or maybe was widely believed to be intractable for machines.\nThe result is Google DeepMind's AlphaGo, the deep learning technique that defeated a professional player and European champion, Fan Hui. The paper \"Mastering the Game of Go with Deep Neural Networks and Tree Search\" is available here: https://storage.googleapis.com/deepmind-data/assets/papers/deepmind-mastering-go.pdf http://www.nature.com/nature/journal/v529/n7587/full/nature16961.html Wired's coverage of AlphaGo: http://www.wired.com/2016/01/in-a-huge-breakthrough-googles-ai-beats-a-top-player-at-the-game-of-go/ Video coverage from DeepMind and Nature: https://www.youtube.com/watch?v=g-dKX...\nhttps://www.youtube.com/watch?v=SUbqy...\nMyungwan Kim analysis: https://www.youtube.com/watch?v=NHRHU...\nPhoto credits: Watson - AP Photo/Jeopardy Productions, Inc. Fan Hui match photo - Google DeepMind - https://www.youtube.com/watch?v=SUbqy...\nGo board image credits (all CC BY 2.0): Renato Ganoza - https://flic.kr/p/7nX4kK Jaro Larnos (changes were applied, mostly recoloring) - https://flic.kr/p/dDeQU9 Luis de Bethencourt - https://flic.kr/p/4c5RaR Detailed analysis of the games against Fan Hui and some more speculation: https://www.reddit.com/r/MachineLearning/comments/43fl90/synopsis of top go professionals analysis of/", "sum_nltk_words": 188, "sum_nltk_runtime": 0.005, "sum_t5": "google deepmind wrote algorithm that plays go. algorithm defeated professional player and european champion, Fan Hui. ai is a deep learning technique that has been used by deep learning algorithms. he is now a member of the google team. he is also the co-founder of deepmind. and the deep learning algorithm... ai is a chinese board game that uses a simple ruleset.", "sum_t5_words": 62, "sum_t5_runtime": 7.73, "language_code": "en", "language": "english", "language_score": "0.9999954935914573", "tags_descriptive": ["Deep Learning (DL)"], "description_lemmatized": "time around google deepmind embarked journey write algorithm play go go ancient chinese board game opposing player try capture others stone board behind veil deceptively simple ruleset lie enormous layer depth complexity scientist like say search space problem significantly larger chess large one often rely human intuition find suitable next move therefore surprising playing go high level maybe widely believed intractable machine result google deepminds alphago deep learning technique defeated professional player european champion fan hui paper mastering game go deep neural network tree search available httpsstoragegoogleapiscomdeepminddataassetspapersdeepmindmasteringgopdf httpwwwnaturecomnaturejournalv529n7587fullnature16961html wireds coverage alphago httpwwwwiredcom201601inahugebreakthroughgooglesaibeatsatopplayeratthegameofgo video coverage deepmind nature httpswwwyoutubecomwatchvgdkx httpswwwyoutubecomwatchvsubqy myungwan kim analysis httpswwwyoutubecomwatchvnhrhu photo credit watson ap photojeopardy production inc fan hui match photo google deepmind httpswwwyoutubecomwatchvsubqy go board image credit cc 20 renato ganoza httpsflickrp7nx4kk jaro larnos change applied mostly recoloring httpsflickrpddequ9 luis de bethencourt httpsflickrp4c5rar detailed analysis game fan hui speculation httpswwwredditcomrmachinelearningcomments43fl90synopsis top go professional analysis", "sum_nltk_lemmatized": "time around google deepmind embarked journey write algorithm play go go ancient chinese board game opposing player try capture others stone board large one often rely human intuition find suitable next move therefore surprising playing go high level maybe widely believed intractable machine result google deepminds alphago deep learning technique defeated professional player european champion fan hui paper mastering game go deep neural network tree search available httpsstoragegoogleapiscomdeepminddataassetspapersdeepmindmasteringgopdf httpwwwnaturecomnaturejournalv529n7587fullnature16961html wireds coverage alphago httpwwwwiredcom201601inahugebreakthroughgooglesaibeatsatopplayeratthegameofgo video coverage deepmind nature httpswwwyoutubecomwatchvgdkx httpswwwyoutubecomwatchvsubqy myungwan kim analysis httpswwwyoutubecomwatchvnhrhu photo credit watson ap photojeopardy production inc fan hui match photo google deepmind httpswwwyoutubecomwatchvsubqy go board image credit cc 20 renato ganoza httpsflickrp7nx4kk jaro larnos change applied mostly recoloring httpsflickrpddequ9 luis de bethencourt httpsflickrp4c5rar detailed analysis game fan hui speculation httpswwwredditcomrmachinelearningcomments43fl90synopsis top go professional analysis", "runtime": 7.749}