{"title": "Digital Creatures Learn To Walk", "description": "In this episode, we are going to talk about computer animation, animating bipeds in particular. If we have the geometry of a creature, we need to specify the bones, the muscle routings and the muscle activations to make them able to walk. Depending on the body proportions and types, it may require quite a bit of trial and error to build muscle layouts so the creature doesn't collapse. Making them walk is even more difficult! This piece of work not only makes it happen for a variety of bipedal creatures, but the results are robust for a variety of target walking speeds, uneven terrain and other, unpleasant difficulties. The paper \"Flexible Muscle-Based Locomotion for Bipedal Creatures\" is available here: http://www.goatstream.com/research/papers/SA2013/ Disclaimer: I was not part of this research project, I am merely providing commentary on this work. Music: \"Daisy Dukes\" by Silent Partner", "link": "https://www.youtube.com/watch?v=kQ2bqz3HPJE", "tags": [], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.7250000000000001, "date_project": "2015-09-08 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 143, "sentences": 6, "language_code": "en", "language": "english", "language_score": "0.9999980622390382", "tags_descriptive": [], "description_lemmatized": "episode going talk computer animation animating biped particular geometry creature need specify bone muscle routings muscle activation make able walk depending body proportion type may require quite bit trial error build muscle layout creature doesnt collapse making walk even difficult piece work make happen variety bipedal creature result robust variety target walking speed uneven terrain unpleasant difficulty paper flexible musclebased locomotion bipedal creature available httpwwwgoatstreamcomresearchpaperssa2013 disclaimer part research project merely providing commentary work music daisy duke silent partner", "runtime": 0.01}