{"title": "Artificial Neural Networks and Deep Learning", "description": "Artificial neural networks provide us incredibly powerful tools in machine learning that are useful for a variety of tasks ranging from image classification to voice translation. So what is all the deep learning rage about? The media seems to be all over the newest neural network research of the DeepMind company that was recently acquired by Google. They used neural networks to create algorithms that are able to play Atari games, learn them like a human would, eventually achieving superhuman performance. Deep learning means that we use artificial neural network with multiple layers, making it even more powerful for more difficult tasks. These machine learning techniques proved to be useful for many tasks beyond image recognition: they also excel at weather predictions, breast cancer cell mitosis detection, brain image segmentation and toxicity prediction among many others. If you would like to know more about neural networks and deep learning, make sure to check out these talks from Andrew Ng: https://www.youtube.com/watch?v=n1ViN... https://www.youtube.com/watch?v=W15K9... You can also check out this gorgeous application of neural networks and reinforcement learning from Google DeepMind: http://www.wired.co.uk/news/archive/2015-02/25/google-deepmind-atari Disclaimer: I was not part of this research project, I am merely providing commentary on this work. In Two Minute Papers, I attempt to bring the most awesome research discoveries to everyone a couple minutes at a time. Music: \"Watercolors\" by John Deley and the 41 Players", "link": "https://www.youtube.com/watch?v=rCWTOOgVXyE", "tags": ["DL", "ANN", "Classification", "Image Segmentation", "RL"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6779999999999999, "date_project": "2015-08-14 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 226, "sentences": 10, "sum_nltk": "Artificial neural networks provide us incredibly powerful tools in machine learning that are useful for a variety of tasks ranging from image classification to voice translation.\nSo what is all the deep learning rage about?\nThe media seems to be all over the newest neural network research of the DeepMind company that was recently acquired by Google.\nThey used neural networks to create algorithms that are able to play Atari games, learn them like a human would, eventually achieving superhuman performance.\nDeep learning means that we use artificial neural network with multiple layers, making it even more powerful for more difficult tasks.\nThese machine learning techniques proved to be useful for many tasks beyond image recognition: they also excel at weather predictions, breast cancer cell mitosis detection, brain image segmentation and toxicity prediction among many others.\nIf you would like to know more about neural networks and deep learning, make sure to check out these talks from Andrew Ng: https://www.youtube.com/watch?v=n1ViN...\nhttps://www.youtube.com/watch?v=W15K9...\nYou can also check out this gorgeous application of neural networks and reinforcement learning from Google DeepMind: http://www.wired.co.uk/news/archive/2015-02/25/google-deepmind-atari Disclaimer: I was not part of this research project, I am merely providing commentary on this work.", "sum_nltk_words": 188, "sum_nltk_runtime": 0.005, "sum_t5": "google acquired deepmind, a company that uses artificial neural networks. the company is using the technology to create algorithms that can play Atari games. the technology is also used to predict weather, cancer and toxicity. the media seems to be all over the research of the company. a researcher at the university of california says the research is \"amazing\". a researcher at the university of california says the research is \"amazing\"", "sum_t5_words": 71, "sum_t5_runtime": 11.614, "language_code": "en", "language": "english", "language_score": "0.9999970357125322", "tags_descriptive": ["Deep Learning (DL)", "Artificial Neural Network (ANN)", "Classification", "Image Segmentation", "Reinforcement Learning (RL)"], "description_lemmatized": "artificial neural network provide u incredibly powerful tool machine learning useful variety task ranging image classification voice translation deep learning rage medium seems newest neural network research deepmind company recently acquired google used neural network create algorithm able play atari game learn like human would eventually achieving superhuman performance deep learning mean use artificial neural network multiple layer making even powerful difficult task machine learning technique proved useful many task beyond image recognition also excel weather prediction breast cancer cell mitosis detection brain image segmentation toxicity prediction among many others would like know neural network deep learning make sure check talk andrew ng httpswwwyoutubecomwatchvn1vin httpswwwyoutubecomwatchvw15k9 also check gorgeous application neural network reinforcement learning google deepmind httpwwwwiredcouknewsarchive20150225googledeepmindatari disclaimer part research project merely providing commentary work two minute paper attempt bring awesome research discovery everyone couple minute time music watercolor john deley 41 player", "sum_nltk_lemmatized": "artificial neural network provide u incredibly powerful tool machine learning useful variety task ranging image classification voice translation deep learning rage medium seems newest neural network research deepmind company recently acquired google used neural network create algorithm able play atari game learn like human would eventually achieving superhuman performance deep learning mean use artificial neural network multiple layer making even powerful difficult task machine learning technique proved useful many task beyond image recognition also excel weather prediction breast cancer cell mitosis detection brain image segmentation toxicity prediction among many others would like know neural network deep learning make sure check talk andrew ng httpswwwyoutubecomwatchvn1vin httpswwwyoutubecomwatchvw15k9 also check gorgeous application neural network reinforcement learning google deepmind httpwwwwiredcouknewsarchive20150225googledeepmindatari disclaimer part research project merely providing commentary work", "runtime": 11.636}