{"title": "OpenAI's Bot Beats DOTA World Champion Dendi", "description": "Some updates and clarifications follow: Update 1: we seem to have conflicting information on the training times - both 24 hours and 2 weeks was mentioned. We'll make sure to address this when the official paper appears. Update 2: more from OpenAI - https://blog.openai.com/more-on-dota-2/ Update 3: more reddit discussion on how to trick the bot into defeat: https://www.reddit.com/r/DotA2/comments/6t8qvs/openai bots were defeated atleast 50 times/ (thanks to nikre for the link) Update 4: an OpenAI employee provides more clarification on the training process - https://news.ycombinator.com/item?id=15001521 Apologies for the inaccuracies - I've watched every video and interview I could get my hands on and found quite a bit of conflicting information. I'll take this into consideration next time when something comes up without an official research paper. OpenAI's materials on their DOTA bot: https://blog.openai.com/dota-2/ Day9's DOTA learning videos are available here: https://www.youtube.com/playlist?list...", "link": "https://www.youtube.com/watch?v=cLC_GHZCOVQ", "tags": [], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.7250000000000001, "date_project": "2017-08-16 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 140, "sentences": 5, "language_code": "en", "language": "english", "language_score": "0.9999977280573823", "tags_descriptive": [], "description_lemmatized": "update clarification follow update 1 seem conflicting information training time 24 hour 2 week mentioned well make sure address official paper appears update 2 openai httpsblogopenaicommoreondota2 update 3 reddit discussion trick bot defeat httpswwwredditcomrdota2comments6t8qvsopenai bot defeated atleast 50 time thanks nikre link update 4 openai employee provides clarification training process httpsnewsycombinatorcomitemid15001521 apology inaccuracy ive watched every video interview could get hand found quite bit conflicting information ill take consideration next time something come without official research paper openais material dota bot httpsblogopenaicomdota2 day9s dota learning video available httpswwwyoutubecomplaylistlist", "runtime": 0.01}