{"title": "Adaptive Cloth Simulations", "description": "This time, we are going to set foot in cloth simulations that are widely used in the motion picture industry. Adaptive algorithms are a class of techniques that try to adapt at the problem that we have at hand. This adaptive method focuses computational resources to regions which are likely to have fine details (wrinkles) and coarsens the simulation quality in regions that are at rest. This substantially reduces the computation time we need for the cloth simulation step. The paper \"Adaptive Anisotropic Remeshing for Cloth Simulation\" by Narain et al. is available here: http://graphics.berkeley.edu/papers/Narain-AAR-2012-11/ Recommended for you - Adaptive Fluid Simulations: https://www.youtube.com/watch?v=dH1s4... The YouTube channel of Sardi Pax with lots of useful Blender tutorials is available here: https://www.youtube.com/user/srf123 Here are some Blender (and cloth simulation) tutorials to get you started: https://www.youtube.com/watch?v=lZe3t... https://www.youtube.com/watch?v=k4czh... https://www.youtube.com/watch?v=gARJx... http://blender.org/ The background of the thumbnail image is the work of Theresa Thompson: https://flic.kr/p/5khSsE It has went through slight modifications (rotation and a monochrome transform). Splash screen/thumbnail design: Felcia Fehr - http://felicia.hu", "link": "https://www.youtube.com/watch?v=LU3pdWTD4Rw", "tags": ["Recommender"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.644, "date_project": "2015-10-07 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 166, "sentences": 11, "language_code": "en", "language": "english", "language_score": "0.9999949139428825", "tags_descriptive": ["Recommender"], "description_lemmatized": "time going set foot cloth simulation widely used motion picture industry adaptive algorithm class technique try adapt problem hand adaptive method focus computational resource region likely fine detail wrinkle coarsens simulation quality region rest substantially reduces computation time need cloth simulation step paper adaptive anisotropic remeshing cloth simulation narain et al available httpgraphicsberkeleyedupapersnarainaar201211 recommended adaptive fluid simulation httpswwwyoutubecomwatchvdh1s4 youtube channel sardi pax lot useful blender tutorial available httpswwwyoutubecomusersrf123 blender cloth simulation tutorial get started httpswwwyoutubecomwatchvlze3t httpswwwyoutubecomwatchvk4czh httpswwwyoutubecomwatchvgarjx httpblenderorg background thumbnail image work theresa thompson httpsflickrp5khsse went slight modification rotation monochrome transform splash screenthumbnail design felcia fehr httpfeliciahu", "runtime": 0.01}