{"title": "Adaptive Fluid Simulations", "description": "There are computer programs that can simulate the behavior of fluids, such as water, milk, honey and many others. However, creating detailed simulations takes a really long time, up to days even for a few seconds of video footage. Adaptive algorithms are a class of techniques that try to adapt at the problem that we have at hand. This adaptive method focuses computational resources to regions which are visible and have many fine details, and coarsens the simulation quality in regions that are not visible (or interesting). The resulting algorithm is much more efficient at simulating small scale turbulent details. Recommended for you - Wavelet Turbulence: https://www.youtube.com/watch?v=5xLSb... The paper \"Highly Adaptive Liquid Simulations on Tetrahedral Meshes\" is available here: http://pub.ist.ac.at/groupwojtan/pro... Disclaimer: I was not part of this research project, I am merely providing commentary on this work. Music: \"Awakening\" by Silent Partner", "link": "https://www.youtube.com/watch?v=dH1s49-lrBk", "tags": ["Recommender"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.7485, "date_project": "2015-09-21 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 142, "sentences": 9, "language_code": "en", "language": "english", "language_score": "0.9999970586768593", "tags_descriptive": ["Recommender"], "description_lemmatized": "computer program simulate behavior fluid water milk honey many others however creating detailed simulation take really long time day even second video footage adaptive algorithm class technique try adapt problem hand adaptive method focus computational resource region visible many fine detail coarsens simulation quality region visible interesting resulting algorithm much efficient simulating small scale turbulent detail recommended wavelet turbulence httpswwwyoutubecomwatchv5xlsb paper highly adaptive liquid simulation tetrahedral mesh available httppubistacatgroupwojtanpro disclaimer part research project merely providing commentary work music awakening silent partner", "runtime": 0.018}