{"title": "Hydrographic Printing", "description": "3D printing is a technique to create digital objects in real life. This technology is mostly focused on reproducing the digital geometry itself - colored patterns (textures) still remains a challenge, and we only have very rudimentary technology to do that. Hydrographic printing on 3D surfaces is a really simple technique: you place a film in water, use a chemical activator spray on it, and shove the object in the water. However, since these objects start stretching the film, the technique is not very accurate, and it only helps you putting repetitive patterns on these objects. Computational Hydrographic Printing is a technique that simulates all of these physical forces that are exerted on the film when your desired object is immersed into the water. Then, it creates a new image map taking all of these distortions into account, and this image you can print with your home inkjet printer. The results will be really accurate, close to indistinguishable from the digitally designed object. The paper \"Computational Hydrographic Printing\" is available here: http://www.cs.columbia.edu/~cxz/publications/hydrographics.pdf Disclaimer: I was not part of this research project, I am merely providing commentary on this work. The splash screen background was taken from \"Computational Hydrographic Printing\" by Zheng et al. Splash screen/thumbnail design: Felcia Fehr - http://felicia.hu Flickr: Wonderlane Link: https://flic.kr/p/atCLXr Music: Soul Groove by Audionautix - it is licensed under a Creative Commons Attribution license (https://creativecommons.org/licenses/by/4.0/) Artist: http://audionautix.com/", "link": "https://www.youtube.com/watch?v=kLnG073NYtw", "tags": [], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6675, "date_project": "2015-08-31 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 232, "sentences": 10, "sum_nltk": "3D printing is a technique to create digital objects in real life.\nThis technology is mostly focused on reproducing the digital geometry itself - colored patterns (textures) still remains a challenge, and we only have very rudimentary technology to do that.\nHydrographic printing on 3D surfaces is a really simple technique: you place a film in water, use a chemical activator spray on it, and shove the object in the water.\nHowever, since these objects start stretching the film, the technique is not very accurate, and it only helps you putting repetitive patterns on these objects.\nComputational Hydrographic Printing is a technique that simulates all of these physical forces that are exerted on the film when your desired object is immersed into the water.\nThen, it creates a new image map taking all of these distortions into account, and this image you can print with your home inkjet printer.\nThe results will be really accurate, close to indistinguishable from the digitally designed object.\nThe paper \"Computational Hydrographic Printing\" is available here: http://www.cs.columbia.edu/~cxz/publications/hydrographics.pdf Disclaimer: I was not part of this research project, I am merely providing commentary on this work.\nThe splash screen background was taken from \"Computational Hydrographic Printing\" by Zheng et al.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.005, "sum_t5": "3D printing is a technique to create digital objects in real life. it is mostly focused on reproducing the digital geometry itself. but the technology is not very accurate, and it only helps you putting repetitive patterns on these objects. the splash screen background was taken from \"Computational Hydrographic Printing\" by Zheng et al.. the results will be really accurate, close to indistinguishable from the digitally designed object.", "sum_t5_words": 68, "sum_t5_runtime": 7.435, "language_code": "en", "language": "english", "language_score": "0.9999951024632951", "tags_descriptive": [], "description_lemmatized": "3d printing technique create digital object real life technology mostly focused reproducing digital geometry colored pattern texture still remains challenge rudimentary technology hydrographic printing 3d surface really simple technique place film water use chemical activator spray shove object water however since object start stretching film technique accurate help putting repetitive pattern object computational hydrographic printing technique simulates physical force exerted film desired object immersed water creates new image map taking distortion account image print home inkjet printer result really accurate close indistinguishable digitally designed object paper computational hydrographic printing available httpwwwcscolumbiaeducxzpublicationshydrographicspdf disclaimer part research project merely providing commentary work splash screen background taken computational hydrographic printing zheng et al splash screenthumbnail design felcia fehr httpfeliciahu flickr wonderlane link httpsflickrpatclxr music soul groove audionautix licensed creative common attribution license httpscreativecommonsorglicensesby40 artist httpaudionautixcom", "sum_nltk_lemmatized": "3d printing technique create digital object real life technology mostly focused reproducing digital geometry colored pattern texture still remains challenge rudimentary technology hydrographic printing 3d surface really simple technique place film water use chemical activator spray shove object water however since object start stretching film technique accurate help putting repetitive pattern object computational hydrographic printing technique simulates physical force exerted film desired object immersed water creates new image map taking distortion account image print home inkjet printer result really accurate close indistinguishable digitally designed object paper computational hydrographic printing available httpwwwcscolumbiaeducxzpublicationshydrographicspdf disclaimer part research project merely providing commentary work splash screen background taken computational hydrographic printing zheng et al", "runtime": 7.452}