{"title": "Metropolis Light Transport", "description": "Metropolis light transport is an advanced photorealistic rendering technique that is remarkably effective at finding the brighter regions of a scene and building many light paths that target these regions. The resulting algorithm is more efficient than traditional random path building algorithms, such as path tracing. The paper \"Metropolis Light Transport\" by Veach and Guibas is available here: https://graphics.stanford.edu/papers/metro/ I held a course on photorealistic rendering at the Technical University of Vienna. Here you can learn how the physics of light works and to write programs like this: https://www.youtube.com/playlist?list... Recommended for you: Manipulating Photorealistic Renderings - https://www.youtube.com/watch?v=L7MOe... Ray Tracing, Subsurface Scattering @ Function 2015 - https://www.youtube.com/watch?v=qyDUv... A more elaborate discussion on Metropolis Light Transport - https://www.youtube.com/watch?v=Zl36H... Eric Veach's Sci-tech award speech: https://www.youtube.com/watch?v=e3ss... Scene credits: Italian Still Life - Bhavin Solanki - http://www.blendswap.com/blends/view/67815 Spheres - Vlad Miller (SATtva) - http://www.luxrender.net/wiki/Show-off pack Music: \"Bet On It\" by Silent Partner. A higher resolution version of the sphere scene comparison is available here: https://cg.tuwien.ac.at/~zsolnai/gfx/adaptive metropolis/ The image from fxguide is available here: http://www.fxguide.com/featured/the-state-of-rendering-part-2/", "link": "https://www.youtube.com/watch?v=f0Uzit_-h3M", "tags": ["Recommender"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6970000000000001, "date_project": "2015-10-14 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 169, "sentences": 10, "language_code": "en", "language": "english", "language_score": "0.9999971194674826", "tags_descriptive": ["Recommender"], "description_lemmatized": "metropolis light transport advanced photorealistic rendering technique remarkably effective finding brighter region scene building many light path target region resulting algorithm efficient traditional random path building algorithm path tracing paper metropolis light transport veach guibas available httpsgraphicsstanfordedupapersmetro held course photorealistic rendering technical university vienna learn physic light work write program like httpswwwyoutubecomplaylistlist recommended manipulating photorealistic rendering httpswwwyoutubecomwatchvl7moe ray tracing subsurface scattering function 2015 httpswwwyoutubecomwatchvqyduv elaborate discussion metropolis light transport httpswwwyoutubecomwatchvzl36h eric veachs scitech award speech httpswwwyoutubecomwatchve3ss scene credit italian still life bhavin solanki httpwwwblendswapcomblendsview67815 sphere vlad miller sattva httpwwwluxrendernetwikishowoff pack music bet silent partner higher resolution version sphere scene comparison available httpscgtuwienacatzsolnaigfxadaptive metropolis image fxguide available httpwwwfxguidecomfeaturedthestateofrenderingpart2", "runtime": 0.01}