{"title": "WaveNet by Google DeepMind", "description": "Let's talk about Google DeepMind's Wavenet! This piece of work is about generating audio waveforms for Text To Speech and more. Text To Speech basically means that we have a voice reading whatever we have written down. The difference in this work, is, however that it can synthesize these samples in someone's voice provided that we have training samples of this person speaking. The paper \"WaveNet: A Generative Model for Raw Audio\" is available here: https://arxiv.org/abs/1609.03499 The blog post about this with the sound samples is available here: https://deepmind.com/blog/wavenet-generative-model-raw-audio/ The machine learning reddit thread about this paper is available here: https://www.reddit.com/r/MachineLearning/comments/51sr9t/deepmind wavenet a generative model for raw audio/?ref=search posts Recommended for you: Every Two Minute Papers episode on deep learning: https://www.youtube.com/playlist?list...", "link": "https://www.youtube.com/watch?v=CqFIVCD1WWo", "tags": ["Recommender", "DL"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.7545, "date_project": "2016-09-12 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 121, "sentences": 4, "language_code": "en", "language": "english", "language_score": "0.9999974840259751", "tags_descriptive": ["Recommender", "Deep Learning (DL)"], "description_lemmatized": "let talk google deepminds wavenet piece work generating audio waveform text speech text speech basically mean voice reading whatever written difference work however synthesize sample someone voice provided training sample person speaking paper wavenet generative model raw audio available httpsarxivorgabs160903499 blog post sound sample available httpsdeepmindcomblogwavenetgenerativemodelrawaudio machine learning reddit thread paper available httpswwwredditcomrmachinelearningcomments51sr9tdeepmind wavenet generative model raw audiorefsearch post recommended every two minute paper episode deep learning httpswwwyoutubecomplaylistlist", "runtime": 0.013}