{"title": "3D Printing Objects With Caustics", "description": "What are caustics? A caustic is a beautiful phenomenon in nature where curved surfaces reflect or refract light, thereby concentrating it to a relatively small area. This technique makes it possible to essentially imagine any kind of caustic pattern, for instance, this brain pattern, and it will create the model that will cast caustics that look exactly like that. It also works with sunlight, and you can also choose different colors for your caustics. The authors found their simulations to be in good agreement with reality, therefore the desired caustic patterns can be fabricated faithfully. The paper \"High-contrast Computational Caustic Design\" is available here: http://chateaunoir.net/caustics.html The full Rendering course at the TU Wien is available here: https://www.youtube.com/playlist?list... More results from this project are available here: http://rayform.ch/", "link": "https://www.youtube.com/watch?v=_r-eIKkyAco", "tags": [], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.639, "date_project": "2016-01-17 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 126, "sentences": 6, "language_code": "en", "language": "english", "language_score": "0.999998100381161", "tags_descriptive": [], "description_lemmatized": "caustic caustic beautiful phenomenon nature curved surface reflect refract light thereby concentrating relatively small area technique make possible essentially imagine kind caustic pattern instance brain pattern create model cast caustic look exactly like also work sunlight also choose different color caustic author found simulation good agreement reality therefore desired caustic pattern fabricated faithfully paper highcontrast computational caustic design available httpchateaunoirnetcausticshtml full rendering course tu wien available httpswwwyoutubecomplaylistlist result project available httprayformch", "runtime": 0.02}