{"title": "StyLit, Illumination-Guided Artistic Style Transfer", "description": "Earlier, we have talked quite a bit about a fantastic new tool that we called artistic style transfer. This means that we have an input photograph that we'd like to modify, and another image from which we'd like to extract the artistic style. This way, we can, for instance, change our photo to look in the style of famous artists. Today, we're going to talk about a flamboyant little technique that is able to perform artistic style transfer in a way that preserves the illumination of the scene. The paper \"StyLit: Illumination-Guided Example-Based Stylization of 3D Renderings\" is available here: http://dcgi.fel.cvut.cz/home/sykorad/stylit Recommended for you: Artistic Style Transfer For Videos - https://www.youtube.com/watch?v=Uxax5... Deep Neural Network Learns Van Gogh's Art - https://www.youtube.com/watch?v=-R9bJ... Neural Material Synthesis (this contains discussions on diffuse and specular materials)- https://www.youtube.com/watch?v=XpwW3...", "link": "https://www.youtube.com/watch?v=ksCSL6Ql0Yg", "tags": ["Recommender"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6930000000000001, "date_project": "2016-09-01 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 132, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999971020534034", "tags_descriptive": ["Recommender"], "description_lemmatized": "earlier talked quite bit fantastic new tool called artistic style transfer mean input photograph wed like modify another image wed like extract artistic style way instance change photo look style famous artist today going talk flamboyant little technique able perform artistic style transfer way preserve illumination scene paper stylit illuminationguided examplebased stylization 3d rendering available httpdcgifelcvutczhomesykoradstylit recommended artistic style transfer video httpswwwyoutubecomwatchvuxax5 deep neural network learns van gogh art httpswwwyoutubecomwatchvr9bj neural material synthesis contains discussion diffuse specular material httpswwwyoutubecomwatchvxpww3", "runtime": 0.008}