{"title": "Artificial Superintelligence [Audio only]", "description": "Humanity is getting closer and closer to creating human-level intelligence. The question nowadays is not if it will happen, but when it will be happen. Through recursive self-improvement, machine intelligence may quickly surpass the level of humans, creating an artificial superintelligent entity. The intelligence of such entity is so unfathomable, that we cannot even wrap our head around what it would be capable of, just as ants cannot grasp the concept of radio waves. Elon Musk compares creating an artificial superintelligence to \"summoning the demon\", and he offered 10 million dollars to research a safe way to develop this technology. Recommended for you: Are We Living In a Computer Simulation? - https://www.youtube.com/watch?v=ATN9o... A great article on Superintelligence on Wait But Why (there are two parts): http://waitbutwhy.com/2015/01/artificial-intelligence-revolution-1.html http://waitbutwhy.com/2015/01/artificial-intelligence-revolution-1.html A talk from Tim Urban, author of Wait But Why: https://www.youtube.com/watch?v=O7xfJ... One more excellent article reflecting on the article above: http://lukemuehlhauser.com/a-reply-to-wait-but-why-on-machine-superintelligence/ Nick Bostrom - Artificial Superintelligence: http://www.amazon.com/gp/product/0199678111?ref =cm sw r awd fkm-tb0J07SSW Elon Musk's $10 million for ethical AI research: http://www.forbes.com/sites/ericmack/2015/01/15/elon-musk-puts-down-10-million-to-fight-skynet/ A neat study from the Machine Intelligence Research Institute (MIRI): https://intelligence.org/files/CEV.pdf Nick Bostrom's poll on when we will achieve superintelligence: http://sophia.de/pdf/2014PT-AIpolls... A science paper claims that our knowledge about the genetic human-mammal differences may be misguided: http://www.plosgenetics.org/article/info%3Adoi%2F10.1371%2Fjournal.pgen.1004525 Excellent discussions on superintelligence: https://www.youtube.com/watch?v=MnT1x... https://www.youtube.com/watch?v=pywF6... https://www.youtube.com/watch?v=h9NB0...", "link": "https://www.youtube.com/watch?v=08V_F19HUfI", "tags": ["Recommender"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.7135, "date_project": "2015-11-29 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 212, "sentences": 11, "sum_nltk": "Humanity is getting closer and closer to creating human-level intelligence.\nThe question nowadays is not if it will happen, but when it will be happen.\nThrough recursive self-improvement, machine intelligence may quickly surpass the level of humans, creating an artificial superintelligent entity.\nThe intelligence of such entity is so unfathomable, that we cannot even wrap our head around what it would be capable of, just as ants cannot grasp the concept of radio waves.\nElon Musk compares creating an artificial superintelligence to \"summoning the demon\", and he offered 10 million dollars to research a safe way to develop this technology.\n- https://www.youtube.com/watch?v=ATN9o...\nA great article on Superintelligence on Wait But Why (there are two parts): http://waitbutwhy.com/2015/01/artificial-intelligence-revolution-1.html http://waitbutwhy.com/2015/01/artificial-intelligence-revolution-1.html A talk from Tim Urban, author of Wait But Why: https://www.youtube.com/watch?v=O7xfJ...\nOne more excellent article reflecting on the article above: http://lukemuehlhauser.com/a-reply-to-wait-but-why-on-machine-superintelligence/ Nick Bostrom - Artificial Superintelligence: http://www.amazon.com/gp/product/0199678111?ref =cm sw r awd fkm-tb0J07SSW Elon Musk's $10 million for ethical AI research: http://www.forbes.com/sites/ericmack/2015/01/15/elon-musk-puts-down-10-million-to-fight-skynet/ A neat study from the Machine Intelligence Research Institute (MIRI): https://intelligence.org/files/CEV.pdf Nick Bostrom's poll on when we will achieve superintelligence: http://sophia.de/pdf/2014PT-AIpolls...\nA science paper claims that our knowledge about the genetic human-mammal differences may be misguided: http://www.plosgenetics.org/article/info%3Adoi%2F10.1371%2Fjournal.pgen.1004525 Excellent discussions on superintelligence: https://www.youtube.com/watch?v=MnT1x...\nhttps://www.youtube.com/watch?v=pywF6...\nhttps://www.youtube.com/watch?v=h9NB0...", "sum_nltk_words": 192, "sum_nltk_runtime": 0.009, "sum_t5": "a poll by the machine intelligence research institute (MIRI) says we will soon achieve superintelligence. a spokesman for the u.s. government says it is pursuing a \"safe way\" to develop such a technology. a spokesman for the u.s. government says it is pursuing a \"safe way\" to develop such a technology. a spokesman for the u.s. government says it is pursuing a \"safe way\" to develop such", "sum_t5_words": 67, "sum_t5_runtime": 8.792, "language_code": "en", "language": "english", "language_score": "0.9999968704833935", "tags_descriptive": ["Recommender"], "description_lemmatized": "humanity getting closer closer creating humanlevel intelligence question nowadays happen happen recursive selfimprovement machine intelligence may quickly surpass level human creating artificial superintelligent entity intelligence entity unfathomable cannot even wrap head around would capable ant cannot grasp concept radio wave elon musk compare creating artificial superintelligence summoning demon offered 10 million dollar research safe way develop technology recommended living computer simulation httpswwwyoutubecomwatchvatn9o great article superintelligence wait two part httpwaitbutwhycom201501artificialintelligencerevolution1html httpwaitbutwhycom201501artificialintelligencerevolution1html talk tim urban author wait httpswwwyoutubecomwatchvo7xfj one excellent article reflecting article httplukemuehlhausercomareplytowaitbutwhyonmachinesuperintelligence nick bostrom artificial superintelligence httpwwwamazoncomgpproduct0199678111ref cm sw r awd fkmtb0j07ssw elon musk 10 million ethical ai research httpwwwforbescomsitesericmack20150115elonmuskputsdown10milliontofightskynet neat study machine intelligence research institute miri httpsintelligenceorgfilescevpdf nick bostroms poll achieve superintelligence httpsophiadepdf2014ptaipolls science paper claim knowledge genetic humanmammal difference may misguided httpwwwplosgeneticsorgarticleinfo3adoi2f1013712fjournalpgen1004525 excellent discussion superintelligence httpswwwyoutubecomwatchvmnt1x httpswwwyoutubecomwatchvpywf6 httpswwwyoutubecomwatchvh9nb0", "sum_nltk_lemmatized": "humanity getting closer closer creating humanlevel intelligence question nowadays happen happen recursive selfimprovement machine intelligence may quickly surpass level human creating artificial superintelligent entity intelligence entity unfathomable cannot even wrap head around would capable ant cannot grasp concept radio wave elon musk compare creating artificial superintelligence summoning demon offered 10 million dollar research safe way develop technology httpswwwyoutubecomwatchvatn9o great article superintelligence wait two part httpwaitbutwhycom201501artificialintelligencerevolution1html httpwaitbutwhycom201501artificialintelligencerevolution1html talk tim urban author wait httpswwwyoutubecomwatchvo7xfj one excellent article reflecting article httplukemuehlhausercomareplytowaitbutwhyonmachinesuperintelligence nick bostrom artificial superintelligence httpwwwamazoncomgpproduct0199678111ref cm sw r awd fkmtb0j07ssw elon musk 10 million ethical ai research httpwwwforbescomsitesericmack20150115elonmuskputsdown10milliontofightskynet neat study machine intelligence research institute miri httpsintelligenceorgfilescevpdf nick bostroms poll achieve superintelligence httpsophiadepdf2014ptaipolls science paper claim knowledge genetic humanmammal difference may misguided httpwwwplosgeneticsorgarticleinfo3adoi2f1013712fjournalpgen1004525 excellent discussion superintelligence httpswwwyoutubecomwatchvmnt1x httpswwwyoutubecomwatchvpywf6 httpswwwyoutubecomwatchvh9nb0", "runtime": 8.821}