{"title": "Manipulating Photorealistic Renderings", "description": "Photorealistic rendering (also called global illumination) enables us to see how digital objects would look like in real life. It is an amazingly powerful tool in the hands of a professional artist, who can create breathtaking images or animations with. However, for the longest time, artists didn't use it in the movie industry because it did not offer a great artistic freedom - after all, it works according to the laws of physics, which are exact. This piece of work enables us to apply artistic edits to photorealistic renderings easily and intuitively. I believe this one has the potential to single-handedly change the landscape of photorealistic rendering on a production scale. VFX tricks with photorealistic rendering in Game of Thrones: https://www.youtube.com/watch?v=C56t6... https://www.youtube.com/watch?v=YJDsl... The paper \"Path-Space Manipulation of Physically-Based Light Transport\" is available here: https://cg.ivd.kit.edu/english/PSMPBLT.php Disclaimer: I was not part of this research project, I am merely providing commentary on this work. I held a course on photorealistic rendering at the Technical University of Vienna. Here you can learn how the physics of light works and to write programs like this: https://www.youtube.com/playlist?list... Lightrig: http://lightrig.de/ Function 2015 demoparty: http://2015.function.hu/ Scene credits: Last Light - J the Ninja (Jason Clarke) - also used as the thumbnail background Italian Style Still Life - Bhavin Solanki Interior scene - EnzoR Klein Bottle - BravoZulu Audi R8 - barryangus SL65 \"Black edition\" - zuzzi Music: \"Do It Right\" by Jingle Punks The thumbnail background was created by Jason Clarke. Splash screen/thumbnail design: Felcia Fehr - http://felicia.hu", "link": "https://www.youtube.com/watch?v=L7MOeQw47BM", "tags": [], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6385000000000001, "date_project": "2015-09-11 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 250, "sentences": 12, "sum_nltk": "Photorealistic rendering (also called global illumination) enables us to see how digital objects would look like in real life.\nHowever, for the longest time, artists didn't use it in the movie industry because it did not offer a great artistic freedom - after all, it works according to the laws of physics, which are exact.\nThis piece of work enables us to apply artistic edits to photorealistic renderings easily and intuitively.\nVFX tricks with photorealistic rendering in Game of Thrones: https://www.youtube.com/watch?v=C56t6...\nhttps://www.youtube.com/watch?v=YJDsl...\nThe paper \"Path-Space Manipulation of Physically-Based Light Transport\" is available here: https://cg.ivd.kit.edu/english/PSMPBLT.php Disclaimer: I was not part of this research project, I am merely providing commentary on this work.\nI held a course on photorealistic rendering at the Technical University of Vienna.\nHere you can learn how the physics of light works and to write programs like this: https://www.youtube.com/playlist?list...\nLightrig: http://lightrig.de/ Function 2015 demoparty: http://2015.function.hu/ Scene credits: Last Light - J the Ninja (Jason Clarke) - also used as the thumbnail background Italian Style Still Life - Bhavin Solanki Interior scene - EnzoR Klein Bottle - BravoZulu Audi R8 - barryangus SL65 \"Black edition\" - zuzzi Music: \"Do It Right\" by Jingle Punks The thumbnail background was created by Jason Clarke.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.009, "sum_t5": "photorealistic rendering (also called global illumination) enables us to see how digital objects would look like in real life. for the longest time, artists didn't use it in the movie industry because it did not offer a great artistic freedom. this piece of work enables us to apply artistic edits to photorealistic renderings easily and intuitively. it has the potential to single-handedly change the landscape of photorealistic rendering on a production scale.", "sum_t5_words": 72, "sum_t5_runtime": 7.629, "language_code": "en", "language": "english", "language_score": "0.9999950719614554", "tags_descriptive": [], "description_lemmatized": "photorealistic rendering also called global illumination enables u see digital object would look like real life amazingly powerful tool hand professional artist create breathtaking image animation however longest time artist didnt use movie industry offer great artistic freedom work according law physic exact piece work enables u apply artistic edits photorealistic rendering easily intuitively believe one potential singlehandedly change landscape photorealistic rendering production scale vfx trick photorealistic rendering game throne httpswwwyoutubecomwatchvc56t6 httpswwwyoutubecomwatchvyjdsl paper pathspace manipulation physicallybased light transport available httpscgivdkiteduenglishpsmpbltphp disclaimer part research project merely providing commentary work held course photorealistic rendering technical university vienna learn physic light work write program like httpswwwyoutubecomplaylistlist lightrig httplightrigde function 2015 demoparty http2015functionhu scene credit last light j ninja jason clarke also used thumbnail background italian style still life bhavin solanki interior scene enzor klein bottle bravozulu audi r8 barryangus sl65 black edition zuzzi music right jingle punk thumbnail background created jason clarke splash screenthumbnail design felcia fehr httpfeliciahu", "sum_nltk_lemmatized": "photorealistic rendering also called global illumination enables u see digital object would look like real life however longest time artist didnt use movie industry offer great artistic freedom work according law physic exact piece work enables u apply artistic edits photorealistic rendering easily intuitively vfx trick photorealistic rendering game throne httpswwwyoutubecomwatchvc56t6 httpswwwyoutubecomwatchvyjdsl paper pathspace manipulation physicallybased light transport available httpscgivdkiteduenglishpsmpbltphp disclaimer part research project merely providing commentary work held course photorealistic rendering technical university vienna learn physic light work write program like httpswwwyoutubecomplaylistlist lightrig httplightrigde function 2015 demoparty http2015functionhu scene credit last light j ninja jason clarke also used thumbnail background italian style still life bhavin solanki interior scene enzor klein bottle bravozulu audi r8 barryangus sl65 black edition zuzzi music right jingle punk thumbnail background created jason clarke", "runtime": 7.652}