{"title": "Terrain Traversal with Reinforcement Learning", "description": "Reinforcement learning is a technique that can learn how to play computer games, or any kind of activity that requires a sequence of actions. In this case, we would like a digital dog to run, and leap over and onto obstacles by choosing the optimal next action. It is quite difficult as there are a lot of body parts to control in harmony. And what is really amazing is that if it has learned everything properly, it will come up with exactly the same movements as we'd expect animals to do in real life! In this technique, dogs were used to demonstrate that reinforcement learning works well in this context, but it's worth noting that it also works with bipeds. The paper \"Dynamic Terrain Traversal Skills Using Reinforcement Learning \" is available here: http://www.cs.ubc.ca/~van/papers/2015-TOG-terrainRL/ Recommended for you: Digital Creatures Learn To Walk - https://www.youtube.com/watch?v=kQ2bq...", "link": "https://www.youtube.com/watch?v=_yjHPu1aYCY", "tags": ["RL", "Recommender"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.653, "date_project": "2015-11-18 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 144, "sentences": 5, "language_code": "en", "language": "english", "language_score": "0.9999964858894634", "tags_descriptive": ["Reinforcement Learning (RL)", "Recommender"], "description_lemmatized": "reinforcement learning technique learn play computer game kind activity requires sequence action case would like digital dog run leap onto obstacle choosing optimal next action quite difficult lot body part control harmony really amazing learned everything properly come exactly movement wed expect animal real life technique dog used demonstrate reinforcement learning work well context worth noting also work biped paper dynamic terrain traversal skill using reinforcement learning available httpwwwcsubccavanpapers2015togterrainrl recommended digital creature learn walk httpswwwyoutubecomwatchvkq2bq", "runtime": 0.015}