{"title": "Gradients, Poisson's Equation and Light Transport", "description": "Photorealistic rendering (also called global illumination) enables us to see how digital objects would look like in real life. It is an amazingly powerful tool in the hands of a professional artist, who can create breathtaking images or animations with. However, images created with these technique contain a substantial amount of noise until a large number of light rays are computed. Today, we're going to talk about how to use gradients and Poisson's equation to speed up this process substantially. The paper \"Gradient-Domain Path Tracing\" is available here: https://mediatech.aalto.fi/publications/graphics/GPT/ The paper \"Gradient-Domain Metropolis Light Transport\" is available here: https://mediatech.aalto.fi/publications/graphics/GPT/ I held a course on photorealistic rendering at the Technical University of Vienna. Here you can learn how the physics of light works and to write programs like this: https://www.youtube.com/playlist?list... Recommended for you: Metropolis Light Transport - https://www.youtube.com/watch?v=f0Uzi... Manipulating Photorealistic Renderings - https://www.youtube.com/watch?v=L7MOe... A talk on ray tracing - https://www.youtube.com/watch?v=qyDUv... The Moon's elevation map is provided by NASA and is available here (license: CC BY 2.0) - https://flic.kr/p/aFqE3n Music: \"Infinite Perspective\" by Kevin MacLeod is licensed under a Creative Commons Attribution license (https://creativecommons.org/licenses/by/4.0/) Source: http://incompetech.com/music/royalty-free/index.html?isrc=USUAN1500024 Artist: http://incompetech.com/", "link": "https://www.youtube.com/watch?v=sSnDTPjfBYU", "tags": ["Recommender"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.677, "date_project": "2015-10-26 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 186, "sentences": 10, "language_code": "en", "language": "english", "language_score": "0.9999972806129399", "tags_descriptive": ["Recommender"], "description_lemmatized": "photorealistic rendering also called global illumination enables u see digital object would look like real life amazingly powerful tool hand professional artist create breathtaking image animation however image created technique contain substantial amount noise large number light ray computed today going talk use gradient poissons equation speed process substantially paper gradientdomain path tracing available httpsmediatechaaltofipublicationsgraphicsgpt paper gradientdomain metropolis light transport available httpsmediatechaaltofipublicationsgraphicsgpt held course photorealistic rendering technical university vienna learn physic light work write program like httpswwwyoutubecomplaylistlist recommended metropolis light transport httpswwwyoutubecomwatchvf0uzi manipulating photorealistic rendering httpswwwyoutubecomwatchvl7moe talk ray tracing httpswwwyoutubecomwatchvqyduv moon elevation map provided nasa available license cc 20 httpsflickrpafqe3n music infinite perspective kevin macleod licensed creative common attribution license httpscreativecommonsorglicensesby40 source httpincompetechcommusicroyaltyfreeindexhtmlisrcusuan1500024 artist httpincompetechcom", "runtime": 0.011}