{"title": "Time Lapse Videos From Community Photos", "description": "Building time lapse videos from community photographs is an incredibly difficult and laborious task: these photos were taken at a different part of the year, from different times of the day, with different viewpoints and cameras. A good algorithm should try to equalize these images and bring them to a common denominator to get rid of the commonly seen flickering effect. Researchers at the University of Washington and Google nailed this regularization in their newest work that they showcased at SIGGRAPH 2015. Check out the video for the details! Photograph credits in the video: Flickr user dration, Zack Lee, Nadav Tobias, Juan Jesus Oro and Klaus Wikirchen. In the original paper, photographs from the following Flickr users were reproduced under Creative Commons license: Aliento Ms All, jirihnidek, mcxurxo, elka cz, Daikrieg, Free the image, Cebete and ToastyKen. The paper \"Time-lapse Mining from Internet Photos\" is available here: http://grail.cs.washington.edu/projects/timelapse/ Disclaimer: I was not part of this research project, I am merely providing commentary on this work. Thumbnail background by Davidw: https://www.flickr.com/photos/davidw/2297191644/ https://creativecommons.org/licenses/by/2.0/", "link": "https://www.youtube.com/watch?v=UePDRN94C8c", "tags": [], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.62, "date_project": "2015-08-25 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 171, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999968159388841", "tags_descriptive": [], "description_lemmatized": "building time lapse video community photograph incredibly difficult laborious task photo taken different part year different time day different viewpoint camera good algorithm try equalize image bring common denominator get rid commonly seen flickering effect researcher university washington google nailed regularization newest work showcased siggraph 2015 check video detail photograph credit video flickr user dration zack lee nadav tobias juan jesus oro klaus wikirchen original paper photograph following flickr user reproduced creative common license aliento m jirihnidek mcxurxo elka cz daikrieg free image cebete toastyken paper timelapse mining internet photo available httpgrailcswashingtoneduprojectstimelapse disclaimer part research project merely providing commentary work thumbnail background davidw httpswwwflickrcomphotosdavidw2297191644 httpscreativecommonsorglicensesby20", "runtime": 0.008}