{"title": "Visually Indicated Sounds", "description": "The Scholarly Store is available here: https://shop.spreadshirt.net/TwoMinutePapers Using the power of deep learning, it is now possible to create a technique that looks at a silent video and synthesize appropriate sound effects for it. The usage is at the moment, limited to hitting these objects with a drumstick. Note: The authors seem to lean on a database of sounds, i.e., the synthesis does not happen from scratch, but they are not merely fetching the database entry for a given sound, but performing example-based synthesis (Section 5.2 in the paper below). In the video and the paper, they both use the words \"synthesized sound\" and \"predicted sound\", and it may be a bit unclear what degree of synthesis qualifies as a \"synthesized sound\". I think this is definitely worthy of further scrutiny. The paper \"Visually Indicated Sounds\" is available here: https://arxiv.org/abs/1512.08512 Recommended for you: What Do Virtual Objects Sound Like? - https://www.youtube.com/watch?v=ZaFqv... Synthesizing Sound From Collisions - https://www.youtube.com/watch?v=rskdL... Reconstructing Sound From Vibrations - https://www.youtube.com/watch?v=2i1hr... Our deep learning-related videos are available here (if you are looking for convolutional neural networks, recurrent neural networks): https://www.youtube.com/playlist?list...", "link": "https://www.youtube.com/watch?v=flOevlA9RyQ", "tags": ["Recommender", "RNN", "DL", "CNN"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.648, "date_project": "2016-07-17 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 182, "sentences": 9, "language_code": "en", "language": "english", "language_score": "0.9999977228342306", "tags_descriptive": ["Recommender", "Recurrent Neural Network (RNN)", "Deep Learning (DL)", "Convolutional Neural Network (CNN)"], "description_lemmatized": "scholarly store available httpsshopspreadshirtnettwominutepapers using power deep learning possible create technique look silent video synthesize appropriate sound effect usage moment limited hitting object drumstick note author seem lean database sound ie synthesis happen scratch merely fetching database entry given sound performing examplebased synthesis section 52 paper video paper use word synthesized sound predicted sound may bit unclear degree synthesis qualifies synthesized sound think definitely worthy scrutiny paper visually indicated sound available httpsarxivorgabs151208512 recommended virtual object sound like httpswwwyoutubecomwatchvzafqv synthesizing sound collision httpswwwyoutubecomwatchvrskdl reconstructing sound vibration httpswwwyoutubecomwatchv2i1hr deep learningrelated video available looking convolutional neural network recurrent neural network httpswwwyoutubecomplaylistlist", "runtime": 0.009}