{"title": "Deep Learning Program Learns to Paint", "description": "Artificial neural networks were inspired by the human brain and simulate how neurons behave when they are shown a sensory input (e.g., images, sounds, etc). They are known to be excellent tools for image recognition, any many other problems beyond that - they also excel at weather predictions, breast cancer cell mitosis detection, brain image segmentation and toxicity prediction among many others. Deep learning means that we use an artificial neural network with multiple layers, making it even more powerful for more difficult tasks. This time they have been shown to be apt at reproducing the artistic style of many famous painters, such as Vincent Van Gogh and Pablo Picasso among many others. All the user needs to do is provide an input photograph and a target image from which the artistic style will be learned. The paper \"Combining Markov Random Fields and Convolutional Neural Networks for Image Synthesis\" is available here: http://arxiv.org/pdf/1601.04589v1.pdf Previous work - the paper \"A Neural Algorithm of Artistic Style\" is available here http://arxiv.org/pdf/1508.06576v2.pdf", "link": "https://www.youtube.com/watch?v=UGAzi1QBVEg", "tags": ["DL", "Image Segmentation", "ANN", "CNN"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6985, "date_project": "2016-02-24 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 168, "sentences": 6, "language_code": "en", "language": "english", "language_score": "0.9999958125816516", "tags_descriptive": ["Deep Learning (DL)", "Image Segmentation", "Artificial Neural Network (ANN)", "Convolutional Neural Network (CNN)"], "description_lemmatized": "artificial neural network inspired human brain simulate neuron behave shown sensory input eg image sound etc known excellent tool image recognition many problem beyond also excel weather prediction breast cancer cell mitosis detection brain image segmentation toxicity prediction among many others deep learning mean use artificial neural network multiple layer making even powerful difficult task time shown apt reproducing artistic style many famous painter vincent van gogh pablo picasso among many others user need provide input photograph target image artistic style learned paper combining markov random field convolutional neural network image synthesis available httparxivorgpdf160104589v1pdf previous work paper neural algorithm artistic style available httparxivorgpdf150806576v2pdf", "runtime": 0.008}