{"title": "Simulating Viscosity and Melting Fluids", "description": "In this series, we have studied fluid simulations extensively. But we haven't talked about one important quantity that describes a fluid, and this quantity is none other than viscosity. Viscosity means the resistance of a fluid against deformation. The large viscosity of honey makes it highly resistant to deformation, and this is responsible for its famous and beautiful coiling effect. Water, however, does not have a lot of objections against deformations, making it so easy to pour it into a glass. With this piece of work, it is possible to efficiently simulate the motion of fluids, and it supports the simulation of a large range of viscosities. The paper \"An Implicit Viscosity Formulation for SPH Fluids\" is available here: http://cg.informatik.uni-freiburg.de/publications/2015 SIGGRAPH viscousSPH.pdf Recommended for you: Painting with Fluid Simulations - https://www.youtube.com/watch?v=1aVSb... Modeling Colliding and Merging Fluids - https://www.youtube.com/watch?v=uj8b5... Adaptive Fluid Simulations - https://www.youtube.com/watch?v=dH1s4... Video source: Smarter Every Day - https://www.youtube.com/watch?v=zz5lG... The thumbnail image was created by Dino Giordano (CC BY 2.0) - https://flic.kr/p/4p9z4w", "link": "https://www.youtube.com/watch?v=KgIrnR2O8KQ", "tags": ["Recommender"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6699999999999999, "date_project": "2016-01-24 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 163, "sentences": 11, "language_code": "en", "language": "english", "language_score": "0.9999952551140419", "tags_descriptive": ["Recommender"], "description_lemmatized": "series studied fluid simulation extensively havent talked one important quantity describes fluid quantity none viscosity viscosity mean resistance fluid deformation large viscosity honey make highly resistant deformation responsible famous beautiful coiling effect water however lot objection deformation making easy pour glass piece work possible efficiently simulate motion fluid support simulation large range viscosity paper implicit viscosity formulation sph fluid available httpcginformatikunifreiburgdepublications2015 siggraph viscoussphpdf recommended painting fluid simulation httpswwwyoutubecomwatchv1avsb modeling colliding merging fluid httpswwwyoutubecomwatchvuj8b5 adaptive fluid simulation httpswwwyoutubecomwatchvdh1s4 video source smarter every day httpswwwyoutubecomwatchvzz5lg thumbnail image created dino giordano cc 20 httpsflickrp4p9z4w", "runtime": 0.007}