{"title": "9 Cool Deep Learning Applications", "description": "Machine learning provides us an incredible set of tools. If you have a difficult problem at hand, you don't need to hand craft an algorithm for it. It finds out by itself what is important about the problem and tries to solve it on its own. In this video, you'll see a number of incredible applications of different machine learning techniques (neural networks, deep learning, convolutional neural networks and more). Note: the fluid simulation paper is using regression forests, which is a machine learning technique, but not strictly deep learning. There are variants of it that are though (e.g., Deep Neural Decision Forests). The paper \"Toxicity Prediction using Deep Learning\" and \"Prediction of human population responses to toxic compounds by a collaborative competition\" are available here: http://arxiv.org/pdf/1503.01445.pdf http://www.nature.com/nbt/journal/v33/n9/full/nbt.3299.html The paper \"A Comparison of Algorithms and Humans For Mitosis Detection\" is available here: http://people.idsia.ch/~juergen/deeplearningwinsMICCAIgrandchallenge.html http://people.idsia.ch/~ciresan/data/isbi2014.pdf Kaggle-related things: http://kaggle.com https://www.kaggle.com/c/dato-native http://blog.kaggle.com/2015/12/03/dato-winners-interview-1st-place-mad-professors/ The paper \"Deep AutoRegressive Networks\" is available here: http://arxiv.org/pdf/1310.8499v2.pdf https://www.youtube.com/watch?v=-yX1S... The furniture completion paper, \"Data-driven Structural Priors for Shape Completion\" is available here: http://cs.stanford.edu/~mhsung/projects/structure-completion Data-driven fluid simulations using regression forests: https://graphics.ethz.ch/~sobarbar/papers/Lad15/DatadrivenFluids.mov https://www.inf.ethz.ch/personal/ladickyl/fluid sigasia15.pdf Selfies and convolutional neural networks: http://karpathy.github.io/2015/10/25/selfie/ Multiagent Cooperation and Competition with Deep Reinforcement Learning: http://arxiv.org/abs/1511.08779 https://www.youtube.com/watch?v=Gb9Dp... https://github.com/NeuroCSUT/DeepMind-Atari-Deep-Q-Learner-2Player Kaggle automatic essay scoring contest: https://www.kaggle.com/c/asap-aes http://www.vikparuchuri.com/blog/on-the-automated-scoring-of-essays/ Great talks on Kaggle: https://www.youtube.com/watch?v=9Zag7... https://www.youtube.com/watch?v=OKOlO... https://www.youtube.com/watch?v=R9Qxu... The thumbnail image was created by Barn Images - https://flic.kr/p/xxBc94", "link": "https://www.youtube.com/watch?v=Bui3DWs02h4", "tags": ["DL", "RL", "CNN", "Regression"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.7484999999999999, "date_project": "2016-01-05 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 223, "sentences": 12, "sum_nltk": "Machine learning provides us an incredible set of tools.\nIf you have a difficult problem at hand, you don't need to hand craft an algorithm for it.\nIt finds out by itself what is important about the problem and tries to solve it on its own.\nIn this video, you'll see a number of incredible applications of different machine learning techniques (neural networks, deep learning, convolutional neural networks and more).\nNote: the fluid simulation paper is using regression forests, which is a machine learning technique, but not strictly deep learning.\nThe paper \"Toxicity Prediction using Deep Learning\" and \"Prediction of human population responses to toxic compounds by a collaborative competition\" are available here: http://arxiv.org/pdf/1503.01445.pdf http://www.nature.com/nbt/journal/v33/n9/full/nbt.3299.html The paper \"A Comparison of Algorithms and Humans For Mitosis Detection\" is available here: http://people.idsia.ch/~juergen/deeplearningwinsMICCAIgrandchallenge.html http://people.idsia.ch/~ciresan/data/isbi2014.pdf Kaggle-related things: http://kaggle.com https://www.kaggle.com/c/dato-native http://blog.kaggle.com/2015/12/03/dato-winners-interview-1st-place-mad-professors/ The paper \"Deep AutoRegressive Networks\" is available here: http://arxiv.org/pdf/1310.8499v2.pdf https://www.youtube.com/watch?v=-yX1S...\nThe furniture completion paper, \"Data-driven Structural Priors for Shape Completion\" is available here: http://cs.stanford.edu/~mhsung/projects/structure-completion Data-driven fluid simulations using regression forests: https://graphics.ethz.ch/~sobarbar/papers/Lad15/DatadrivenFluids.mov https://www.inf.ethz.ch/personal/ladickyl/fluid sigasia15.pdf Selfies and convolutional neural networks: http://karpathy.github.io/2015/10/25/selfie/ Multiagent Cooperation and Competition with Deep Reinforcement Learning: http://arxiv.org/abs/1511.08779 https://www.youtube.com/watch?v=Gb9Dp...\nhttps://github.com/NeuroCSUT/DeepMind-Atari-Deep-Q-Learner-2Player Kaggle automatic essay scoring contest: https://www.kaggle.com/c/asap-aes http://www.vikparuchuri.com/blog/on-the-automated-scoring-of-essays/ Great talks on Kaggle: https://www.youtube.com/watch?v=9Zag7...\nhttps://www.youtube.com/watch?v=OKOlO...\nhttps://www.youtube.com/watch?v=R9Qxu...", "sum_nltk_words": 191, "sum_nltk_runtime": 0.006, "sum_t5": "a number of incredible applications of machine learning are being shown. the paper is using regression forests, which is a machine learning technique. there are variants of it that are though. the paper is based on a symbiosis study of a human. back to mail online home. back to the page you came from.. back to the page you came from.. back to the page you came from.", "sum_t5_words": 68, "sum_t5_runtime": 7.87, "language_code": "en", "language": "english", "language_score": "0.9999972490392506", "tags_descriptive": ["Deep Learning (DL)", "Reinforcement Learning (RL)", "Convolutional Neural Network (CNN)", "Regression"], "description_lemmatized": "machine learning provides u incredible set tool difficult problem hand dont need hand craft algorithm find important problem try solve video youll see number incredible application different machine learning technique neural network deep learning convolutional neural network note fluid simulation paper using regression forest machine learning technique strictly deep learning variant though eg deep neural decision forest paper toxicity prediction using deep learning prediction human population response toxic compound collaborative competition available httparxivorgpdf150301445pdf httpwwwnaturecomnbtjournalv33n9fullnbt3299html paper comparison algorithm human mitosis detection available httppeopleidsiachjuergendeeplearningwinsmiccaigrandchallengehtml httppeopleidsiachciresandataisbi2014pdf kagglerelated thing httpkagglecom httpswwwkagglecomcdatonative httpblogkagglecom20151203datowinnersinterview1stplacemadprofessors paper deep autoregressive network available httparxivorgpdf13108499v2pdf httpswwwyoutubecomwatchvyx1s furniture completion paper datadriven structural prior shape completion available httpcsstanfordedumhsungprojectsstructurecompletion datadriven fluid simulation using regression forest httpsgraphicsethzchsobarbarpaperslad15datadrivenfluidsmov httpswwwinfethzchpersonalladickylfluid sigasia15pdf selfies convolutional neural network httpkarpathygithubio20151025selfie multiagent cooperation competition deep reinforcement learning httparxivorgabs151108779 httpswwwyoutubecomwatchvgb9dp httpsgithubcomneurocsutdeepmindatarideepqlearner2player kaggle automatic essay scoring contest httpswwwkagglecomcasapaes httpwwwvikparuchuricomblogontheautomatedscoringofessays great talk kaggle httpswwwyoutubecomwatchv9zag7 httpswwwyoutubecomwatchvokolo httpswwwyoutubecomwatchvr9qxu thumbnail image created barn image httpsflickrpxxbc94", "sum_nltk_lemmatized": "machine learning provides u incredible set tool difficult problem hand dont need hand craft algorithm find important problem try solve video youll see number incredible application different machine learning technique neural network deep learning convolutional neural network note fluid simulation paper using regression forest machine learning technique strictly deep learning paper toxicity prediction using deep learning prediction human population response toxic compound collaborative competition available httparxivorgpdf150301445pdf httpwwwnaturecomnbtjournalv33n9fullnbt3299html paper comparison algorithm human mitosis detection available httppeopleidsiachjuergendeeplearningwinsmiccaigrandchallengehtml httppeopleidsiachciresandataisbi2014pdf kagglerelated thing httpkagglecom httpswwwkagglecomcdatonative httpblogkagglecom20151203datowinnersinterview1stplacemadprofessors paper deep autoregressive network available httparxivorgpdf13108499v2pdf httpswwwyoutubecomwatchvyx1s furniture completion paper datadriven structural prior shape completion available httpcsstanfordedumhsungprojectsstructurecompletion datadriven fluid simulation using regression forest httpsgraphicsethzchsobarbarpaperslad15datadrivenfluidsmov httpswwwinfethzchpersonalladickylfluid sigasia15pdf selfies convolutional neural network httpkarpathygithubio20151025selfie multiagent cooperation competition deep reinforcement learning httparxivorgabs151108779 httpswwwyoutubecomwatchvgb9dp httpsgithubcomneurocsutdeepmindatarideepqlearner2player kaggle automatic essay scoring contest httpswwwkagglecomcasapaes httpwwwvikparuchuricomblogontheautomatedscoringofessays great talk kaggle httpswwwyoutubecomwatchv9zag7 httpswwwyoutubecomwatchvokolo httpswwwyoutubecomwatchvr9qxu", "runtime": 7.894}