{"title": "Creating Photographs Using Deep Learning", "description": "Machine learning techniques such as deep learning artificial neural networks had proven to be extremely useful for a variety of tasks that were previously deemed very difficult, or even impossible to solve. In this work, a deep learning technique is used to learn how different light source positions affect a scene and create (\"guess\") new photographs with unknown light source positions. The results are absolutely stunning. The promised links for artificial neural networks follow below. The paper \"Image Based Relighting Using Neural Networks\" is available here: http://research.microsoft.com/en-us/um/people/yuedong/project/neuralibr/neuralibr.htm Disclaimer: I was not part of this research project, I am merely providing commentary on this work. Recommended for you: Artificial Neural Networks and Deep Learning - https://www.youtube.com/watch?v=rCWTO... Deep Neural Network Learns Van Gogh's Art - https://www.youtube.com/watch?v=-R9bJ... Music: \"The Place Inside\" by Silent Partner", "link": "https://www.youtube.com/watch?v=HOLoPgTzV6g", "tags": ["Recommender", "DL", "ANN"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.7130000000000001, "date_project": "2015-10-03 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 131, "sentences": 8, "language_code": "en", "language": "english", "language_score": "0.999998203369843", "tags_descriptive": ["Recommender", "Deep Learning (DL)", "Artificial Neural Network (ANN)"], "description_lemmatized": "machine learning technique deep learning artificial neural network proven extremely useful variety task previously deemed difficult even impossible solve work deep learning technique used learn different light source position affect scene create guess new photograph unknown light source position result absolutely stunning promised link artificial neural network follow paper image based relighting using neural network available httpresearchmicrosoftcomenusumpeopleyuedongprojectneuralibrneuralibrhtm disclaimer part research project merely providing commentary work recommended artificial neural network deep learning httpswwwyoutubecomwatchvrcwto deep neural network learns van gogh art httpswwwyoutubecomwatchvr9bj music place inside silent partner", "runtime": 0.008}