{"title": "Designing 3D Printable Robotic Creatures", "description": "This episode covers a paper from Disney Research on how to design 3D printable robots. In order to get a robot from A to B, one has to specify scientific attributes like trajectories and angular velocities. But people don't think in angular velocities, they think in intuitive actions, like moving forward, sideways, or even the style of a desired movement. Specifying these things instead would be much more useful, but also, scientifically quite challenging. One can specify the design of the robot, for instance, different shapes, motor positions, and joints can be added, and the technique finds out a physically plausible way for them to walk and move around. The paper \"Interactive Design of 3D Printable Robotic Creatures\" is available here: https://www.disneyresearch.com/publication/interactive-design-of-3d-printable-robotic-creatures/ Recommended for you: - Hydrographic Printing (in 3D) https://www.youtube.com/watch?v=kLnG0... - 3D Printing a Glockenspiel https://www.youtube.com/watch?v=2kOCT...", "link": "https://www.youtube.com/watch?v=ImIaoKsjgUE", "tags": ["Recommender"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6745, "date_project": "2016-01-12 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 137, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999961799947887", "tags_descriptive": ["Recommender"], "description_lemmatized": "episode cover paper disney research design 3d printable robot order get robot b one specify scientific attribute like trajectory angular velocity people dont think angular velocity think intuitive action like moving forward sideways even style desired movement specifying thing instead would much useful also scientifically quite challenging one specify design robot instance different shape motor position joint added technique find physically plausible way walk move around paper interactive design 3d printable robotic creature available httpswwwdisneyresearchcompublicationinteractivedesignof3dprintableroboticcreatures recommended hydrographic printing 3d httpswwwyoutubecomwatchvklng0 3d printing glockenspiel httpswwwyoutubecomwatchv2koct", "runtime": 0.013}