{"title": "Deep Neural Network Learns Van Gogh's Art", "description": "Artificial neural networks were inspired by the human brain and simulate how neurons behave when they are shown a sensory input (e.g., images, sounds, etc). They are known to be excellent tools for image recognition, any many other problems beyond that - they also excel at weather predictions, breast cancer cell mitosis detection, brain image segmentation and toxicity prediction among many others. Deep learning means that we use an artificial neural network with multiple layers, making it even more powerful for more difficult tasks. This time they have been shown to be apt at reproducing the artistic style of many famous painters, such as Vincent Van Gogh and Pablo Picasso among many others. All the user needs to do is provide an input photograph and a target image from which the artistic style will be learned. I promised some links, so here they come! The paper \"A Neural Algorithm of Artistic Style\" is available here: http://arxiv.org/abs/1508.06576v1 Disclaimer: I was not part of this research project, I am merely providing commentary on this work. Recommended for you - Two Minute Papers episode on Artificial Neural Networks: https://www.youtube.com/watch?v=rCWTO... Picasso meets Gandalf: http://mashable.com/2015/08/29/computer-photos/ A nice website with many results: https://deepart.io/ More examples with Picasso and some sketches: http://imgur.com/a/jeJB6 Google DeepMind's Deep Q-learning algorithm plays Atari games: https://www.youtube.com/watch?v=V1eYn... The first implementations / source code packages are now available: 1. http://gitxiv.com/posts/jG46ukGod8R7Rdtud/a-neural-algorithm-of-artistic-style 2. https://github.com/kaishengtai/neuralart 3. https://github.com/jcjohnson/neural-style A great read on Deep Dreaming Neural Networks: http://googleresearch.blogspot.co.uk/2015/06/inceptionism-going-deeper-into-neural.html Many of you have asked for the code. Some people were experimenting with it in the Machine Learning reddit. Check it out: https://www.reddit.com/r/MachineLearning/comments/3imx1m/a neural algorithm of artistic style/", "link": "https://www.youtube.com/watch?v=-R9bJGNHltQ", "tags": ["Recommender", "DL", "ANN", "Image Segmentation"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.7575000000000001, "date_project": "2015-08-29 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 267, "sentences": 14, "sum_nltk": "Artificial neural networks were inspired by the human brain and simulate how neurons behave when they are shown a sensory input (e.g., images, sounds, etc).\nDeep learning means that we use an artificial neural network with multiple layers, making it even more powerful for more difficult tasks.\nThis time they have been shown to be apt at reproducing the artistic style of many famous painters, such as Vincent Van Gogh and Pablo Picasso among many others.\nAll the user needs to do is provide an input photograph and a target image from which the artistic style will be learned.\nThe paper \"A Neural Algorithm of Artistic Style\" is available here: http://arxiv.org/abs/1508.06576v1 Disclaimer: I was not part of this research project, I am merely providing commentary on this work.\nRecommended for you - Two Minute Papers episode on Artificial Neural Networks: https://www.youtube.com/watch?v=rCWTO...\nPicasso meets Gandalf: http://mashable.com/2015/08/29/computer-photos/ A nice website with many results: https://deepart.io/ More examples with Picasso and some sketches: http://imgur.com/a/jeJB6 Google DeepMind's Deep Q-learning algorithm plays Atari games: https://www.youtube.com/watch?v=V1eYn...\nhttp://gitxiv.com/posts/jG46ukGod8R7Rdtud/a-neural-algorithm-of-artistic-style 2.\nhttps://github.com/kaishengtai/neuralart 3.\nhttps://github.com/jcjohnson/neural-style A great read on Deep Dreaming Neural Networks: http://googleresearch.blogspot.co.uk/2015/06/inceptionism-going-deeper-into-neural.html Many of you have asked for the code.\nCheck it out: https://www.reddit.com/r/MachineLearning/comments/3imx1m/a neural algorithm of artistic style/", "sum_nltk_words": 190, "sum_nltk_runtime": 0.011, "sum_t5": "artificial neural networks were inspired by the human brain and simulate how neurons behave when shown a sensory input. they excel at image recognition, breast cancer cell mitosis detection, brain image segmentation and toxicity prediction. this time they have been shown to be apt at reproducing the artistic style of many famous painters, such as Vincent Van Gogh and Pablo Picasso. the first implementations / source code packages are now available: 1. http://gitxiv.com/posts/jG46ukGod", "sum_t5_words": 73, "sum_t5_runtime": 9.293, "language_code": "en", "language": "english", "language_score": "0.9999957732168792", "tags_descriptive": ["Recommender", "Deep Learning (DL)", "Artificial Neural Network (ANN)", "Image Segmentation"], "description_lemmatized": "artificial neural network inspired human brain simulate neuron behave shown sensory input eg image sound etc known excellent tool image recognition many problem beyond also excel weather prediction breast cancer cell mitosis detection brain image segmentation toxicity prediction among many others deep learning mean use artificial neural network multiple layer making even powerful difficult task time shown apt reproducing artistic style many famous painter vincent van gogh pablo picasso among many others user need provide input photograph target image artistic style learned promised link come paper neural algorithm artistic style available httparxivorgabs150806576v1 disclaimer part research project merely providing commentary work recommended two minute paper episode artificial neural network httpswwwyoutubecomwatchvrcwto picasso meet gandalf httpmashablecom20150829computerphotos nice website many result httpsdeepartio example picasso sketch httpimgurcomajejb6 google deepminds deep qlearning algorithm play atari game httpswwwyoutubecomwatchvv1eyn first implementation source code package available 1 httpgitxivcompostsjg46ukgod8r7rdtudaneuralalgorithmofartisticstyle 2 httpsgithubcomkaishengtaineuralart 3 httpsgithubcomjcjohnsonneuralstyle great read deep dreaming neural network httpgoogleresearchblogspotcouk201506inceptionismgoingdeeperintoneuralhtml many asked code people experimenting machine learning reddit check httpswwwredditcomrmachinelearningcomments3imx1ma neural algorithm artistic style", "sum_nltk_lemmatized": "artificial neural network inspired human brain simulate neuron behave shown sensory input eg image sound etc deep learning mean use artificial neural network multiple layer making even powerful difficult task time shown apt reproducing artistic style many famous painter vincent van gogh pablo picasso among many others user need provide input photograph target image artistic style learned paper neural algorithm artistic style available httparxivorgabs150806576v1 disclaimer part research project merely providing commentary work recommended two minute paper episode artificial neural network httpswwwyoutubecomwatchvrcwto picasso meet gandalf httpmashablecom20150829computerphotos nice website many result httpsdeepartio example picasso sketch httpimgurcomajejb6 google deepminds deep qlearning algorithm play atari game httpswwwyoutubecomwatchvv1eyn httpgitxivcompostsjg46ukgod8r7rdtudaneuralalgorithmofartisticstyle 2 httpsgithubcomkaishengtaineuralart 3 httpsgithubcomjcjohnsonneuralstyle great read deep dreaming neural network httpgoogleresearchblogspotcouk201506inceptionismgoingdeeperintoneuralhtml many asked code check httpswwwredditcomrmachinelearningcomments3imx1ma neural algorithm artistic style", "runtime": 9.334}