{"title": "Artistic Style Transfer For Videos", "description": "Artificial neural networks were inspired by the human brain and simulate how neurons behave when they are shown a sensory input (e.g., images, sounds, etc). They are known to be excellent tools for image recognition, any many other problems beyond that - they also excel at weather predictions, breast cancer cell mitosis detection, brain image segmentation and toxicity prediction among many others. Deep learning means that we use an artificial neural network with multiple layers, making it even more powerful for more difficult tasks. This time they have been shown to be apt at reproducing the artistic style of many famous painters, such as Vincent Van Gogh and Pablo Picasso among many others. All the user needs to do is provide an input photograph and a target image from which the artistic style will be learned. And now, onto the next frontier: transferring artistic style to videos! The paper \"Artistic style transfer for videos\" is available here: http://arxiv.org/abs/1604.08610 The implementation of this technique is also available: https://github.com/manuelruder/artistic-videos Recommended for you: Deep Neural Network Learns Van Gogh's Art - https://www.youtube.com/watch?v=-R9bJ... Deep Learning Program Learns to Paint - https://www.youtube.com/watch?v=UGAzi... From Doodles To Paintings With Deep Learning - https://www.youtube.com/watch?v=jMZqx... Sintel Movie copyright: Blender Foundation https://durian.blender.org/sharing/", "link": "https://www.youtube.com/watch?v=Uxax5EKg0zA", "tags": ["Recommender", "Image Segmentation", "DL", "ANN"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.7230000000000001, "date_project": "2016-05-22 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 202, "sentences": 9, "sum_nltk": "Artificial neural networks were inspired by the human brain and simulate how neurons behave when they are shown a sensory input (e.g., images, sounds, etc).\nThey are known to be excellent tools for image recognition, any many other problems beyond that - they also excel at weather predictions, breast cancer cell mitosis detection, brain image segmentation and toxicity prediction among many others.\nDeep learning means that we use an artificial neural network with multiple layers, making it even more powerful for more difficult tasks.\nThis time they have been shown to be apt at reproducing the artistic style of many famous painters, such as Vincent Van Gogh and Pablo Picasso among many others.\nAll the user needs to do is provide an input photograph and a target image from which the artistic style will be learned.\nAnd now, onto the next frontier: transferring artistic style to videos!\nThe paper \"Artistic style transfer for videos\" is available here: http://arxiv.org/abs/1604.08610 The implementation of this technique is also available: https://github.com/manuelruder/artistic-videos Recommended for you: Deep Neural Network Learns Van Gogh's Art - https://www.youtube.com/watch?v=-R9bJ...\nDeep Learning Program Learns to Paint - https://www.youtube.com/watch?v=UGAzi...\nFrom Doodles To Paintings With Deep Learning - https://www.youtube.com/watch?v=jMZqx...\nSintel Movie copyright: Blender Foundation https://durian.blender.org/sharing/", "sum_nltk_words": 193, "sum_nltk_runtime": 0.003, "sum_t5": "artificial neural networks were inspired by the human brain and simulate how neurons behave when shown a sensory input. they excel at image recognition, breast cancer cell mitosis detection, brain image segmentation and toxicity prediction. this time they have been shown to be apt at reproducing the artistic style of many famous painters, such as Vincent van Gogh and Pablo Picasso. the paper \"Artistic style transfer for videos\" is available here: http://arxiv.org/abs/1604.08610.", "sum_t5_words": 72, "sum_t5_runtime": 10.681, "language_code": "en", "language": "english", "language_score": "0.9999967052379647", "tags_descriptive": ["Recommender", "Image Segmentation", "Deep Learning (DL)", "Artificial Neural Network (ANN)"], "description_lemmatized": "artificial neural network inspired human brain simulate neuron behave shown sensory input eg image sound etc known excellent tool image recognition many problem beyond also excel weather prediction breast cancer cell mitosis detection brain image segmentation toxicity prediction among many others deep learning mean use artificial neural network multiple layer making even powerful difficult task time shown apt reproducing artistic style many famous painter vincent van gogh pablo picasso among many others user need provide input photograph target image artistic style learned onto next frontier transferring artistic style video paper artistic style transfer video available httparxivorgabs160408610 implementation technique also available httpsgithubcommanuelruderartisticvideos recommended deep neural network learns van gogh art httpswwwyoutubecomwatchvr9bj deep learning program learns paint httpswwwyoutubecomwatchvugazi doodle painting deep learning httpswwwyoutubecomwatchvjmzqx sintel movie copyright blender foundation httpsdurianblenderorgsharing", "sum_nltk_lemmatized": "artificial neural network inspired human brain simulate neuron behave shown sensory input eg image sound etc known excellent tool image recognition many problem beyond also excel weather prediction breast cancer cell mitosis detection brain image segmentation toxicity prediction among many others deep learning mean use artificial neural network multiple layer making even powerful difficult task time shown apt reproducing artistic style many famous painter vincent van gogh pablo picasso among many others user need provide input photograph target image artistic style learned onto next frontier transferring artistic style video paper artistic style transfer video available httparxivorgabs160408610 implementation technique also available httpsgithubcommanuelruderartisticvideos recommended deep neural network learns van gogh art httpswwwyoutubecomwatchvr9bj deep learning program learns paint httpswwwyoutubecomwatchvugazi doodle painting deep learning httpswwwyoutubecomwatchvjmzqx sintel movie copyright blender foundation httpsdurianblenderorgsharing", "runtime": 10.736}