{"title": "Breaking Deep Learning Systems With Adversarial Examples", "description": "Artificial neural networks are computer programs that try to approximate what the human brain does to solve problems like recognizing objects in images. In this piece of work, the authors analyze the properties of these neural networks and try to unveil what exactly makes them think that a paper towel is a paper towel, and, building on this knowledge, try to fool these programs. Carefully crafted adversarial examples can be used to fool deep neural network reliably. The paper \"Intriguing properties of neural networks\" is available here: http://arxiv.org/abs/1312.6199 The paper \"Explaining and Harnessing Adversarial Examples\" is available here: http://arxiv.org/abs/1412.6572 Image credits: Thumbnail image - https://www.flickr.com/photos/healthblog/8384110298 (CC BY-SA 2.0) Shower cap - Code Words / Julia Evans - https://codewords.recurse.com/issues/five/why-do-neural-networks-think-a-panda-is-a-vulture MNIST - hxhl95 Andrej Karpathy's online convolutional neural network: http://cs.stanford.edu/people/karpathy/convnetjs/demo/cifar10.html", "link": "https://www.youtube.com/watch?v=j9FLOinaG94", "tags": ["CNN", "ANN"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6685, "date_project": "2016-02-03 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 128, "sentences": 4, "language_code": "en", "language": "english", "language_score": "0.9999979961152019", "tags_descriptive": ["Convolutional Neural Network (CNN)", "Artificial Neural Network (ANN)"], "description_lemmatized": "artificial neural network computer program try approximate human brain solve problem like recognizing object image piece work author analyze property neural network try unveil exactly make think paper towel paper towel building knowledge try fool program carefully crafted adversarial example used fool deep neural network reliably paper intriguing property neural network available httparxivorgabs13126199 paper explaining harnessing adversarial example available httparxivorgabs14126572 image credit thumbnail image httpswwwflickrcomphotoshealthblog8384110298 cc bysa 20 shower cap code word julia evans httpscodewordsrecursecomissuesfivewhydoneuralnetworksthinkapandaisavulture mnist hxhl95 andrej karpathys online convolutional neural network httpcsstanfordedupeoplekarpathyconvnetjsdemocifar10html", "runtime": 0.008}