{"title": "Neural Material Synthesis", "description": "We are going to talk about techniques that create physically based material models from photographs that we can use in our light simulation programs. In an earlier work, two photographs are required for high-quality reconstruction. It seems that working from only one photograph doesn't seem possible at all. However, with the power of deep learning... The paper \"Two-Shot SVBRDF Capture for Stationary Materials\" is available here: https://mediatech.aalto.fi/publications/graphics/TwoShotSVBRDF/ The paper \"Reflectance Modeling by Neural Texture Synthesis\" is available here: https://mediatech.aalto.fi/publications/graphics/TwoShotSVBRDF/ NVIDIA has implemented the two-shot model! Have a look: https://twitter.com/karolyzsolnai/st... Our earlier episode on Gradient Domain Light Transport is available here: https://www.youtube.com/watch?v=sSnDT... The light transport course at the Technical University of Vienna is available here: https://www.youtube.com/playlist?list...", "link": "https://www.youtube.com/watch?v=XpwW3glj2T8", "tags": ["DL"], "kind": "Paper", "host": "youtube.com", "learn_score": 1, "explore_score": 1, "compete_score": 0, "engagement_score": 0.6935, "date_project": "2016-08-17 00:00:00", "date_scraped": "2021-02-01 00:00:00", "words": 115, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999961679504372", "tags_descriptive": ["Deep Learning (DL)"], "description_lemmatized": "going talk technique create physically based material model photograph use light simulation program earlier work two photograph required highquality reconstruction seems working one photograph doesnt seem possible however power deep learning paper twoshot svbrdf capture stationary material available httpsmediatechaaltofipublicationsgraphicstwoshotsvbrdf paper reflectance modeling neural texture synthesis available httpsmediatechaaltofipublicationsgraphicstwoshotsvbrdf nvidia implemented twoshot model look httpstwittercomkarolyzsolnaist earlier episode gradient domain light transport available httpswwwyoutubecomwatchvssndt light transport course technical university vienna available httpswwwyoutubecomplaylistlist", "runtime": 0.031}