{"title": "Breast Cancer Detection with Machine Learning", "description": "Over the past decades, machine learning techniques have been widely used in intelligent health systems, particularly for breast cancer diagnosis and prognosis. In this article, I will walk you through how to create a breast cancer detection model using machine learning and the Python programming language.Breast cancer is one of the most common cancers in women globally, accounting for the majority of new cancer cases and cancer-related deaths according to global statistics, making it a major public health problem in the world. today’s society.Also, Read – Machine Learning Full Course for free.Early diagnosis of breast cancer can dramatically improve prognosis and chances of survival, as it can promote timely clinical treatment of patients. More precise classification of benign tumours can prevent patients from undergoing unnecessary treatments.", "link": "https://thecleverprogrammer.com/2020/11/14/breast-cancer-detection-with-machine-learning/", "tags": ["Naive Bayes", "Classification", "Regression"], "kind": "Project", "ml_libs": ["sklearn"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-11-14 16:36:47", "date_scraped": "2020-12-20 00:00:00", "words": 126, "sentences": 4, "runtime": 0.002, "description_category": "Healthcare", "description_category_score": 0.8010683059692383, "description_category_runtime": 11.086, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9561213850975037, "description_subcategory_runtime": 17.195, "category": "Healthcare", "category_score": 0.8010683059692383, "subcategory": "Machine Learning", "subcategory_score": 0.9561213850975037, "runtime_cat": 28.281, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999976704019489", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "past decade machine learning technique widely used intelligent health system particularly breast cancer diagnosis prognosis article walk create breast cancer detection model using machine learning python programming languagebreast cancer one common cancer woman globally accounting majority new cancer case cancerrelated death according global statistic making major public health problem world today societyalso read machine learning full course freeearly diagnosis breast cancer dramatically improve prognosis chance survival promote timely clinical treatment patient precise classification benign tumour prevent patient undergoing unnecessary treatment", "tags_descriptive": ["Naive Bayes", "Classification", "Regression"]}