{"title": "Galaxy Classification with Machine Learning", "description": "The first galaxy was observed by a Persian astronomer Abd al-Rahman over 1,000 years ago, and it was first believed to be an unknown extended structure. which is now known as Messier-31 or the infamous Andromeda Galaxy. From that point on, these unknown structures are more frequently observed and recorded, but it took more than 9 centuries for astronomers to manifest on an agreement that they were not just astronomical objects, but entire galaxies. In this article, I will introduce you to the Galaxy Classification Model with Machine Learning.As the discoveries and classification of galaxies increased, several astronomers observed the divergent morphologies. Then, they started grouping previously reported galaxies and newly discovered galaxies based on morphological features which then formed a meaningful classification scheme.Also, Read – My Journey From Commerce to Machine Learning.", "link": "https://thecleverprogrammer.com/2020/08/28/galaxy-classification-with-machine-learning/", "tags": ["ReLu", "Classification"], "kind": "Project", "ml_libs": ["keras", "sklearn", "tensorflow"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-08-28 17:35:18", "date_scraped": "2020-12-20 00:00:00", "words": 133, "sentences": 5, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.09079297631978989, "description_category_runtime": 11.819, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9563654065132141, "description_subcategory_runtime": 17.728, "category": "Wholesale & Retail", "category_score": 0.09079297631978989, "subcategory": "Machine Learning", "subcategory_score": 0.9563654065132141, "runtime_cat": 29.547, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999979535729134", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "first galaxy observed persian astronomer abd alrahman 1000 year ago first believed unknown extended structure known messier31 infamous andromeda galaxy point unknown structure frequently observed recorded took 9 century astronomer manifest agreement astronomical object entire galaxy article introduce galaxy classification model machine learningas discovery classification galaxy increased several astronomer observed divergent morphology started grouping previously reported galaxy newly discovered galaxy based morphological feature formed meaningful classification schemealso read journey commerce machine learning", "tags_descriptive": ["Rectified Linear Unit (ReLU)", "Classification"]}