{"title": "Employee Turnover Prediction", "description": "This article features the implementation of an employee turnover analysis that is built using Python’s Scikit-Learn library. In this article, I will use Logistic Regression and  Random Forest Machine Learning algorithms. At the end of this article, you would be able to choose the best algorithm for your future projects like Employee Turnover Prediction.Employee Turnover or Employee Turnover ratio is the measurement of the total number of employees who leave an organization in a particular year. Employee Turnover Prediction means to predict whether an employee is going to leave the organization in the coming period. A Company uses this predictive analysis to measure how many employees they will need if the potential employees will leave their organization. A company also uses this predictive analysis to make the workplace better for employees by understanding the core reasons for the high turnover ratio.Now let’s dive into the data to move further with this project on Employee Turnover Prediction. You can download the dataset I have used in this article below.Now let’s import the data and move further with the analysis:Rename column name from “sales” to “department”:The type of the columns can be found out as follows:Our data is pretty clean, with no missing values, so let’s move further and see how many employees work in the organization:The “left” column is the outcome variable recording one and 0. 1 for employees who left the company and 0 for those who didn’t.The department column of the dataset has many categories, and we need to reduce the categories for better modelling. Let’s see all the categories of the department column:Let’s add all the “technical”, “support” and “IT” columns into one column to make our analysis easier.As there are two categorical variables (department, salary) in the dataset and they need to be converted to dummy variables before they can be used for modelling.Now the actual variables need to be removed after the dummy variable have been created. Column names after creating dummy variables for categorical variables:The outcome variable is “left”, and all the other variables are predictors.Let’s use the feature selection method to decide which variables are the best option that can predict employee turnover with great accuracy. There are a total of 18 columns in X, and now let’s see how we can select about 10 from them:You can see that or feature selection chose the 10 variables for us, which are marked True in the support_ array and marked with a choice “1” in the ranking_array. Now lets have a look at these columns:Let’s check the accuracy of our logistic regression model.Now let’s check the accuracy of our Random Forest Classification Model: Random Forest Accuracy: 0.978Now I will construct a confusion matrix to visualize predictions made by our classifier and evaluate the accuracy of our machine learning classification.Random ForestLogistic RegressionThe receiver operating characteristic (ROC) curve is a standard tool used with binary classifiers. The red dotted line represents the ROC curve of a purely random classifier; a good classifier stays as far away from that line as possible (toward the top-left corner).So, as we can see that the Random Forest Model has proven to be more useful in the prediction of employee turnover, now let’s have a look at the feature importance of our random forest classification model.According to our Random Forest classification model, the above aspects show the most important features which will influence whether an employee will leave the company, in ascending order.I hope you liked this article on Employee Turnover Prediction with Machine Learning. Feel free to ask your valuable questions in the comments section and dont’ forget to subscribe to our daily newsletters below if you like my work.", "link": "https://thecleverprogrammer.com/2020/07/12/employee-turnover-prediction/", "tags": ["Regression", "Logistic Regression", "Random Forest", "Classification"], "kind": "Project", "ml_libs": ["sklearn"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-07-12 18:27:24", "date_scraped": "2020-12-20 00:00:00", "words": 606, "sentences": 14, "sum_nltk": "At the end of this article, you would be able to choose the best algorithm for your future projects like Employee Turnover Prediction.Employee Turnover or Employee Turnover ratio is the measurement of the total number of employees who leave an organization in a particular year.\nColumn names after creating dummy variables for categorical variables:The outcome variable is “left”, and all the other variables are predictors.Let’s use the feature selection method to decide which variables are the best option that can predict employee turnover with great accuracy.\nThe red dotted line represents the ROC curve of a purely random classifier; a good classifier stays as far away from that line as possible (toward the top-left corner).So, as we can see that the Random Forest Model has proven to be more useful in the prediction of employee turnover, now let’s have a look at the feature importance of our random forest classification model.According to our Random Forest classification model, the above aspects show the most important features which will influence whether an employee will leave the company, in ascending order.I hope you liked this article on Employee Turnover Prediction with Machine Learning.", "sum_nltk_words": 188, "sum_nltk_runtime": 0.006, "sum_t5": "this article features the implementation of an employee turnover analysis that is built using Python’s Scikit-Learn library. in this article, I will use Logistic Regression and Random Forest machine learning algorithms. at the end of this article, you would be able to choose the best algorithm for your future projects like Employee Turnover Prediction. a company uses this predictive analysis to measure how many employees they will need if the potential employees will leave their organization.", "sum_t5_words": 76, "sum_t5_runtime": 6.17, "runtime": 0.007, "nltk_category": "Finance", "nltk_category_score": 0.5486150979995728, "nltk_category_runtime": 16.35, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9959726333618164, "nltk_subcategory_runtime": 26.699, "category": "Finance", "category_score": 0.5486150979995728, "subcategory": "Machine Learning", "subcategory_score": 0.9959726333618164, "runtime_cat": 43.049, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999973142538485", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "article feature implementation employee turnover analysis built using python scikitlearn library article use logistic regression random forest machine learning algorithm end article would able choose best algorithm future project like employee turnover predictionemployee turnover employee turnover ratio measurement total number employee leave organization particular year employee turnover prediction mean predict whether employee going leave organization coming period company us predictive analysis measure many employee need potential employee leave organization company also us predictive analysis make workplace better employee understanding core reason high turnover rationow let dive data move project employee turnover prediction download dataset used article belownow let import data move analysisrename column name sale departmentthe type column found followsour data pretty clean missing value let move see many employee work organizationthe left column outcome variable recording one 0 1 employee left company 0 didntthe department column dataset many category need reduce category better modelling let see category department columnlets add technical support column one column make analysis easieras two categorical variable department salary dataset need converted dummy variable used modellingnow actual variable need removed dummy variable created column name creating dummy variable categorical variablesthe outcome variable left variable predictorslets use feature selection method decide variable best option predict employee turnover great accuracy total 18 column x let see select 10 themyou see feature selection chose 10 variable u marked true support_ array marked choice 1 ranking_array let look columnslets check accuracy logistic regression modelnow let check accuracy random forest classification model random forest accuracy 0978now construct confusion matrix visualize prediction made classifier evaluate accuracy machine learning classificationrandom forestlogistic regressionthe receiver operating characteristic roc curve standard tool used binary classifier red dotted line represents roc curve purely random classifier good classifier stay far away line possible toward topleft cornerso see random forest model proven useful prediction employee turnover let look feature importance random forest classification modelaccording random forest classification model aspect show important feature influence whether employee leave company ascending orderi hope liked article employee turnover prediction machine learning feel free ask valuable question comment section dont forget subscribe daily newsletter like work", "tags_descriptive": ["Regression", "Logistic Regression", "Random Forest", "Classification"]}