{"title": "Skin Cancer Classification with Machine Learning", "description": "Skin Cancer is one of the most common types of disease in the United States. Up to 4 Million cases have been reported dead due to skin cancer in the United States over the year. In this article, I will create a model for skin cancer classification with Machine Learning. This is a huge number, really 4 million, people died just from Skin cancer in a country. As all those people have been dying, but half of those cases or maybe even more, didn’t have went to the doctor at the early stages of the disease when it might have been prevented.If people are getting the symptoms of skin cancer, they still don’t reach out for a doctor, which is not a good signal because skin cancer can be cured at the early stages.So this is where a machine learning algorithm works in the classification of Skin Cancer. As I mentioned earlier Skin Cancer can be easily cured in the early stages of the disease, but it’s the people who don’t want to visit the doctor. So here is a simple machine learning algorithm, which can help those people to identify if they are having skin cancer or not while sitting at their homes. This Machine Learning algorithm is based on Convolutional Neural Networks (CNN).Lets start with importing the librariesNow I will simply upload images to train our machine learning model using the skimage library in python. You can download these images from belowThese images are sample images of  Benign mole and Malign mole which are a type of skin problems.Let’s visualize these imagesNow lets train our model for further classificationTo see the summary of our trained model we will execute the code belowNow lets visualize the output of our trained modelNow lets zoom and visualize some of the filtersNow let’s visualize and test the actual ability of our trained model", "link": "https://thecleverprogrammer.com/2020/06/29/skin-cancer-classification-with-machine-learning/", "tags": ["CNN", "VGG", "Classification"], "kind": "Project", "ml_libs": ["keras", "skimage"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-06-29 22:31:15", "date_scraped": "2020-12-20 00:00:00", "words": 312, "sentences": 9, "sum_nltk": "Skin Cancer is one of the most common types of disease in the United States.\nUp to 4 Million cases have been reported dead due to skin cancer in the United States over the year.\nIn this article, I will create a model for skin cancer classification with Machine Learning.\nThis is a huge number, really 4 million, people died just from Skin cancer in a country.\nAs all those people have been dying, but half of those cases or maybe even more, didn’t have went to the doctor at the early stages of the disease when it might have been prevented.If people are getting the symptoms of skin cancer, they still don’t reach out for a doctor, which is not a good signal because skin cancer can be cured at the early stages.So this is where a machine learning algorithm works in the classification of Skin Cancer.\nAs I mentioned earlier Skin Cancer can be easily cured in the early stages of the disease, but it’s the people who don’t want to visit the doctor.\nSo here is a simple machine learning algorithm, which can help those people to identify if they are having skin cancer or not while sitting at their homes.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.003, "sum_t5": "up to 4 million people have died from skin cancer in the united states over the year. half of those people didn't go to the doctor at the early stages of the disease. this is where a machine learning algorithm works in the classification of Skin Cancer. this machine learning algorithm is based on Convolutional Neural Networks (CNN). it can help people to identify if they are having skin cancer or not while sitting at their homes.", "sum_t5_words": 77, "sum_t5_runtime": 5.781, "runtime": 0.003, "nltk_category": "Healthcare", "nltk_category_score": 0.8112179636955261, "nltk_category_runtime": 16.627, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9905192255973816, "nltk_subcategory_runtime": 26.324, "category": "Healthcare", "category_score": 0.8112179636955261, "subcategory": "Machine Learning", "subcategory_score": 0.9905192255973816, "runtime_cat": 42.951, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999972090053195", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "skin cancer one common type disease united state 4 million case reported dead due skin cancer united state year article create model skin cancer classification machine learning huge number really 4 million people died skin cancer country people dying half case maybe even didnt went doctor early stage disease might preventedif people getting symptom skin cancer still dont reach doctor good signal skin cancer cured early stagesso machine learning algorithm work classification skin cancer mentioned earlier skin cancer easily cured early stage disease people dont want visit doctor simple machine learning algorithm help people identify skin cancer sitting home machine learning algorithm based convolutional neural network cnnlets start importing librariesnow simply upload image train machine learning model using skimage library python download image belowthese image sample image benign mole malign mole type skin problemslets visualize imagesnow let train model classificationto see summary trained model execute code belownow let visualize output trained modelnow let zoom visualize filtersnow let visualize test actual ability trained model", "tags_descriptive": ["Convolutional Neural Network (CNN)", "VGG", "Classification"]}