{"title": "Twitter Sentiment Analysis", "description": "Twitter Sentiment Analysis is the process of computationally identifying and categorizing tweets expressed in a piece of text, especially in order to determine whether the writer’s attitude towards a particular topic, product, etc. is positive, negative, or neutral.In this Article I will do twitter sentiment analysis with Natural Language Processing using the nltk library with python.Lets start with importing the librariesFirst of all, splitting the data set into a training and a testing set. The test set is the 10% of the original data set. For this particular analysis I dropped the neutral tweets, as my goal was to only differentiate positive and negative tweets.As a next step I separated the Positive and Negative tweets of the training set in order to easily visualize their contained words. After that I cleaned the text from hashtags, mentions and links. Now they were ready for a WordCloud visualization which shows only the most emphatic words of the Positive and Negative tweets.Interesting to notice the following words and expressions in the positive word set: truth, strong, legitimate, together, love, jobIn my interpretation, people tend to believe that their ideal candidate is truthful, legitimate, above good and bad.At the same time, negative tweets contains words like: influence, news, elevatormusic, disappointing, softball, makeup, cherry picking, tryingIn my understanding people missed the decisively acting and considered the scolded candidates too soft and cherry picking.After the vizualization, I removed the hashtags, mentions, links and stopwords from the training set.Stop Word: Stop Words are words which do not contain important significance to be used in Search Queries. Usually these words are filtered out from search queries because they return vast amount of unnecessary information. ( the, for, this etc. )As a next step I extracted the so called features with nltk lib, first by measuring a frequent distribution and by selecting the resulting keys.Hereby I plotted the most frequently distributed words. The most words are centered around debate nights.Using the nltk NaiveBayes Classifier I classified the extracted tweet word features.Finally, with not-so-intelligent metrics, I tried to measure how the classifier algorithm scored.", "link": "https://thecleverprogrammer.com/2020/06/13/twitter-sentiment-analysis/", "tags": ["Classification", "NLP", "Naive Bayes", "Sentiment Analysis"], "kind": "Project", "ml_libs": ["sklearn", "nltk"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-06-13 13:03:58", "date_scraped": "2020-12-20 00:00:00", "words": 328, "sentences": 10, "sum_nltk": "Twitter Sentiment Analysis is the process of computationally identifying and categorizing tweets expressed in a piece of text, especially in order to determine whether the writer’s attitude towards a particular topic, product, etc.\nis positive, negative, or neutral.In this Article I will do twitter sentiment analysis with Natural Language Processing using the nltk library with python.Lets start with importing the librariesFirst of all, splitting the data set into a training and a testing set.\nFor this particular analysis I dropped the neutral tweets, as my goal was to only differentiate positive and negative tweets.As a next step I separated the Positive and Negative tweets of the training set in order to easily visualize their contained words.\nNow they were ready for a WordCloud visualization which shows only the most emphatic words of the Positive and Negative tweets.Interesting to notice the following words and expressions in the positive word set: truth, strong, legitimate, together, love, jobIn my interpretation, people tend to believe that their ideal candidate is truthful, legitimate, above good and bad.At the same time, negative tweets contains words like: influence, news, elevatormusic, disappointing, softball, makeup, cherry picking, tryingIn my understanding people missed the decisively acting and considered the scolded candidates too soft and cherry picking.After the vizualization, I removed the hashtags, mentions, links and stopwords from the training set.Stop Word: Stop Words are words which do not contain important significance to be used in Search Queries.", "sum_nltk_words": 218, "sum_nltk_runtime": 0.004, "sum_t5": "a word cloud visualization shows only the emphatic words of the positive and negative tweets. negative tweets contains words like: influence, strong, legitimate, together, love, job. a second step was to extract the so called features with nltk lib. nltk classifier classified the extracted tweet word features. a third step was to measure how the classifier algorithm scored. a final step was to use a python classifier to classify the", "sum_t5_words": 70, "sum_t5_runtime": 6.87, "runtime": 0.004, "nltk_category": "Media & Publishing", "nltk_category_score": 0.21731582283973694, "nltk_category_runtime": 23.681, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.5090888142585754, "nltk_subcategory_runtime": 37.408, "category": "Media & Publishing", "category_score": 0.21731582283973694, "subcategory": "Tools", "subcategory_score": 0.5090888142585754, "runtime_cat": 61.089, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999959245074851", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "twitter sentiment analysis process computationally identifying categorizing tweet expressed piece text especially order determine whether writer attitude towards particular topic product etc positive negative neutralin article twitter sentiment analysis natural language processing using nltk library pythonlets start importing librariesfirst splitting data set training testing set test set 10 original data set particular analysis dropped neutral tweet goal differentiate positive negative tweetsas next step separated positive negative tweet training set order easily visualize contained word cleaned text hashtags mention link ready wordcloud visualization show emphatic word positive negative tweetsinteresting notice following word expression positive word set truth strong legitimate together love jobin interpretation people tend believe ideal candidate truthful legitimate good badat time negative tweet contains word like influence news elevatormusic disappointing softball makeup cherry picking tryingin understanding people missed decisively acting considered scolded candidate soft cherry pickingafter vizualization removed hashtags mention link stopwords training setstop word stop word word contain important significance used search query usually word filtered search query return vast amount unnecessary information etc next step extracted called feature nltk lib first measuring frequent distribution selecting resulting keyshereby plotted frequently distributed word word centered around debate nightsusing nltk naivebayes classifier classified extracted tweet word featuresfinally notsointelligent metric tried measure classifier algorithm scored", "tags_descriptive": ["Classification", "Natural Language Processing (NLP)", "Naive Bayes", "Sentiment Analysis"]}