{"title": "LSTM in Machine Learning", "description": "The LSTM Network model stands for Long Short Term Memory networks. These are a special kind of Neural Networks which are generally capable of understanding long term dependencies. LSTM model was generally designed to prevent the problems of long term dependencies which they generally do in a very good manner. In this article I will take you through how we can use LSTMs in Time Series Forecasting.The LSTM Network models generally have potential to remove or add data carefully which is regulated by a special structure known as gates. The first step in processing LSTMs is to determine what information we need to throw from the cell. The next step is deciding what new information we should store in the cell. At last we decide what we want as an output. The output is generally based on the state of cells. Let’s understand the process of LSTM using an example of Time Series Forecasting to predict stock prices.", "link": "https://thecleverprogrammer.com/2020/08/11/lstm-in-machine-learning/", "tags": ["LSTM", "RNN"], "kind": "Project", "ml_libs": ["keras", "sklearn", "tensorflow"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-08-11 13:05:09", "date_scraped": "2020-12-20 00:00:00", "words": 158, "sentences": 9, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.07950621843338013, "description_category_runtime": 13.317, "description_subcategory": "Preventative and Reactive", "description_subcategory_score": 0.3012179732322693, "description_subcategory_runtime": 20.432, "category": "Finance", "category_score": 0.07950621843338013, "subcategory": "Preventative and Reactive", "subcategory_score": 0.3012179732322693, "runtime_cat": 33.75, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999963691112832", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "lstm network model stand long short term memory network special kind neural network generally capable understanding long term dependency lstm model generally designed prevent problem long term dependency generally good manner article take use lstms time series forecastingthe lstm network model generally potential remove add data carefully regulated special structure known gate first step processing lstms determine information need throw cell next step deciding new information store cell last decide want output output generally based state cell let understand process lstm using example time series forecasting predict stock price", "tags_descriptive": ["Long short-term memory (LSTM)", "Recurrent Neural Network (RNN)"]}