{"title": "Artificial Neural Networks with Machine Learning", "description": "Artificial neural networks are one of the main tools used in machine learning. As the “neural” part of their name suggests, they are brain-inspired systems which are intended to replicate the way that we humans learn. Neural networks consist of input and output layers, as well as (in most cases) a hidden layer consisting of units that transform the input into something that the output layer can use. They are excellent tools for finding patterns which are far too complex or numerous for a human programmer to extract and teach the machine to recognize.This Machine Learning Project Classifies Clothes from the Fashion MNIST Data set using Artificial Neural Networks and Python.Let’s start by importing the libraries we need for this taskTo load the data setTo print the shape of the training and testing dataTo Compile the ModelTo Train the modelTo Evaluate the ModelTo Make a PredictionTo print the maximum labelsTo Print the first 5 images", "link": "https://thecleverprogrammer.com/2020/05/24/artificial-neural-networks-with-machine-learning/", "tags": ["ANN", "ReLu", "Classification"], "kind": "Project", "ml_libs": ["keras", "pattern", "tensorflow"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-05-24 14:17:48", "date_scraped": "2020-12-20 00:00:00", "words": 138, "sentences": 4, "runtime": 0.003, "description_category": "Utilities", "description_category_score": 0.05438779294490814, "description_category_runtime": 14.6, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9905340671539307, "description_subcategory_runtime": 22.795, "category": "Utilities", "category_score": 0.05438779294490814, "subcategory": "Machine Learning", "subcategory_score": 0.9905340671539307, "runtime_cat": 37.395, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999965213050375", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "artificial neural network one main tool used machine learning neural part name suggests braininspired system intended replicate way human learn neural network consist input output layer well case hidden layer consisting unit transform input something output layer use excellent tool finding pattern far complex numerous human programmer extract teach machine recognizethis machine learning project classifies clothes fashion mnist data set using artificial neural network pythonlets start importing library need taskto load data setto print shape training testing datato compile modelto train modelto evaluate modelto make predictionto print maximum labelsto print first 5 image", "tags_descriptive": ["Artificial Neural Network (ANN)", "Rectified Linear Unit (ReLU)", "Classification"]}