{"title": "NLP For WhatsApp Chats", "description": "Natural Language Processing or NLP is a field of Artificial Intelligence which focuses on enabling the systems for understanding and processing the human languages. In this article, I will use NLP to analyze my WhatsApp Chats. For some privacy reasons, I will use Person 1, Person 2 and so on in my WhatsApp Chats.If you have never exported your whatsapp chats before, don’t worry it’s very easy. For NLP of WhatsApp chats, you need to extract the whatsapp chats from your smartphone. You just need to open any chat in your whatsapp then select the export chat option. The text file you will get as a return will look like this:I will use two different approaches for the NLP of WhatsApp Chats. First, by focusing on the fundamentals of NLP and the other is by using the datetime stamp at the starting of every conversation.To analyze our whatsapp conversations, initially, our conversation needs to be formatted in the form of data. This involved a few basic steps in achieving the formation of data by creating a dictionary, constructed within two keys with each of the respective values with a list of the person tokenized conversations.The classification of tokenized conversations will ne be achieved by training a Naive Bayes Classification model or the training set with some pre-categorized chat styles conversations:Our trained model can be tested by using a test set or even by user input. Our model is trained in a way that can classify any tokenized sentence into different categories like Greetings, Statements, Emotions, questions, etc.‘Greet’ynQuestion’Now let’s run the model on WhatsApp data for counting the occurrences of each category of the tokenized conversations:We all use emojis, everyone, not only on WhatsApp but with any other chatting platform. Now let’s see what emojis are being used in most of the conversations.It’s very interesting to visualize how one person uses more emojis than the other person. This is the only way we express our emotions while having a whatsapp conversation.The plotting of sentiments against the datetime is not as easy as it looks. As there are many different sentiments on the same day, so the first step is to calculate the mean sentiment for each day and then grouping by datetime. So let’s see how we can do this:Even plotting the average of sentiments for each day will prove to be very messy. So let’s simply take a rolling average of 10 days, and then plot the average sentiment score:Now let’s have a look at the frequency of whatsapp chats which is not a part of NLP for Whatsapp but it is a part of time series analysis. We can use time series here to see the frequency of chats. First, need to create a colour pallete ordered by the total number of messages for each day.Ordered list of days according to total message countThis is essentially the current order of colours:Reorder colours according to their index position in the ‘days_freq’ list:I hope you liked this article on NLP for WhatsApp chats. Feel free to ask your valuable questions in the comments section. Don’t forget to subscribe for my daily newsletters below to get email notifications if you like my work.", "link": "https://thecleverprogrammer.com/2020/07/16/nlp-for-whatsapp-chats/", "tags": ["NLP", "Naive Bayes", "Classification"], "kind": "Project", "ml_libs": ["nltk"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-07-16 17:35:34", "date_scraped": "2020-12-20 00:00:00", "words": 531, "sentences": 18, "sum_nltk": "For some privacy reasons, I will use Person 1, Person 2 and so on in my WhatsApp Chats.If you have never exported your whatsapp chats before, don’t worry it’s very easy.\nFirst, by focusing on the fundamentals of NLP and the other is by using the datetime stamp at the starting of every conversation.To analyze our whatsapp conversations, initially, our conversation needs to be formatted in the form of data.\nOur model is trained in a way that can classify any tokenized sentence into different categories like Greetings, Statements, Emotions, questions, etc.‘Greet’ynQuestion’Now let’s run the model on WhatsApp data for counting the occurrences of each category of the tokenized conversations:We all use emojis, everyone, not only on WhatsApp but with any other chatting platform.\nThis is the only way we express our emotions while having a whatsapp conversation.The plotting of sentiments against the datetime is not as easy as it looks.\nSo let’s simply take a rolling average of 10 days, and then plot the average sentiment score:Now let’s have a look at the frequency of whatsapp chats which is not a part of NLP for Whatsapp but it is a part of time series analysis.", "sum_nltk_words": 192, "sum_nltk_runtime": 0.005, "sum_t5": "i will use Person 1, Person 2 and so on in my WhatsApp Chats. for some privacy reasons, i will use Person 1, Person 2 and so on. i will use the datetime stamp at the starting of every conversation. i will use the datetime stamp at the beginning of every conversation. i will use the datetime stamp at the beginning of every conversation. i will use the datetime stamp at the beginning of every conversation.", "sum_t5_words": 76, "sum_t5_runtime": 6.144, "runtime": 0.005, "nltk_category": "Manufacturing", "nltk_category_score": 0.0182354673743248, "nltk_category_runtime": 18.714, "nltk_subcategory": "General", "nltk_subcategory_score": 0.08751608431339264, "nltk_subcategory_runtime": 29.546, "category": "Manufacturing", "category_score": 0.0182354673743248, "subcategory": "General", "subcategory_score": 0.08751608431339264, "runtime_cat": 48.26, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999966795077345", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "natural language processing nlp field artificial intelligence focus enabling system understanding processing human language article use nlp analyze whatsapp chat privacy reason use person 1 person 2 whatsapp chatsif never exported whatsapp chat dont worry easy nlp whatsapp chat need extract whatsapp chat smartphone need open chat whatsapp select export chat option text file get return look like thisi use two different approach nlp whatsapp chat first focusing fundamental nlp using datetime stamp starting every conversationto analyze whatsapp conversation initially conversation need formatted form data involved basic step achieving formation data creating dictionary constructed within two key respective value list person tokenized conversationsthe classification tokenized conversation ne achieved training naive bayes classification model training set precategorized chat style conversationsour trained model tested using test set even user input model trained way classify tokenized sentence different category like greeting statement emotion question etcgreetynquestionnow let run model whatsapp data counting occurrence category tokenized conversationswe use emojis everyone whatsapp chatting platform let see emojis used conversationsits interesting visualize one person us emojis person way express emotion whatsapp conversationthe plotting sentiment datetime easy look many different sentiment day first step calculate mean sentiment day grouping datetime let see thiseven plotting average sentiment day prove messy let simply take rolling average 10 day plot average sentiment scorenow let look frequency whatsapp chat part nlp whatsapp part time series analysis use time series see frequency chat first need create colour pallete ordered total number message dayordered list day according total message countthis essentially current order coloursreorder colour according index position days_freq listi hope liked article nlp whatsapp chat feel free ask valuable question comment section dont forget subscribe daily newsletter get email notification like work", "tags_descriptive": ["Natural Language Processing (NLP)", "Naive Bayes", "Classification"]}