{"title": "Network Security with Machine Learning", "description": "The most likely way for attackers to gain access to your infrastructure is through the network. Network security is the general practice of protecting computer networks and devices accessible to the network against malicious intent, misuse and denial. In this article, I will take you through techniques of Network Security Analysis with Machine Learning.Exploring patterns is one of the main strengths of machine learning, and there are many inherent patterns to discover in the network traffic data. At first glance, network packet capture data may appear sporadic and random, but most communication flows follow strict network protocol.Live network data capture is the primary way to record network activity for online or offline analysis. Like a CCTV camera at a traffic intersection, packet analyzers intercept and record network traffic. Now let’s create a network attack classifier from scratch using machine learning.", "link": "https://thecleverprogrammer.com/2020/08/12/network-security-with-machine-learning/", "tags": ["Classification"], "kind": "Project", "ml_libs": ["pattern", "sklearn"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-08-12 10:03:08", "date_scraped": "2020-12-20 00:00:00", "words": 140, "sentences": 6, "runtime": 0.0, "description_category": "Construction & Engineering", "description_category_score": 0.19630666077136993, "description_category_runtime": 11.812, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9617824554443359, "description_subcategory_runtime": 17.945, "category": "Construction & Engineering", "category_score": 0.19630666077136993, "subcategory": "Machine Learning", "subcategory_score": 0.9617824554443359, "runtime_cat": 29.757, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999972359154823", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "likely way attacker gain access infrastructure network network security general practice protecting computer network device accessible network malicious intent misuse denial article take technique network security analysis machine learningexploring pattern one main strength machine learning many inherent pattern discover network traffic data first glance network packet capture data may appear sporadic random communication flow follow strict network protocollive network data capture primary way record network activity online offline analysis like cctv camera traffic intersection packet analyzer intercept record network traffic let create network attack classifier scratch using machine learning", "tags_descriptive": ["Classification"]}