{"title": "Face Detection with Python", "description": "In this article, I will show you how to create a simple face detector using Python. Building a program that detects faces is a great way to get started with machine learning computer vision tasks. So I will introduce you here a very easy way of face detection with Python.As the title suggests, I will write a program for the task of face detection with Python. When I say a program you can understand it like teaching a machine what to do. I like to use teaching rather than programming because that’s actually what I’m doing here.Also, Read – Machine Learning Full Course for free.The best way to learn about everything is to teach, so while teaching a machine to detect faces, we are also learning. So, before I start this face detection task with Python, I want to share the difference between face detection and face recognition.", "link": "https://thecleverprogrammer.com/2020/10/09/face-detection-with-python/", "tags": ["CV", "Classification"], "kind": "Project", "ml_libs": ["opencv-python"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-10-09 18:25:31", "date_scraped": "2020-12-20 00:00:00", "words": 148, "sentences": 6, "runtime": 0.003, "description_category": "Education & Research", "description_category_score": 0.11139075458049774, "description_category_runtime": 12.394, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.6736581921577454, "description_subcategory_runtime": 19.114, "category": "Education & Research", "category_score": 0.11139075458049774, "subcategory": "Machine Learning", "subcategory_score": 0.6736581921577454, "runtime_cat": 31.508, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999964788572521", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "article show create simple face detector using python building program detects face great way get started machine learning computer vision task introduce easy way face detection pythonas title suggests write program task face detection python say program understand like teaching machine like use teaching rather programming thats actually im herealso read machine learning full course freethe best way learn everything teach teaching machine detect face also learning start face detection task python want share difference face detection face recognition", "tags_descriptive": ["Computer Vision (CV)", "Classification"]}