{"title": "Resume Screening with Python", "description": "Companies often receive thousands of resumes for each job posting and employ dedicated screening officers to screen qualified candidates. In this article, I will introduce you to a machine learning project on Resume Screening with Python programming language.Hiring the right talent is a challenge for all businesses. This challenge is magnified by the high volume of applicants if the business is labour-intensive, growing, and facing high attrition rates.Also, Read – 100+ Machine Learning Projects Solved and Explained.An example of such a business is that IT departments are short of growing markets. In a typical service organization, professionals with a variety of technical skills and business domain expertise are hired and assigned to projects to resolve customer issues. This task of selecting the best talent among many others is known as Resume Screening.Typically, large companies do not have enough time to open each CV, so they use machine learning algorithms for the Resume Screening task.", "link": "https://thecleverprogrammer.com/2020/12/06/resume-screening-with-python/", "tags": ["CV", "Classification", "RL"], "kind": "Project", "ml_libs": ["sklearn", "nltk"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-12-06 19:05:33", "date_scraped": "2020-12-20 00:00:00", "words": 154, "sentences": 5, "runtime": 0.003, "description_category": "Utilities", "description_category_score": 0.1582040935754776, "description_category_runtime": 13.401, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9518950581550598, "description_subcategory_runtime": 20.606, "category": "Utilities", "category_score": 0.1582040935754776, "subcategory": "Machine Learning", "subcategory_score": 0.9518950581550598, "runtime_cat": 34.007, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999985422887867", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "company often receive thousand resume job posting employ dedicated screening officer screen qualified candidate article introduce machine learning project resume screening python programming languagehiring right talent challenge business challenge magnified high volume applicant business labourintensive growing facing high attrition ratesalso read 100 machine learning project solved explainedan example business department short growing market typical service organization professional variety technical skill business domain expertise hired assigned project resolve customer issue task selecting best talent among many others known resume screeningtypically large company enough time open cv use machine learning algorithm resume screening task", "tags_descriptive": ["Computer Vision (CV)", "Classification", "Reinforcement Learning (RL)"]}