{"title": "Deploy a Machine Learning Model", "description": "I have trained and developed a lot of Machine Learning models, if you are a student in Machine Learning, you must have also developed models. In this article, I will train and Deploy a Machine Learning Model using Flask step by step. I will first train a model, then I will work to serve our model, and at the end I will deploy our machine learning model.When you train a machine learning model, also think about how you will deploy a machine learning model to serve your trained model to the available users. You will get a lot of websites who are teaching to train a machine learning model but nobody goes beyond to deploy a machine learning model. Because training and deploying a machine learning model are very different from each other. But it’s not difficult. Training a model is the most important part in machine learning. But deploying a model is a different art because you have to think  a lot in the process how you will make your machine learning application to your users. Let’s do this step by step. I will train a SMS Spam detection machine learning model. I will not explain the procedure of training a machine learning model as you will get a lot of articles in this website about training model. My primary focus for today is to teach you how to deploy a machine learning model.You can download the dataset I will use in training my machine learning model below:Now let’s train our model for sms spam detection:After you train your model, you must have wondered how could you use that model without training the model. So you can save the model for you future use, there is no need of training the model every time while you the model. You can save your machine learning model as follows:And the next time you need the same model, you can load this machine learning model as follows:After training your sms spam detection classification, it’s time to deploy our machine learning model. I will create a simple web application which will consist a web page which will look like a form where we can write or paste our sms. The web page will consist a submit button, when we will click the submit button it will use our machine learning model to classify whether the sms is spam or ham (not spam).First, I will create a folder for this project called SMS-Message-Spam-Detector , this is the directory tree inside the folder:The sub-directory templates is the directory in which Flask will look for static HTML files for rendering in the web browser, in our case, we have two html files: home.html and result.html.The app.py file will contain the main code that will be executed by the python to run our Flask web application. It includes the Machine Learning code for classifying our sms messages as spam or ham.The following are the contents of the home.html file that will create a text form where a user can enter a message:In the header section of or html file (home.html), we loaded style.css file. CSS is to determine the appearance and style of HTML documents. style.css has to be saved in a sub-directory called static, which is the default directory where Flask looks for static files such as CSS.Now, I will create a result.html file that will give us a result of our model prediction. It is the final step when we deploy a machine learning model.After following all the steps to deploy a machine learning model, now you can simply run this program using your app.py file.You will see you output as follows:I hope, you like this article on Train and deploy a machine learning model. Feel free to ask your valuable questions in the comments section. Don’t forget to subscribe for my daily newsletters below to get emails notification of our daily newsletters is you like my work.", "link": "https://thecleverprogrammer.com/2020/07/14/deploy-a-machine-learning-model/", "tags": ["Naive Bayes", "Classification"], "kind": "Project", "ml_libs": ["sklearn"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-07-14 11:54:36", "date_scraped": "2020-12-20 00:00:00", "words": 641, "sentences": 21, "sum_nltk": "In this article, I will train and Deploy a Machine Learning Model using Flask step by step.\nBut deploying a model is a different art because you have to think  a lot in the process how you will make your machine learning application to your users.\nYou can save your machine learning model as follows:And the next time you need the same model, you can load this machine learning model as follows:After training your sms spam detection classification, it’s time to deploy our machine learning model.\nThe web page will consist a submit button, when we will click the submit button it will use our machine learning model to classify whether the sms is spam or ham (not spam).First, I will create a folder for this project called SMS-Message-Spam-Detector , this is the directory tree inside the folder:The sub-directory templates is the directory in which Flask will look for static HTML files for rendering in the web browser, in our case, we have two html files: home.html and result.html.The app.py file will contain the main code that will be executed by the python to run our Flask web application.\nIt includes the Machine Learning code for classifying our sms messages as spam or ham.The following are the contents of the home.html file that will create a text form where a user can enter a message:In the header section of or html file (home.html), we loaded style.css file.", "sum_nltk_words": 223, "sum_nltk_runtime": 0.007, "sum_t5": "i will first train a model, then work to serve our model, and at the end I will deploy our machine learning model. deploying a machine learning model is a different art because you have to think a lot in the process how you will make your machine learning application to your users. i will create a simple web application which will consist a web page which will look like a form where we can write or paste our sms.", "sum_t5_words": 80, "sum_t5_runtime": 6.181, "runtime": 0.006, "nltk_category": "Economics", "nltk_category_score": 0.08539383113384247, "nltk_category_runtime": 21.423, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9574598670005798, "nltk_subcategory_runtime": 34.525, "category": "Economics", "category_score": 0.08539383113384247, "subcategory": "Machine Learning", "subcategory_score": 0.9574598670005798, "runtime_cat": 55.948, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999981087842402", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "trained developed lot machine learning model student machine learning must also developed model article train deploy machine learning model using flask step step first train model work serve model end deploy machine learning modelwhen train machine learning model also think deploy machine learning model serve trained model available user get lot website teaching train machine learning model nobody go beyond deploy machine learning model training deploying machine learning model different difficult training model important part machine learning deploying model different art think lot process make machine learning application user let step step train sm spam detection machine learning model explain procedure training machine learning model get lot article website training model primary focus today teach deploy machine learning modelyou download dataset use training machine learning model belownow let train model sm spam detectionafter train model must wondered could use model without training model save model future use need training model every time model save machine learning model followsand next time need model load machine learning model followsafter training sm spam detection classification time deploy machine learning model create simple web application consist web page look like form write paste sm web page consist submit button click submit button use machine learning model classify whether sm spam ham spamfirst create folder project called smsmessagespamdetector directory tree inside folderthe subdirectory template directory flask look static html file rendering web browser case two html file homehtml resulthtmlthe apppy file contain main code executed python run flask web application includes machine learning code classifying sm message spam hamthe following content homehtml file create text form user enter messagein header section html file homehtml loaded stylecss file cs determine appearance style html document stylecss saved subdirectory called static default directory flask look static file cssnow create resulthtml file give u result model prediction final step deploy machine learning modelafter following step deploy machine learning model simply run program using apppy fileyou see output followsi hope like article train deploy machine learning model feel free ask valuable question comment section dont forget subscribe daily newsletter get email notification daily newsletter like work", "tags_descriptive": ["Naive Bayes", "Classification"]}