{"title": "TikTok Algorithm with Machine Learning", "description": "The discovery of the TikTok Algorithm is a very popular and powerful recommendation system. Similar to Netflix and YouTube, the TikTok algorithm works out of you. It can only provide you with profiled recommendations if you use the app by interacting with it in some way. In this article, I’ll walk you through how to build a TikTok algorithm with Machine Learning.Just think about how long a person can watch a video, which videos he watches, which ones he skips, which ones he likes and on what videos he comments on, etc. These are features that we have to take into account to feed the algorithm.Also, Read – Machine Learning Full Course for free.TikTok has graciously shared the conceptual workings of their algorithm on its website. It focuses on the concepts of the algorithm, rather than the code, so here I’m going to apply those concepts to the code and share a simple guide to creating this type of popular algorithm.", "link": "https://thecleverprogrammer.com/2020/09/26/tiktok-algorithm-with-machine-learning/", "tags": ["Recommender", "Regression"], "kind": "Project", "ml_libs": ["sklearn"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-09-26 11:44:34", "date_scraped": "2020-12-20 00:00:00", "words": 161, "sentences": 6, "runtime": 0.003, "description_category": "Education & Research", "description_category_score": 0.31773221492767334, "description_category_runtime": 13.992, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9269446134567261, "description_subcategory_runtime": 21.628, "category": "Education & Research", "category_score": 0.31773221492767334, "subcategory": "Machine Learning", "subcategory_score": 0.9269446134567261, "runtime_cat": 35.62, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999963139116472", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "discovery tiktok algorithm popular powerful recommendation system similar netflix youtube tiktok algorithm work provide profiled recommendation use app interacting way article ill walk build tiktok algorithm machine learningjust think long person watch video video watch one skip one like video comment etc feature take account feed algorithmalso read machine learning full course freetiktok graciously shared conceptual working algorithm website focus concept algorithm rather code im going apply concept code share simple guide creating type popular algorithm", "tags_descriptive": ["Recommender", "Regression"]}