{"title": "Topic Modeling with Python", "description": "Topic modeling is a type of statistical modeling for discovering abstract “subjects” that appear in a collection of documents. This means creating one topic per document template and words per topic template, modeled as Dirichlet distributions. In this article, I will walk you through the task of Topic Modeling in Machine Learning with Python.The field of Topic modeling has become increasingly important in recent years. Subject modeling is an unsupervised machine learning way to organize text (or image or DNA, etc.) information so that associated pieces of text can be identified.Also, Read – Machine Learning Full Course for free.", "link": "https://thecleverprogrammer.com/2020/10/24/topic-modeling-with-python/", "tags": ["NLP"], "kind": "Project", "ml_libs": ["pattern"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-10-24 12:30:03", "date_scraped": "2020-12-20 00:00:00", "words": 99, "sentences": 4, "runtime": 0.003, "description_category": "Media & Publishing", "description_category_score": 0.190108060836792, "description_category_runtime": 9.235, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9285997748374939, "description_subcategory_runtime": 13.85, "category": "Media & Publishing", "category_score": 0.190108060836792, "subcategory": "Machine Learning", "subcategory_score": 0.9285997748374939, "runtime_cat": 23.085, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999956978228332", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "topic modeling type statistical modeling discovering abstract subject appear collection document mean creating one topic per document template word per topic template modeled dirichlet distribution article walk task topic modeling machine learning pythonthe field topic modeling become increasingly important recent year subject modeling unsupervised machine learning way organize text image dna etc information associated piece text identifiedalso read machine learning full course free", "tags_descriptive": ["Natural Language Processing (NLP)"]}