{"title": "Rainfall Prediction with Machine Learning", "description": "Rainfall Prediction is one of the difficult and uncertain tasks that have a significant impact on human society. Timely and accurate forecasting can proactively help reduce human and financial loss. This study presents a set of experiments that involve the use of common machine learning techniques to create models that can predict whether it will rain tomorrow or not based on the weather data for that day in major cities in Australia.I’ve always liked knowing the parameters meteorologists take into account before making a weather forecast, so I found the dataset interesting. From an expert’s point of view, however, this dataset is fairly straightforward. At the end of this article, you will learn:Also, Read – Linear Search Algorithm with Python.Let’s start this task of rainfall prediction by importing the data, you can download the dataset I am using in this task from here:", "link": "https://thecleverprogrammer.com/2020/09/11/rainfall-prediction-with-machine-learning/", "tags": ["Regression", "Decision Tree", "GBM", "Logistic Regression", "Random Forest", "Classification"], "kind": "Project", "ml_libs": ["sklearn", "catboost", "xgboost", "lightgbm"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-09-11 12:42:17", "date_scraped": "2020-12-20 00:00:00", "words": 143, "sentences": 5, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.22327345609664917, "description_category_runtime": 12.52, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.6617265939712524, "description_subcategory_runtime": 19.354, "category": "Utilities", "category_score": 0.22327345609664917, "subcategory": "Machine Learning", "subcategory_score": 0.6617265939712524, "runtime_cat": 31.875, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999968394557868", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "rainfall prediction one difficult uncertain task significant impact human society timely accurate forecasting proactively help reduce human financial loss study present set experiment involve use common machine learning technique create model predict whether rain tomorrow based weather data day major city australiaive always liked knowing parameter meteorologist take account making weather forecast found dataset interesting expert point view however dataset fairly straightforward end article learnalso read linear search algorithm pythonlets start task rainfall prediction importing data download dataset using task", "tags_descriptive": ["Regression", "Decision Tree", "Gradient Boosting", "Logistic Regression", "Random Forest", "Classification"]}