{"title": "Instagram Filters with Python", "description": "You must have used Instagram once in your life, have you noticed that you see a variety of Instagram filters when uploading an image. These filters are designed to improve the quality of the image. These filters are an example of complex machine learning algorithms that are deployed in production to serve Instagram. So if these filters are created by machine learning algorithms, it means that we can also create Instagram filters with Python.In this article, I’ll walk you through how to create beautiful Instagram filters using machine learning. The best part of this task is that we are using Python. The biggest advantage of using such a popular language like Python is that you will get packages for almost every task.Also, Read – Machine Learning Full Course For Free.", "link": "https://thecleverprogrammer.com/2020/09/24/instagram-filters-with-python/", "tags": ["CV"], "kind": "Project", "ml_libs": ["opencv-python"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-09-24 16:42:42", "date_scraped": "2020-12-20 00:00:00", "words": 130, "sentences": 6, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.07352632284164429, "description_category_runtime": 10.67, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9641263484954834, "description_subcategory_runtime": 16.597, "category": "Utilities", "category_score": 0.07352632284164429, "subcategory": "Machine Learning", "subcategory_score": 0.9641263484954834, "runtime_cat": 27.266, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999962536538854", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "must used instagram life noticed see variety instagram filter uploading image filter designed improve quality image filter example complex machine learning algorithm deployed production serve instagram filter created machine learning algorithm mean also create instagram filter pythonin article ill walk create beautiful instagram filter using machine learning best part task using python biggest advantage using popular language like python get package almost every taskalso read machine learning full course free", "tags_descriptive": ["Computer Vision (CV)"]}