{"title": "GDP Analysis with Data Science", "description": "In this Data Science Project, I am investigating the dataset “Countries of the World”. I will be focusing on the factors affecting a country’s GDP per capita and try to make a model using the data of 227 countries from the dataset. I will also briefly discuss the total GDP.Let’s start by importing the required Python libraries You can download the data set we need for this task from here:Let’s look at the dataWe noticed that there are some missing data in the table. For simplicity, I will just fill the missing data using the median of the region that a country belongs, as countries that are close geologically are often similar in many ways. For example, lets check the region median of ‘GDP ($ per capita)’, ‘Literacy (%)’ and ‘Agriculture’. Note that for ‘climate’ we use the mode instead of median as it seems that ‘climate’ is a categorical feature here.", "link": "https://thecleverprogrammer.com/2020/05/26/data-science-project-gdp-analysis/", "tags": ["Random Forest", "Linear Regression", "Regression"], "kind": "Project", "ml_libs": ["sklearn"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-05-26 13:06:23", "date_scraped": "2020-12-20 00:00:00", "words": 152, "sentences": 6, "runtime": 0.002, "description_category": "Agriculture", "description_category_score": 0.6787845492362976, "description_category_runtime": 14.372, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.270321786403656, "description_subcategory_runtime": 22.934, "category": "Agriculture", "category_score": 0.6787845492362976, "subcategory": "Machine Learning", "subcategory_score": 0.270321786403656, "runtime_cat": 37.307, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999964034911699", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data science project investigating dataset country world focusing factor affecting country gdp per caput try make model using data 227 country dataset also briefly discus total gdplets start importing required python library download data set need task herelets look datawe noticed missing data table simplicity fill missing data using median region country belongs country close geologically often similar many way example let check region median gdp per caput literacy agriculture note climate use mode instead median seems climate categorical feature", "tags_descriptive": ["Random Forest", "Linear Regression", "Regression"]}