{"title": "Face Landmarks Detection", "description": "Have you ever thought how Snapchat manage to apply amazing filters according to your face? It have been programmed to detect some marks on your face to project a filter according to those marks. In Machine Learning those marks are known as Face Landmarks. In this article I will guide you how you can detect face Landmarks with Machine Learning.Now, I will simply start with importing all the libraries we need for this task. I will use PyTorch in this article to face landmarks detection with Deep Learning. Let’s import all the libraries:The dataset I will choose here to detect Face Landmarks in an official DLIB dataset which consists of over 6666 images of different dimensions. The code below will download the dataset and unzip for further exploration:Now, let’s have a look at what we are working with, to see all the data cleaning and preprocessing opportunities that we need to go through. Here is an example of an image from the dataset we have taken for this task. You can see that the face covers very less amount of space in the image. If we will use this image in the neural network it will take the background also. So like we prepare a text data we will prepare this image dataset for further exploration.", "link": "https://thecleverprogrammer.com/2020/07/22/face-landmarks-detection/", "tags": ["ResNet", "DL", "Image Segmentation"], "kind": "Project", "ml_libs": ["imutils", "skimage"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-07-22 11:57:18", "date_scraped": "2020-12-20 00:00:00", "words": 216, "sentences": 10, "sum_nltk": "Have you ever thought how Snapchat manage to apply amazing filters according to your face?\nIt have been programmed to detect some marks on your face to project a filter according to those marks.\nIn Machine Learning those marks are known as Face Landmarks.\nIn this article I will guide you how you can detect face Landmarks with Machine Learning.Now, I will simply start with importing all the libraries we need for this task.\nI will use PyTorch in this article to face landmarks detection with Deep Learning.\nLet’s import all the libraries:The dataset I will choose here to detect Face Landmarks in an official DLIB dataset which consists of over 6666 images of different dimensions.\nThe code below will download the dataset and unzip for further exploration:Now, let’s have a look at what we are working with, to see all the data cleaning and preprocessing opportunities that we need to go through.\nHere is an example of an image from the dataset we have taken for this task.\nYou can see that the face covers very less amount of space in the image.\nSo like we prepare a text data we will prepare this image dataset for further exploration.", "sum_nltk_words": 191, "sum_nltk_runtime": 0.003, "sum_t5": "Snapchat detects facial marks and projects a filter based on those marks. in machine learning those marks are known as Face Landmarks. we will use PyTorch to detect face landmarks with Deep Learning. the code below will download the dataset and unzip for further exploration. if we use this image in the neural network it will take the background also. if we use this image in the neural network it will take the background also.", "sum_t5_words": 75, "sum_t5_runtime": 4.534, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.43193963170051575, "nltk_category_runtime": 16.644, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.7894837856292725, "nltk_subcategory_runtime": 26.513, "category": "Education & Research", "category_score": 0.43193963170051575, "subcategory": "Machine Learning", "subcategory_score": 0.7894837856292725, "runtime_cat": 43.157, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999958508331833", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "ever thought snapchat manage apply amazing filter according face programmed detect mark face project filter according mark machine learning mark known face landmark article guide detect face landmark machine learningnow simply start importing library need task use pytorch article face landmark detection deep learning let import librariesthe dataset choose detect face landmark official dlib dataset consists 6666 image different dimension code download dataset unzip explorationnow let look working see data cleaning preprocessing opportunity need go example image dataset taken task see face cover le amount space image use image neural network take background also like prepare text data prepare image dataset exploration", "tags_descriptive": ["ResNet", "Deep Learning (DL)", "Image Segmentation"]}