{"title": "Data Augmentation in Deep Learning", "description": "Data Augmentation is a technique in Deep Learning which helps in adding value to our base dataset by adding the gathered information from various sources to improve the quality of data of an organisation. Data Augmentation is one of the most important processes that makes the data very much informational. Improving the data is very important for every business because data is considered as the oil of business. Data Augmentation can be applied to any form of the dataset, which mainly includes text, images, and audio.Data Augmentation helps in the study of the insights based on customers, product sales, and various other departments where the use of additional information can help a business to study the insights of the data very deeply. In this article, I will show you the most used field of Data Augmentation that is Image Augmentation.", "link": "https://thecleverprogrammer.com/2020/07/20/data-augmentation-in-deep-learning/", "tags": ["DL", "ReLu", "Classification"], "kind": "Project", "ml_libs": ["keras", "tensorflow"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-07-20 14:36:26", "date_scraped": "2020-12-20 00:00:00", "words": 140, "sentences": 5, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.3423391282558441, "description_category_runtime": 11.474, "description_subcategory": "Retail", "description_subcategory_score": 0.37201330065727234, "description_subcategory_runtime": 17.756, "category": "Wholesale & Retail", "category_score": 0.3423391282558441, "subcategory": "Retail", "subcategory_score": 0.37201330065727234, "runtime_cat": 29.23, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999960362638394", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data augmentation technique deep learning help adding value base dataset adding gathered information various source improve quality data organisation data augmentation one important process make data much informational improving data important every business data considered oil business data augmentation applied form dataset mainly includes text image audiodata augmentation help study insight based customer product sale various department use additional information help business study insight data deeply article show used field data augmentation image augmentation", "tags_descriptive": ["Deep Learning (DL)", "Rectified Linear Unit (ReLU)", "Classification"]}