{"title": "Machine Translation Model", "description": "Machine Translation is one of the most challenging tasks in Artificial Intelligence that works by investigating the use of software to translate a text or speech from one language to another. In this article, I will take you through Machine Translation using Neural networks.At the end of this article, you will learn to develop a machine translation model using Neural networks and python. I will use the English language as an input and we will train our Machine Translation model to give the output in the French language. Now let’s start with importing all the libraries that we need for this task:I will first create two functions to load the data and another function to test our data:Now let’s load the data and have a look at some insights from the data, the dataset that I am using here contains an English phrase with its translation:Dataset LoadedAs we are doing the translation of a language so the complexity of this problem will be determined by the complexity of the vocabulary. The more complex is the vocabulary of our language is the more complex our problem will be. Let’s look at the data to see what complex data we are dealing with:", "link": "https://thecleverprogrammer.com/2020/07/28/machine-translation-model/", "tags": ["RNN", "GRU", "Machine Translation"], "kind": "Project", "ml_libs": ["keras", "vocabulary"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-07-28 12:37:22", "date_scraped": "2020-12-20 00:00:00", "words": 201, "sentences": 6, "sum_nltk": "Machine Translation is one of the most challenging tasks in Artificial Intelligence that works by investigating the use of software to translate a text or speech from one language to another.\nIn this article, I will take you through Machine Translation using Neural networks.At the end of this article, you will learn to develop a machine translation model using Neural networks and python.\nI will use the English language as an input and we will train our Machine Translation model to give the output in the French language.\nNow let’s start with importing all the libraries that we need for this task:I will first create two functions to load the data and another function to test our data:Now let’s load the data and have a look at some insights from the data, the dataset that I am using here contains an English phrase with its translation:Dataset LoadedAs we are doing the translation of a language so the complexity of this problem will be determined by the complexity of the vocabulary.\nThe more complex is the vocabulary of our language is the more complex our problem will be.\nLet’s look at the data to see what complex data we are dealing with:", "sum_nltk_words": 196, "sum_nltk_runtime": 0.002, "sum_t5": "the more complex is the vocabulary of our language is the more complex our problem will be. the more complex is the vocabulary of our language is the more complex our problem will be. the more complex is the vocabulary of our language is the more complex our problem will be. the more complex is the vocabulary of our language is the more complex our problem will be. the more complex is the vocabulary of our language is the more complex our problem will be. the more complex is the vocabulary of our language is the more complex our problem will be", "sum_t5_words": 102, "sum_t5_runtime": 5.14, "runtime": 0.0, "nltk_category": "Media & Publishing", "nltk_category_score": 0.5780198574066162, "nltk_category_runtime": 16.1, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8687776327133179, "nltk_subcategory_runtime": 25.691, "category": "Media & Publishing", "category_score": 0.5780198574066162, "subcategory": "Machine Learning", "subcategory_score": 0.8687776327133179, "runtime_cat": 41.792, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999971076886388", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "machine translation one challenging task artificial intelligence work investigating use software translate text speech one language another article take machine translation using neural networksat end article learn develop machine translation model using neural network python use english language input train machine translation model give output french language let start importing library need taski first create two function load data another function test datanow let load data look insight data dataset using contains english phrase translationdataset loadedas translation language complexity problem determined complexity vocabulary complex vocabulary language complex problem let look data see complex data dealing", "tags_descriptive": ["Recurrent Neural Network (RNN)", "Gated Recurrent Unit (GRU)", "Machine Translation"]}