{"title": "Weather Forecasting with Machine Learning", "description": "In this article, I will show how we can do Weather Forecasting with Machine Learning algorithm and compare some frameworks for further classification.Lets start this task by importing the librariesDownload and read the data setTo look at first 5 rows of the dataWe have got an unexpected column named Unnamed: 0. Well, this is a very common problem. We face this when our csv file has an index column which has no name. here is how we can get rid of it.Now, we’ll make an attribute that would contain date (month, year). So that we could get temperature values with the timeline.On a closer look, by clicking on One Year View, we can see that the graph seems distorted because this is how the values really are. The temperature varies every year with months.We also will stick to these seasons for our analysis.A cluster size of 3 seems a good choice hereThere is a cluster from 26.2-27.5 and mean temperature for most months during history has been between 26.8-26.9Let’s see if we can get some insights from yearly mean temperature data. I am going to treat this as a time series as well.We can see clear positive trend lines. Let’s see if we could find any trend in seasonal mean temperatures.", "link": "https://thecleverprogrammer.com/2020/06/11/weather-forecasting-with-machine-learning/", "tags": ["Classification", "Decision Tree"], "kind": "Project", "ml_libs": ["pattern", "sklearn"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-06-11 23:29:55", "date_scraped": "2020-12-20 00:00:00", "words": 211, "sentences": 8, "sum_nltk": "In this article, I will show how we can do Weather Forecasting with Machine Learning algorithm and compare some frameworks for further classification.Lets start this task by importing the librariesDownload and read the data setTo look at first 5 rows of the dataWe have got an unexpected column named Unnamed: 0.\nWe face this when our csv file has an index column which has no name.\nhere is how we can get rid of it.Now, we’ll make an attribute that would contain date (month, year).\nSo that we could get temperature values with the timeline.On a closer look, by clicking on One Year View, we can see that the graph seems distorted because this is how the values really are.\nThe temperature varies every year with months.We also will stick to these seasons for our analysis.A cluster size of 3 seems a good choice hereThere is a cluster from 26.2-27.5 and mean temperature for most months during history has been between 26.8-26.9Let’s see if we can get some insights from yearly mean temperature data.\nI am going to treat this as a time series as well.We can see clear positive trend lines.\nLet’s see if we could find any trend in seasonal mean temperatures.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.003, "sum_t5": "we face this when our csv file has an index column which has no name. now, we’ll make an attribute that would contain date (month, year) so that we could get temperature values with the timeline. yearly mean temperature data is going to be treated as a time series. we can see clear positive trend lines. Let’s see if we could find any trend in seasonal mean temperatures... if we can find any trend in seasonal mean temperatures, we will use a cluster size", "sum_t5_words": 84, "sum_t5_runtime": 5.202, "runtime": 0.002, "nltk_category": "Utilities", "nltk_category_score": 0.17699439823627472, "nltk_category_runtime": 18.088, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.43422046303749084, "nltk_subcategory_runtime": 29.42, "category": "Utilities", "category_score": 0.17699439823627472, "subcategory": "Tools", "subcategory_score": 0.43422046303749084, "runtime_cat": 47.508, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999977723642306", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "article show weather forecasting machine learning algorithm compare framework classificationlets start task importing librariesdownload read data setto look first 5 row datawe got unexpected column named unnamed 0 well common problem face csv file index column name get rid itnow well make attribute would contain date month year could get temperature value timelineon closer look clicking one year view see graph seems distorted value really temperature varies every year monthswe also stick season analysisa cluster size 3 seems good choice herethere cluster 262275 mean temperature month history 268269lets see get insight yearly mean temperature data going treat time series wellwe see clear positive trend line let see could find trend seasonal mean temperature", "tags_descriptive": ["Classification", "Decision Tree"]}