{"title": "Language Classification with Python", "description": "In this article, I’ll walk you through how to create a language classification model to classify text into language categories. This language classification model can be used on data analyzed from online sources to categorize text into languages and filter the desired language before running an analysis such as sentiment analysis.The language classification is the grouping of associated languages in the same category. Languages are grouped diachronically into language families. In other words, languages are grouped according to their development and evolution throughout history, with languages that descend from a common ancestor being grouped in the same language family.Also, Read – Machine Learning Full Course for free.", "link": "https://thecleverprogrammer.com/2020/10/08/language-classification-with-python/", "tags": ["Classification", "Sentiment Analysis", "Decision Tree"], "kind": "Project", "ml_libs": ["sklearn"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-10-08 17:44:49", "date_scraped": "2020-12-20 00:00:00", "words": 107, "sentences": 4, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.3230668604373932, "description_category_runtime": 9.548, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.863738477230072, "description_subcategory_runtime": 14.213, "category": "Education & Research", "category_score": 0.3230668604373932, "subcategory": "Machine Learning", "subcategory_score": 0.863738477230072, "runtime_cat": 23.761, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999985666290981", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "article ill walk create language classification model classify text language category language classification model used data analyzed online source categorize text language filter desired language running analysis sentiment analysisthe language classification grouping associated language category language grouped diachronically language family word language grouped according development evolution throughout history language descend common ancestor grouped language familyalso read machine learning full course free", "tags_descriptive": ["Classification", "Sentiment Analysis", "Decision Tree"]}