{"title": "Fraud Detection with Machine Learning", "description": "Fraud is one of the major issues we come up majorly in banks, life insurance, health insurance, and many others. These major frauds are dependent on the person who is trying to sell you the fake product or service, if you are matured enough to decide what is wrong then you will never get into any fraud transactions. But one such fraud that has been increasing a lot these days is fraud in making payments. In this article, I will take you through a solution to fraud detection with machine learning.The dataset that I will use for this task can be easily downloaded from here. The dataset that I am using is transaction data for online purchases collected from an e-commerce retailer. The dataset contains more than 39000 transactions, each transaction contains 5 features that will describe the nature of the transactions. So let’s start with importing all the necessary libraries we need for Fraud Detection with Machine Learning:", "link": "https://thecleverprogrammer.com/2020/08/04/fraud-detection-with-machine-learning/", "tags": ["Logistic Regression", "Classification", "Regression"], "kind": "Project", "ml_libs": ["sklearn"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-08-04 01:04:12", "date_scraped": "2020-12-20 00:00:00", "words": 159, "sentences": 7, "runtime": 0.005, "description_category": "Banking & Insurance", "description_category_score": 0.5240703821182251, "description_category_runtime": 12.803, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.914595901966095, "description_subcategory_runtime": 20.192, "category": "Banking & Insurance", "category_score": 0.5240703821182251, "subcategory": "Machine Learning", "subcategory_score": 0.914595901966095, "runtime_cat": 32.995, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.999997426011779", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "fraud one major issue come majorly bank life insurance health insurance many others major fraud dependent person trying sell fake product service matured enough decide wrong never get fraud transaction one fraud increasing lot day fraud making payment article take solution fraud detection machine learningthe dataset use task easily downloaded dataset using transaction data online purchase collected ecommerce retailer dataset contains 39000 transaction transaction contains 5 feature describe nature transaction let start importing necessary library need fraud detection machine learning", "tags_descriptive": ["Logistic Regression", "Classification", "Regression"]}