{"title": "Named Entity Recognition (NER)", "description": "Named Entity means anything that is a real-world object such as a person, a place, any organisation, any product which has a name. For example – “My name is Aman, and I and a Machine Learning Trainer”. In this sentence the name “Aman”, the field or subject “Machine Learning” and the profession “Trainer” are named entities. In Machine Learning Named Entity Recognition (NER) is a task of Natural Language Processing to identify the named entities in a certain piece of text.Have you ever used software known as Grammarly? It identifies all the incorrect spellings and punctuations in the text and corrects it. But it does not do anything with the named entities, as it is also using the same technique. In this article, I will take you through the task of Named Entity Recognition (NER) with Machine Learning.", "link": "https://thecleverprogrammer.com/2020/08/04/named-entity-recognition-ner/", "tags": ["LSTM", "NLP", "ReLu", "NER"], "kind": "Project", "ml_libs": ["spacy", "keras", "sklearn", "tensorflow"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-08-04 21:46:09", "date_scraped": "2020-12-20 00:00:00", "words": 138, "sentences": 6, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.015403375029563904, "description_category_runtime": 13.202, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7896533608436584, "description_subcategory_runtime": 20.982, "category": "Wholesale & Retail", "category_score": 0.015403375029563904, "subcategory": "Machine Learning", "subcategory_score": 0.7896533608436584, "runtime_cat": 34.185, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999968549629152", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "named entity mean anything realworld object person place organisation product name example name aman machine learning trainer sentence name aman field subject machine learning profession trainer named entity machine learning named entity recognition ner task natural language processing identify named entity certain piece texthave ever used software known grammarly identifies incorrect spelling punctuation text corrects anything named entity also using technique article take task named entity recognition ner machine learning", "tags_descriptive": ["Long short-term memory (LSTM)", "Natural Language Processing (NLP)", "Rectified Linear Unit (ReLU)", "Named Entity Recognition (NER)"]}