{"title": "Fake News Detection Model", "description": "Fake News is one of the major concerns in our society right now. It is a very widespread issue that even the most leading media sometimes gets with the trap of Fake News. If it’s difficult for media channels to detect fake news then it’s next to difficult for a general citizen. As a part of a Machine Learning project, in this article, I will show you Fake News Detection with Machine Learning. I will use all the misinformation that we heard from some previous months about coronavirus. So at the end of this article, you will be able to create a fake news detection model on coronavirus.The data I will use in this article is collected from more than 1000 news articles and posts on social media platforms on coronavirus. You can download the dataset from here.Now I will Import all the libraries that we need for Fake News Detection; then I will Import the dataset using the pandas library in Python. Then I will prepare the data using the python pandas:I will create a number of new features based on the titles and body of news articles. Now let’s go through all the features one by one.Now I will count the number of capital letters in the Title of each article; then I will count the percentage of each capital letter in the body of all the articles. Counting the Capital letters will allow is to know what is the Title based on so that we can use that data for use as a categorical feature.On average, the fake news has a huge amount of words in capital letters in the title of the articles. This gives the impression that the people who write fake news try to impress the audience by the titles of their articles.Stop Words are the words that the search engines are programmed to ignore. For example – a the, at, on, which etc. Now I will count the number of stop words present in the title of each article:The titles of the articles of fake news contain fewer stop words then the titles of real news.Now I will count the number of proper noun in the title of each article:The titles of the fake news articles have more use of proper nouns than the titles of real news.", "link": "https://thecleverprogrammer.com/2020/07/18/fake-news-detection-model/", "tags": ["Classification"], "kind": "Project", "ml_libs": ["sklearn", "nltk"], "host": "thecleverprogrammer.com", "language": "english", "date_project": "2020-07-18 21:55:20", "date_scraped": "2020-12-20 00:00:00", "words": 385, "sentences": 13, "sum_nltk": "If it’s difficult for media channels to detect fake news then it’s next to difficult for a general citizen.\nSo at the end of this article, you will be able to create a fake news detection model on coronavirus.The data I will use in this article is collected from more than 1000 news articles and posts on social media platforms on coronavirus.\nYou can download the dataset from here.Now I will Import all the libraries that we need for Fake News Detection; then I will Import the dataset using the pandas library in Python.\nThen I will prepare the data using the python pandas:I will create a number of new features based on the titles and body of news articles.\nNow let’s go through all the features one by one.Now I will count the number of capital letters in the Title of each article; then I will count the percentage of each capital letter in the body of all the articles.\nCounting the Capital letters will allow is to know what is the Title based on so that we can use that data for use as a categorical feature.On average, the fake news has a huge amount of words in capital letters in the title of the articles.", "sum_nltk_words": 203, "sum_nltk_runtime": 0.004, "sum_t5": "the data is collected from more than 1000 news articles and posts on social media platforms on coronavirus. the data will be used to create a fake news detection model. it will then be imported using the pandas library in Python. the data will be used to create a number of new features based on the titles and body of news articles. a machine learning project is currently underway. a new feature will be created based on the number of stop words present in the title of each article.", "sum_t5_words": 89, "sum_t5_runtime": 6.841, "runtime": 0.004, "nltk_category": "Media & Publishing", "nltk_category_score": 0.5207294225692749, "nltk_category_runtime": 17.087, "nltk_subcategory": "General", "nltk_subcategory_score": 0.726008415222168, "nltk_subcategory_runtime": 27.233, "category": "Media & Publishing", "category_score": 0.5207294225692749, "subcategory": "General", "subcategory_score": 0.726008415222168, "runtime_cat": 44.32, "programming_language": "Python", "ml_score": "1.0", "language_code": "en", "language_score": "0.9999976950056285", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "fake news one major concern society right widespread issue even leading medium sometimes get trap fake news difficult medium channel detect fake news next difficult general citizen part machine learning project article show fake news detection machine learning use misinformation heard previous month coronavirus end article able create fake news detection model coronavirusthe data use article collected 1000 news article post social medium platform coronavirus download dataset herenow import library need fake news detection import dataset using panda library python prepare data using python pandasi create number new feature based title body news article let go feature one onenow count number capital letter title article count percentage capital letter body article counting capital letter allow know title based use data use categorical featureon average fake news huge amount word capital letter title article give impression people write fake news try impress audience title articlesstop word word search engine programmed ignore example etc count number stop word present title articlethe title article fake news contain fewer stop word title real newsnow count number proper noun title articlethe title fake news article use proper noun title real news", "tags_descriptive": ["Classification"]}