{"title": "Plant Seedlings Classification", "description": "Determine the species of a seedling from an imageCan you differentiate a weed from a crop seedling? The ability to do so effectively can mean better crop yields and better stewardship of the environment. The Aarhus University Signal Processing group, in collaboration with University of Southern Denmark, has recently released a dataset containing images of approximately 960 unique plants belonging to 12 species at several growth stages.  We're hosting this dataset as a Kaggle competition in order to give it wider exposure, to give the community an opportunity to experiment with different image recognition techniques, as well to provide a place to cross-pollenate ideas. Acknowledgments We extend our appreciation to the Aarhus University Department of Engineering Signal Processing Group for hosting the original data.  Citation A Public Image Database for Benchmark of Plant Seedling Classification Algorithms", "link": "https://www.kaggle.com/c/plant-seedlings-classification", "tags": ["DL", "Plants", "CV", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-03-13 00:59:00", "words": 138, "sentences": 5, "runtime": 0.0, "description_category": "Agriculture", "description_category_score": 0.3462032377719879, "description_category_runtime": 12.585, "description_subcategory": "Life-sciences", "description_subcategory_score": 0.4269718527793884, "description_subcategory_runtime": 19.102, "category": "Agriculture", "category_score": 0.3462032377719879, "subcategory": "Life-sciences", "subcategory_score": 0.4269718527793884, "runtime_cat": 31.687, "engagement_score": "0.635", "language_code": "en", "language": "english", "language_score": "0.9999978461544552", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "determine specie seedling imagecan differentiate weed crop seedling ability effectively mean better crop yield better stewardship environment aarhus university signal processing group collaboration university southern denmark recently released dataset containing image approximately 960 unique plant belonging 12 specie several growth stage hosting dataset kaggle competition order give wider exposure give community opportunity experiment different image recognition technique well provide place crosspollenate idea acknowledgment extend appreciation aarhus university department engineering signal processing group hosting original data citation public image database benchmark plant seedling classification algorithm", "tags_descriptive": ["Deep Learning (DL)", "Plants", "Computer Vision (CV)", "Convolutional Neural Network (CNN)"]}