{"title": "Diabetic Retinopathy Detection", "description": "Identify signs of diabetic retinopathy in eye imagesDiabetic retinopathy is the leading cause of blindness in the working-age population of the developed world. It is estimated to affect over 93 million people.  The US Center for Disease Control and Prevention estimates that 29.1 million people in the US have diabetes and the World Health Organization estimates that 347 million people have the disease worldwide. Diabetic Retinopathy (DR) is an eye disease associated with long-standing diabetes. Around 40% to 45% of Americans with diabetes have some stage of the disease. Progression to vision impairment can be slowed or averted if DR is detected in time, however this can be difficult as the disease often shows few symptoms until it is too late to provide effective treatment. Currently, detecting DR is a time-consuming and manual process that requires a trained clinician to examine and evaluate digital color fundus photographs of the retina. By the time human readers submit their reviews, often a day or two later, the delayed results lead to lost follow up, miscommunication, and delayed treatment. Clinicians can identify DR by the presence of lesions associated with the vascular abnormalities caused by the disease. While this approach is effective, its resource demands are high. The expertise and equipment required are often lacking in areas where the rate of diabetes in local populations is high and DR detection is most needed. As the number of individuals with diabetes continues to grow, the infrastructure needed to prevent blindness due to DR will become even more insufficient. The need for a comprehensive and automated method of DR screening has long been recognized, and previous efforts have made good progress using image classification, pattern recognition, and machine learning. With color fundus photography as input, the goal of this competition is to push an automated detection system to the limit of what is possible – ideally resulting in models with realistic clinical potential. The winning models will be open sourced to maximize the impact such a model can have on improving DR detection. Acknowledgements This competition is sponsored by the California Healthcare Foundation.  Retinal images were provided by EyePACS, a free platform for retinopathy screening.", "link": "https://www.kaggle.com/c/diabetic-retinopathy-detection", "tags": ["DL", "Classification", "Transfer Learning"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-07-28 01:59:00", "words": 356, "sentences": 15, "sum_nltk": "Identify signs of diabetic retinopathy in eye imagesDiabetic retinopathy is the leading cause of blindness in the working-age population of the developed world.\nDiabetic Retinopathy (DR) is an eye disease associated with long-standing diabetes.\nProgression to vision impairment can be slowed or averted if DR is detected in time, however this can be difficult as the disease often shows few symptoms until it is too late to provide effective treatment.\nCurrently, detecting DR is a time-consuming and manual process that requires a trained clinician to examine and evaluate digital color fundus photographs of the retina.\nClinicians can identify DR by the presence of lesions associated with the vascular abnormalities caused by the disease.\nThe expertise and equipment required are often lacking in areas where the rate of diabetes in local populations is high and DR detection is most needed.\nThe need for a comprehensive and automated method of DR screening has long been recognized, and previous efforts have made good progress using image classification, pattern recognition, and machine learning.\nWith color fundus photography as input, the goal of this competition is to push an automated detection system to the limit of what is possible – ideally resulting in models with realistic clinical potential.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.004, "sum_t5": "a competition to identify signs of diabetic retinopathy in eye images is being held to help improve DR detection. the winning models will be open sourced to maximize the impact such a model can have on improving DR detection. the winning models will be open sourced to maximize the impact such a model can have on improving DR detection. the winning models will be open sourced to maximize the impact such a model can have on improving DR detection.", "sum_t5_words": 79, "sum_t5_runtime": 6.227, "runtime": 0.003, "nltk_category": "Healthcare", "nltk_category_score": 0.46993085741996765, "nltk_category_runtime": 17.485, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6938572525978088, "nltk_subcategory_runtime": 28.551, "category": "Healthcare", "category_score": 0.46993085741996765, "subcategory": "Machine Learning", "subcategory_score": 0.6938572525978088, "runtime_cat": 46.036, "engagement_score": "0.622", "language_code": "en", "language": "english", "language_score": "0.9999968760910771", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify sign diabetic retinopathy eye imagesdiabetic retinopathy leading cause blindness workingage population developed world estimated affect 93 million people u center disease control prevention estimate 291 million people u diabetes world health organization estimate 347 million people disease worldwide diabetic retinopathy dr eye disease associated longstanding diabetes around 40 45 american diabetes stage disease progression vision impairment slowed averted dr detected time however difficult disease often show symptom late provide effective treatment currently detecting dr timeconsuming manual process requires trained clinician examine evaluate digital color fundus photograph retina time human reader submit review often day two later delayed result lead lost follow miscommunication delayed treatment clinician identify dr presence lesion associated vascular abnormality caused disease approach effective resource demand high expertise equipment required often lacking area rate diabetes local population high dr detection needed number individual diabetes continues grow infrastructure needed prevent blindness due dr become even insufficient need comprehensive automated method dr screening long recognized previous effort made good progress using image classification pattern recognition machine learning color fundus photography input goal competition push automated detection system limit possible ideally resulting model realistic clinical potential winning model open sourced maximize impact model improving dr detection acknowledgement competition sponsored california healthcare foundation retinal image provided eyepacs free platform retinopathy screening", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Transfer Learning"]}