{"title": "Draper Satellite Image Chronology", "description": "Can you put order to space and time?Imagine a world where we can use satellite images to help find better access to clean water, prevent poaching of wildlife, predict storms more efficiently, optimize traffic patterns more readily, and inform human behaviors to mitigate the spread of disease.  Thanks to a marked increase of satellites in orbit, we will be able to capture images – and the information contained within – of nearly every place on Earth, every day by 2017. However, our ability to analyze datasets of these images has not advanced as quickly. Changes from day to day in images of the same location are subtle, can be hard to detect, and are difficult to understand in terms of their significance. In this competition, Draper provides a unique dataset of images taken at the same locations over 5 days. Kagglers are challenged to predict the chronological order of the photos taken at each location. Accurately doing so could uncover approaches that have a global impact on commerce, science, and humanitarian works.", "link": "https://www.kaggle.com/c/draper-satellite-image-chronology", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-06-28 01:59:00", "words": 168, "sentences": 5, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.23522484302520752, "description_category_runtime": 14.501, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.6286200881004333, "description_subcategory_runtime": 22.968, "category": "Utilities", "category_score": 0.23522484302520752, "subcategory": "Judicial Applied", "subcategory_score": 0.6286200881004333, "runtime_cat": 37.469, "engagement_score": "0.593", "language_code": "en", "language": "english", "language_score": "0.9999952628473932", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "put order space timeimagine world use satellite image help find better access clean water prevent poaching wildlife predict storm efficiently optimize traffic pattern readily inform human behavior mitigate spread disease thanks marked increase satellite orbit able capture image information contained within nearly every place earth every day 2017 however ability analyze datasets image advanced quickly change day day image location subtle hard detect difficult understand term significance competition draper provides unique dataset image taken location 5 day kagglers challenged predict chronological order photo taken location accurately could uncover approach global impact commerce science humanitarian work", "tags_descriptive": []}