{"title": "Bengali.AI Handwritten Grapheme Classification", "description": "Classify the components of handwritten BengaliChallenge and dataset summary available at https://arxiv.org/abs/2010.00170 Bengali is the 5th most spoken language in the world with hundreds of million of speakers. It’s the official language of Bangladesh and the second most spoken language in India. Considering its reach, there’s significant business and educational interest in developing AI that can optically recognize images of the language handwritten. This challenge hopes to improve on approaches to Bengali recognition.  Optical character recognition is particularly challenging for Bengali. While Bengali has 49 letters (to be more specific 11 vowels and 38 consonants) in its alphabet, there are also 18 potential diacritics, or accents. This means that there are many more graphemes, or the smallest units in a written language. The added complexity results in ~13,000 different grapheme variations (compared to English’s 250 graphemic units). Bangladesh-based non-profit Bengali.AI is focused on helping to solve this problem. They build and release crowdsourced, metadata-rich datasets and open source them through research competitions. Through this work, Bengali.AI hopes to democratize and accelerate research in Bengali language technologies and to promote machine learning education. For this competition, you’re given the image of a handwritten Bengali grapheme and are challenged to separately classify three constituent elements in the image: grapheme root, vowel diacritics, and consonant diacritics. By participating in the competition, you’ll hopefully accelerate Bengali handwritten optical character recognition research and help enable the digitalization of educational resources. Moreover, the methods introduced in the competition will also empower cousin languages in the Indian subcontinent. Acknowledgements:    Apurba: Apurba is the exclusive sponsor of Bengali.AI for this competition. Apurba Technologies Inc. is founded by a group of technology veterans who have been working at the cutting edge of software development in Silicon Valley for many years. Apart from its many ventures, Apurba is a pioneer in Bengali NLP research today and is accelerating AI research in Bangladesh through its contributions.     Intelligent Machines Limited: Intelligent Machines Limited is the technical partner of Bengali.AI for this competition and is providing compute support to Bangladeshi students. IML is an Artificial Intelligence and Advanced Analytics startup offering customized solutions to businesses in Bangladesh. IML believes in the strength of Bangladeshi talented resources and in the possibility of a far greater and developed Bangladesh in the coming days.", "link": "https://www.kaggle.com/c/bengaliai-cv19", "tags": ["Exploratory Data Analysis", "CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-03-17 00:59:00", "words": 386, "sentences": 21, "sum_nltk": "Classify the components of handwritten BengaliChallenge and dataset summary available at https://arxiv.org/abs/2010.00170 Bengali is the 5th most spoken language in the world with hundreds of million of speakers.\nConsidering its reach, there’s significant business and educational interest in developing AI that can optically recognize images of the language handwritten.\nOptical character recognition is particularly challenging for Bengali.\nThrough this work, Bengali.AI hopes to democratize and accelerate research in Bengali language technologies and to promote machine learning education.\nFor this competition, you’re given the image of a handwritten Bengali grapheme and are challenged to separately classify three constituent elements in the image: grapheme root, vowel diacritics, and consonant diacritics.\nBy participating in the competition, you’ll hopefully accelerate Bengali handwritten optical character recognition research and help enable the digitalization of educational resources.\nMoreover, the methods introduced in the competition will also empower cousin languages in the Indian subcontinent.\nApart from its many ventures, Apurba is a pioneer in Bengali NLP research today and is accelerating AI research in Bangladesh through its contributions.\nIML believes in the strength of Bangladeshi talented resources and in the possibility of a far greater and developed Bangladesh in the coming days.", "sum_nltk_words": 186, "sum_nltk_runtime": 0.005, "sum_t5": "Bengali is the official language of Bangladesh and the second most spoken language in india. there's significant business and educational interest in developing AI that can optically recognize images of the language handwritten. this challenge hopes to improve on approaches to Bengali recognition. while Bengali has 49 letters (to be more specific 11 vowels and 38 consonants) in its alphabet, there are also 18 potential diacritics, or accents. the added complexity results in 13,000 different grapheme variations (compared to English’", "sum_t5_words": 80, "sum_t5_runtime": 7.012, "runtime": 0.01, "nltk_category": "Education & Research", "nltk_category_score": 0.8549651503562927, "nltk_category_runtime": 19.488, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8319990634918213, "nltk_subcategory_runtime": 31.792, "category": "Education & Research", "category_score": 0.8549651503562927, "subcategory": "Machine Learning", "subcategory_score": 0.8319990634918213, "runtime_cat": 51.28, "engagement_score": "0.682", "language_code": "en", "language": "english", "language_score": "0.9999951205085479", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "classify component handwritten bengalichallenge dataset summary available httpsarxivorgabs201000170 bengali 5th spoken language world hundred million speaker official language bangladesh second spoken language india considering reach there significant business educational interest developing ai optically recognize image language handwritten challenge hope improve approach bengali recognition optical character recognition particularly challenging bengali bengali 49 letter specific 11 vowel 38 consonant alphabet also 18 potential diacritic accent mean many grapheme smallest unit written language added complexity result 13000 different grapheme variation compared english 250 graphemic unit bangladeshbased nonprofit bengaliai focused helping solve problem build release crowdsourced metadatarich datasets open source research competition work bengaliai hope democratize accelerate research bengali language technology promote machine learning education competition youre given image handwritten bengali grapheme challenged separately classify three constituent element image grapheme root vowel diacritic consonant diacritic participating competition youll hopefully accelerate bengali handwritten optical character recognition research help enable digitalization educational resource moreover method introduced competition also empower cousin language indian subcontinent acknowledgement apurba apurba exclusive sponsor bengaliai competition apurba technology inc founded group technology veteran working cutting edge software development silicon valley many year apart many venture apurba pioneer bengali nlp research today accelerating ai research bangladesh contribution intelligent machine limited intelligent machine limited technical partner bengaliai competition providing compute support bangladeshi student iml artificial intelligence advanced analytics startup offering customized solution business bangladesh iml belief strength bangladeshi talented resource possibility far greater developed bangladesh coming day", "tags_descriptive": ["Exploratory Data Analysis", "Computer Vision (CV)"]}