{"title": "20 Newsgroups Ciphertext Challenge", "description": "V8g{9827\f$A${?^*?}$$v7\u0010*.yig$w9.8}This isn't your classic decoder ring puzzle found in a cereal box. There's a twist. Welcome to the Ciphertext Challenge! In this competition, we've encrypted parts of a well-known dataset -- the 20 Newsgroups dataset -- with several simple, classic ciphers.  This dataset is commonly used as a multi-class and NLP sample set, noted for its small size, varied nature, and the first-hand look it offers into the deep existential horrors of the 90s-era internet. With 20 fairly distinct classes and lots of clues, it allows for a wide variety of successful approaches. We've made the problem a little harder to solve. Fabulous Kaggle swag will go to the top competitors - the highest-scoring teams (which might be the first to crack the code!), and the most popular kernel.  Note that this is a short competition, so use your submissions wisely. * = Note: It is possible to apply a number of techniques using ONLY the ciphertext. Acknowledgements Kaggle is hosting this competition for the machine learning community to use for fun and practice.  You can view and download the unencrypted dataset from Jason Rennie's homepage.  In the words of the host: The 20 Newsgroups data set is a collection of approximately 20,000 newsgroup documents, partitioned (nearly) evenly across 20 different newsgroups. To the best of my knowledge, it was originally collected by Ken Lang, probably for his Newsweeder: Learning to filter netnews paper, though he does not explicitly mention this collection. If you use the dataset in a scientific publication, please reference (at a minimum) the above website. Photo by U.S. Air Force photo/Don Branum", "link": "https://www.kaggle.com/c/20-newsgroups-ciphertext-challenge", "tags": ["NLP", "Classification", "Exploratory Data Analysis", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-01-17 00:59:00", "words": 270, "sentences": 16, "sum_nltk": "V8g{9827\f$A${?^*?}$$v7\u0010*.yig$w9.8}This isn't your classic decoder ring puzzle found in a cereal box.\nWelcome to the Ciphertext Challenge!\nIn this competition, we've encrypted parts of a well-known dataset -- the 20 Newsgroups dataset -- with several simple, classic ciphers.\nThis dataset is commonly used as a multi-class and NLP sample set, noted for its small size, varied nature, and the first-hand look it offers into the deep existential horrors of the 90s-era internet.\nFabulous Kaggle swag will go to the top competitors - the highest-scoring teams (which might be the first to crack the code!), and the most popular kernel.\nNote that this is a short competition, so use your submissions wisely.\n* = Note: It is possible to apply a number of techniques using ONLY the ciphertext.\nAcknowledgements Kaggle is hosting this competition for the machine learning community to use for fun and practice.\nYou can view and download the unencrypted dataset from Jason Rennie's homepage.\nIn the words of the host: The 20 Newsgroups data set is a collection of approximately 20,000 newsgroup documents, partitioned (nearly) evenly across 20 different newsgroups.\nIf you use the dataset in a scientific publication, please reference (at a minimum) the above website.", "sum_nltk_words": 189, "sum_nltk_runtime": 0.003, "sum_t5": "the 20 Newsgroups dataset is a collection of approximately 20,000 newsgroup documents. the dataset is commonly used as a multi-class and NLP sample set. the highest-scoring teams (which might be the first to crack the code!) and the most popular kernel will win. the ciphertext challenge is open to all machine learning enthusiasts. if you use the dataset in a scientific publication, please reference (at minimum) the above website.", "sum_t5_words": 69, "sum_t5_runtime": 6.206, "runtime": 2.528, "nltk_category": "Utilities", "nltk_category_score": 0.16819773614406586, "nltk_category_runtime": 21.546, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.3856425881385803, "nltk_subcategory_runtime": 33.775, "category": "Utilities", "category_score": 0.16819773614406586, "subcategory": "Machine Learning", "subcategory_score": 0.3856425881385803, "runtime_cat": 55.321, "engagement_score": "0.525", "language_code": "en", "language": "english", "language_score": "0.9999964191371239", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "v8g9827 av7yigw98this isnt classic decoder ring puzzle found cereal box there twist welcome ciphertext challenge competition weve encrypted part wellknown dataset 20 newsgroups dataset several simple classic cipher dataset commonly used multiclass nlp sample set noted small size varied nature firsthand look offer deep existential horror 90sera internet 20 fairly distinct class lot clue allows wide variety successful approach weve made problem little harder solve fabulous kaggle swag go top competitor highestscoring team might first crack code popular kernel note short competition use submission wisely note possible apply number technique using ciphertext acknowledgement kaggle hosting competition machine learning community use fun practice view download unencrypted dataset jason rennies homepage word host 20 newsgroups data set collection approximately 20000 newsgroup document partitioned nearly evenly across 20 different newsgroups best knowledge originally collected ken lang probably newsweeder learning filter netnews paper though explicitly mention collection use dataset scientific publication please reference minimum website photo u air force photodon branum", "tags_descriptive": ["Natural Language Processing (NLP)", "Classification", "Exploratory Data Analysis", "Classification"]}