{"title": "Santa's Workshop Tour 2019", "description": "In the notebook we can build a model, and pretend that it will optimize...Hammers ring, are you listenin’ In the shop, toys are glistenin’ Should they see the sights? There might be a fight… Walkin’ ‘round the Workshop Wonderland  Families said, they want to see it Santa said, he’d guarantee it They pick a date But they may have to wait Walkin’  ‘round the Workshop Wonderland We told Santa that he was a madman He just wants to make sure they all smile He’ll say “Are you flexible?“, They’ll say “Yeah man, But can you help us make it worth our while?” “Give them food, or sweater the more they wait, the gifts get better” Please help us rank Or we’ll break the bank! Walkin’ ’round the Workshop Wonderland Santa has exciting news! For 100 days before Christmas, he opened up tours to his workshop. Because demand was so strong, and because Santa wanted to make things as fair as possible, he let each of the 5,000 families that will visit the workshop choose a list of dates they'd like to attend the workshop. Now that all the families have sent Santa their preferences, he's realized it's impossible for everyone to get their top picks, so he's decided to provide extra perks for families that don't get their preferences. In addition, Santa's accounting department has told him that, depending on how families are scheduled, there may be some unexpected and hefty costs incurred. Santa needs the help of the Kaggle community to optimize which day each family is assigned to attend the workshop in order to minimize any extra expenses that would cut into next years toy budget! Can you help Santa out? Attribution Banner/Listing Photo by Nathan Lemon on Unsplash Description Photo by Markus Spiske on Unsplash", "link": "https://www.kaggle.com/c/santa-workshop-tour-2019", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-01-16 00:59:00", "words": 300, "sentences": 5, "sum_nltk": "There might be a fight… Walkin’ ‘round the Workshop Wonderland  Families said, they want to see it Santa said, he’d guarantee it They pick a date But they may have to wait Walkin’  ‘round the Workshop Wonderland We told Santa that he was a madman He just wants to make sure they all smile He’ll say “Are you flexible?“, They’ll say “Yeah man, But can you help us make it worth our while?” “Give them food, or sweater the more they wait, the gifts get better” Please help us rank Or we’ll break the bank!\nBecause demand was so strong, and because Santa wanted to make things as fair as possible, he let each of the 5,000 families that will visit the workshop choose a list of dates they'd like to attend the workshop.\nNow that all the families have sent Santa their preferences, he's realized it's impossible for everyone to get their top picks, so he's decided to provide extra perks for families that don't get their preferences.\nSanta needs the help of the Kaggle community to optimize which day each family is assigned to attend the workshop in order to minimize any extra expenses that would cut into next years toy budget!\nCan you help Santa out?", "sum_nltk_words": 207, "sum_nltk_runtime": 0.003, "sum_t5": "Santa has opened up tours to his workshop for 100 days before christmas. he's realized it's impossible for everyone to get their top picks, so he's decided to provide extra perks for families that don't get their preferences. he needs the help of the Kaggle community to optimize which day each family is assigned to attend the workshop in order to minimize any extra expenses. if you can help Santa out, please send us a message on facebook or twitter.", "sum_t5_words": 80, "sum_t5_runtime": 6.306, "runtime": 0.005, "nltk_category": "Accommodation & Food", "nltk_category_score": 0.9597212076187134, "nltk_category_runtime": 19.477, "nltk_subcategory": "Food", "nltk_subcategory_score": 0.8816322684288025, "nltk_subcategory_runtime": 31.043, "category": "Accommodation & Food", "category_score": 0.9597212076187134, "subcategory": "Food", "subcategory_score": 0.8816322684288025, "runtime_cat": 50.52, "engagement_score": "0.67", "language_code": "en", "language": "english", "language_score": "0.9999963577749074", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notebook build model pretend optimizehammers ring listenin shop toy glistenin see sight might fight walkin round workshop wonderland family said want see santa said hed guarantee pick date may wait walkin round workshop wonderland told santa madman want make sure smile hell say flexible theyll say yeah man help u make worth give food sweater wait gift get better please help u rank well break bank walkin round workshop wonderland santa exciting news 100 day christmas opened tour workshop demand strong santa wanted make thing fair possible let 5000 family visit workshop choose list date theyd like attend workshop family sent santa preference he realized impossible everyone get top pick he decided provide extra perk family dont get preference addition santa accounting department told depending family scheduled may unexpected hefty cost incurred santa need help kaggle community optimize day family assigned attend workshop order minimize extra expense would cut next year toy budget help santa attribution bannerlisting photo nathan lemon unsplash description photo markus spiske unsplash", "tags_descriptive": ["Exploratory Data Analysis"]}