{"title": "Quora Insincere Questions Classification", "description": "Detect toxic content to improve online conversationsAn existential problem for any major website today is how to handle toxic and divisive content. Quora wants to tackle this problem head-on to keep their platform a place where users can feel safe sharing their knowledge with the world. Quora is a platform that empowers people to learn from each other. On Quora, people can ask questions and connect with others who contribute unique insights and quality answers. A key challenge is to weed out insincere questions -- those founded upon false premises, or that intend to make a statement rather than look for helpful answers. In this competition, Kagglers will develop models that identify and flag insincere questions. To date, Quora has employed both machine learning and manual review to address this problem. With your help, they can develop more scalable methods to detect toxic and misleading content. Here's your chance to combat online trolls at scale. Help Quora uphold their policy of “Be Nice, Be Respectful” and continue to be a place for sharing and growing the world’s knowledge. Important Note Be aware that this is being run as a Kernels Only Competition, requiring that all submissions be made via a Kernel output. Please read the Kernels FAQ and the data page very carefully to fully understand how this is designed.", "link": "https://www.kaggle.com/c/quora-insincere-questions-classification", "tags": ["DL", "NLP", "Classification", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-02-14 00:09:00", "words": 220, "sentences": 12, "sum_nltk": "Detect toxic content to improve online conversationsAn existential problem for any major website today is how to handle toxic and divisive content.\nQuora wants to tackle this problem head-on to keep their platform a place where users can feel safe sharing their knowledge with the world.\nQuora is a platform that empowers people to learn from each other.\nOn Quora, people can ask questions and connect with others who contribute unique insights and quality answers.\nA key challenge is to weed out insincere questions -- those founded upon false premises, or that intend to make a statement rather than look for helpful answers.\nIn this competition, Kagglers will develop models that identify and flag insincere questions.\nTo date, Quora has employed both machine learning and manual review to address this problem.\nWith your help, they can develop more scalable methods to detect toxic and misleading content.\nHere's your chance to combat online trolls at scale.\nHelp Quora uphold their policy of “Be Nice, Be Respectful” and continue to be a place for sharing and growing the world’s knowledge.\nImportant Note Be aware that this is being run as a Kernels Only Competition, requiring that all submissions be made via a Kernel output.", "sum_nltk_words": 192, "sum_nltk_runtime": 0.003, "sum_t5": "Detect toxic content to improve online conversations. a key challenge is to weed out insincere questions. a key challenge is to weed out insincere questions. a key challenge is to weed out insincere questions. a key challenge is to weed out insincere questions.. with your help, they can develop more scalable methods to detect toxic and misleading content.. with your help, they can develop more scalable methods to detect toxic and misleading content.", "sum_t5_words": 73, "sum_t5_runtime": 5.16, "runtime": 0.002, "nltk_category": "Accommodation & Food", "nltk_category_score": 0.5556643605232239, "nltk_category_runtime": 17.897, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.6018005013465881, "nltk_subcategory_runtime": 28.411, "category": "Accommodation & Food", "category_score": 0.5556643605232239, "subcategory": "Student", "subcategory_score": 0.6018005013465881, "runtime_cat": 46.309, "engagement_score": "0.712", "language_code": "en", "language": "english", "language_score": "0.9999968565027925", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "detect toxic content improve online conversationsan existential problem major website today handle toxic divisive content quora want tackle problem headon keep platform place user feel safe sharing knowledge world quora platform empowers people learn quora people ask question connect others contribute unique insight quality answer key challenge weed insincere question founded upon false premise intend make statement rather look helpful answer competition kagglers develop model identify flag insincere question date quora employed machine learning manual review address problem help develop scalable method detect toxic misleading content here chance combat online troll scale help quora uphold policy nice respectful continue place sharing growing world knowledge important note aware run kernel competition requiring submission made via kernel output please read kernel faq data page carefully fully understand designed", "tags_descriptive": ["Deep Learning (DL)", "Natural Language Processing (NLP)", "Classification", "Exploratory Data Analysis"]}