{"title": "Porto Seguro’s Safe Driver Prediction", "description": "Predict if a driver will file an insurance claim next year.Nothing ruins the thrill of buying a brand new car more quickly than seeing your new insurance bill. The sting’s even more painful when you know you’re a good driver. It doesn’t seem fair that you have to pay so much if you’ve been cautious on the road for years. Porto Seguro, one of Brazil’s largest auto and homeowner insurance companies, completely agrees. Inaccuracies in car insurance company’s claim predictions raise the cost of insurance for good drivers and reduce the price for bad ones. In this competition, you’re challenged to build a model that predicts the probability that a driver will initiate an auto insurance claim in the next year. While Porto Seguro has used machine learning for the past 20 years, they’re looking to Kaggle’s machine learning community to explore new, more powerful methods. A more accurate prediction will allow them to further tailor their prices, and hopefully make auto insurance coverage more accessible to more drivers.", "link": "https://www.kaggle.com/c/porto-seguro-safe-driver-prediction", "tags": ["Classification", "Feature Engineering", "Dimensionality Reduction", "Logistic Regression", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-11-30 00:59:00", "words": 169, "sentences": 8, "runtime": 0.002, "description_category": "Finance", "description_category_score": 0.4154512584209442, "description_category_runtime": 15.763, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9216817617416382, "description_subcategory_runtime": 24.752, "category": "Finance", "category_score": 0.4154512584209442, "subcategory": "Machine Learning", "subcategory_score": 0.9216817617416382, "runtime_cat": 40.515, "engagement_score": "0.723", "language_code": "en", "language": "english", "language_score": "0.9999980569950133", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict driver file insurance claim next yearnothing ruin thrill buying brand new car quickly seeing new insurance bill sting even painful know youre good driver doesnt seem fair pay much youve cautious road year porto seguro one brazil largest auto homeowner insurance company completely agrees inaccuracy car insurance company claim prediction raise cost insurance good driver reduce price bad one competition youre challenged build model predicts probability driver initiate auto insurance claim next year porto seguro used machine learning past 20 year theyre looking kaggles machine learning community explore new powerful method accurate prediction allow tailor price hopefully make auto insurance coverage accessible driver", "tags_descriptive": ["Classification", "Feature Engineering", "Dimensionality Reduction", "Logistic Regression", "Classification"]}