{"title": "Data Science London + Scikit-learn", "description": "Scikit-learn is an open-source machine learning library for Python. Give it a try here!hosting a meetup on Scikit-learn We encourage participants to post code via the \"Tutorials\" link on the left.  Don't worry about accuracy or whether your code is perfect.  The aim here is to explore sklearn by using it.    Its implementation is high quality due to s Meetup Information Thursday, March 7, 2013,  “Learning in Python with scikit-learn\" by Andreas Mueller   \"Parallel and large scale learning with scikit-learn\" by Olivier Grisel   notebook interface How to perform scalable text feature extraction with the Hashing Trick and hyper parameters tuning How to optimize memory usage with memory mapping How to approximate kernel Support Vector Machines for large scale datasets A short introduction to Ensembles with model averaging and Random Forests   by day and a Python machine learning hacker by night. He is interested in applications to Natural Language Processing, Computer Vision and predictive modelling.", "link": "https://www.kaggle.com/c/data-science-london-scikit-learn", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-01-01 00:59:00", "words": 158, "sentences": 5, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.1789548397064209, "description_category_runtime": 15.731, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9697520136833191, "description_subcategory_runtime": 25.293, "category": "Education & Research", "category_score": 0.1789548397064209, "subcategory": "Machine Learning", "subcategory_score": 0.9697520136833191, "runtime_cat": 41.025, "engagement_score": "0.545", "language_code": "en", "language": "english", "language_score": "0.9999967121048994", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "scikitlearn opensource machine learning library python give try herehosting meetup scikitlearn encourage participant post code via tutorial link left dont worry accuracy whether code perfect aim explore sklearn using implementation high quality due meetup information thursday march 7 2013 learning python scikitlearn andreas mueller parallel large scale learning scikitlearn olivier grisel notebook interface perform scalable text feature extraction hashing trick hyper parameter tuning optimize memory usage memory mapping approximate kernel support vector machine large scale datasets short introduction ensemble model averaging random forest day python machine learning hacker night interested application natural language processing computer vision predictive modelling", "tags_descriptive": []}