{"title": "Recursion Cellular Image Classification", "description": "CellSignal: Disentangling biological signal from experimental noise in cellular imagesThe cost of some drugs and medical treatments has risen so high in recent years that many patients are having to go without. You can help with a classification project that could make researchers more efficient. One of the more surprising reasons behind the cost is how long it takes to bring new treatments to market. Despite improvements in technology and science, research and development continues to lag. In fact, finding new treatments takes, on average, more than 10 years and costs hundreds of millions of dollars.  Recursion Pharmaceuticals, creators of the industry’s largest dataset of biological images, generated entirely in-house, believes AI has the potential to dramatically improve and expedite the drug discovery process. More specifically, your efforts could help them understand how drugs interact with human cells.  This competition will have you disentangling experimental noise from real biological signals. Your entry will classify images of cells under one of 1,108 different genetic perturbations. You can help eliminate the noise introduced by technical execution and environmental variation between experiments. If successful, you could dramatically improve the industry’s ability to model cellular images according to their relevant biology. In turn, applying AI could greatly decrease the cost of treatments, and ensure these treatments get to patients faster. This competition is a part of the NeurIPS 2019 competition track. Winners will be invited to contribute their solutions towards the workshop presentation. Acknowledgments Thank you to the following sponsors & supporters of this competition:     Google Cloud: Google Cloud is widely recognized as a global leader in delivering a secure, open and intelligent enterprise cloud platform. Our technology is built on Google’s private network and is the product of nearly 20 years of innovation in security, network architecture, collaboration, artificial intelligence and open source software. We offer a simply engineered set of tools and unparalleled technology across Google Cloud Platform and G Suite that help bring people, insights and ideas together. Customers across more than 150 countries trust Google Cloud to modernize their computing environment for today’s digital world.   DoiT: You have the cloud and we have your back. For nearly a decade, we’ve been helping businesses build and scale cloud solutions with our world-class cloud engineering support. We help our customers with technical support and consulting on building and operating complex large-scale distributed systems, developing better machine learning models and setting up big data solutions using Google Cloud, Amazon AWS and Microsoft Azure.   NVIDIA: NVIDIA’s (NASDAQ: NVDA) invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots and self-driving cars that can perceive and understand the world. More information at http://nvidianews.nvidia.com.   Lambda: Lambda provides Deep Learning workstations, servers, and GPU cloud services. Lambda Deep Learning infrastructure is used by the world's leading AI research & development organizations including Apple, Microsoft, MIT, Stanford, and the US Government. To learn more, visit www.lambdalabs.com.", "link": "https://www.kaggle.com/c/recursion-cellular-image-classification", "tags": ["DL", "Classification", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-09-27 01:59:00", "words": 527, "sentences": 27, "sum_nltk": "CellSignal: Disentangling biological signal from experimental noise in cellular imagesThe cost of some drugs and medical treatments has risen so high in recent years that many patients are having to go without.\nWe offer a simply engineered set of tools and unparalleled technology across Google Cloud Platform and G Suite that help bring people, insights and ideas together.\nCustomers across more than 150 countries trust Google Cloud to modernize their computing environment for today’s digital world.\nFor nearly a decade, we’ve been helping businesses build and scale cloud solutions with our world-class cloud engineering support.\nWe help our customers with technical support and consulting on building and operating complex large-scale distributed systems, developing better machine learning models and setting up big data solutions using Google Cloud, Amazon AWS and Microsoft Azure.\nMore recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots and self-driving cars that can perceive and understand the world.\nLambda Deep Learning infrastructure is used by the world's leading AI research & development organizations including Apple, Microsoft, MIT, Stanford, and the US Government.", "sum_nltk_words": 184, "sum_nltk_runtime": 0.007, "sum_t5": "competition will have you disentangling experimental noise from real biological signals. your entry will classify images of cells under one of 1,108 different genetic perturbations. if successful, you could dramatically improve the industry’s ability to model cellular images according to their relevant biology. if successful, you could dramatically improve the industry’s ability to model cellular images according to their relevant biology. if successful, you could dramatically improve the industry’s ability to model cellular images according to their relevant biology.", "sum_t5_words": 79, "sum_t5_runtime": 6.8, "runtime": 0.004, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.4987376928329468, "nltk_category_runtime": 16.601, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8238570094108582, "nltk_subcategory_runtime": 26.308, "category": "Biotechnological & Life Sciences", "category_score": 0.4987376928329468, "subcategory": "Machine Learning", "subcategory_score": 0.8238570094108582, "runtime_cat": 42.909, "engagement_score": "0.638", "language_code": "en", "language": "english", "language_score": "0.9999954470048674", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "cellsignal disentangling biological signal experimental noise cellular imagesthe cost drug medical treatment risen high recent year many patient go without help classification project could make researcher efficient one surprising reason behind cost long take bring new treatment market despite improvement technology science research development continues lag fact finding new treatment take average 10 year cost hundred million dollar recursion pharmaceutical creator industry largest dataset biological image generated entirely inhouse belief ai potential dramatically improve expedite drug discovery process specifically effort could help understand drug interact human cell competition disentangling experimental noise real biological signal entry classify image cell one 1108 different genetic perturbation help eliminate noise introduced technical execution environmental variation experiment successful could dramatically improve industry ability model cellular image according relevant biology turn applying ai could greatly decrease cost treatment ensure treatment get patient faster competition part neurips 2019 competition track winner invited contribute solution towards workshop presentation acknowledgment thank following sponsor supporter competition google cloud google cloud widely recognized global leader delivering secure open intelligent enterprise cloud platform technology built google private network product nearly 20 year innovation security network architecture collaboration artificial intelligence open source software offer simply engineered set tool unparalleled technology across google cloud platform g suite help bring people insight idea together customer across 150 country trust google cloud modernize computing environment today digital world doit cloud back nearly decade weve helping business build scale cloud solution worldclass cloud engineering support help customer technical support consulting building operating complex largescale distributed system developing better machine learning model setting big data solution using google cloud amazon aws microsoft azure nvidia nvidias nasdaq nvda invention gpu 1999 sparked growth pc gaming market redefined modern computer graphic revolutionized parallel computing recently gpu deep learning ignited modern ai next era computing gpu acting brain computer robot selfdriving car perceive understand world information httpnvidianewsnvidiacom lambda lambda provides deep learning workstation server gpu cloud service lambda deep learning infrastructure used world leading ai research development organization including apple microsoft mit stanford u government learn visit wwwlambdalabscom", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Exploratory Data Analysis"]}