{"title": "Expedia Hotel Recommendations", "description": "Which hotel type will an Expedia customer book?Planning your dream vacation, or even a weekend escape, can be an overwhelming affair. With hundreds, even thousands, of hotels to choose from at every destination, it's difficult to know which will suit your personal preferences. Should you go with an old standby with those pillow mints you like, or risk a new hotel with a trendy pool bar?   Expedia wants to take the proverbial rabbit hole out of hotel search by providing personalized hotel recommendations to their users. This is no small task for a site with hundreds of millions of visitors every month! Currently, Expedia uses search parameters to adjust their hotel recommendations, but there aren't enough customer specific data to personalize them for each user. In this competition, Expedia is challenging Kagglers to contextualize customer data and predict the likelihood a user will stay at 100 different hotel groups. The data in this competition is a random selection from Expedia and is not representative of the overall statistics.", "link": "https://www.kaggle.com/c/expedia-hotel-recommendations", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-06-11 01:59:00", "words": 160, "sentences": 6, "runtime": 0.002, "description_category": "Finance", "description_category_score": 0.19717952609062195, "description_category_runtime": 15.31, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.446528822183609, "description_subcategory_runtime": 23.757, "category": "Finance", "category_score": 0.19717952609062195, "subcategory": "Judicial Applied", "subcategory_score": 0.446528822183609, "runtime_cat": 39.068, "engagement_score": "0.68", "language_code": "en", "language": "english", "language_score": "0.999996872493395", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "hotel type expedia customer bookplanning dream vacation even weekend escape overwhelming affair hundred even thousand hotel choose every destination difficult know suit personal preference go old standby pillow mint like risk new hotel trendy pool bar expedia want take proverbial rabbit hole hotel search providing personalized hotel recommendation user small task site hundred million visitor every month currently expedia us search parameter adjust hotel recommendation arent enough customer specific data personalize user competition expedia challenging kagglers contextualize customer data predict likelihood user stay 100 different hotel group data competition random selection expedia representative overall statistic", "tags_descriptive": []}