{"title": "Aerial Cactus Identification", "description": "Determine whether an image contains a columnar cactusTo assess the impact of climate change on Earth's flora and fauna, it is vital to quantify how human activities such as logging, mining, and agriculture are impacting our protected natural areas. Researchers in Mexico have created the VIGIA project, which aims to build a system for autonomous surveillance of protected areas. A first step in such an effort is the ability to recognize the vegetation inside the protected areas. In this competition, you are tasked with creation of an algorithm that can identify a specific type of cactus in aerial imagery. This is a kernels-only competition, meaning you must submit predictions using Kaggle Kernels. Read the basics here. Acknowledgments Kaggle is hosting this competition for the machine learning community to use for fun and practice. The original version of this data can be found here, with details in the following paper: Efren López-Jiménez, Juan Irving Vasquez-Gomez, Miguel Angel Sanchez-Acevedo, Juan Carlos Herrera-Lozada, Abril Valeria Uriarte-Arcia, Columnar Cactus Recognition in Aerial Images using a Deep Learning Approach. Ecological Informatics. 2019. Acknowledgements to Consejo Nacional de Ciencia y Tecnología. Project cátedra 1507. Instituto Politècnico Nacional. Universidad de la Cañada. Contributors: Eduardo Armas Garca, Rafael Cano Martnez and Luis Cresencio Mota Carrera. J.I. Vasquez-Gomez, JC. Herrera Lozada. Abril Uriarte, Miguel Sanchez.", "link": "https://www.kaggle.com/c/aerial-cactus-identification", "tags": ["DL", "Classification", "Exploratory Data Analysis", "CNN", "Transfer Learning"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-07-09 01:59:00", "words": 216, "sentences": 19, "sum_nltk": "Determine whether an image contains a columnar cactusTo assess the impact of climate change on Earth's flora and fauna, it is vital to quantify how human activities such as logging, mining, and agriculture are impacting our protected natural areas.\nResearchers in Mexico have created the VIGIA project, which aims to build a system for autonomous surveillance of protected areas.\nA first step in such an effort is the ability to recognize the vegetation inside the protected areas.\nIn this competition, you are tasked with creation of an algorithm that can identify a specific type of cactus in aerial imagery.\nThis is a kernels-only competition, meaning you must submit predictions using Kaggle Kernels.\nRead the basics here.\nAcknowledgments Kaggle is hosting this competition for the machine learning community to use for fun and practice.\nThe original version of this data can be found here, with details in the following paper: Efren López-Jiménez, Juan Irving Vasquez-Gomez, Miguel Angel Sanchez-Acevedo, Juan Carlos Herrera-Lozada, Abril Valeria Uriarte-Arcia, Columnar Cactus Recognition in Aerial Images using a Deep Learning Approach.\nEcological Informatics.\nAcknowledgements to Consejo Nacional de Ciencia y Tecnología.\nProject cátedra 1507.\nInstituto Politècnico Nacional.\nJ.I. Vasquez-Gomez, JC.\nHerrera Lozada.\nAbril Uriarte, Miguel Sanchez.", "sum_nltk_words": 185, "sum_nltk_runtime": 0.003, "sum_t5": "researchers in Mexico have created the VIGIA project. the project aims to build a system for autonomous surveillance of protected areas. you must submit predictions using Kaggle Kernels. the competition is open to the machine learning community. cnn.org/impacts/cgia/. a cctv image is a columnar cactus... a cctv image is a columnar cactus.", "sum_t5_words": 52, "sum_t5_runtime": 6.658, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.15306738018989563, "nltk_category_runtime": 23.263, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6912904381752014, "nltk_subcategory_runtime": 37.407, "category": "Utilities", "category_score": 0.15306738018989563, "subcategory": "Machine Learning", "subcategory_score": 0.6912904381752014, "runtime_cat": 60.669, "engagement_score": "0.656", "language_code": "en", "language": "english", "language_score": "0.9999979521202079", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "determine whether image contains columnar cactusto ass impact climate change earth flora fauna vital quantify human activity logging mining agriculture impacting protected natural area researcher mexico created vigia project aim build system autonomous surveillance protected area first step effort ability recognize vegetation inside protected area competition tasked creation algorithm identify specific type cactus aerial imagery kernelsonly competition meaning must submit prediction using kaggle kernel read basic acknowledgment kaggle hosting competition machine learning community use fun practice original version data found detail following paper efren lopezjimenez juan irving vasquezgomez miguel angel sanchezacevedo juan carlos herreralozada abril valeria uriartearcia columnar cactus recognition aerial image using deep learning approach ecological informatics 2019 acknowledgement consejo nacional de ciencia tecnologia project catedra 1507 instituto politecnico nacional universidad de la canada contributor eduardo armas garca rafael cano martnez luis cresencio mota carrera ji vasquezgomez jc herrera lozada abril uriarte miguel sanchez", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Exploratory Data Analysis", "Convolutional Neural Network (CNN)", "Transfer Learning"]}