{"title": "Ghouls, Goblins, and Ghosts... Boo!", "description": "Can you classify monsters haunting Kaggle?Get out your dowsing rods, electromagnetic sensors, … and gradient boosting machines. Kaggle is haunted and we need your help. After a month of making scientific observations and taking careful measurements, we’ve determined that 900 ghouls, ghosts, and goblins are infesting our halls and frightening our data scientists. When trying garlic, asking politely, and using reverse psychology didn't work, it became clear that machine learning is the only answer to banishing our unwanted guests.  So now the hour has come to put the data we’ve collected in your hands. We’ve managed to identify 371 of the ghastly creatures, but need your help to vanquish the rest. And only an accurate classification algorithm can thwart them. Use bone length measurements, severity of rot, extent of soullessness, and other characteristics to distinguish (and extinguish) the intruders. Are you ghost-busters up for the challenge?", "link": "https://www.kaggle.com/c/ghouls-goblins-and-ghosts-boo", "tags": ["Classification", "Feature Engineering", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-12-02 00:59:00", "words": 145, "sentences": 9, "runtime": 0.002, "description_category": "Emergency & Relief", "description_category_score": 0.5253920555114746, "description_category_runtime": 14.776, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9828994274139404, "description_subcategory_runtime": 23.074, "category": "Emergency & Relief", "category_score": 0.5253920555114746, "subcategory": "Machine Learning", "subcategory_score": 0.9828994274139404, "runtime_cat": 37.85, "engagement_score": "0.631", "language_code": "en", "language": "english", "language_score": "0.9999982201923708", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "classify monster haunting kaggleget dowsing rod electromagnetic sensor gradient boosting machine kaggle haunted need help month making scientific observation taking careful measurement weve determined 900 ghoul ghost goblin infesting hall frightening data scientist trying garlic asking politely using reverse psychology didnt work became clear machine learning answer banishing unwanted guest hour come put data weve collected hand weve managed identify 371 ghastly creature need help vanquish rest accurate classification algorithm thwart use bone length measurement severity rot extent soullessness characteristic distinguish extinguish intruder ghostbusters challenge", "tags_descriptive": ["Classification", "Feature Engineering", "Exploratory Data Analysis"]}