{"title": "PetFinder.my Adoption Prediction", "description": "How cute is that doggy in the shelter?Millions of stray animals suffer on the streets or are euthanized in shelters every day around the world. If homes can be found for them, many precious lives can be saved — and more happy families created. PetFinder.my has been Malaysia’s leading animal welfare platform since 2008, with a database of more than 150,000 animals. PetFinder collaborates closely with animal lovers, media, corporations, and global organizations to improve animal welfare. Animal adoption rates are strongly correlated to the metadata associated with their online profiles, such as descriptive text and photo characteristics. As one example, PetFinder is currently experimenting with a simple AI tool called the Cuteness Meter, which ranks how cute a pet is based on qualities present in their photos. In this competition you will be developing algorithms to predict the adoptability of pets - specifically, how quickly is a pet adopted? If successful, they will be adapted into AI tools that will guide shelters and rescuers around the world on improving their pet profiles' appeal, reducing animal suffering and euthanization. Top participants may be invited to collaborate on implementing their solutions into AI tools for assessing and improving pet adoption performance, which will benefit global animal welfare.  Important Note Be aware that this is being run as a Kernels Only Competition, requiring that all submissions be made via a Kernel output.      Photo by Krista Mangulsone on Unsplash", "link": "https://www.kaggle.com/c/petfinder-adoption-prediction", "tags": ["Classification", "Ensembling", "Xgboost", "Feature Engineering", "Random Forest", "Exploratory Data Analysis", "SVM", "Regression"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-04-10 03:09:00", "words": 242, "sentences": 10, "sum_nltk": "How cute is that doggy in the shelter?Millions of stray animals suffer on the streets or are euthanized in shelters every day around the world.\nPetFinder collaborates closely with animal lovers, media, corporations, and global organizations to improve animal welfare.\nAnimal adoption rates are strongly correlated to the metadata associated with their online profiles, such as descriptive text and photo characteristics.\nAs one example, PetFinder is currently experimenting with a simple AI tool called the Cuteness Meter, which ranks how cute a pet is based on qualities present in their photos.\nIn this competition you will be developing algorithms to predict the adoptability of pets - specifically, how quickly is a pet adopted?\nIf successful, they will be adapted into AI tools that will guide shelters and rescuers around the world on improving their pet profiles' appeal, reducing animal suffering and euthanization.\nTop participants may be invited to collaborate on implementing their solutions into AI tools for assessing and improving pet adoption performance, which will benefit global animal welfare.\nImportant Note Be aware that this is being run as a Kernels Only Competition, requiring that all submissions be made via a Kernel output.", "sum_nltk_words": 186, "sum_nltk_runtime": 0.003, "sum_t5": "PetFinder.my is a leading animal welfare platform in the world. it has a database of more than 150,000 animals. if successful, they will be adapted into AI tools to help shelters and rescuers. top participants may be invited to collaborate on implementing their solutions into AI tools for assessing and improving pet adoption performance. the competition is being run as a Kernels Only Competition. all submissions must be made via a Kernel output.", "sum_t5_words": 73, "sum_t5_runtime": 4.898, "runtime": 0.002, "nltk_category": "Education & Research", "nltk_category_score": 0.05103098228573799, "nltk_category_runtime": 16.809, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.40315258502960205, "nltk_subcategory_runtime": 26.584, "category": "Education & Research", "category_score": 0.05103098228573799, "subcategory": "Machine Learning", "subcategory_score": 0.40315258502960205, "runtime_cat": 43.395, "engagement_score": "0.681", "language_code": "en", "language": "english", "language_score": "0.9999971570588119", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "cute doggy sheltermillions stray animal suffer street euthanized shelter every day around world home found many precious life saved happy family created petfindermy malaysia leading animal welfare platform since 2008 database 150000 animal petfinder collaborates closely animal lover medium corporation global organization improve animal welfare animal adoption rate strongly correlated metadata associated online profile descriptive text photo characteristic one example petfinder currently experimenting simple ai tool called cuteness meter rank cute pet based quality present photo competition developing algorithm predict adoptability pet specifically quickly pet adopted successful adapted ai tool guide shelter rescuer around world improving pet profile appeal reducing animal suffering euthanization top participant may invited collaborate implementing solution ai tool assessing improving pet adoption performance benefit global animal welfare important note aware run kernel competition requiring submission made via kernel output photo krista mangulsone unsplash", "tags_descriptive": ["Classification", "Ensembling", "Xgboost", "Feature Engineering", "Random Forest", "Exploratory Data Analysis", "Support Vector Machines (SVM)", "Regression"]}