{"title": "Prudential Life Insurance Assessment", "description": "Can you make buying life insurance easier?Picture this. You are a data scientist in a start-up culture with the potential to have a very large impact on the business. Oh, and you are backed up by a company with 140 years' business experience. Curious? Great! You are the kind of person we are looking for. Prudential, one of the largest issuers of life insurance in the USA, is hiring passionate data scientists to join a newly-formed Data Science group solving complex challenges and identifying opportunities. The results have been impressive so far but we want more.  The Challenge In a one-click shopping world with on-demand everything, the life insurance application process is antiquated. Customers provide extensive information to identify risk classification and eligibility, including scheduling medical exams, a process that takes an average of 30 days. The result? People are turned off. That’s why only 40% of U.S. households own individual life insurance. Prudential wants to make it quicker and less labor intensive for new and existing customers to get a quote while maintaining privacy boundaries. By developing a predictive model that accurately classifies risk using a more automated approach, you can greatly impact public perception of the industry. The results will help Prudential better understand the predictive power of the data points in the existing assessment, enabling us to significantly streamline the process.", "link": "https://www.kaggle.com/c/prudential-life-insurance-assessment", "tags": ["Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-02-16 00:59:00", "words": 222, "sentences": 12, "sum_nltk": "Can you make buying life insurance easier?Picture this.\nYou are a data scientist in a start-up culture with the potential to have a very large impact on the business.\nPrudential, one of the largest issuers of life insurance in the USA, is hiring passionate data scientists to join a newly-formed Data Science group solving complex challenges and identifying opportunities.\nThe results have been impressive so far but we want more.\nThe Challenge In a one-click shopping world with on-demand everything, the life insurance application process is antiquated.\nCustomers provide extensive information to identify risk classification and eligibility, including scheduling medical exams, a process that takes an average of 30 days.\nThe result?\nThat’s why only 40% of U.S. households own individual life insurance.\nPrudential wants to make it quicker and less labor intensive for new and existing customers to get a quote while maintaining privacy boundaries.\nBy developing a predictive model that accurately classifies risk using a more automated approach, you can greatly impact public perception of the industry.\nThe results will help Prudential better understand the predictive power of the data points in the existing assessment, enabling us to significantly streamline the process.", "sum_nltk_words": 183, "sum_nltk_runtime": 0.003, "sum_t5": "data scientists are needed to help make life insurance buying easier. only 40% of american households own individual life insurance. the challenge is to make it quicker and less labor intensive for new and existing customers. the results will help Prudential better understand the predictive power of the data points in the existing assessment. the results will help us significantly streamline the process. back to mail online home. back to the page you came from.. back to the page you came from.", "sum_t5_words": 82, "sum_t5_runtime": 4.763, "runtime": 0.002, "nltk_category": "Justice, Law and Regulations", "nltk_category_score": 0.40626421570777893, "nltk_category_runtime": 17.707, "nltk_subcategory": "Insurance and Risk", "nltk_subcategory_score": 0.8828121423721313, "nltk_subcategory_runtime": 28.553, "category": "Justice, Law and Regulations", "category_score": 0.40626421570777893, "subcategory": "Insurance and Risk", "subcategory_score": 0.8828121423721313, "runtime_cat": 46.26, "engagement_score": "0.693", "language_code": "en", "language": "english", "language_score": "0.9999948922719413", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "make buying life insurance easierpicture data scientist startup culture potential large impact business oh backed company 140 year business experience curious great kind person looking prudential one largest issuer life insurance usa hiring passionate data scientist join newlyformed data science group solving complex challenge identifying opportunity result impressive far want challenge oneclick shopping world ondemand everything life insurance application process antiquated customer provide extensive information identify risk classification eligibility including scheduling medical exam process take average 30 day result people turned thats 40 u household individual life insurance prudential want make quicker le labor intensive new existing customer get quote maintaining privacy boundary developing predictive model accurately classifies risk using automated approach greatly impact public perception industry result help prudential better understand predictive power data point existing assessment enabling u significantly streamline process", "tags_descriptive": ["Classification"]}