{"title": "Otto Group Product Classification Challenge", "description": "Classify products into the correct categoryGet started on this competition through Kaggle Scripts The Otto Group is one of the world’s biggest e-commerce companies, with subsidiaries in more than 20 countries, including Crate & Barrel (USA), Otto.de (Germany) and 3 Suisses (France). We are selling millions of products worldwide every day, with several thousand products being added to our product line. A consistent analysis of the performance of our products is crucial. However, due to our diverse global infrastructure, many identical products get classified differently. Therefore, the quality of our product analysis depends heavily on the ability to accurately cluster similar products. The better the classification, the more insights we can generate about our product range.  For this competition, we have provided a dataset with 93 features for more than 200,000 products. The objective is to build a predictive model which is able to distinguish between our main product categories. The winning models will be open sourced.", "link": "https://www.kaggle.com/c/otto-group-product-classification-challenge", "tags": ["Feature Engineering", "Xgboost", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-05-19 01:59:00", "words": 157, "sentences": 9, "runtime": 0.006, "description_category": "Accommodation & Food", "description_category_score": 0.33734479546546936, "description_category_runtime": 14.11, "description_subcategory": "Marketing", "description_subcategory_score": 0.45703014731407166, "description_subcategory_runtime": 22.194, "category": "Accommodation & Food", "category_score": 0.33734479546546936, "subcategory": "Marketing", "subcategory_score": 0.45703014731407166, "runtime_cat": 36.304, "engagement_score": "0.706", "language_code": "en", "language": "english", "language_score": "0.9999981629070154", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "classify product correct categoryget started competition kaggle script otto group one world biggest ecommerce company subsidiary 20 country including crate barrel usa ottode germany 3 suisse france selling million product worldwide every day several thousand product added product line consistent analysis performance product crucial however due diverse global infrastructure many identical product get classified differently therefore quality product analysis depends heavily ability accurately cluster similar product better classification insight generate product range competition provided dataset 93 feature 200000 product objective build predictive model able distinguish main product category winning model open sourced", "tags_descriptive": ["Feature Engineering", "Xgboost", "Classification"]}