{"title": "Nomad2018 Predicting Transparent Conductors", "description": "Predict the key properties of novel transparent semiconductorsInnovative materials design is needed to tackle some of the most important health, environmental, energy, social, and economic challenges of this century. In particular, improving the properties of materials that are intrinsically connected to the generation and utilization of energy is crucial if we are to mitigate environmental damage due to a growing global demand. Transparent conductors are an important class of compounds that are both electrically conductive and have a low absorption in the visible range, which are typically competing properties. A combination of both of these characteristics is key for the operation of a variety of technological devices such as photovoltaic cells, light-emitting diodes for flat-panel displays, transistors, sensors, touch screens, and lasers. However, only a small number of compounds are currently known to display both transparency and conductivity suitable enough to be used as transparent conducting materials.  Aluminum (Al), gallium (Ga), indium (In) sesquioxides are some of the most promising transparent conductors because of a combination of both large bandgap energies, which leads to optical transparency over the visible range, and high conductivities. These materials are also chemically stable and relatively inexpensive to produce. Alloying of these binary compounds in ternary or quaternary mixtures could enable the design of a new material at a specific composition with improved properties over what is current possible. These alloys are described by the formula (AlxGayInz)2NO3N; where x, y, and z can vary but are limited by the constraint x+y+z = 1. The total number of atoms in the", "link": "https://www.kaggle.com/c/nomad2018-predict-transparent-conductors", "tags": ["Feature Engineering", "Linear Regression"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-02-16 00:59:00", "words": 249, "sentences": 10, "sum_nltk": "Predict the key properties of novel transparent semiconductorsInnovative materials design is needed to tackle some of the most important health, environmental, energy, social, and economic challenges of this century.\nIn particular, improving the properties of materials that are intrinsically connected to the generation and utilization of energy is crucial if we are to mitigate environmental damage due to a growing global demand.\nTransparent conductors are an important class of compounds that are both electrically conductive and have a low absorption in the visible range, which are typically competing properties.\nA combination of both of these characteristics is key for the operation of a variety of technological devices such as photovoltaic cells, light-emitting diodes for flat-panel displays, transistors, sensors, touch screens, and lasers.\nHowever, only a small number of compounds are currently known to display both transparency and conductivity suitable enough to be used as transparent conducting materials.\nAluminum (Al), gallium (Ga), indium (In) sesquioxides are some of the most promising transparent conductors because of a combination of both large bandgap energies, which leads to optical transparency over the visible range, and high conductivities.\nAlloying of these binary compounds in ternary or quaternary mixtures could enable the design of a new material at a specific composition with improved properties over what is current possible.", "sum_nltk_words": 200, "sum_nltk_runtime": 0.003, "sum_t5": "a small number of compounds are currently known to display both transparency and conductivity suitable enough to be used as transparent conducting materials. alumina, gallium (Ga), indium (In) sesquioxides are some of the most promising transparent conductors. alumina, gallium (Ga), indium (In) sesquioxides are some of the most promising transparent conductors. alumina, gallium (Ga), indium (In) sesquioxides are some", "sum_t5_words": 59, "sum_t5_runtime": 6.411, "runtime": 0.0, "nltk_category": "Wholesale & Retail", "nltk_category_score": 0.33730122447013855, "nltk_category_runtime": 20.39, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.6749484539031982, "nltk_subcategory_runtime": 32.468, "category": "Wholesale & Retail", "category_score": 0.33730122447013855, "subcategory": "Physical", "subcategory_score": 0.6749484539031982, "runtime_cat": 52.857, "engagement_score": "0.638", "language_code": "en", "language": "english", "language_score": "0.9999978083743047", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict key property novel transparent semiconductorsinnovative material design needed tackle important health environmental energy social economic challenge century particular improving property material intrinsically connected generation utilization energy crucial mitigate environmental damage due growing global demand transparent conductor important class compound electrically conductive low absorption visible range typically competing property combination characteristic key operation variety technological device photovoltaic cell lightemitting diode flatpanel display transistor sensor touch screen laser however small number compound currently known display transparency conductivity suitable enough used transparent conducting material aluminum al gallium ga indium sesquioxides promising transparent conductor combination large bandgap energy lead optical transparency visible range high conductivity material also chemically stable relatively inexpensive produce alloying binary compound ternary quaternary mixture could enable design new material specific composition improved property current possible alloy described formula alxgayinz2no3n x z vary limited constraint xyz 1 total number atom", "tags_descriptive": ["Feature Engineering", "Linear Regression"]}