{"title": "Generative Dog Images", "description": "Experiment with creating puppy picsThis competition is closed and no longer accepting submissions. The private leaderboard has been finalized as of 8/28/2019.  Important Warning: This competition has an experimental format and submission style (images as submission). Competitors must use generative methods to create their submission images and are not permitted to make submissions that include any images already classified as dogs or altered versions of such images.  To enforce and prevent cheating, we reserve the right to: (a) Visually inspect all participants' submitted images, (b) review any submitted source code, (c) use these reviews to identify violators or determine winners, and (d) disqualify participants from the competition who are found in violation. This is also specified in the competition's rules  Use your training skills to create images, rather than identify them. You’ll be using GANs, which are at the creative frontier of machine learning. You might think of GANs as robot artists in a sense—able to create eerily lifelike images, and even digital worlds.  \"You might not think that programmers are artists, but programming is an extremely creative profession. It’s logic-based creativity. '' -   John Romero  A generative adversarial network (GAN) is a class of machine learning system invented by Ian Goodfellow in 2014. Two neural networks compete with each other in a game. Given a training set, this technique learns to generate new data with the same statistics as the training set. In this competition, you’ll be training generative models to create images of dogs. Only this time… there’s no ground truth data for you to predict. Here, you’ll submit the images and be scored based on how well those images are classified as dogs from pre-trained neural networks.  Take these images, for example. Can you tell which are real vs. generated?  Trick question; they are all generated! Why dogs? We chose dogs because, well, who doesn’t love looking at photos of adorable pups? Moreover, dogs can be classified into many sub-categories (breed, color, size), making them ideal candidates for image generation. Generative methods (in particular, GANs) are currently used in various places on Kaggle for data augmentation. Their potential is vast; they can learn to mimic any distribution of data across any domain: photographs, drawings, music, and prose. If successful, not only will you help advance the state of the art in generative image creation, but you’ll enable us to create more experiments across a variety of domains in the future.  This is a Kernels-only competition. Refer to Kernels Requirements for details.", "link": "https://www.kaggle.com/c/generative-dog-images", "tags": ["DL", "GAN", "CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-08-28 21:23:00", "words": 424, "sentences": 24, "sum_nltk": "Competitors must use generative methods to create their submission images and are not permitted to make submissions that include any images already classified as dogs or altered versions of such images.\nThis is also specified in the competition's rules  Use your training skills to create images, rather than identify them.\nYou’ll be using GANs, which are at the creative frontier of machine learning.\nYou might think of GANs as robot artists in a sense—able to create eerily lifelike images, and even digital worlds.\n'' -   John Romero  A generative adversarial network (GAN) is a class of machine learning system invented by Ian Goodfellow in 2014.\nIn this competition, you’ll be training generative models to create images of dogs.\nHere, you’ll submit the images and be scored based on how well those images are classified as dogs from pre-trained neural networks.\nMoreover, dogs can be classified into many sub-categories (breed, color, size), making them ideal candidates for image generation.\nGenerative methods (in particular, GANs) are currently used in various places on Kaggle for data augmentation.\nIf successful, not only will you help advance the state of the art in generative image creation, but you’ll enable us to create more experiments across a variety of domains in the future.", "sum_nltk_words": 202, "sum_nltk_runtime": 0.006, "sum_t5": "competition has an experimental format and submission style (images as submission) Competitors must use generative methods to create their submission images. you'll be scoring based on how well those images are classified as dogs. you'll be using generative adversarial networks, which are at the creative frontier of machine learning. to enforce and prevent cheating, we reserve the right to: (a) visually inspect all participants' submitted images, (b) review any submitted source code, (c) use these reviews to identify violat", "sum_t5_words": 79, "sum_t5_runtime": 7.004, "runtime": 0.005, "nltk_category": "Justice, Law and Regulations", "nltk_category_score": 0.49815934896469116, "nltk_category_runtime": 20.162, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.864503026008606, "nltk_subcategory_runtime": 32.495, "category": "Justice, Law and Regulations", "category_score": 0.49815934896469116, "subcategory": "Machine Learning", "subcategory_score": 0.864503026008606, "runtime_cat": 52.658, "engagement_score": "0.641", "language_code": "en", "language": "english", "language_score": "0.999998281993389", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "experiment creating puppy picsthis competition closed longer accepting submission private leaderboard finalized 8282019 important warning competition experimental format submission style image submission competitor must use generative method create submission image permitted make submission include image already classified dog altered version image enforce prevent cheating reserve right visually inspect participant submitted image b review submitted source code c use review identify violator determine winner disqualify participant competition found violation also specified competition rule use training skill create image rather identify youll using gans creative frontier machine learning might think gans robot artist senseable create eerily lifelike image even digital world might think programmer artist programming extremely creative profession logicbased creativity john romero generative adversarial network gan class machine learning system invented ian goodfellow 2014 two neural network compete game given training set technique learns generate new data statistic training set competition youll training generative model create image dog time there ground truth data predict youll submit image scored based well image classified dog pretrained neural network take image example tell real v generated trick question generated dog chose dog well doesnt love looking photo adorable pup moreover dog classified many subcategories breed color size making ideal candidate image generation generative method particular gans currently used various place kaggle data augmentation potential vast learn mimic distribution data across domain photograph drawing music prose successful help advance state art generative image creation youll enable u create experiment across variety domain future kernelsonly competition refer kernel requirement detail", "tags_descriptive": ["Deep Learning (DL)", "Generative Adversarial Networks (GAN)", "Computer Vision (CV)"]}