{"title": "The Winton Stock Market Challenge", "description": "Join a multi-disciplinary team of research scientistsDo you laugh (and then get down to work) in the face of terabytes of noisy, non-stationary data? Winton Capital is looking for data scientists who excel at finding the hidden signal in the proverbial haystack, and who are excited by creating novel statistical modelling and data mining techniques.  In this recruiting competition, Winton challenges you to take on the very difficult task of predicting the future (stock returns). Given historical stock performance and a host of masked features, can you predict intra and end of day returns without being deceived by all the noise?  Research scientists at Winton have crafted this competition to be challenging and fun for the community while providing a taste of the types of problems they work on everyday. They're excited to connect with Kagglers who bring a unique background and creative approach to the competition. Winton is offering cash prizes to winning teams as a reward for their work, but the intent of the competition is not commercial. The intellectual property you create remains your own and will be evaluated in the context of suitability for employment.   For more on the culture at Winton, check out the About Winton page or their careers page.", "link": "https://www.kaggle.com/c/the-winton-stock-market-challenge", "tags": ["Finance", "Xgboost"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-01-27 00:59:00", "words": 192, "sentences": 5, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.2358575165271759, "description_category_runtime": 18.886, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.36450499296188354, "description_subcategory_runtime": 30.174, "category": "Education & Research", "category_score": 0.2358575165271759, "subcategory": "Judicial Applied", "subcategory_score": 0.36450499296188354, "runtime_cat": 49.061, "engagement_score": "0.635", "language_code": "en", "language": "english", "language_score": "0.9999961701928971", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "join multidisciplinary team research scientistsdo laugh get work face terabyte noisy nonstationary data winton capital looking data scientist excel finding hidden signal proverbial haystack excited creating novel statistical modelling data mining technique recruiting competition winton challenge take difficult task predicting future stock return given historical stock performance host masked feature predict intra end day return without deceived noise research scientist winton crafted competition challenging fun community providing taste type problem work everyday theyre excited connect kagglers bring unique background creative approach competition winton offering cash prize winning team reward work intent competition commercial intellectual property create remains evaluated context suitability employment culture winton check winton page career page", "tags_descriptive": ["Finance", "Xgboost"]}