{"title": "Web Traffic Time Series Forecasting", "description": "Forecast future traffic to Wikipedia pagesThis competition focuses on the problem of forecasting the future values of multiple time series, as it has always been one of the most challenging problems in the field. More specifically, we aim the competition at testing state-of-the-art methods designed by the participants, on the problem of forecasting future web traffic for approximately 145,000 Wikipedia articles.  Sequential or temporal observations emerge in many key real-world problems, ranging from biological data, financial markets, weather forecasting, to audio and video processing. The field of time series encapsulates many different problems, ranging from analysis and inference to classification and forecast. What can you do to help predict future views?  This competition will run as two stages and involves prediction of actual future events. There will be a training stage during which the leaderboard is based on historical data, followed by a stage where participants are scored on real future events.   You have complete freedom in how to produce your forecasts: e.g. use of univariate vs multi-variate models, use of metadata (article identifier), hierarchical time series modeling (for different types of traffic), data augmentation (e.g. using Google Trends data to extend the dataset), anomaly and outlier detection and cleaning, different strategies for missing value imputation, and many more types of approaches.   We thank Google Inc. and Voleon for sponsorship of this competition, and Oren Anava and Vitaly Kuznetsov for organizing it. Kaggle is excited to partner with research groups to push forward the frontier of machine learning. Research competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team. Any questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "link": "https://www.kaggle.com/c/web-traffic-time-series-forecasting", "tags": ["NLP", "Exploratory Data Analysis", "Gradient Boosting", "LSTM"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-11-16 00:59:00", "words": 290, "sentences": 14, "sum_nltk": "Forecast future traffic to Wikipedia pagesThis competition focuses on the problem of forecasting the future values of multiple time series, as it has always been one of the most challenging problems in the field.\nMore specifically, we aim the competition at testing state-of-the-art methods designed by the participants, on the problem of forecasting future web traffic for approximately 145,000 Wikipedia articles.\nSequential or temporal observations emerge in many key real-world problems, ranging from biological data, financial markets, weather forecasting, to audio and video processing.\nThe field of time series encapsulates many different problems, ranging from analysis and inference to classification and forecast.\nThere will be a training stage during which the leaderboard is based on historical data, followed by a stage where participants are scored on real future events.\nYou have complete freedom in how to produce your forecasts: e.g. use of univariate vs multi-variate models, use of metadata (article identifier), hierarchical time series modeling (for different types of traffic), data augmentation (e.g. using Google Trends data to extend the dataset), anomaly and outlier detection and cleaning, different strategies for missing value imputation, and many more types of approaches.\nResearch competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team.", "sum_nltk_words": 203, "sum_nltk_runtime": 0.003, "sum_t5": "competition aims to test state-of-the-art methods designed by participants. participants will be able to predict actual future events. competition will run as two stages and involves prediction of actual future events. a winner will be selected by a panel of judges. the winner will be notified by email. back to mail online home. back to the page you came from. back to the page you came from. back to the page you came from.", "sum_t5_words": 74, "sum_t5_runtime": 5.956, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.25702178478240967, "nltk_category_runtime": 19.114, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.4450019598007202, "nltk_subcategory_runtime": 31.061, "category": "Education & Research", "category_score": 0.25702178478240967, "subcategory": "Tools", "subcategory_score": 0.4450019598007202, "runtime_cat": 50.174, "engagement_score": "0.65", "language_code": "en", "language": "english", "language_score": "0.9999975439823974", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "forecast future traffic wikipedia pagesthis competition focus problem forecasting future value multiple time series always one challenging problem field specifically aim competition testing stateoftheart method designed participant problem forecasting future web traffic approximately 145000 wikipedia article sequential temporal observation emerge many key realworld problem ranging biological data financial market weather forecasting audio video processing field time series encapsulates many different problem ranging analysis inference classification forecast help predict future view competition run two stage involves prediction actual future event training stage leaderboard based historical data followed stage participant scored real future event complete freedom produce forecast eg use univariate v multivariate model use metadata article identifier hierarchical time series modeling different type traffic data augmentation eg using google trend data extend dataset anomaly outlier detection cleaning different strategy missing value imputation many type approach thank google inc voleon sponsorship competition oren anava vitaly kuznetsov organizing kaggle excited partner research group push forward frontier machine learning research competition make use kaggles platform experience largely organized research group data science team question concern regarding competition data quality topic addressed", "tags_descriptive": ["Natural Language Processing (NLP)", "Exploratory Data Analysis", "Gradient Boosting", "Long short-term memory (LSTM)"]}