{"title": "iMaterialist Challenge (Fashion) at FGVC5", "description": "Image classification of fashion products.As shoppers move online, it would be a dream come true to have products in photos classified automatically. But, automatic product recognition is tough because for the same product, a picture can be taken in different lighting, angles, backgrounds, and levels of occlusion. Meanwhile different fine-grained categories may look very similar, for example, royal blue vs turquoise in color. Many of today’s general-purpose recognition machines simply cannot perceive such subtle differences between photos, yet these differences could be important for shopping decisions. Tackling issues like this is why the Conference on Computer Vision and Pattern Recognition (CVPR) has put together a workshop specifically for data scientists focused on fine-grained visual categorization called the FGVC5 workshop. As part of this workshop, CVPR is partnering with Google, Wish, and Malong Technologies to challenge the data science community to help push the state of the art in automatic image classification. In this competition, FGVC workshop organizers with Wish and Malong Technologies challenge you to develop algorithms that will help with an important step towards automatic product detection – to accurately assign attribute labels for fashion images. Individuals/Teams with top submissions will be invited to present their work live at the FGVC5 workshop. Kaggle is excited to partner with research groups to push forward the frontier of machine learning. Research competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team. Any questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "link": "https://www.kaggle.com/c/imaterialist-challenge-fashion-2018", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-05-31 01:59:00", "words": 255, "sentences": 11, "sum_nltk": "Image classification of fashion products.As shoppers move online, it would be a dream come true to have products in photos classified automatically.\nBut, automatic product recognition is tough because for the same product, a picture can be taken in different lighting, angles, backgrounds, and levels of occlusion.\nMany of today’s general-purpose recognition machines simply cannot perceive such subtle differences between photos, yet these differences could be important for shopping decisions.\nTackling issues like this is why the Conference on Computer Vision and Pattern Recognition (CVPR) has put together a workshop specifically for data scientists focused on fine-grained visual categorization called the FGVC5 workshop.\nAs part of this workshop, CVPR is partnering with Google, Wish, and Malong Technologies to challenge the data science community to help push the state of the art in automatic image classification.\nIn this competition, FGVC workshop organizers with Wish and Malong Technologies challenge you to develop algorithms that will help with an important step towards automatic product detection – to accurately assign attribute labels for fashion images.\nKaggle is excited to partner with research groups to push forward the frontier of machine learning.\nResearch competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team.", "sum_nltk_words": 200, "sum_nltk_runtime": 0.004, "sum_t5": "the conference on computer vision and pattern recognition (CVPR) has put together a workshop specifically for data scientists focused on fine-grained visual categorization called the FGVC5 workshop. the workshop is partnering with Google, Wish, and Malong Technologies to challenge the data science community to help push the state of the art in automatic image classification. individuals/Teams with top submissions will be invited to present their work live at the FGVC5 workshop.", "sum_t5_words": 71, "sum_t5_runtime": 5.695, "runtime": 0.002, "nltk_category": "Education & Research", "nltk_category_score": 0.6964324116706848, "nltk_category_runtime": 18.514, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8006276488304138, "nltk_subcategory_runtime": 29.771, "category": "Education & Research", "category_score": 0.6964324116706848, "subcategory": "Machine Learning", "subcategory_score": 0.8006276488304138, "runtime_cat": 48.287, "engagement_score": "0.553", "language_code": "en", "language": "english", "language_score": "0.9999965875104282", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "image classification fashion productsas shopper move online would dream come true product photo classified automatically automatic product recognition tough product picture taken different lighting angle background level occlusion meanwhile different finegrained category may look similar example royal blue v turquoise color many today generalpurpose recognition machine simply cannot perceive subtle difference photo yet difference could important shopping decision tackling issue like conference computer vision pattern recognition cvpr put together workshop specifically data scientist focused finegrained visual categorization called fgvc5 workshop part workshop cvpr partnering google wish malong technology challenge data science community help push state art automatic image classification competition fgvc workshop organizer wish malong technology challenge develop algorithm help important step towards automatic product detection accurately assign attribute label fashion image individualsteams top submission invited present work live fgvc5 workshop kaggle excited partner research group push forward frontier machine learning research competition make use kaggles platform experience largely organized research group data science team question concern regarding competition data quality topic addressed", "tags_descriptive": ["Exploratory Data Analysis"]}