{"title": "Invasive Species Monitoring", "description": "Identify images of invasive hydrangeaTangles of kudzu overwhelm trees in Georgia while cane toads threaten habitats in over a dozen countries worldwide. These are just two invasive species of many which can have damaging effects on the environment, the economy, and even human health. Despite widespread impact, efforts to track the location and spread of invasive species are so costly that they’re difficult to undertake at scale. Currently, ecosystem and plant distribution monitoring depends on expert knowledge. Trained scientists visit designated areas and take note of the species inhabiting them. Using such a highly qualified workforce is expensive, time inefficient, and insufficient since humans cannot cover large areas when sampling.  Because scientists cannot sample a large quantity of areas, some machine learning algorithms are used in order to predict the presence or absence of invasive species in areas that have not been sampled. The accuracy of this approach is far from optimal, but still contributes to approaches to solving ecological problems. In this playground competition, Kagglers are challenged to develop algorithms to more accurately identify whether images of forests and foliage contain invasive hydrangea or not. Techniques from computer vision alongside other current technologies like aerial imaging can make invasive species monitoring cheaper, faster, and more reliable. Acknowledgments Data providers: Christian Requena Mesa, Thore Engel, Amrita Menon, Emma Bradley.", "link": "https://www.kaggle.com/c/invasive-species-monitoring", "tags": ["DL", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-08-16 01:59:00", "words": 220, "sentences": 11, "sum_nltk": "Identify images of invasive hydrangeaTangles of kudzu overwhelm trees in Georgia while cane toads threaten habitats in over a dozen countries worldwide.\nThese are just two invasive species of many which can have damaging effects on the environment, the economy, and even human health.\nDespite widespread impact, efforts to track the location and spread of invasive species are so costly that they’re difficult to undertake at scale.\nCurrently, ecosystem and plant distribution monitoring depends on expert knowledge.\nTrained scientists visit designated areas and take note of the species inhabiting them.\nUsing such a highly qualified workforce is expensive, time inefficient, and insufficient since humans cannot cover large areas when sampling.\nBecause scientists cannot sample a large quantity of areas, some machine learning algorithms are used in order to predict the presence or absence of invasive species in areas that have not been sampled.\nThe accuracy of this approach is far from optimal, but still contributes to approaches to solving ecological problems.\nIn this playground competition, Kagglers are challenged to develop algorithms to more accurately identify whether images of forests and foliage contain invasive hydrangea or not.\nTechniques from computer vision alongside other current technologies like aerial imaging can make invasive species monitoring cheaper, faster, and more reliable.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.003, "sum_t5": "cane toads threaten habitats in over a dozen countries worldwide. kudzu overwhelm trees in Georgia while cane toads threaten habitats in over a dozen countries. invasive species monitoring is so costly that it’s difficult to undertake at scale. a competition is being held to identify whether images of forests and foliage contain invasive hydrangea. a computer vision algorithm can be used to identify invasive species.", "sum_t5_words": 65, "sum_t5_runtime": 4.654, "runtime": 0.002, "nltk_category": "Utilities", "nltk_category_score": 0.4687328338623047, "nltk_category_runtime": 17.989, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.937660813331604, "nltk_subcategory_runtime": 28.445, "category": "Utilities", "category_score": 0.4687328338623047, "subcategory": "Machine Learning", "subcategory_score": 0.937660813331604, "runtime_cat": 46.436, "engagement_score": "0.608", "language_code": "en", "language": "english", "language_score": "0.9999963350811029", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify image invasive hydrangeatangles kudzu overwhelm tree georgia cane toad threaten habitat dozen country worldwide two invasive specie many damaging effect environment economy even human health despite widespread impact effort track location spread invasive specie costly theyre difficult undertake scale currently ecosystem plant distribution monitoring depends expert knowledge trained scientist visit designated area take note specie inhabiting using highly qualified workforce expensive time inefficient insufficient since human cannot cover large area sampling scientist cannot sample large quantity area machine learning algorithm used order predict presence absence invasive specie area sampled accuracy approach far optimal still contributes approach solving ecological problem playground competition kagglers challenged develop algorithm accurately identify whether image forest foliage contain invasive hydrangea technique computer vision alongside current technology like aerial imaging make invasive specie monitoring cheaper faster reliable acknowledgment data provider christian requena mesa thore engel amrita menon emma bradley", "tags_descriptive": ["Deep Learning (DL)", "Convolutional Neural Network (CNN)"]}