{"title": "Random Acts of Pizza", "description": "Predicting altruism through free pizzaGet started on this competition through Kaggle Scripts In machine learning, it is often said there are no free lunches. How wrong we were. This competition contains a dataset with 5671 textual requests for pizza from the Reddit community Random Acts of Pizza together with their outcome (successful/unsuccessful) and meta-data. Participants must create an algorithm capable of predicting which requests will garner a cheesy (but sincere!) act of kindness. \"I'll write a poem, sing a song, do a dance, play an instrument, whatever! I just want a pizza,\" says one hopeful poster. What about making an algorithm?  Kaggle is hosting this competition for the machine learning community to use for fun and practice. This data was collected and graciously shared by Althoff et al. (Buy them a pizza -- data collection is a thankless and tedious job!) We encourage participants to explore their accompanying paper and ask that you cite the following reference in any publications that result from your work: Tim Althoff, Cristian Danescu-Niculescu-Mizil, Dan Jurafsky. How to Ask for a Favor: A Case Study on the Success of Altruistic Requests, Proceedings of ICWSM, 2014.", "link": "https://www.kaggle.com/c/random-acts-of-pizza", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-06-02 01:59:00", "words": 180, "sentences": 7, "runtime": 0.003, "description_category": "Education & Research", "description_category_score": 0.17531053721904755, "description_category_runtime": 19.154, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9426131248474121, "description_subcategory_runtime": 31.017, "category": "Education & Research", "category_score": 0.17531053721904755, "subcategory": "Machine Learning", "subcategory_score": 0.9426131248474121, "runtime_cat": 50.171, "engagement_score": "0.602", "language_code": "en", "language": "english", "language_score": "0.9999962896009321", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predicting altruism free pizzaget started competition kaggle script machine learning often said free lunch wrong competition contains dataset 5671 textual request pizza reddit community random act pizza together outcome successfulunsuccessful metadata participant must create algorithm capable predicting request garner cheesy sincere act kindness ill write poem sing song dance play instrument whatever want pizza say one hopeful poster making algorithm kaggle hosting competition machine learning community use fun practice data collected graciously shared althoff et al buy pizza data collection thankless tedious job encourage participant explore accompanying paper ask cite following reference publication result work tim althoff cristian danescuniculescumizil dan jurafsky ask favor case study success altruistic request proceeding icwsm 2014", "tags_descriptive": []}