{"title": "Flavours of Physics: Finding τ  →  μμμ (Kernels Only)", "description": "Identify a rare decay phenomenonThe European Organization for Nuclear Research is the world’s largest high energy physics laboratory.  LHCb is an experiment set up to explore what happened after the Big Bang that allowed matter to survive and build the Universe we inhabit today.  The Yandex School of Data Analysis (YSDA) is a free Master’s-level program in Computer Science and Data Analysis, which is offered by Yandex since 2007. The aim of the School is to train specialists in data analysis and information retrieval to be able to solve cutting edge industry problems as well as fundamental research challenges. YSDA is associated member of LHCb since December 2014.  Yandex Data Factory are the Machine Learning and data analytics experts that use data science to improve business’ operations, revenues and profitability. By building upon the real-time personalisation and predictive analytics technology of parent company, Yandex, the fourth largest search engine in the world, Yandex Data Factory helps clients improve their business awareness through the exploitation of their own data. Yandex Data Factory’s proven data science and technology continually analyses, tests, refines and reapplies hundreds of hypotheses to the customers’ datasets to determine the best next course of action. It offers tailored, scalable, SaaS-driven Machine Learning services to a wide variety of data-reliant verticals, such as retail, financial services, travel and telecoms, who wish to use their data for purposes such as improving personalisation, segmentation, churn prevention or fraud detection. Yandex Data Factory was founded in 2014 by Yandex and is headquartered in Amsterdam, operating throughout Europe.  Intel (NASDAQ: INTC) is a world leader in computing innovation. The company designs and builds the essential technologies that serve as the foundation for the world’s computing devices. As a leader in corporate responsibility and sustainability, Intel also manufactures the world’s first commercially available “conflict-free” microprocessors. Additional information about Intel is available at http://newsroom.intel.com and http://blogs.intel.com.  The University of Zurich is one of the leading research universities in Europe and offers the widest range of degree programs in Switzerland. It was founded in 1833 and currently has seven faculties: Philosophy, Human Medicine, Economic Sciences, Law, Mathematics and Natural Sciences, Theology and Veterinary Medicine.   Warwick is one of the UK's leading universities, with an acknowledged reputation for excellence in research and teaching, for innovation, and for links with business and industry.  Institute of Nuclear Physics, Polish Academy of Sciences. Founded in 1955 Institute of Nuclear Physics has become leading Particle Physics research institution and ranked as class A+ by Polish Ministry of Higher Education.  Consistently ranked as one of Russia’s top universities, the Higher School of Economics is a leader in Russian education and one of the preeminent economics and social sciences universities in eastern Europe and Eurasia.", "link": "https://www.kaggle.com/c/flavours-of-physics-kernels-only", "tags": ["Classification", "Feature Engineering", "Physics", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-09-25 01:59:00", "words": 457, "sentences": 19, "sum_nltk": "The Yandex School of Data Analysis (YSDA) is a free Master’s-level program in Computer Science and Data Analysis, which is offered by Yandex since 2007.\nYandex Data Factory are the Machine Learning and data analytics experts that use data science to improve business’ operations, revenues and profitability.\nBy building upon the real-time personalisation and predictive analytics technology of parent company, Yandex, the fourth largest search engine in the world, Yandex Data Factory helps clients improve their business awareness through the exploitation of their own data.\nYandex Data Factory was founded in 2014 by Yandex and is headquartered in Amsterdam, operating throughout Europe.\nThe University of Zurich is one of the leading research universities in Europe and offers the widest range of degree programs in Switzerland.\nWarwick is one of the UK's leading universities, with an acknowledged reputation for excellence in research and teaching, for innovation, and for links with business and industry.\nFounded in 1955 Institute of Nuclear Physics has become leading Particle Physics research institution and ranked as class A+ by Polish Ministry of Higher Education.\nConsistently ranked as one of Russia’s top universities, the Higher School of Economics is a leader in Russian education and one of the preeminent economics and social sciences universities in eastern Europe and Eurasia.", "sum_nltk_words": 203, "sum_nltk_runtime": 0.005, "sum_t5": "the Yandex School of Data Analysis (YSDA) is a free Master's-level program in Computer Science and Data Analysis. the aim of the School is to train specialists in data analysis and information retrieval. ysDA is associated member of LHCb since December 2014. Yandex Data Factory is the Machine Learning and data analytics experts that use data science to improve business’ operations, revenues and profitability. the school is headquartered in Amsterdam, operating throughout Europe.", "sum_t5_words": 73, "sum_t5_runtime": 6.616, "runtime": 0.004, "nltk_category": "Education & Research", "nltk_category_score": 0.9082298874855042, "nltk_category_runtime": 19.533, "nltk_subcategory": "School", "nltk_subcategory_score": 0.6928954720497131, "nltk_subcategory_runtime": 31.522, "category": "Education & Research", "category_score": 0.9082298874855042, "subcategory": "School", "subcategory_score": 0.6928954720497131, "runtime_cat": 51.056, "engagement_score": "0.465", "language_code": "en", "language": "english", "language_score": "0.9999968312094171", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify rare decay phenomenonthe european organization nuclear research world largest high energy physic laboratory lhcb experiment set explore happened big bang allowed matter survive build universe inhabit today yandex school data analysis ysda free masterslevel program computer science data analysis offered yandex since 2007 aim school train specialist data analysis information retrieval able solve cutting edge industry problem well fundamental research challenge ysda associated member lhcb since december 2014 yandex data factory machine learning data analytics expert use data science improve business operation revenue profitability building upon realtime personalisation predictive analytics technology parent company yandex fourth largest search engine world yandex data factory help client improve business awareness exploitation data yandex data factory proven data science technology continually analysis test refines reapplies hundred hypothesis customer datasets determine best next course action offer tailored scalable saasdriven machine learning service wide variety datareliant vertical retail financial service travel telecom wish use data purpose improving personalisation segmentation churn prevention fraud detection yandex data factory founded 2014 yandex headquartered amsterdam operating throughout europe intel nasdaq intc world leader computing innovation company design build essential technology serve foundation world computing device leader corporate responsibility sustainability intel also manufacture world first commercially available conflictfree microprocessor additional information intel available httpnewsroomintelcom httpblogsintelcom university zurich one leading research university europe offer widest range degree program switzerland founded 1833 currently seven faculty philosophy human medicine economic science law mathematics natural science theology veterinary medicine warwick one uk leading university acknowledged reputation excellence research teaching innovation link business industry institute nuclear physic polish academy science founded 1955 institute nuclear physic become leading particle physic research institution ranked class polish ministry higher education consistently ranked one russia top university higher school economics leader russian education one preeminent economics social science university eastern europe eurasia", "tags_descriptive": ["Classification", "Feature Engineering", "Physics", "Classification"]}