{"title": "CareerCon 2019 - Help Navigate Robots", "description": "Compete to get your resume in front of our sponsorsCareerCon 2019 is upon us! CareerCon is a digital event all about landing your first data science job — and registration is now open! Ahead of the event, we have a fun competition to get you started. See below for a unique challenge and opportunity to share your resume with select CareerCon sponsors.  ___________________________________ The Competition Robots are smart… by design. To fully understand and properly navigate a task, however, they need input about their environment. In this competition, you’ll help robots recognize the floor surface they’re standing on using data collected from Inertial Measurement Units (IMU sensors). We’ve collected IMU sensor data while driving a small mobile robot over different floor surfaces on the university premises. The task is to predict which one of the nine floor types (carpet, tiles, concrete) the robot is on using sensor data such as acceleration and velocity. Succeed and you'll help improve the navigation of robots without assistance across many different surfaces, so they won’t fall down on the job.  Special thanks for making this competition possible: The data for this competition has been collected by Heikki Huttunen and Francesco Lomio from the Department of Signal Processing and Damoon Mohamadi, Kaan Celikbilek, Pedram Ghazi and Reza Ghabcheloo from the Department of Automation and Mechanical   Engineering both from Tampere University, Finland. We at Kaggle would like thank them all for kindly donating the data that has made this competition possible!", "link": "https://www.kaggle.com/c/career-con-2019", "tags": ["DL", "Classification", "Feature Engineering", "Exploratory Data Analysis", "LSTM", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-04-12 01:59:00", "words": 249, "sentences": 10, "sum_nltk": "CareerCon is a digital event all about landing your first data science job — and registration is now open!\nSee below for a unique challenge and opportunity to share your resume with select CareerCon sponsors.\nIn this competition, you’ll help robots recognize the floor surface they’re standing on using data collected from Inertial Measurement Units (IMU sensors).\nWe’ve collected IMU sensor data while driving a small mobile robot over different floor surfaces on the university premises.\nThe task is to predict which one of the nine floor types (carpet, tiles, concrete) the robot is on using sensor data such as acceleration and velocity.\nSucceed and you'll help improve the navigation of robots without assistance across many different surfaces, so they won’t fall down on the job.\nSpecial thanks for making this competition possible: The data for this competition has been collected by Heikki Huttunen and Francesco Lomio from the Department of Signal Processing and Damoon Mohamadi, Kaan Celikbilek, Pedram Ghazi and Reza Ghabcheloo from the Department of Automation and Mechanical   Engineering both from Tampere University, Finland.\nWe at Kaggle would like thank them all for kindly donating the data that has made this competition possible!", "sum_nltk_words": 190, "sum_nltk_runtime": 0.003, "sum_t5": "registration is now open for this competition. you'll help robots recognize the floor surface they're standing on. you'll help improve the navigation of robots without assistance across many different surfaces, so they won't fall down on the job. see below for a unique challenge and opportunity to share your resume with select CareerCon sponsors. see below for a unique challenge and opportunity to share your resume with select sponsors. click here to register for the competition.", "sum_t5_words": 76, "sum_t5_runtime": 5.722, "runtime": 0.0, "nltk_category": "Education & Research", "nltk_category_score": 0.7041717171669006, "nltk_category_runtime": 19.121, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.8070767521858215, "nltk_subcategory_runtime": 31.106, "category": "Education & Research", "category_score": 0.7041717171669006, "subcategory": "Student", "subcategory_score": 0.8070767521858215, "runtime_cat": 50.227, "engagement_score": "0.664", "language_code": "en", "language": "english", "language_score": "0.9999977392983618", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "compete get resume front sponsorscareercon 2019 upon u careercon digital event landing first data science job registration open ahead event fun competition get started see unique challenge opportunity share resume select careercon sponsor ___________________________________ competition robot smart design fully understand properly navigate task however need input environment competition youll help robot recognize floor surface theyre standing using data collected inertial measurement unit imu sensor weve collected imu sensor data driving small mobile robot different floor surface university premise task predict one nine floor type carpet tile concrete robot using sensor data acceleration velocity succeed youll help improve navigation robot without assistance across many different surface wont fall job special thanks making competition possible data competition collected heikki huttunen francesco lomio department signal processing damoon mohamadi kaan celikbilek pedram ghazi reza ghabcheloo department automation mechanical engineering tampere university finland kaggle would like thank kindly donating data made competition possible", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Feature Engineering", "Exploratory Data Analysis", "Long short-term memory (LSTM)", "Classification"]}