{"title": "Bike Sharing Demand", "description": "Forecast use of a city bikeshare systemGet started on this competition through Kaggle Scripts Bike sharing systems are a means of renting bicycles where the process of obtaining membership, rental, and bike return is automated via a network of kiosk locations throughout a city. Using these systems, people are able rent a bike from a one location and return it to a different place on an as-needed basis. Currently, there are over 500 bike-sharing programs around the world. The data generated by these systems makes them attractive for researchers because the duration of travel, departure location, arrival location, and time elapsed is explicitly recorded. Bike sharing systems therefore function as a sensor network, which can be used for studying mobility in a city. In this competition, participants are asked to combine historical usage patterns with weather data in order to forecast bike rental demand in the Capital Bikeshare program in Washington, D.C.  Acknowledgements Kaggle is hosting this competition for the machine learning community to use for fun and practice. This dataset was provided by Hadi Fanaee Tork using data from Capital Bikeshare. We also thank the UCI machine learning repository for hosting the dataset. If you use the problem in publication, please cite: Fanaee-T, Hadi, and Gama, Joao, Event labeling combining ensemble detectors and background knowledge, Progress in Artificial Intelligence (2013): pp. 1-15, Springer Berlin Heidelberg.", "link": "https://www.kaggle.com/c/bike-sharing-demand", "tags": ["Feature Engineering", "Random Forest", "Exploratory Data Analysis", "Regression"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-05-30 01:59:00", "words": 211, "sentences": 10, "sum_nltk": "Forecast use of a city bikeshare systemGet started on this competition through Kaggle Scripts Bike sharing systems are a means of renting bicycles where the process of obtaining membership, rental, and bike return is automated via a network of kiosk locations throughout a city.\nUsing these systems, people are able rent a bike from a one location and return it to a different place on an as-needed basis.\nCurrently, there are over 500 bike-sharing programs around the world.\nBike sharing systems therefore function as a sensor network, which can be used for studying mobility in a city.\nIn this competition, participants are asked to combine historical usage patterns with weather data in order to forecast bike rental demand in the Capital Bikeshare program in Washington, D.C.\nAcknowledgements Kaggle is hosting this competition for the machine learning community to use for fun and practice.\nThis dataset was provided by Hadi Fanaee Tork using data from Capital Bikeshare.\nWe also thank the UCI machine learning repository for hosting the dataset.\nIf you use the problem in publication, please cite: Fanaee-T, Hadi, and Gama, Joao, Event labeling combining ensemble detectors and background knowledge, Progress in Artificial Intelligence (2013): pp.", "sum_nltk_words": 174, "sum_nltk_runtime": 0.003, "sum_t5": "a competition is being held to forecast bike rental demand in a city. participants are asked to combine historical usage patterns with weather data. the data was provided by Hadi Fanaee Tork using data from Capital Bikeshare. if you use the problem in publication, please cite the uci machine learning repository..................", "sum_t5_words": 51, "sum_t5_runtime": 4.668, "runtime": 0.005, "nltk_category": "Media & Publishing", "nltk_category_score": 0.32659798860549927, "nltk_category_runtime": 19.893, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9202193021774292, "nltk_subcategory_runtime": 31.937, "category": "Media & Publishing", "category_score": 0.32659798860549927, "subcategory": "Machine Learning", "subcategory_score": 0.9202193021774292, "runtime_cat": 51.83, "engagement_score": "0.703", "language_code": "en", "language": "english", "language_score": "0.99999756847057", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "forecast use city bikeshare systemget started competition kaggle script bike sharing system mean renting bicycle process obtaining membership rental bike return automated via network kiosk location throughout city using system people able rent bike one location return different place asneeded basis currently 500 bikesharing program around world data generated system make attractive researcher duration travel departure location arrival location time elapsed explicitly recorded bike sharing system therefore function sensor network used studying mobility city competition participant asked combine historical usage pattern weather data order forecast bike rental demand capital bikeshare program washington dc acknowledgement kaggle hosting competition machine learning community use fun practice dataset provided hadi fanaee tork using data capital bikeshare also thank uci machine learning repository hosting dataset use problem publication please cite fanaeet hadi gama joao event labeling combining ensemble detector background knowledge progress artificial intelligence 2013 pp 115 springer berlin heidelberg", "tags_descriptive": ["Feature Engineering", "Random Forest", "Exploratory Data Analysis", "Regression"]}