{"title": "Integer Sequence Learning", "description": "1, 2, 3, 4, 5, 7?!7. You read that correctly. That's the start to a real integer sequence, the powers of primes. Want something easier? How about the next number in 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55? If you answered 89, you may enjoy this challenge. Your computer may find it considerably less enjoyable. The On-Line Encyclopedia of Integer Sequences is a 50+ year effort by mathematicians the world over to catalog sequences of integers. If it has a pattern, it's probably in the OEIS, and probably described with amazing detail. This competition challenges you create a machine learning algorithm capable of guessing the next number in an integer sequence. While this sounds like pattern recognition in its most basic form, a quick look at the data will convince you this is anything but basic! Acknowledgments Kaggle is hosting this competition for the data science community to use for fun and education. We thank the OEIS and its contributors for cataloging this data.", "link": "https://www.kaggle.com/c/integer-sequence-learning", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-11-01 00:59:00", "words": 159, "sentences": 10, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.6191707253456116, "description_category_runtime": 16.302, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9028241634368896, "description_subcategory_runtime": 25.917, "category": "Education & Research", "category_score": 0.6191707253456116, "subcategory": "Machine Learning", "subcategory_score": 0.9028241634368896, "runtime_cat": 42.22, "engagement_score": "0.572", "language_code": "en", "language": "english", "language_score": "0.9999943407268042", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "1 2 3 4 5 77 read correctly thats start real integer sequence power prime want something easier next number 0 1 1 2 3 5 8 13 21 34 55 answered 89 may enjoy challenge computer may find considerably le enjoyable online encyclopedia integer sequence 50 year effort mathematician world catalog sequence integer pattern probably oeis probably described amazing detail competition challenge create machine learning algorithm capable guessing next number integer sequence sound like pattern recognition basic form quick look data convince anything basic acknowledgment kaggle hosting competition data science community use fun education thank oeis contributor cataloging data", "tags_descriptive": []}