{"title": "IEEE-CIS Fraud Detection", "description": "Can you detect fraud from customer transactions?Imagine standing at the check-out counter at the grocery store with a long line behind you and the cashier not-so-quietly announces that your card has been declined. In this moment, you probably aren’t thinking about the data science that determined your fate. Embarrassed, and certain you have the funds to cover everything needed for an epic nacho party for 50 of your closest friends, you try your card again. Same result. As you step aside and allow the cashier to tend to the next customer, you receive a text message from your bank. “Press 1 if you really tried to spend $500 on cheddar cheese.” While perhaps cumbersome (and often embarrassing) in the moment, this fraud prevention system is actually saving consumers millions of dollars per year. Researchers from the IEEE Computational Intelligence Society (IEEE-CIS) want to improve this figure, while also improving the customer experience. With higher accuracy fraud detection,  you can get on with your chips without the hassle. IEEE-CIS works across a variety of AI and machine learning areas, including deep neural networks, fuzzy systems, evolutionary computation, and swarm intelligence. Today they’re partnering with the world’s leading payment service company, Vesta Corporation, seeking the best solutions for fraud prevention industry, and now you are invited to join the challenge. In this competition, you’ll benchmark machine learning models on a challenging large-scale dataset. The data comes from Vesta's real-world e-commerce transactions  and contains a wide range of features from device type to product features. You also have the opportunity to create new features to improve your results.  If successful, you’ll improve the efficacy of fraudulent transaction alerts for millions of people around the world, helping hundreds of thousands of businesses reduce their fraud loss and increase their revenue. And of course, you will save party people just like you the hassle of false positives. Acknowledgements:   Vesta Corporation provided the dataset for this competition. Vesta Corporation is the forerunner in guaranteed e-commerce payment solutions.  Founded in 1995, Vesta pioneered the process of fully guaranteed card-not-present (CNP) payment transactions for the telecommunications industry.  Since then, Vesta has firmly expanded data science and machine learning capabilities across the globe and solidified its position as the leader in guaranteed ecommerce payments. Today, Vesta guarantees more than $18B in transactions annually.  Header Photo by Tim Evans on Unsplash", "link": "https://www.kaggle.com/c/ieee-fraud-detection", "tags": ["Finance", "Classification", "Feature Engineering", "Xgboost", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-10-04 01:59:00", "words": 399, "sentences": 21, "sum_nltk": "Can you detect fraud from customer transactions?Imagine standing at the check-out counter at the grocery store with a long line behind you and the cashier not-so-quietly announces that your card has been declined.\nToday they’re partnering with the world’s leading payment service company, Vesta Corporation, seeking the best solutions for fraud prevention industry, and now you are invited to join the challenge.\nIn this competition, you’ll benchmark machine learning models on a challenging large-scale dataset.\nThe data comes from Vesta's real-world e-commerce transactions  and contains a wide range of features from device type to product features.\nIf successful, you’ll improve the efficacy of fraudulent transaction alerts for millions of people around the world, helping hundreds of thousands of businesses reduce their fraud loss and increase their revenue.\nVesta Corporation is the forerunner in guaranteed e-commerce payment solutions.\nFounded in 1995, Vesta pioneered the process of fully guaranteed card-not-present (CNP) payment transactions for the telecommunications industry.\nSince then, Vesta has firmly expanded data science and machine learning capabilities across the globe and solidified its position as the leader in guaranteed ecommerce payments.\nToday, Vesta guarantees more than $18B in transactions annually.", "sum_nltk_words": 183, "sum_nltk_runtime": 0.006, "sum_t5": "the competition will benchmark machine learning models on a challenging large-scale dataset. the data comes from Vesta's real-world e-commerce transactions. you'll improve the efficacy of fraudulent transaction alerts for millions of people around the world. if successful, you'll improve the efficacy of fraudulent transaction alerts for millions of people around the world. if successful, you'll improve the efficacy of fraudulent transaction alerts for millions of people around the world.", "sum_t5_words": 69, "sum_t5_runtime": 6.827, "runtime": 0.003, "nltk_category": "Finance", "nltk_category_score": 0.6730421185493469, "nltk_category_runtime": 18.843, "nltk_subcategory": "Fraud", "nltk_subcategory_score": 0.8205775022506714, "nltk_subcategory_runtime": 29.713, "category": "Finance", "category_score": 0.6730421185493469, "subcategory": "Fraud", "subcategory_score": 0.8205775022506714, "runtime_cat": 48.556, "engagement_score": "0.731", "language_code": "en", "language": "english", "language_score": "0.9999961184825328", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "detect fraud customer transactionsimagine standing checkout counter grocery store long line behind cashier notsoquietly announces card declined moment probably arent thinking data science determined fate embarrassed certain fund cover everything needed epic nacho party 50 closest friend try card result step aside allow cashier tend next customer receive text message bank press 1 really tried spend 500 cheddar cheese perhaps cumbersome often embarrassing moment fraud prevention system actually saving consumer million dollar per year researcher ieee computational intelligence society ieeecis want improve figure also improving customer experience higher accuracy fraud detection get chip without hassle ieeecis work across variety ai machine learning area including deep neural network fuzzy system evolutionary computation swarm intelligence today theyre partnering world leading payment service company vesta corporation seeking best solution fraud prevention industry invited join challenge competition youll benchmark machine learning model challenging largescale dataset data come vesta realworld ecommerce transaction contains wide range feature device type product feature also opportunity create new feature improve result successful youll improve efficacy fraudulent transaction alert million people around world helping hundred thousand business reduce fraud loss increase revenue course save party people like hassle false positive acknowledgement vesta corporation provided dataset competition vesta corporation forerunner guaranteed ecommerce payment solution founded 1995 vesta pioneered process fully guaranteed cardnotpresent cnp payment transaction telecommunication industry since vesta firmly expanded data science machine learning capability across globe solidified position leader guaranteed ecommerce payment today vesta guarantee 18b transaction annually header photo tim evans unsplash", "tags_descriptive": ["Finance", "Classification", "Feature Engineering", "Xgboost", "Exploratory Data Analysis"]}