{"title": "NFL Punt Analytics Competition", "description": "Analyze NFL game data and suggest rules to improve player safety during punt playsWelcome In this challenge you'll notice there isn't a leaderboard, and you are not required to develop a predictive model. This isn't a traditional supervised Kaggle machine learning competition. Instead, this challenge asks you to use data to propose specific rule modifications for the NFL that aim to reduce the occurrence of concussions during punt plays. For more information on this challenge format, see this forum thread. This challenge is part of NFL 1st & Future, presented by Arrow Electronics – the NFL’s annual Super Bowl competition designed to spur innovation in player health, safety and performance. The Challenge For the 2018 season, the NFL revised their kickoff rules in an effort to reduce the risk of injury during those plays. By examining injury reports, player position and velocity data, and game video, they were able to understand the game-play circumstances that may exacerbate the risk of injury to players.  This comprehensive review showed that over the course of all games during the 2015-2017 seasons, the kickoff represented only six percent of plays but 12 percent of concussions. Players had approximately four times the risk of concussion on returned kickoffs compared to running or passing plays. The changes to the kickoff rule aim to address the components that posed the most risk, like the use of a two-man wedge.  Now, the NFL is challenging Kagglers to help them perform the same examination, this time on punt play rules. They have provided data for all punt plays from the 2016 and 2017 NFL seasons that includes player rosters, on-field position data and video data, including the plays in which a player suffered a concussion.   Your challenge is to propose specific rule modifications (e.g. changes to the initial formation, tackling techniques, blocking rules etc.), supported by data, that may reduce the occurrence of concussions during punt plays. More details on the entry criteria are available in Overview tab > Evaluation.  About The NFL The National Football League is America's most popular sports league, comprised of 32 franchises that compete each year to win the Super Bowl, the world's biggest annual sporting event. Founded in 1920, the NFL developed the model for the successful modern sports league, including national and international distribution, extensive revenue sharing, competitive excellence, and strong franchises across the country. The NFL is committed to advancing progress in the diagnosis, prevention and treatment of sports-related injuries. The NFL's ongoing health and safety efforts include support for independent medical research and engineering advancements and a commitment to look at anything and everything to protect players and make the game safer, including enhancements to medical protocols and improvements to how our game is taught and played. As more is learned, the league evaluates and changes rules to evolve the game and try to improve protections for players. Since 2002 alone, the NFL has made 50 rules changes intended to eliminate potentially dangerous tactics and reduce the risk of injuries. For more information about the NFL's health and safety efforts, please visit www.PlaySmartPlaySafe.com.  Evaluation", "link": "https://www.kaggle.com/c/NFL-Punt-Analytics-Competition", "tags": ["Sports", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-01-10 00:59:00", "words": 520, "sentences": 23, "sum_nltk": "Analyze NFL game data and suggest rules to improve player safety during punt playsWelcome In this challenge you'll notice there isn't a leaderboard, and you are not required to develop a predictive model.\nInstead, this challenge asks you to use data to propose specific rule modifications for the NFL that aim to reduce the occurrence of concussions during punt plays.\nThis challenge is part of NFL 1st & Future, presented by Arrow Electronics – the NFL’s annual Super Bowl competition designed to spur innovation in player health, safety and performance.\nThe Challenge For the 2018 season, the NFL revised their kickoff rules in an effort to reduce the risk of injury during those plays.\nYour challenge is to propose specific rule modifications (e.g. changes to the initial formation, tackling techniques, blocking rules etc.), supported by data, that may reduce the occurrence of concussions during punt plays.\nThe NFL's ongoing health and safety efforts include support for independent medical research and engineering advancements and a commitment to look at anything and everything to protect players and make the game safer, including enhancements to medical protocols and improvements to how our game is taught and played.\nAs more is learned, the league evaluates and changes rules to evolve the game and try to improve protections for players.", "sum_nltk_words": 209, "sum_nltk_runtime": 0.006, "sum_t5": "this challenge is part of NFL 1st & Future, presented by Arrow Electronics. it is designed to spur innovation in player health, safety and performance. the kickoff represents only six percent of plays but 12 percent of concussions. players had approximately four times the risk of concussion on returned kickoffs compared to running or passing plays. the kickoff represents only six percent of plays but 12 percent of concussions.", "sum_t5_words": 69, "sum_t5_runtime": 6.341, "runtime": 0.004, "nltk_category": "Education & Research", "nltk_category_score": 0.6847801804542542, "nltk_category_runtime": 17.948, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.7459768056869507, "nltk_subcategory_runtime": 28.292, "category": "Education & Research", "category_score": 0.6847801804542542, "subcategory": "Judicial Applied", "subcategory_score": 0.7459768056869507, "runtime_cat": 46.24, "engagement_score": "0.0", "language_code": "en", "language": "english", "language_score": "0.9999961004833235", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "analyze nfl game data suggest rule improve player safety punt playswelcome challenge youll notice isnt leaderboard required develop predictive model isnt traditional supervised kaggle machine learning competition instead challenge asks use data propose specific rule modification nfl aim reduce occurrence concussion punt play information challenge format see forum thread challenge part nfl 1st future presented arrow electronics nfls annual super bowl competition designed spur innovation player health safety performance challenge 2018 season nfl revised kickoff rule effort reduce risk injury play examining injury report player position velocity data game video able understand gameplay circumstance may exacerbate risk injury player comprehensive review showed course game 20152017 season kickoff represented six percent play 12 percent concussion player approximately four time risk concussion returned kickoff compared running passing play change kickoff rule aim address component posed risk like use twoman wedge nfl challenging kagglers help perform examination time punt play rule provided data punt play 2016 2017 nfl season includes player roster onfield position data video data including play player suffered concussion challenge propose specific rule modification eg change initial formation tackling technique blocking rule etc supported data may reduce occurrence concussion punt play detail entry criterion available overview tab evaluation nfl national football league america popular sport league comprised 32 franchise compete year win super bowl world biggest annual sporting event founded 1920 nfl developed model successful modern sport league including national international distribution extensive revenue sharing competitive excellence strong franchise across country nfl committed advancing progress diagnosis prevention treatment sportsrelated injury nfls ongoing health safety effort include support independent medical research engineering advancement commitment look anything everything protect player make game safer including enhancement medical protocol improvement game taught played learned league evaluates change rule evolve game try improve protection player since 2002 alone nfl made 50 rule change intended eliminate potentially dangerous tactic reduce risk injury information nfls health safety effort please visit wwwplaysmartplaysafecom evaluation", "tags_descriptive": ["Sports", "Exploratory Data Analysis"]}