{"title": "Global Wheat Detection", "description": "Can you help identify wheat heads using image analysis?Open up your pantry and you’re likely to find several wheat products. Indeed, your morning toast or cereal may rely upon this common grain. Its popularity as a food and crop makes wheat widely studied. To get large and accurate data about wheat fields worldwide, plant scientists use image detection of \"wheat heads\"—spikes atop the plant containing grain. These images are used to estimate the density and size of wheat heads in different varieties. Farmers can use the data to assess health and maturity when making management decisions in their fields. However, accurate wheat head detection in outdoor field images can be visually challenging. There is often overlap of dense wheat plants, and the wind can blur the photographs. Both make it difficult to identify single heads. Additionally, appearances vary due to maturity, color, genotype, and head orientation. Finally, because wheat is grown worldwide, different varieties, planting densities, patterns, and field conditions must be considered. Models developed for wheat phenotyping need to generalize between different growing environments. Current detection methods involve one- and two-stage detectors (Yolo-V3 and Faster-RCNN), but even when trained with a large dataset, a bias to the training region remains. The Global Wheat Head Dataset is led by nine research institutes from seven countries: the University of Tokyo, Institut national de recherche pour l’agriculture, l’alimentation et l’environnement, Arvalis, ETHZ, University of Saskatchewan, University of Queensland, Nanjing Agricultural University, and Rothamsted Research. These institutions are joined by many in their pursuit of accurate wheat head detection, including the Global Institute for Food Security, DigitAg, Kubota, and Hiphen. In this competition, you’ll detect wheat heads from outdoor images of wheat plants, including wheat datasets from around the globe. Using worldwide data, you will focus on a generalized solution to estimate the number and size of wheat heads. To better gauge the performance for unseen genotypes, environments, and observational conditions, the training dataset covers multiple regions. You will use more than 3,000 images from Europe (France, UK, Switzerland) and North America (Canada). The test data includes about 1,000 images from Australia, Japan, and China. Wheat is a staple across the globe, which is why this competition must account for different growing conditions. Models developed for wheat phenotyping need to be able to generalize between environments. If successful, researchers can accurately estimate the density and size of wheat heads in different varieties. With improved detection farmers can better assess their crops, ultimately bringing cereal, toast, and other favorite dishes to your table.  This is a Code Competition. Refer to Code Requirements for details.", "link": "https://www.kaggle.com/c/global-wheat-detection", "tags": ["DL", "CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-08-19 03:59:00", "words": 431, "sentences": 26, "sum_nltk": "To get large and accurate data about wheat fields worldwide, plant scientists use image detection of \"wheat heads\"—spikes atop the plant containing grain.\nThese images are used to estimate the density and size of wheat heads in different varieties.\nFarmers can use the data to assess health and maturity when making management decisions in their fields.\nHowever, accurate wheat head detection in outdoor field images can be visually challenging.\nFinally, because wheat is grown worldwide, different varieties, planting densities, patterns, and field conditions must be considered.\nModels developed for wheat phenotyping need to generalize between different growing environments.\nThese institutions are joined by many in their pursuit of accurate wheat head detection, including the Global Institute for Food Security, DigitAg, Kubota, and Hiphen.\nIn this competition, you’ll detect wheat heads from outdoor images of wheat plants, including wheat datasets from around the globe.\nUsing worldwide data, you will focus on a generalized solution to estimate the number and size of wheat heads.\nWheat is a staple across the globe, which is why this competition must account for different growing conditions.\nIf successful, researchers can accurately estimate the density and size of wheat heads in different varieties.", "sum_nltk_words": 186, "sum_nltk_runtime": 0.006, "sum_t5": "wheat is a staple across the globe, which is why it is widely studied. image analysis of wheat heads is a challenge for farmers. there is often overlap of dense wheat plants, and the wind can blur the photographs. the global wheat head dataset is led by nine research institutes from seven countries. do you know a wheat head? send it to john sutter@dailymail.com. if you can help, send a message to john sutter@dailymail", "sum_t5_words": 74, "sum_t5_runtime": 7.06, "runtime": 0.003, "nltk_category": "Agriculture", "nltk_category_score": 0.842609167098999, "nltk_category_runtime": 18.08, "nltk_subcategory": "General", "nltk_subcategory_score": 0.9453957080841064, "nltk_subcategory_runtime": 28.134, "category": "Agriculture", "category_score": 0.842609167098999, "subcategory": "General", "subcategory_score": 0.9453957080841064, "runtime_cat": 46.214, "engagement_score": "0.686", "language_code": "en", "language": "english", "language_score": "0.999996692845501", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "help identify wheat head using image analysisopen pantry youre likely find several wheat product indeed morning toast cereal may rely upon common grain popularity food crop make wheat widely studied get large accurate data wheat field worldwide plant scientist use image detection wheat headsspikes atop plant containing grain image used estimate density size wheat head different variety farmer use data ass health maturity making management decision field however accurate wheat head detection outdoor field image visually challenging often overlap dense wheat plant wind blur photograph make difficult identify single head additionally appearance vary due maturity color genotype head orientation finally wheat grown worldwide different variety planting density pattern field condition must considered model developed wheat phenotyping need generalize different growing environment current detection method involve one twostage detector yolov3 fasterrcnn even trained large dataset bias training region remains global wheat head dataset led nine research institute seven country university tokyo institut national de recherche pour lagriculture lalimentation et lenvironnement arvalis ethz university saskatchewan university queensland nanjing agricultural university rothamsted research institution joined many pursuit accurate wheat head detection including global institute food security digitag kubota hiphen competition youll detect wheat head outdoor image wheat plant including wheat datasets around globe using worldwide data focus generalized solution estimate number size wheat head better gauge performance unseen genotype environment observational condition training dataset cover multiple region use 3000 image europe france uk switzerland north america canada test data includes 1000 image australia japan china wheat staple across globe competition must account different growing condition model developed wheat phenotyping need able generalize environment successful researcher accurately estimate density size wheat head different variety improved detection farmer better ass crop ultimately bringing cereal toast favorite dish table code competition refer code requirement detail", "tags_descriptive": ["Deep Learning (DL)", "Computer Vision (CV)"]}