{"title": "iMet Collection 2020 - FGVC7", "description": "Recognize artwork attributes from The Metropolitan Museum of ArtThe Metropolitan Museum of Art in New York, also known as The Met, has a diverse collection of over 1.5M objects of which over 200K have been digitized with imagery. Can you help find the significant attributes to identify a specific work of art? Help advance this research in this notebook competition.    The online cataloguing information is generated by subject matter experts and includes a wide range of data. These include, but are not limited to: multiple object classifications, artist, title, period, date, medium, culture, size, provenance, geographic location, and other related museum objects within The Met’s collection. While the annotations describe the object from an art history perspective, they can also be indirect in describing finer-grained attributes for the museum-goer’s understanding. Adding fine-grained attributes to aid in the visual understanding of the museum objects will enable the ability to search for visually related objects.  This is a Code Competition. Refer to Code Requirements for details.  About This is an FGVCx competition hosted as part of the FGVC7 workshop at CVPR 2020.", "link": "https://www.kaggle.com/c/imet-2020-fgvc7", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-05-29 01:59:00", "words": 185, "sentences": 9, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.47095099091529846, "description_category_runtime": 16.912, "description_subcategory": "Student", "description_subcategory_score": 0.36778655648231506, "description_subcategory_runtime": 27.128, "category": "Education & Research", "category_score": 0.47095099091529846, "subcategory": "Student", "subcategory_score": 0.36778655648231506, "runtime_cat": 44.04, "engagement_score": "0.497", "language_code": "en", "language": "english", "language_score": "0.9999973122326695", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "recognize artwork attribute metropolitan museum artthe metropolitan museum art new york also known met diverse collection 15m object 200k digitized imagery help find significant attribute identify specific work art help advance research notebook competition online cataloguing information generated subject matter expert includes wide range data include limited multiple object classification artist title period date medium culture size provenance geographic location related museum object within mets collection annotation describe object art history perspective also indirect describing finergrained attribute museumgoers understanding adding finegrained attribute aid visual understanding museum object enable ability search visually related object code competition refer code requirement detail fgvcx competition hosted part fgvc7 workshop cvpr 2020", "tags_descriptive": []}