{"title": "Categorical Feature Encoding Challenge", "description": "Binary classification, with every feature a categoricalIs there a cat in your dat? A common task in machine learning pipelines is encoding categorical variables for a given algorithm in a format that allows as much useful signal as possible to be captured. Because this is such a common task and important skill to master, we've put together a dataset that contains only categorical features, and includes:  binary features low- and high-cardinality nominal features low- and high-cardinality  ordinal features (potentially) cyclical features  This Playground competition will give you the opportunity to try different encoding schemes for different algorithms to compare how they perform. We encourage you to share what you find with the community. If you're not sure how to get started, you can check out the Categorical Variables  section of Kaggle's Intermediate Machine Learning course.  Have Fun!", "link": "https://www.kaggle.com/c/cat-in-the-dat", "tags": ["Classification", "Feature Engineering", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-12-10 00:59:00", "words": 142, "sentences": 5, "runtime": 0.0, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.11922888457775116, "description_category_runtime": 13.381, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9245747923851013, "description_subcategory_runtime": 20.558, "category": "Real Estate, Rental & Leasing", "category_score": 0.11922888457775116, "subcategory": "Machine Learning", "subcategory_score": 0.9245747923851013, "runtime_cat": 33.939, "engagement_score": "0.661", "language_code": "en", "language": "english", "language_score": "0.9999969355556189", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "binary classification every feature categoricalis cat dat common task machine learning pipeline encoding categorical variable given algorithm format allows much useful signal possible captured common task important skill master weve put together dataset contains categorical feature includes binary feature low highcardinality nominal feature low highcardinality ordinal feature potentially cyclical feature playground competition give opportunity try different encoding scheme different algorithm compare perform encourage share find community youre sure get started check categorical variable section kaggles intermediate machine learning course fun", "tags_descriptive": ["Classification", "Feature Engineering", "Exploratory Data Analysis"]}