{"title": "The 3rd YouTube-8M Video Understanding Challenge", "description": "Temporal localization of topics within videoImagine being able to search for the moment in any video where an adorable kitten sneezes, even though the uploader didn’t title or describe the video with such descriptive metadata. Now, apply that same concept to videos that cover important or special events like a baby’s first steps or a game-winning goal -- and now we have the ability to quickly find and share special video moments. This technology is called temporal concept localization within video and Google Research can use your help to advance the state of the art in this area.    An example of the detected action \"blowing out candles\" In most web searches, video retrieval and ranking is performed by matching query terms to metadata and other video-level signals. However, we know that videos can contain an array of topics that aren’t always characterized by the uploader, and many of these miss localizations to brief but important moments within the video. Temporal localization can enable applications such as  improved video search (including search within video), video summarization and highlight extraction, action moment detection, improved video content safety, and many others. In previous years, participants worked on advancements in video-level annotations, building both unconstrained and constrained models. In this third challenge based on the YouTube 8M dataset, Kagglers will localize video-level labels to the precise time in the video where the label actually appears, and do this at an unprecedented scale. To put it another way: at what point in the video does the cat sneeze?   If successful, your new machine learning models will significantly improve video understanding for all, by not only identifying the topics relevant to a video, but also pinpointing where in the video they appear. This competition is being hosted by Google Research as a part of the International Conference on Computer Vision (ICCV) 2019 selected workshop session. Please refer to the YouTube 8M Large-Scale Video Understanding Workshop Page for details about the workshop.", "link": "https://www.kaggle.com/c/youtube8m-2019", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-10-12 01:59:00", "words": 331, "sentences": 11, "sum_nltk": "Temporal localization of topics within videoImagine being able to search for the moment in any video where an adorable kitten sneezes, even though the uploader didn’t title or describe the video with such descriptive metadata.\nThis technology is called temporal concept localization within video and Google Research can use your help to advance the state of the art in this area.\nAn example of the detected action \"blowing out candles\" In most web searches, video retrieval and ranking is performed by matching query terms to metadata and other video-level signals.\nHowever, we know that videos can contain an array of topics that aren’t always characterized by the uploader, and many of these miss localizations to brief but important moments within the video.\nIn previous years, participants worked on advancements in video-level annotations, building both unconstrained and constrained models.\nIn this third challenge based on the YouTube 8M dataset, Kagglers will localize video-level labels to the precise time in the video where the label actually appears, and do this at an unprecedented scale.\nPlease refer to the YouTube 8M Large-Scale Video Understanding Workshop Page for details about the workshop.", "sum_nltk_words": 182, "sum_nltk_runtime": 0.004, "sum_t5": "google research is seeking your help to advance the state of the art in this area. the competition will localize video-level labels to the precise time in the video where the label actually appears. if successful, your new machine learning models will significantly improve video understanding. the competition is being hosted by google research as part of the international conference on computer vision (ICCV) 2019 selected workshop session. click here to enter the competition.. click here to enter the competition.", "sum_t5_words": 80, "sum_t5_runtime": 5.965, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.21549975872039795, "nltk_category_runtime": 16.806, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.3278810679912567, "nltk_subcategory_runtime": 26.661, "category": "Education & Research", "category_score": 0.21549975872039795, "subcategory": "Machine Learning", "subcategory_score": 0.3278810679912567, "runtime_cat": 43.467, "engagement_score": "0.571", "language_code": "en", "language": "english", "language_score": "0.9999973949953727", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "temporal localization topic within videoimagine able search moment video adorable kitten sneeze even though uploader didnt title describe video descriptive metadata apply concept video cover important special event like baby first step gamewinning goal ability quickly find share special video moment technology called temporal concept localization within video google research use help advance state art area example detected action blowing candle web search video retrieval ranking performed matching query term metadata videolevel signal however know video contain array topic arent always characterized uploader many miss localization brief important moment within video temporal localization enable application improved video search including search within video video summarization highlight extraction action moment detection improved video content safety many others previous year participant worked advancement videolevel annotation building unconstrained constrained model third challenge based youtube 8m dataset kagglers localize videolevel label precise time video label actually appears unprecedented scale put another way point video cat sneeze successful new machine learning model significantly improve video understanding identifying topic relevant video also pinpointing video appear competition hosted google research part international conference computer vision iccv 2019 selected workshop session please refer youtube 8m largescale video understanding workshop page detail workshop", "tags_descriptive": []}