{"title": "Facebook V: Predicting Check Ins", "description": "Identify the correct place for check insEver wonder what it's like to work at Facebook? Facebook and Kaggle are launching a machine learning engineering competition for 2016. Trail blaze your way to the top of the leaderboard to earn an opportunity at interviewing for one of the 10+ open roles as a software engineer, working on world class machine learning problems.  The goal of this competition is to predict which place a person would like to check in to. For the purposes of this competition, Facebook created an artificial world consisting of more than 100,000 places located in a 10 km by 10 km square. For a given set of coordinates, your task is to return a ranked list of the most likely places. Data was fabricated to resemble location signals coming from mobile devices, giving you a flavor of what it takes to work with real data complicated by inaccurate and noisy values. Inconsistent and erroneous location data can disrupt experience for services like Facebook Check In. We highly encourage competitors to be active on Kaggle Scripts. Your work there will be thoughtfully included in the decision making process. Please note: You must compete as an individual in recruiting competitions. You may only use the data provided to make your predictions.", "link": "https://www.kaggle.com/c/facebook-v-predicting-check-ins", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-07-07 01:59:00", "words": 211, "sentences": 11, "sum_nltk": "Identify the correct place for check insEver wonder what it's like to work at Facebook?\nFacebook and Kaggle are launching a machine learning engineering competition for 2016.\nTrail blaze your way to the top of the leaderboard to earn an opportunity at interviewing for one of the 10+ open roles as a software engineer, working on world class machine learning problems.\nThe goal of this competition is to predict which place a person would like to check in to.\nFor the purposes of this competition, Facebook created an artificial world consisting of more than 100,000 places located in a 10 km by 10 km square.\nFor a given set of coordinates, your task is to return a ranked list of the most likely places.\nData was fabricated to resemble location signals coming from mobile devices, giving you a flavor of what it takes to work with real data complicated by inaccurate and noisy values.\nInconsistent and erroneous location data can disrupt experience for services like Facebook Check In. We highly encourage competitors to be active on Kaggle Scripts.\nYour work there will be thoughtfully included in the decision making process.\nYou may only use the data provided to make your predictions.", "sum_nltk_words": 191, "sum_nltk_runtime": 0.003, "sum_t5": "Facebook and Kaggle are launching a machine learning engineering competition for 2016. the goal of this competition is to predict which place a person would like to check in to. you must compete as an individual in recruiting competitions. you may only use the data provided to make your predictions. a successful candidate will be able to earn an interview. a successful candidate will be able to earn an interview. a successful candidate will be able to earn an interview.", "sum_t5_words": 80, "sum_t5_runtime": 4.877, "runtime": 0.002, "nltk_category": "Accommodation & Food", "nltk_category_score": 0.3140680491924286, "nltk_category_runtime": 17.048, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8631267547607422, "nltk_subcategory_runtime": 26.769, "category": "Accommodation & Food", "category_score": 0.3140680491924286, "subcategory": "Machine Learning", "subcategory_score": 0.8631267547607422, "runtime_cat": 43.817, "engagement_score": "0.655", "language_code": "en", "language": "english", "language_score": "0.9999964170647868", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify correct place check insever wonder like work facebook facebook kaggle launching machine learning engineering competition 2016 trail blaze way top leaderboard earn opportunity interviewing one 10 open role software engineer working world class machine learning problem goal competition predict place person would like check purpose competition facebook created artificial world consisting 100000 place located 10 km 10 km square given set coordinate task return ranked list likely place data fabricated resemble location signal coming mobile device giving flavor take work real data complicated inaccurate noisy value inconsistent erroneous location data disrupt experience service like facebook check highly encourage competitor active kaggle script work thoughtfully included decision making process please note must compete individual recruiting competition may use data provided make prediction", "tags_descriptive": []}