{"title": "COVID19 Global Forecasting (Week 5)", "description": "Forecast daily COVID-19 spread in regions around worldThis is week 5 of Kaggle's COVID-19 forecasting series, following the Week 4 competition. This competition has some changes from prior weeks - be sure to check the Evaluation and Data pages for more details. All of the prior discussion forums have been migrated to this competition for continuity. Background The White House Office of Science and Technology Policy (OSTP) pulled together a coalition research groups and companies (including Kaggle)  to prepare the COVID-19 Open Research Dataset (CORD-19) to attempt to address key open scientific questions on COVID-19. Those questions are drawn from National Academies of Sciences, Engineering, and Medicine’s (NASEM) and the World Health Organization (WHO). The Challenge Kaggle is launching a companion COVID-19 forecasting challenges to help answer a subset of the NASEM/WHO questions. While the challenge involves developing quantile estimates intervals for confirmed cases and fatalities between May 12 and June 7 by region, the primary goal isn't only to produce accurate forecasts. It’s also to identify factors that appear to impact the transmission rate of COVID-19. You are encouraged to pull in, curate and share data sources that might be helpful. If you find variables that look like they impact the transmission rate, please share your finding in a notebook.  As the data becomes available, we will update the leaderboard with live results based on data made available from the Johns Hopkins University Center for Systems Science and Engineering (JHU CSSE). We have received support and guidance from health and policy organizations in launching these challenges. We're hopeful the Kaggle community can make valuable contributions to developing a better understanding of factors that impact the transmission of COVID-19.  Companies and Organizations There is also a call to action for companies and other organizations: If you have datasets that might be useful, please upload them to Kaggle’s dataset platform and reference them in this forum thread. That will make them accessible to those participating in this challenge and a resource to the wider scientific community. Acknowledgements JHU CSSE for making the data available to the public. The White House OSTP for pulling together the key open questions. The image comes from the Center for Disease Control.  This is a Code Competition. Refer to Code Requirements for details.", "link": "https://www.kaggle.com/c/covid19-global-forecasting-week-5", "tags": ["Random Forest"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-05-12 01:59:00", "words": 381, "sentences": 20, "sum_nltk": "This competition has some changes from prior weeks - be sure to check the Evaluation and Data pages for more details.\nAll of the prior discussion forums have been migrated to this competition for continuity.\nBackground The White House Office of Science and Technology Policy (OSTP) pulled together a coalition research groups and companies (including Kaggle)  to prepare the COVID-19 Open Research Dataset (CORD-19) to attempt to address key open scientific questions on COVID-19.\nThose questions are drawn from National Academies of Sciences, Engineering, and Medicine’s (NASEM) and the World Health Organization (WHO).\nThe Challenge Kaggle is launching a companion COVID-19 forecasting challenges to help answer a subset of the NASEM/WHO questions.\nIt’s also to identify factors that appear to impact the transmission rate of COVID-19.\nAs the data becomes available, we will update the leaderboard with live results based on data made available from the Johns Hopkins University Center for Systems Science and Engineering (JHU CSSE).\nWe have received support and guidance from health and policy organizations in launching these challenges.\nWe're hopeful the Kaggle community can make valuable contributions to developing a better understanding of factors that impact the transmission of COVID-19.\nThe White House OSTP for pulling together the key open questions.", "sum_nltk_words": 197, "sum_nltk_runtime": 0.005, "sum_t5": "this competition has some changes from prior weeks. all of the prior discussion forums have been migrated to this competition for continuity. the challenge involves developing quantile estimates intervals for confirmed cases and fatalities between May 12 and June 7 by region. the primary goal isn't only to produce accurate forecasts. it's also to identify factors that appear to impact the transmission rate of COVID-19. as the data becomes available, we will update the leaderboard with live results based on data made available from the Johns Hopkins", "sum_t5_words": 87, "sum_t5_runtime": 7.055, "runtime": 0.005, "nltk_category": "Healthcare", "nltk_category_score": 0.5229907631874084, "nltk_category_runtime": 19.467, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.4366069734096527, "nltk_subcategory_runtime": 31.14, "category": "Healthcare", "category_score": 0.5229907631874084, "subcategory": "Student", "subcategory_score": 0.4366069734096527, "runtime_cat": 50.608, "engagement_score": "0.539", "language_code": "en", "language": "english", "language_score": "0.99999789157933", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "forecast daily covid19 spread region around worldthis week 5 kaggles covid19 forecasting series following week 4 competition competition change prior week sure check evaluation data page detail prior discussion forum migrated competition continuity background white house office science technology policy ostp pulled together coalition research group company including kaggle prepare covid19 open research dataset cord19 attempt address key open scientific question covid19 question drawn national academy science engineering medicine nasem world health organization challenge kaggle launching companion covid19 forecasting challenge help answer subset nasemwho question challenge involves developing quantile estimate interval confirmed case fatality may 12 june 7 region primary goal isnt produce accurate forecast also identify factor appear impact transmission rate covid19 encouraged pull curate share data source might helpful find variable look like impact transmission rate please share finding notebook data becomes available update leaderboard live result based data made available john hopkins university center system science engineering jhu csse received support guidance health policy organization launching challenge hopeful kaggle community make valuable contribution developing better understanding factor impact transmission covid19 company organization also call action company organization datasets might useful please upload kaggles dataset platform reference forum thread make accessible participating challenge resource wider scientific community acknowledgement jhu csse making data available public white house ostp pulling together key open question image come center disease control code competition refer code requirement detail", "tags_descriptive": ["Random Forest"]}