{"title": "Walmart Recruiting: Trip Type Classification", "description": "Use market basket analysis to classify shopping tripsWalmart uses both art and science to continually make progress on their core mission of better understanding and serving their customers. One way Walmart is able to improve customers' shopping experiences is by segmenting their store visits into different trip types.   Whether they're on a last minute run for new puppy supplies or leisurely making their way through a weekly grocery list, classifying trip types enables Walmart to create the best shopping experience for every customer. Currently, Walmart's trip types are created from a combination of existing customer insights (\"art\") and purchase history data (\"science\"). In their third recruiting competition, Walmart is challenging Kagglers to focus on the (data) science and classify customer trips using only a transactional dataset of the items they've purchased. Improving the science behind trip type classification will help Walmart refine their segmentation process. Walmart is hosting this competition to connect with data scientists who break the mold.", "link": "https://www.kaggle.com/c/walmart-recruiting-trip-type-classification", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-12-28 00:59:00", "words": 151, "sentences": 5, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.45373228192329407, "description_category_runtime": 14.015, "description_subcategory": "Retail", "description_subcategory_score": 0.6673858761787415, "description_subcategory_runtime": 22.286, "category": "Wholesale & Retail", "category_score": 0.45373228192329407, "subcategory": "Retail", "subcategory_score": 0.6673858761787415, "runtime_cat": 36.301, "engagement_score": "0.647", "language_code": "en", "language": "english", "language_score": "0.9999983124919545", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "use market basket analysis classify shopping tripswalmart us art science continually make progress core mission better understanding serving customer one way walmart able improve customer shopping experience segmenting store visit different trip type whether theyre last minute run new puppy supply leisurely making way weekly grocery list classifying trip type enables walmart create best shopping experience every customer currently walmarts trip type created combination existing customer insight art purchase history data science third recruiting competition walmart challenging kagglers focus data science classify customer trip using transactional dataset item theyve purchased improving science behind trip type classification help walmart refine segmentation process walmart hosting competition connect data scientist break mold", "tags_descriptive": []}