{"title": "Predicting Molecular Properties", "description": "Can you measure the magnetic interactions between a pair of atoms?Think you can use your data science smarts to make big predictions at a molecular level? This challenge aims to predict interactions between atoms. Imaging technologies like MRI enable us to see and understand the molecular composition of tissues. Nuclear Magnetic Resonance (NMR) is a closely related technology which uses the same principles to understand the structure and dynamics of proteins and molecules. Researchers around the world conduct NMR experiments to further understanding of the structure and dynamics of molecules, across areas like environmental science, pharmaceutical science, and materials science.   This competition is hosted by members of the CHemistry and Mathematics in Phase Space (CHAMPS) at the University of Bristol, Cardiff University, Imperial College and the University of Leeds. Winning teams will have an opportunity to partner with this multi-university research program on an academic publication Your Challenge In this competition, you will develop an algorithm that can predict the magnetic interaction between two atoms in a molecule (i.e., the scalar coupling constant). Once the competition finishes, CHAMPS would like to invite the top teams to present their work, discuss the details of their models, and work with them to write a joint research publication which discusses an open-source implementation of the solution. About Scalar Coupling Using NMR to gain insight into a molecule’s structure and dynamics depends on the ability to accurately predict so-called “scalar couplings”. These are effectively the magnetic interactions between a pair of atoms. The strength of this magnetic interaction depends on intervening electrons and chemical bonds that make up a molecule’s three-dimensional structure. Using state-of-the-art methods from quantum mechanics, it is possible to accurately calculate scalar coupling constants given only a 3D molecular structure as input. However, these quantum mechanics calculations are extremely expensive (days or weeks per molecule), and therefore have limited applicability in day-to-day workflows. A fast and reliable method to predict these interactions will allow medicinal chemists to gain structural insights faster and cheaper, enabling scientists to understand how the 3D chemical structure of a molecule affects its properties and behavior.  Ultimately, such tools will enable researchers to make progress in a range of important problems, like designing molecules to carry out specific cellular tasks, or designing better drug molecules to fight disease. Join the CHAMPS Scalar Coupling challenge to apply predictive analytics to chemistry and chemical biology.", "link": "https://www.kaggle.com/c/champs-scalar-coupling", "tags": ["Feature Engineering"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-08-29 01:59:00", "words": 399, "sentences": 15, "sum_nltk": "Can you measure the magnetic interactions between a pair of atoms?Think you can use your data science smarts to make big predictions at a molecular level?\nNuclear Magnetic Resonance (NMR) is a closely related technology which uses the same principles to understand the structure and dynamics of proteins and molecules.\nResearchers around the world conduct NMR experiments to further understanding of the structure and dynamics of molecules, across areas like environmental science, pharmaceutical science, and materials science.\nWinning teams will have an opportunity to partner with this multi-university research program on an academic publication Your Challenge In this competition, you will develop an algorithm that can predict the magnetic interaction between two atoms in a molecule (i.e., the scalar coupling constant).\nAbout Scalar Coupling Using NMR to gain insight into a molecule’s structure and dynamics depends on the ability to accurately predict so-called “scalar couplings”.\nUsing state-of-the-art methods from quantum mechanics, it is possible to accurately calculate scalar coupling constants given only a 3D molecular structure as input.\nJoin the CHAMPS Scalar Coupling challenge to apply predictive analytics to chemistry and chemical biology.", "sum_nltk_words": 177, "sum_nltk_runtime": 0.005, "sum_t5": "competition aims to predict interactions between atoms. nuclear magnetic resonance (nmr) is closely related to MRI. it uses same principles to understand structure and dynamics of proteins. winning teams will have an opportunity to partner on an academic publication. they will present their work and discuss the details of their models. the winners will then have an opportunity to present their work. if they win, they will be invited to present their work on an academic publication.", "sum_t5_words": 77, "sum_t5_runtime": 6.293, "runtime": 0.002, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.6509934663772583, "nltk_category_runtime": 16.97, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.568519651889801, "nltk_subcategory_runtime": 26.951, "category": "Biotechnological & Life Sciences", "category_score": 0.6509934663772583, "subcategory": "Physical", "subcategory_score": 0.568519651889801, "runtime_cat": 43.922, "engagement_score": "0.695", "language_code": "en", "language": "english", "language_score": "0.9999952170606838", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "measure magnetic interaction pair atomsthink use data science smart make big prediction molecular level challenge aim predict interaction atom imaging technology like mri enable u see understand molecular composition tissue nuclear magnetic resonance nmr closely related technology us principle understand structure dynamic protein molecule researcher around world conduct nmr experiment understanding structure dynamic molecule across area like environmental science pharmaceutical science material science competition hosted member chemistry mathematics phase space champ university bristol cardiff university imperial college university leeds winning team opportunity partner multiuniversity research program academic publication challenge competition develop algorithm predict magnetic interaction two atom molecule ie scalar coupling constant competition finish champ would like invite top team present work discus detail model work write joint research publication discus opensource implementation solution scalar coupling using nmr gain insight molecule structure dynamic depends ability accurately predict socalled scalar coupling effectively magnetic interaction pair atom strength magnetic interaction depends intervening electron chemical bond make molecule threedimensional structure using stateoftheart method quantum mechanic possible accurately calculate scalar coupling constant given 3d molecular structure input however quantum mechanic calculation extremely expensive day week per molecule therefore limited applicability daytoday workflow fast reliable method predict interaction allow medicinal chemist gain structural insight faster cheaper enabling scientist understand 3d chemical structure molecule affect property behavior ultimately tool enable researcher make progress range important problem like designing molecule carry specific cellular task designing better drug molecule fight disease join champ scalar coupling challenge apply predictive analytics chemistry chemical biology", "tags_descriptive": ["Feature Engineering"]}