{"title": "Allstate Claims Severity", "description": "How severe is an insurance claim?When you’ve been devastated by a serious car accident, your focus is on the things that matter the most: family, friends, and other loved ones. Pushing paper with your insurance agent is the last place you want your time or mental energy spent. This is why Allstate, a personal insurer in the United States, is continually seeking fresh ideas to improve their claims service for the over 16 million households they protect.  Allstate is currently developing automated methods of predicting the cost, and hence severity, of claims. In this recruitment challenge, Kagglers are invited to show off their creativity and flex their technical chops by creating an algorithm which accurately predicts claims severity. Aspiring competitors will demonstrate insight into better ways to predict claims severity for the chance to be part of Allstate’s efforts to ensure a worry-free customer experience. New to Kaggle? This competition is a recruiting competition, your chance to get a foot in the door with the hiring team at Allstate.", "link": "https://www.kaggle.com/c/allstate-claims-severity", "tags": ["Model Comparison"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-12-13 00:59:00", "words": 168, "sentences": 7, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.496585875749588, "description_category_runtime": 14.591, "description_subcategory": "Insurance and Risk", "description_subcategory_score": 0.8161338567733765, "description_subcategory_runtime": 23.145, "category": "Education & Research", "category_score": 0.496585875749588, "subcategory": "Insurance and Risk", "subcategory_score": 0.8161338567733765, "runtime_cat": 37.736, "engagement_score": "0.7", "language_code": "en", "language": "english", "language_score": "0.9999967058618746", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "severe insurance claimwhen youve devastated serious car accident focus thing matter family friend loved one pushing paper insurance agent last place want time mental energy spent allstate personal insurer united state continually seeking fresh idea improve claim service 16 million household protect allstate currently developing automated method predicting cost hence severity claim recruitment challenge kagglers invited show creativity flex technical chop creating algorithm accurately predicts claim severity aspiring competitor demonstrate insight better way predict claim severity chance part allstates effort ensure worryfree customer experience new kaggle competition recruiting competition chance get foot door hiring team allstate", "tags_descriptive": ["Model Comparison"]}