{"title": "Facebook Recruiting III - Keyword Extraction", "description": "Identify keywords and tags from millions of text questionsLooking for a data science position at Facebook?  After two successful prior Kaggle competitions, Facebook continues their mission to identify the best data scientists and software engineers that Kaggle has to offer. In this third installment, they seek candidates who have experience text mining large amounts of data.  This competition tests your text skills on a large dataset from the Stack Exchange sites.  The task is to predict the tags (a.k.a. keywords, topics, summaries), given only the question text and its title. The dataset contains content from disparate stack exchange sites, containing a mix of both technical and non-technical questions.  Positions are available in Menlo Park, Seattle, New York City, and London; candidates must have, or be eligible to obtain, authorization to work in the US or UK. Please note: you must compete as an individual in recruiting competitions. You may only use the data provided to make your predictions. Crawling stack exchange sites to look up answers is not permitted. Facebook will review the code of the top participants before deciding whether to offer an interview.  This competition counts towards rankings & achievements.  If you wish to be considered for an interview at Facebook, check the box \"Allow host to contact me\" when you make your first entry. Acknowledgements We thank Stack Exchange (and its users) for generously releasing the source dataset through its Creative Commons Data Dumps. All data is licensed under the cc-by-sa license.", "link": "https://www.kaggle.com/c/facebook-recruiting-iii-keyword-extraction", "tags": ["Classification", "Feature Engineering", "Exploratory Data Analysis", "Logistic Regression", "Classification", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2013-12-21 00:59:00", "words": 246, "sentences": 13, "sum_nltk": "Identify keywords and tags from millions of text questionsLooking for a data science position at Facebook?\nAfter two successful prior Kaggle competitions, Facebook continues their mission to identify the best data scientists and software engineers that Kaggle has to offer.\nIn this third installment, they seek candidates who have experience text mining large amounts of data.\nThis competition tests your text skills on a large dataset from the Stack Exchange sites.\nThe task is to predict the tags (a.k.a. keywords, topics, summaries), given only the question text and its title.\nThe dataset contains content from disparate stack exchange sites, containing a mix of both technical and non-technical questions.\nYou may only use the data provided to make your predictions.\nCrawling stack exchange sites to look up answers is not permitted.\nFacebook will review the code of the top participants before deciding whether to offer an interview.\nThis competition counts towards rankings & achievements.\nIf you wish to be considered for an interview at Facebook, check the box \"Allow host to contact me\" when you make your first entry.\nAcknowledgements We thank Stack Exchange (and its users) for generously releasing the source dataset through its Creative Commons Data Dumps.", "sum_nltk_words": 187, "sum_nltk_runtime": 0.004, "sum_t5": "Facebook is seeking candidates who have experience text mining large amounts of data. the task is to predict the tags (a.k.a. keywords, topics, summaries) given only the question text and its title. positions are available in menlo park, Seattle, New York City, and London. candidates must have, or be eligible to obtain, authorization to work in the US or UK. if you wish to be considered for an interview at Facebook, check the box \"Allow host to contact me\"", "sum_t5_words": 79, "sum_t5_runtime": 5.218, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.5847942233085632, "nltk_category_runtime": 17.419, "nltk_subcategory": "Textual Analysis", "nltk_subcategory_score": 0.7904687523841858, "nltk_subcategory_runtime": 27.569, "category": "Utilities", "category_score": 0.5847942233085632, "subcategory": "Textual Analysis", "subcategory_score": 0.7904687523841858, "runtime_cat": 44.988, "engagement_score": "0.588", "language_code": "en", "language": "english", "language_score": "0.9999962306580864", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify keywords tag million text questionslooking data science position facebook two successful prior kaggle competition facebook continues mission identify best data scientist software engineer kaggle offer third installment seek candidate experience text mining large amount data competition test text skill large dataset stack exchange site task predict tag aka keywords topic summary given question text title dataset contains content disparate stack exchange site containing mix technical nontechnical question position available menlo park seattle new york city london candidate must eligible obtain authorization work u uk please note must compete individual recruiting competition may use data provided make prediction crawling stack exchange site look answer permitted facebook review code top participant deciding whether offer interview competition count towards ranking achievement wish considered interview facebook check box allow host contact make first entry acknowledgement thank stack exchange user generously releasing source dataset creative common data dump data licensed ccbysa license", "tags_descriptive": ["Classification", "Feature Engineering", "Exploratory Data Analysis", "Logistic Regression", "Classification", "Classification"]}