{"title": "Facial Keypoints Detection", "description": "Detect the location of keypoints on face imagesThe objective of this task is to predict keypoint positions on face images. This can be used as a building block in several applications, such as:  tracking faces in images and video analysing facial expressions detecting dysmorphic facial signs for medical diagnosis biometrics / face recognition  Detecing facial keypoints is a very challenging problem.  Facial features vary greatly from one individual to another, and even for a single individual, there is a large amount of variation due to 3D pose, size, position, viewing angle, and illumination conditions. Computer vision research has come a long way in addressing these difficulties, but there remain many opportunities for improvement. This getting-started competition provides a benchmark data set and an  R tutorial to get you going on analysing face images. Get started with R >> Acknowledgements The data set for this competition was graciously provided by  Dr. Yoshua Bengio of the University of Montreal. James Petterson.", "link": "https://www.kaggle.com/c/facial-keypoints-detection", "tags": ["DL", "Regression", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-01-07 01:00:00", "words": 161, "sentences": 6, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.12111034244298935, "description_category_runtime": 14.32, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.2371513396501541, "description_subcategory_runtime": 23.041, "category": "Education & Research", "category_score": 0.12111034244298935, "subcategory": "Machine Learning", "subcategory_score": 0.2371513396501541, "runtime_cat": 37.36, "engagement_score": "0.54", "language_code": "en", "language": "english", "language_score": "0.9999963501522744", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "detect location keypoints face imagesthe objective task predict keypoint position face image used building block several application tracking face image video analysing facial expression detecting dysmorphic facial sign medical diagnosis biometrics face recognition detecing facial keypoints challenging problem facial feature vary greatly one individual another even single individual large amount variation due 3d pose size position viewing angle illumination condition computer vision research come long way addressing difficulty remain many opportunity improvement gettingstarted competition provides benchmark data set r tutorial get going analysing face image get started r acknowledgement data set competition graciously provided dr yoshua bengio university montreal james petterson", "tags_descriptive": ["Deep Learning (DL)", "Regression", "Convolutional Neural Network (CNN)"]}