{"title": "Open Images Object Detection RVC 2020 edition", "description": "Detect objects in varied and complex imagesIntroduction Computer vision has advanced considerably but is still challenged in matching the precision of human perception. Open Images is a collaborative release of ~9 million images annotated with image-level labels, object bounding boxes, object segmentation masks, visual relationships, and localized narratives. This uniquely large and diverse dataset is designed to spur state of the art advances in analyzing and understanding images. This year the Open Images Object Detection competition is a part of the larger Robust Vision Challenge 2020. This challenge encourages the participants to develop robust computer vision algorithms able to perform well across multiple datasets. Please refer to the RVC 2020 page and the Open Images Challenge page for more details.  Participants are also welcome to submit to this playground competition beyond the context of RVC. Object Detection Track In this track, you are asked to predict a tight bounding box around object instances. The training set contains 12.2M bounding-boxes across 500 categories on 1.7M images. The boxes have been largely manually drawn by professional annotators to ensure accuracy and consistency. The images are very diverse and often contain complex scenes with several objects (7 per image on average).   Example annotations. Left: Mark Paul Gosselaar plays the guitar by Rhys A. Right: the house by anita kluska. Both images used under CC BY 2.0 license. The training data, format, and submission modalities are identical to the 2019 Open Images Challenge.", "link": "https://www.kaggle.com/c/open-images-object-detection-rvc-2020", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-08-14 18:00:00", "words": 242, "sentences": 16, "sum_nltk": "Detect objects in varied and complex imagesIntroduction Computer vision has advanced considerably but is still challenged in matching the precision of human perception.\nOpen Images is a collaborative release of ~9 million images annotated with image-level labels, object bounding boxes, object segmentation masks, visual relationships, and localized narratives.\nThis uniquely large and diverse dataset is designed to spur state of the art advances in analyzing and understanding images.\nThis year the Open Images Object Detection competition is a part of the larger Robust Vision Challenge 2020.\nThis challenge encourages the participants to develop robust computer vision algorithms able to perform well across multiple datasets.\nPlease refer to the RVC 2020 page and the Open Images Challenge page for more details.\nObject Detection Track In this track, you are asked to predict a tight bounding box around object instances.\nThe training set contains 12.2M bounding-boxes across 500 categories on 1.7M images.\nThe boxes have been largely manually drawn by professional annotators to ensure accuracy and consistency.\nThe images are very diverse and often contain complex scenes with several objects (7 per image on average).\nThe training data, format, and submission modalities are identical to the 2019 Open Images Challenge.", "sum_nltk_words": 188, "sum_nltk_runtime": 0.003, "sum_t5": "9 million images annotated with image-level labels, object bounding boxes, object segmentation masks, visual relationships, and localized narratives. this year the Open Images Object Detection competition is a part of the larger Robust Vision Challenge 2020. the training set contains 12.2M bounding-boxes across 500 categories on 1.7M images. participants are also welcome to submit to this playground competition beyond the context of RVC 2020.", "sum_t5_words": 64, "sum_t5_runtime": 4.916, "runtime": 0.003, "nltk_category": "Media & Publishing", "nltk_category_score": 0.3318348526954651, "nltk_category_runtime": 16.903, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.4693458378314972, "nltk_subcategory_runtime": 27.403, "category": "Media & Publishing", "category_score": 0.3318348526954651, "subcategory": "Student", "subcategory_score": 0.4693458378314972, "runtime_cat": 44.307, "engagement_score": "0.491", "language_code": "en", "language": "english", "language_score": "0.9999950913432732", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "detect object varied complex imagesintroduction computer vision advanced considerably still challenged matching precision human perception open image collaborative release 9 million image annotated imagelevel label object bounding box object segmentation mask visual relationship localized narrative uniquely large diverse dataset designed spur state art advance analyzing understanding image year open image object detection competition part larger robust vision challenge 2020 challenge encourages participant develop robust computer vision algorithm able perform well across multiple datasets please refer rvc 2020 page open image challenge page detail participant also welcome submit playground competition beyond context rvc object detection track track asked predict tight bounding box around object instance training set contains 122m boundingboxes across 500 category 17m image box largely manually drawn professional annotator ensure accuracy consistency image diverse often contain complex scene several object 7 per image average example annotation left mark paul gosselaar play guitar rhys right house anita kluska image used cc 20 license training data format submission modality identical 2019 open image challenge", "tags_descriptive": []}