{"title": "WSDM - KKBox's Churn Prediction Challenge", "description": "Can you predict when subscribers will churn?The 11th ACM International Conference on Web Search and Data Mining (WSDM 2018) is challenging you to build an algorithm that predicts whether a subscription user will churn using a donated dataset from KKBOX. WSDM (pronounced \"wisdom\") is one of the the premier conferences on web inspired research involving search and data mining. They're committed to publishing original, high quality papers and presentations, with an emphasis on practical but principled novel models. For a subscription business, accurately predicting churn is critical to long-term success. Even slight variations in churn can drastically affect profits. KKBOX is Asia’s leading music streaming service, holding the world’s most comprehensive Asia-Pop music library with over 30 million tracks. They offer a generous, unlimited version of their service to millions of people, supported by advertising and paid subscriptions. This delicate model is dependent on accurately predicting churn of their paid users. In this competition you’re tasked to build an algorithm that predicts whether a user will churn after their subscription expires. Currently, the company uses survival analysis techniques to determine the residual membership life time for each subscriber. By adopting different methods, KKBOX anticipates they’ll discover new insights to why users leave so they can be proactive in keeping users dancing. Winners will present their findings at the WSDM conference February 6-8, 2018 in Los Angeles, CA.  For more information on the conference, click here.", "link": "https://www.kaggle.com/c/kkbox-churn-prediction-challenge", "tags": ["DL", "Classification", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-12-18 00:59:00", "words": 236, "sentences": 13, "sum_nltk": "Can you predict when subscribers will churn?The 11th ACM International Conference on Web Search and Data Mining (WSDM 2018) is challenging you to build an algorithm that predicts whether a subscription user will churn using a donated dataset from KKBOX.\nWSDM (pronounced \"wisdom\") is one of the the premier conferences on web inspired research involving search and data mining.\nThey're committed to publishing original, high quality papers and presentations, with an emphasis on practical but principled novel models.\nFor a subscription business, accurately predicting churn is critical to long-term success.\nEven slight variations in churn can drastically affect profits.\nKKBOX is Asia’s leading music streaming service, holding the world’s most comprehensive Asia-Pop music library with over 30 million tracks.\nThey offer a generous, unlimited version of their service to millions of people, supported by advertising and paid subscriptions.\nThis delicate model is dependent on accurately predicting churn of their paid users.\nIn this competition you’re tasked to build an algorithm that predicts whether a user will churn after their subscription expires.\nWinners will present their findings at the WSDM conference February 6-8, 2018 in Los Angeles, CA.\nFor more information on the conference, click here.", "sum_nltk_words": 185, "sum_nltk_runtime": 0.003, "sum_t5": "the 11th ACM International Conference on Web Search and Data Mining (WSDM 2018) is challenging you to build an algorithm that predicts whether a subscription user will churn. a donated dataset from KKBOX is used to build the algorithm. winners will present their findings at the WSDM conference in los angeles, CA. a total of 67 million subscribers are currently subscribed to KKBOX. the company anticipates they’ll discover new insights to why users leave so they can", "sum_t5_words": 77, "sum_t5_runtime": 6.351, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.49741289019584656, "nltk_category_runtime": 17.869, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.6681714057922363, "nltk_subcategory_runtime": 28.56, "category": "Finance", "category_score": 0.49741289019584656, "subcategory": "Quality", "subcategory_score": 0.6681714057922363, "runtime_cat": 46.431, "engagement_score": "0.614", "language_code": "en", "language": "english", "language_score": "0.999996799005258", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict subscriber churnthe 11th acm international conference web search data mining wsdm 2018 challenging build algorithm predicts whether subscription user churn using donated dataset kkbox wsdm pronounced wisdom one premier conference web inspired research involving search data mining theyre committed publishing original high quality paper presentation emphasis practical principled novel model subscription business accurately predicting churn critical longterm success even slight variation churn drastically affect profit kkbox asia leading music streaming service holding world comprehensive asiapop music library 30 million track offer generous unlimited version service million people supported advertising paid subscription delicate model dependent accurately predicting churn paid user competition youre tasked build algorithm predicts whether user churn subscription expires currently company us survival analysis technique determine residual membership life time subscriber adopting different method kkbox anticipates theyll discover new insight user leave proactive keeping user dancing winner present finding wsdm conference february 68 2018 los angeles ca information conference click", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Exploratory Data Analysis"]}