{"title": "University of Liverpool - Ion Switching", "description": "Identify the number of channels open at each time pointThink you can use your data science skills to make big predictions at a submicroscopic level? Many diseases, including cancer, are believed to have a contributing factor in common. Ion channels are pore-forming proteins present in animals and plants. They encode learning and memory, help fight infections, enable pain signals, and stimulate muscle contraction. If scientists could better study ion channels, which may be possible with the aid of machine learning, it could have a far-reaching impact.  When ion channels open, they pass electric currents. Existing methods of detecting these state changes are slow and laborious. Humans must supervise the analysis, which imparts considerable bias, in addition to being tedious. These difficulties limit the volume of ion channel current analysis that can be used in research. Scientists hope that technology could enable rapid automatic detection of ion channel current events in raw data. The University of Liverpool’s Institute of Ageing and Chronic Disease is working to advance ion channel research. Their team of scientists have asked for your help. In this competition, you’ll use ion channel data to better model automatic identification methods. If successful, you’ll be able to detect individual ion channel events in noisy raw signals. The data is simulated and injected with real world noise to emulate what scientists observe in laboratory experiments. Technology to analyze electrical data in cells has not changed significantly over the past 20 years. If we better understand ion channel activity, the research could impact many areas related to cell health and migration. From human diseases to how climate change affects plants, faster detection of ion channels could greatly accelerate solutions to major world problems. Acknowledgements: This would not be possible without the help of the Biotechnology and Biological Sciences Research Council (BBSRC).", "link": "https://www.kaggle.com/c/liverpool-ion-switching", "tags": ["Time Series Analysis", "Exploratory Data Analysis", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-05-26 01:59:00", "words": 301, "sentences": 18, "sum_nltk": "Identify the number of channels open at each time pointThink you can use your data science skills to make big predictions at a submicroscopic level?\nIon channels are pore-forming proteins present in animals and plants.\nIf scientists could better study ion channels, which may be possible with the aid of machine learning, it could have a far-reaching impact.\nWhen ion channels open, they pass electric currents.\nThese difficulties limit the volume of ion channel current analysis that can be used in research.\nScientists hope that technology could enable rapid automatic detection of ion channel current events in raw data.\nThe University of Liverpool’s Institute of Ageing and Chronic Disease is working to advance ion channel research.\nIn this competition, you’ll use ion channel data to better model automatic identification methods.\nIf successful, you’ll be able to detect individual ion channel events in noisy raw signals.\nTechnology to analyze electrical data in cells has not changed significantly over the past 20 years.\nIf we better understand ion channel activity, the research could impact many areas related to cell health and migration.\nFrom human diseases to how climate change affects plants, faster detection of ion channels could greatly accelerate solutions to major world problems.", "sum_nltk_words": 191, "sum_nltk_runtime": 0.005, "sum_t5": "scientists hope that technology could enable rapid automatic detection of ion channel current events in raw data. ion channels open, they pass electric currents. existing methods of detecting these state changes are slow and laborious. if successful, you’ll be able to detect individual ion channel events in noisy raw signals. this could impact many areas related to cell health and migration. it would not be possible without the help of the Biotechnology and Biological Sciences Research Council (BBSRC).", "sum_t5_words": 78, "sum_t5_runtime": 6.276, "runtime": 0.0, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.572513222694397, "nltk_category_runtime": 17.683, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8704303503036499, "nltk_subcategory_runtime": 27.575, "category": "Biotechnological & Life Sciences", "category_score": 0.572513222694397, "subcategory": "Machine Learning", "subcategory_score": 0.8704303503036499, "runtime_cat": 45.258, "engagement_score": "0.693", "language_code": "en", "language": "english", "language_score": "0.9999963659856878", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify number channel open time pointthink use data science skill make big prediction submicroscopic level many disease including cancer believed contributing factor common ion channel poreforming protein present animal plant encode learning memory help fight infection enable pain signal stimulate muscle contraction scientist could better study ion channel may possible aid machine learning could farreaching impact ion channel open pas electric current existing method detecting state change slow laborious human must supervise analysis imparts considerable bias addition tedious difficulty limit volume ion channel current analysis used research scientist hope technology could enable rapid automatic detection ion channel current event raw data university liverpool institute ageing chronic disease working advance ion channel research team scientist asked help competition youll use ion channel data better model automatic identification method successful youll able detect individual ion channel event noisy raw signal data simulated injected real world noise emulate scientist observe laboratory experiment technology analyze electrical data cell changed significantly past 20 year better understand ion channel activity research could impact many area related cell health migration human disease climate change affect plant faster detection ion channel could greatly accelerate solution major world problem acknowledgement would possible without help biotechnology biological science research council bbsrc", "tags_descriptive": ["Time Series Analysis", "Exploratory Data Analysis", "Convolutional Neural Network (CNN)"]}