{"title": "Two Sigma: Using News to Predict Stock Movements", "description": "Use news analytics to predict stock price performanceAugust 2019 Update: this competition is closed and is no longer accepting submissions.  The data has been removed from this competition and is not available for use. Thanks for participating! Can we use the content of news analytics to predict stock price performance? The ubiquity of data today enables investors at any scale to make better investment decisions. The challenge is ingesting and interpreting the data to determine which data is useful, finding the signal in this sea of information. Two Sigma  is passionate about this challenge and is excited to share it with the Kaggle community. As a scientifically driven investment manager, Two Sigma has been applying technology and data science to financial forecasts for over 17 years. Their pioneering advances in big data, AI, and machine learning have pushed the investment industry forward. Now, they're eager to engage with Kagglers in this continuing pursuit of innovation. By analyzing news data to predict stock prices, Kagglers have a unique opportunity to advance the state of research in understanding the predictive power of the news. This power, if harnessed, could help predict financial outcomes and generate significant economic impact all over the world.  Data for this competition comes from the following sources:  Market data provided by Intrinio. News data provided by Thomson Reuters. Copyright Thomson Reuters, 2017. All Rights Reserved. Use, duplication, or sale of this service, or data contained herein, except as described in the Competition Rules, is strictly prohibited.    The THOMSON REUTERS Kinesis Logo and THOMSON REUTERS are trademarks of Thomson Reuters and its affiliated companies in the United States and other countries and used herein under license.", "link": "https://www.kaggle.com/c/two-sigma-financial-news", "tags": ["NLP", "Finance", "Ensembling", "Feature Engineering", "Time Series Analysis", "Exploratory Data Analysis", "LSTM", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-08-06 01:59:00", "words": 284, "sentences": 16, "sum_nltk": "Use news analytics to predict stock price performanceAugust 2019 Update: this competition is closed and is no longer accepting submissions.\nThe data has been removed from this competition and is not available for use.\nCan we use the content of news analytics to predict stock price performance?\nThe challenge is ingesting and interpreting the data to determine which data is useful, finding the signal in this sea of information.\nAs a scientifically driven investment manager, Two Sigma has been applying technology and data science to financial forecasts for over 17 years.\nTheir pioneering advances in big data, AI, and machine learning have pushed the investment industry forward.\nBy analyzing news data to predict stock prices, Kagglers have a unique opportunity to advance the state of research in understanding the predictive power of the news.\nThis power, if harnessed, could help predict financial outcomes and generate significant economic impact all over the world.\nData for this competition comes from the following sources:  Market data provided by Intrinio.\nNews data provided by Thomson Reuters.\nUse, duplication, or sale of this service, or data contained herein, except as described in the Competition Rules, is strictly prohibited.", "sum_nltk_words": 184, "sum_nltk_runtime": 0.004, "sum_t5": "two Sigma is passionate about this challenge and is excited to share it with the Kaggle community. the data has been removed from this competition and is not available for use. use, duplication, or sale of this service, or data contained herein, is strictly prohibited. the thOMSON REUTERS Kinesis logo and THOMSON REUTERS are trademarks of Thomson Reuters.. if you have any questions, please contact john mcginley at john@twosigma", "sum_t5_words": 69, "sum_t5_runtime": 6.381, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.6864364147186279, "nltk_category_runtime": 16.387, "nltk_subcategory": "Trading & Investment", "nltk_subcategory_score": 0.5928978323936462, "nltk_subcategory_runtime": 25.767, "category": "Finance", "category_score": 0.6864364147186279, "subcategory": "Trading & Investment", "subcategory_score": 0.5928978323936462, "runtime_cat": 42.154, "engagement_score": "0.698", "language_code": "en", "language": "english", "language_score": "0.9999985209258191", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "use news analytics predict stock price performanceaugust 2019 update competition closed longer accepting submission data removed competition available use thanks participating use content news analytics predict stock price performance ubiquity data today enables investor scale make better investment decision challenge ingesting interpreting data determine data useful finding signal sea information two sigma passionate challenge excited share kaggle community scientifically driven investment manager two sigma applying technology data science financial forecast 17 year pioneering advance big data ai machine learning pushed investment industry forward theyre eager engage kagglers continuing pursuit innovation analyzing news data predict stock price kagglers unique opportunity advance state research understanding predictive power news power harnessed could help predict financial outcome generate significant economic impact world data competition come following source market data provided intrinio news data provided thomson reuters copyright thomson reuters 2017 right reserved use duplication sale service data contained herein except described competition rule strictly prohibited thomson reuters kinesis logo thomson reuters trademark thomson reuters affiliated company united state country used herein license", "tags_descriptive": ["Natural Language Processing (NLP)", "Finance", "Ensembling", "Feature Engineering", "Time Series Analysis", "Exploratory Data Analysis", "Long short-term memory (LSTM)", "Classification"]}