{"title": "Recruit Restaurant Visitor Forecasting", "description": "Predict how many future visitors a restaurant will receiveRunning a thriving local restaurant isn't always as charming as first impressions appear. There are often all sorts of unexpected troubles popping up that could hurt business. One common predicament is that restaurants need to know how many customers to expect each day to effectively purchase ingredients and schedule staff members. This forecast isn't easy to make because many unpredictable factors affect restaurant attendance, like weather and local competition. It's even harder for newer restaurants with little historical data. Recruit Holdings has unique access to key datasets that could make automated future customer prediction possible. Specifically, Recruit Holdings owns Hot Pepper Gourmet (a restaurant review service), AirREGI (a restaurant point of sales service), and Restaurant Board (reservation log management software). In this competition, you're challenged to use reservation and visitation data to predict the total number of visitors to a restaurant for future dates. This information will help restaurants be much more efficient and allow them to focus on creating an enjoyable dining experience for their customers.", "link": "https://www.kaggle.com/c/recruit-restaurant-visitor-forecasting", "tags": ["Ensembling"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-02-07 00:59:00", "words": 175, "sentences": 9, "runtime": 0.002, "description_category": "Accommodation & Food", "description_category_score": 0.6131978034973145, "description_category_runtime": 14.154, "description_subcategory": "Restaurant", "description_subcategory_score": 0.7892010807991028, "description_subcategory_runtime": 22.393, "category": "Accommodation & Food", "category_score": 0.6131978034973145, "subcategory": "Restaurant", "subcategory_score": 0.7892010807991028, "runtime_cat": 36.547, "engagement_score": "0.684", "language_code": "en", "language": "english", "language_score": "0.9999972875175268", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict many future visitor restaurant receiverunning thriving local restaurant isnt always charming first impression appear often sort unexpected trouble popping could hurt business one common predicament restaurant need know many customer expect day effectively purchase ingredient schedule staff member forecast isnt easy make many unpredictable factor affect restaurant attendance like weather local competition even harder newer restaurant little historical data recruit holding unique access key datasets could make automated future customer prediction possible specifically recruit holding owns hot pepper gourmet restaurant review service airregi restaurant point sale service restaurant board reservation log management software competition youre challenged use reservation visitation data predict total number visitor restaurant future date information help restaurant much efficient allow focus creating enjoyable dining experience customer", "tags_descriptive": ["Ensembling"]}