{"title": "Movie Review Sentiment Analysis (Kernels Only)", "description": "Classify the sentiment of sentences from the Rotten Tomatoes dataset\"There's a thin line between likably old-fashioned and fuddy-duddy, and The Count of Monte Cristo ... never quite settles on either side.\" The Rotten Tomatoes movie review dataset is a corpus of movie reviews used for sentiment analysis, originally collected by Pang and Lee [1]. In their work on sentiment treebanks, Socher et al. [2] used Amazon's Mechanical Turk to create fine-grained labels for all parsed phrases in the corpus. This competition presents a chance to benchmark your sentiment-analysis ideas on the Rotten Tomatoes dataset. You are asked to label phrases on a scale of five values: negative, somewhat negative, neutral, somewhat positive, positive. Obstacles like sentence negation, sarcasm, terseness, language ambiguity, and many others make this task very challenging.  Kaggle is hosting this competition for the machine learning community to use for fun and practice. This competition was inspired by the work of Socher et al [2]. We encourage participants to explore the accompanying (and dare we say, fantastic) website that accompanies the paper: http://nlp.stanford.edu/sentiment/ There you will find have source code, a live demo, and even an online interface to help train the model. [1] Pang and L. Lee. 2005. Seeing stars: Exploiting class relationships for sentiment categorization with respect to rating scales. In ACL, pages 115–124. [2] Recursive Deep Models for Semantic Compositionality Over a Sentiment Treebank, Richard Socher, Alex Perelygin, Jean Wu, Jason Chuang, Chris Manning, Andrew Ng and Chris Potts. Conference on Empirical Methods in Natural Language Processing (EMNLP 2013).", "link": "https://www.kaggle.com/c/movie-review-sentiment-analysis-kernels-only", "tags": ["DL", "NLP", "Classification", "CNN", "Exploratory Data Analysis", "Transfer Learning"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-09-25 01:59:00", "words": 249, "sentences": 16, "sum_nltk": "Classify the sentiment of sentences from the Rotten Tomatoes dataset\"There's a thin line between likably old-fashioned and fuddy-duddy, and The Count of Monte Cristo ...\nnever quite settles on either side.\" The Rotten Tomatoes movie review dataset is a corpus of movie reviews used for sentiment analysis, originally collected by Pang and Lee [1].\nIn their work on sentiment treebanks, Socher et al.\n[2] used Amazon's Mechanical Turk to create fine-grained labels for all parsed phrases in the corpus.\nThis competition presents a chance to benchmark your sentiment-analysis ideas on the Rotten Tomatoes dataset.\nYou are asked to label phrases on a scale of five values: negative, somewhat negative, neutral, somewhat positive, positive.\nObstacles like sentence negation, sarcasm, terseness, language ambiguity, and many others make this task very challenging.\nKaggle is hosting this competition for the machine learning community to use for fun and practice.\nThis competition was inspired by the work of Socher et al [2].\nSeeing stars: Exploiting class relationships for sentiment categorization with respect to rating scales.\n[2] Recursive Deep Models for Semantic Compositionality Over a Sentiment Treebank, Richard Socher, Alex Perelygin, Jean Wu, Jason Chuang, Chris Manning, Andrew Ng and Chris Potts.", "sum_nltk_words": 182, "sum_nltk_runtime": 0.003, "sum_t5": "this competition challenges machine learning to classify sentiments. you are asked to label phrases on a scale of five values. you can use the source code, a live demo, and even an online interface. if you're not sure, try the online contest. if you're not sure, try the online contest. a prize of $1,000 will be awarded. a prize of $1,000 will be given to the winner. a prize of $1,000 will be awarded.", "sum_t5_words": 74, "sum_t5_runtime": 6.342, "runtime": 0.002, "nltk_category": "Education & Research", "nltk_category_score": 0.19947978854179382, "nltk_category_runtime": 20.201, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.926659882068634, "nltk_subcategory_runtime": 32.747, "category": "Education & Research", "category_score": 0.19947978854179382, "subcategory": "Machine Learning", "subcategory_score": 0.926659882068634, "runtime_cat": 52.948, "engagement_score": "0.595", "language_code": "en", "language": "english", "language_score": "0.9999988587565124", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "classify sentiment sentence rotten tomato datasettheres thin line likably oldfashioned fuddyduddy count monte cristo never quite settle either side rotten tomato movie review dataset corpus movie review used sentiment analysis originally collected pang lee 1 work sentiment treebanks socher et al 2 used amazon mechanical turk create finegrained label parsed phrase corpus competition present chance benchmark sentimentanalysis idea rotten tomato dataset asked label phrase scale five value negative somewhat negative neutral somewhat positive positive obstacle like sentence negation sarcasm terseness language ambiguity many others make task challenging kaggle hosting competition machine learning community use fun practice competition inspired work socher et al 2 encourage participant explore accompanying dare say fantastic website accompanies paper httpnlpstanfordedusentiment find source code live demo even online interface help train model 1 pang l lee 2005 seeing star exploiting class relationship sentiment categorization respect rating scale acl page 115124 2 recursive deep model semantic compositionality sentiment treebank richard socher alex perelygin jean wu jason chuang chris manning andrew ng chris potts conference empirical method natural language processing emnlp 2013", "tags_descriptive": ["Deep Learning (DL)", "Natural Language Processing (NLP)", "Classification", "Convolutional Neural Network (CNN)", "Exploratory Data Analysis", "Transfer Learning"]}