{"title": "Dog Breed Identification", "description": "Determine the breed of a dog in an imageWho's a good dog? Who likes ear scratches? Well, it seems those fancy deep neural networks don't have all the answers. However, maybe they can answer that ubiquitous question we all ask when meeting a four-legged stranger: what kind of good pup is that? In this playground competition, you are provided a strictly canine subset of ImageNet in order to practice fine-grained image categorization. How well you can tell your Norfolk Terriers from your Norwich Terriers? With 120 breeds of dogs and a limited number training images per class, you might find the problem more, err, ruff than you anticipated.  Acknowledgments We extend our gratitude to the creators of the Stanford Dogs Dataset for making this competition possible: Aditya Khosla, Nityananda Jayadevaprakash, Bangpeng Yao, and Fei-Fei Li.", "link": "https://www.kaggle.com/c/dog-breed-identification", "tags": ["DL", "CV", "Transfer Learning"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-02-27 00:59:00", "words": 136, "sentences": 4, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.08264274150133133, "description_category_runtime": 13.354, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7302395701408386, "description_subcategory_runtime": 21.186, "category": "Education & Research", "category_score": 0.08264274150133133, "subcategory": "Machine Learning", "subcategory_score": 0.7302395701408386, "runtime_cat": 34.54, "engagement_score": "0.658", "language_code": "en", "language": "english", "language_score": "0.9999963881385372", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "determine breed dog imagewhos good dog like ear scratch well seems fancy deep neural network dont answer however maybe answer ubiquitous question ask meeting fourlegged stranger kind good pup playground competition provided strictly canine subset imagenet order practice finegrained image categorization well tell norfolk terrier norwich terrier 120 breed dog limited number training image per class might find problem err ruff anticipated acknowledgment extend gratitude creator stanford dog dataset making competition possible aditya khosla nityananda jayadevaprakash bangpeng yao feifei li", "tags_descriptive": ["Deep Learning (DL)", "Computer Vision (CV)", "Transfer Learning"]}