{"title": "Kannada MNIST", "description": "MNIST like datatset for Kannada handwritten digitsBored of MNIST? The goal of this competition is to provide a simple extension to the classic MNIST competition we're all familiar with. Instead of using Arabic numerals, it uses a recently-released dataset of Kannada digits. Kannada is a language spoken predominantly by people of Karnataka in southwestern India. The language has roughly 45 million native speakers and is written using the Kannada script. Wikipedia  This competition uses the same format as the MNIST competition in terms of how the data is structured, but it's different in that it is a synchronous re-run Kernels competition. You write your code in a Kaggle Notebook, and when you submit the results, your code is scored on both the public test set, as well as a private (unseen) test set. Technical Information All details of the dataset curation has been captured in the paper titled: Prabhu, Vinay Uday. \"Kannada-MNIST: A new handwritten digits dataset for the Kannada language.\" arXiv preprint arXiv:1908.01242 (2019) The github repo of the author can be found here. On the originally-posted dataset, the author suggests some interesting questions you may be interested in exploring. Please note, although this dataset has been released in full, the purpose of this competition is for practice, not to find the labels to submit a perfect score. In addition to the main dataset, the author also disseminated an additional real world handwritten dataset (with 10k images), termed as the 'Dig-MNIST dataset' that can serve as an out-of-domain test dataset. It was created with the help of volunteers that were non-native users of the language, authored on a smaller sheet and scanned with different scanner settings compared to the main dataset. This 'dig-MNIST' dataset serves as a more difficult test-set (An accuracy of 76.1% was reported in the paper cited above) and achieving ~98+% accuracy on this test dataset would be rather commendable. Acknowledgments Kaggle thanks Vinay Prabhu for providing this interesting dataset for a Playground competition. Image reference: https://www.researchgate.net/figure/speech-for-Kannada-numbers_fig2_313113588", "link": "https://www.kaggle.com/c/Kannada-MNIST", "tags": ["DL", "Classification", "Exploratory Data Analysis", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-12-18 00:59:00", "words": 332, "sentences": 15, "sum_nltk": "Instead of using Arabic numerals, it uses a recently-released dataset of Kannada digits.\nThe language has roughly 45 million native speakers and is written using the Kannada script.\n\"Kannada-MNIST: A new handwritten digits dataset for the Kannada language.\" arXiv preprint arXiv:1908.01242 (2019) The github repo of the author can be found here.\nPlease note, although this dataset has been released in full, the purpose of this competition is for practice, not to find the labels to submit a perfect score.\nIn addition to the main dataset, the author also disseminated an additional real world handwritten dataset (with 10k images), termed as the 'Dig-MNIST dataset' that can serve as an out-of-domain test dataset.\nIt was created with the help of volunteers that were non-native users of the language, authored on a smaller sheet and scanned with different scanner settings compared to the main dataset.\nThis 'dig-MNIST' dataset serves as a more difficult test-set (An accuracy of 76.1% was reported in the paper cited above) and achieving ~98+% accuracy on this test dataset would be rather commendable.\nAcknowledgments Kaggle thanks Vinay Prabhu for providing this interesting dataset for a Playground competition.", "sum_nltk_words": 182, "sum_nltk_runtime": 0.004, "sum_t5": "the goal of this competition is to provide a simple extension to the classic MNIST competition. instead of using Arabic numerals, it uses a recently-released dataset of Kannada digits. the language has roughly 45 million native speakers and is written using the Kannada script. the purpose of this competition is for practice, not to find the labels to submit a perfect score. the 'dig-MNIST dataset' is a more difficult test dataset.", "sum_t5_words": 71, "sum_t5_runtime": 6.536, "runtime": 0.003, "nltk_category": "Finance", "nltk_category_score": 0.3628252148628235, "nltk_category_runtime": 18.919, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.6353282332420349, "nltk_subcategory_runtime": 30.559, "category": "Finance", "category_score": 0.3628252148628235, "subcategory": "Student", "subcategory_score": 0.6353282332420349, "runtime_cat": 49.478, "engagement_score": "0.655", "language_code": "en", "language": "english", "language_score": "0.9999978630808992", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "mnist like datatset kannada handwritten digitsbored mnist goal competition provide simple extension classic mnist competition familiar instead using arabic numeral us recentlyreleased dataset kannada digit kannada language spoken predominantly people karnataka southwestern india language roughly 45 million native speaker written using kannada script wikipedia competition us format mnist competition term data structured different synchronous rerun kernel competition write code kaggle notebook submit result code scored public test set well private unseen test set technical information detail dataset curation captured paper titled prabhu vinay uday kannadamnist new handwritten digit dataset kannada language arxiv preprint arxiv190801242 2019 github repo author found originallyposted dataset author suggests interesting question may interested exploring please note although dataset released full purpose competition practice find label submit perfect score addition main dataset author also disseminated additional real world handwritten dataset 10k image termed digmnist dataset serve outofdomain test dataset created help volunteer nonnative user language authored smaller sheet scanned different scanner setting compared main dataset digmnist dataset serf difficult testset accuracy 761 reported paper cited achieving 98 accuracy test dataset would rather commendable acknowledgment kaggle thanks vinay prabhu providing interesting dataset playground competition image reference httpswwwresearchgatenetfigurespeechforkannadanumbers_fig2_313113588", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Exploratory Data Analysis", "Convolutional Neural Network (CNN)"]}