{"title": "TReNDS Neuroimaging", "description": "Multiscanner normative age and assessments prediction with brain function, structure, and connectivityHuman brain research is among the most complex areas of study for scientists. We know that age and other factors can affect its function and structure, but more research is needed into what specifically occurs within the brain. With much of the research using MRI scans, data scientists are well positioned to support future insights. In particular, neuroimaging specialists look for measurable markers of behavior, health, or disorder to help identify relevant brain regions and their contribution to typical or symptomatic effects.  In this competition, you will predict multiple assessments plus age from multimodal brain MRI features. You will be working from existing results from other data scientists, doing the important work of validating the utility of multimodal features in a normative population of unaffected subjects. Due to the complexity of the brain and differences between scanners, generalized approaches will be essential to effectively propel multimodal neuroimaging research forward. The Tri-Institutional Georgia State University/Georgia Institute of Technology/Emory University Center for Translational Research in Neuroimaging and Data Science (TReNDS) leverages advanced brain imaging to promote research into brain health. The organization is focused on developing, applying and sharing advanced analytic approaches and neuroinformatics tools. Among its software projects are the GIFT and FIT neuroimaging toolboxes, the COINS data management system, and the COINSTAC toolkit for federated learning, all aimed at supporting data scientists and other neuroimaging researchers. Making the leap from research to clinical application is particularly difficult in brain health. In order to translate to clinical settings, research findings have to be reproduced consistently and validated in out-of-sample instances. The problem is particularly well-suited for data science, but current approaches typically do not generalize well. With this large dataset and competition, your efforts could directly address an important area of brain research. Acknowledgments", "link": "https://www.kaggle.com/c/trends-assessment-prediction", "tags": ["DL", "Feature Engineering", "Random Forest", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-06-30 01:59:00", "words": 305, "sentences": 15, "sum_nltk": "Multiscanner normative age and assessments prediction with brain function, structure, and connectivityHuman brain research is among the most complex areas of study for scientists.\nWe know that age and other factors can affect its function and structure, but more research is needed into what specifically occurs within the brain.\nWith much of the research using MRI scans, data scientists are well positioned to support future insights.\nIn this competition, you will predict multiple assessments plus age from multimodal brain MRI features.\nYou will be working from existing results from other data scientists, doing the important work of validating the utility of multimodal features in a normative population of unaffected subjects.\nDue to the complexity of the brain and differences between scanners, generalized approaches will be essential to effectively propel multimodal neuroimaging research forward.\nThe Tri-Institutional Georgia State University/Georgia Institute of Technology/Emory University Center for Translational Research in Neuroimaging and Data Science (TReNDS) leverages advanced brain imaging to promote research into brain health.\nMaking the leap from research to clinical application is particularly difficult in brain health.\nThe problem is particularly well-suited for data science, but current approaches typically do not generalize well.", "sum_nltk_words": 184, "sum_nltk_runtime": 0.004, "sum_t5": "a competition is being held to predict age and other features from MRI scans. john sutter: generalized approaches will be essential to propel multimodal neuroimaging research forward. he says making the leap from research to clinical application is particularly difficult in brain health. sutter: if you can predict age and other features, you will be able to help improve the quality of life. sutter: if you can predict age and other features, you will be able to improve the quality of", "sum_t5_words": 81, "sum_t5_runtime": 6.674, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.48905277252197266, "nltk_category_runtime": 18.056, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.7763584852218628, "nltk_subcategory_runtime": 27.389, "category": "Utilities", "category_score": 0.48905277252197266, "subcategory": "Judicial Applied", "subcategory_score": 0.7763584852218628, "runtime_cat": 45.445, "engagement_score": "0.648", "language_code": "en", "language": "english", "language_score": "0.999997187889568", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "multiscanner normative age assessment prediction brain function structure connectivityhuman brain research among complex area study scientist know age factor affect function structure research needed specifically occurs within brain much research using mri scan data scientist well positioned support future insight particular neuroimaging specialist look measurable marker behavior health disorder help identify relevant brain region contribution typical symptomatic effect competition predict multiple assessment plus age multimodal brain mri feature working existing result data scientist important work validating utility multimodal feature normative population unaffected subject due complexity brain difference scanner generalized approach essential effectively propel multimodal neuroimaging research forward triinstitutional georgia state universitygeorgia institute technologyemory university center translational research neuroimaging data science trend leverage advanced brain imaging promote research brain health organization focused developing applying sharing advanced analytic approach neuroinformatics tool among software project gift fit neuroimaging toolbox coin data management system coinstac toolkit federated learning aimed supporting data scientist neuroimaging researcher making leap research clinical application particularly difficult brain health order translate clinical setting research finding reproduced consistently validated outofsample instance problem particularly wellsuited data science current approach typically generalize well large dataset competition effort could directly address important area brain research acknowledgment", "tags_descriptive": ["Deep Learning (DL)", "Feature Engineering", "Random Forest", "Exploratory Data Analysis"]}