{"title": "Kuzushiji Recognition", "description": "Opening the door to a thousand years of Japanese cultureBuild a model to transcribe ancient Kuzushiji into contemporary Japanese characters Imagine the history contained in a thousand years of books. What stories are in those books? What knowledge can we learn from the world before our time? What was the weather like 500 years ago? What happened when Mt. Fuji erupted? How can one fold 100 cranes using only one piece of paper? The answers to these questions are in those books. Japan has millions of books and over a billion historical documents such as personal letters or diaries preserved nationwide. Most of them cannot be read by the majority of Japanese people living today because they were written in “Kuzushiji”. Even though Kuzushiji, a cursive writing style, had been used in Japan for over a thousand years, there are very few fluent readers of Kuzushiji today (only 0.01% of modern Japanese natives). Due to the lack of available human resources, there has been a great deal of interest in using Machine Learning to automatically recognize these historical texts and transcribe them into modern Japanese characters. Nevertheless, several challenges in Kuzushiji recognition have made the performance of existing systems extremely poor. (More information in About Kuzushiji) This is where you come in. The hosts need help from machine learning experts to transcribe Kuzushiji into contemporary Japanese characters. With your help, Center for Open Data in the Humanities (CODH) will be able to develop better algorithms for Kuzushiji recognition. The model is not only a great contribution to the machine learning community, but also a great help for making millions of documents more accessible and leading to new discoveries in Japanese history and culture.  Hosts Center for Open Data  in the Humanities (CODH)  conducts research and development to enhance access to humanities data using state-of-the-art technology in informatics and statistics. The National Institute of Japanese Literature (NIJL) is an institution which strives to serve researchers in the field of Japanese literature as well as those working in various other humanities, by collecting in one location a vast storage of materials related to Japanese literature gathered from all corners of the country.  The National Institute of Informatics (NII) is Japan's only general academic research institution seeking to create future value in the new discipline of informatics. NII seeks to advance integrated research and development activities in information-related fields, including networking, software, and content. Official Collaborators Mikel Bober-Irizar (anokas) Kaggle Grandmaster and Alex Lamb (MILA. Quebec Artificial Intelligence Institute)", "link": "https://www.kaggle.com/c/kuzushiji-recognition", "tags": ["DL", "CNN", "Exploratory Data Analysis", "CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-10-15 01:59:00", "words": 420, "sentences": 18, "sum_nltk": "Opening the door to a thousand years of Japanese cultureBuild a model to transcribe ancient Kuzushiji into contemporary Japanese characters Imagine the history contained in a thousand years of books.\nEven though Kuzushiji, a cursive writing style, had been used in Japan for over a thousand years, there are very few fluent readers of Kuzushiji today (only 0.01% of modern Japanese natives).\nDue to the lack of available human resources, there has been a great deal of interest in using Machine Learning to automatically recognize these historical texts and transcribe them into modern Japanese characters.\nThe hosts need help from machine learning experts to transcribe Kuzushiji into contemporary Japanese characters.\nWith your help, Center for Open Data in the Humanities (CODH) will be able to develop better algorithms for Kuzushiji recognition.\nThe model is not only a great contribution to the machine learning community, but also a great help for making millions of documents more accessible and leading to new discoveries in Japanese history and culture.\nThe National Institute of Informatics (NII) is Japan's only general academic research institution seeking to create future value in the new discipline of informatics.\nNII seeks to advance integrated research and development activities in information-related fields, including networking, software, and content.", "sum_nltk_words": 200, "sum_nltk_runtime": 0.005, "sum_t5": "a model will be developed to transcribe ancient Kuzushiji into contemporary Japanese characters. the model will be used by the center for open data in the humanities (CODH). the model will be used to make millions of documents more accessible. only 0.01% of modern Japanese natives are fluent readers of Kuzushiji. a total of 1.2 million books are currently in the public domain. a total of 1.2 billion documents are currently in the public domain.", "sum_t5_words": 75, "sum_t5_runtime": 6.777, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.4812118113040924, "nltk_category_runtime": 18.753, "nltk_subcategory": "General", "nltk_subcategory_score": 0.9478585720062256, "nltk_subcategory_runtime": 29.84, "category": "Education & Research", "category_score": 0.4812118113040924, "subcategory": "General", "subcategory_score": 0.9478585720062256, "runtime_cat": 48.594, "engagement_score": "0.574", "language_code": "en", "language": "english", "language_score": "0.999996729921718", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "opening door thousand year japanese culturebuild model transcribe ancient kuzushiji contemporary japanese character imagine history contained thousand year book story book knowledge learn world time weather like 500 year ago happened mt fuji erupted one fold 100 crane using one piece paper answer question book japan million book billion historical document personal letter diary preserved nationwide cannot read majority japanese people living today written kuzushiji even though kuzushiji cursive writing style used japan thousand year fluent reader kuzushiji today 001 modern japanese native due lack available human resource great deal interest using machine learning automatically recognize historical text transcribe modern japanese character nevertheless several challenge kuzushiji recognition made performance existing system extremely poor information kuzushiji come host need help machine learning expert transcribe kuzushiji contemporary japanese character help center open data humanity codh able develop better algorithm kuzushiji recognition model great contribution machine learning community also great help making million document accessible leading new discovery japanese history culture host center open data humanity codh conduct research development enhance access humanity data using stateoftheart technology informatics statistic national institute japanese literature nijl institution strives serve researcher field japanese literature well working various humanity collecting one location vast storage material related japanese literature gathered corner country national institute informatics nii japan general academic research institution seeking create future value new discipline informatics nii seek advance integrated research development activity informationrelated field including networking software content official collaborator mikel boberirizar anokas kaggle grandmaster alex lamb mila quebec artificial intelligence institute", "tags_descriptive": ["Deep Learning (DL)", "Convolutional Neural Network (CNN)", "Exploratory Data Analysis", "Computer Vision (CV)"]}