{"title": "Histopathologic Cancer Detection", "description": "Identify metastatic tissue in histopathologic scans of lymph node sectionsIn this competition, you must create an algorithm to identify metastatic cancer in small image patches taken from larger digital pathology scans. The data for this competition is a slightly modified version of the PatchCamelyon (PCam) benchmark dataset (the original PCam dataset contains duplicate images due to its probabilistic sampling, however, the version presented on Kaggle does not contain duplicates).   PCam is highly interesting for both its size, simplicity to get started on, and approachability. In the authors' words:   [PCam] packs the clinically-relevant task of metastasis detection into a straight-forward binary image classification task, akin to CIFAR-10 and MNIST. Models can easily be trained on a single GPU in a couple hours, and achieve competitive scores in the Camelyon16 tasks of tumor detection and whole-slide image diagnosis. Furthermore, the balance between task-difficulty and tractability makes it a prime suspect for fundamental machine learning research on topics as active learning, model uncertainty, and explainability.     Acknowledgements   Kaggle is hosting this competition for the machine learning community to use for fun and practice. This dataset was provided by Bas Veeling, with additional input from Babak Ehteshami Bejnordi, Geert Litjens, and Jeroen van der Laak.  You may view and download the official Pcam dataset from  GitHub. The data is provided under the CC0 License, following the license of Camelyon16. If you use PCam in a scientific publication, please reference the following papers: [1] B. S. Veeling, J. Linmans, J. Winkens, T. Cohen, M. Welling. \"Rotation Equivariant CNNs for Digital Pathology\".  arXiv:1806.03962 [2] Ehteshami Bejnordi et al. Diagnostic Assessment of Deep Learning Algorithms for Detection of Lymph Node Metastases in Women With Breast Cancer. JAMA: The Journal of the American Medical Association, 318(22), 2199–2210. doi:jama.2017.14585 Photo by Ousa Chea", "link": "https://www.kaggle.com/c/histopathologic-cancer-detection", "tags": ["DL", "Classification", "CV", "Classification", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-03-31 00:59:00", "words": 306, "sentences": 22, "sum_nltk": "Identify metastatic tissue in histopathologic scans of lymph node sectionsIn this competition, you must create an algorithm to identify metastatic cancer in small image patches taken from larger digital pathology scans.\nThe data for this competition is a slightly modified version of the PatchCamelyon (PCam) benchmark dataset (the original PCam dataset contains duplicate images due to its probabilistic sampling, however, the version presented on Kaggle does not contain duplicates).\nModels can easily be trained on a single GPU in a couple hours, and achieve competitive scores in the Camelyon16 tasks of tumor detection and whole-slide image diagnosis.\nAcknowledgements   Kaggle is hosting this competition for the machine learning community to use for fun and practice.\nThis dataset was provided by Bas Veeling, with additional input from Babak Ehteshami Bejnordi, Geert Litjens, and Jeroen van der Laak.\nYou may view and download the official Pcam dataset from  GitHub. The data is provided under the CC0 License, following the license of Camelyon16.\nIf you use PCam in a scientific publication, please reference the following papers: [1] B.\nDiagnostic Assessment of Deep Learning Algorithms for Detection of Lymph Node Metastases in Women With Breast Cancer.\nJAMA: The Journal of the American Medical Association, 318(22), 2199–2210.\ndoi:jama.2017.14585 Photo by Ousa Chea", "sum_nltk_words": 200, "sum_nltk_runtime": 0.004, "sum_t5": "a competition is being held to create an algorithm to identify metastatic cancer. the algorithm is based on a modified version of the patchcamelyon benchmark dataset. the data is provided under the CC0 License, following the license of Camelyon16. the competition is open to the machine learning community. a total of 142 people have entered the competition. a total of 142 people have entered. a total of 142 submissions are expected to be submitted.", "sum_t5_words": 74, "sum_t5_runtime": 6.859, "runtime": 0.004, "nltk_category": "Healthcare", "nltk_category_score": 0.28764158487319946, "nltk_category_runtime": 21.689, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8384168744087219, "nltk_subcategory_runtime": 35.39, "category": "Healthcare", "category_score": 0.28764158487319946, "subcategory": "Machine Learning", "subcategory_score": 0.8384168744087219, "runtime_cat": 57.081, "engagement_score": "0.653", "language_code": "en", "language": "english", "language_score": "0.9999971228407842", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify metastatic tissue histopathologic scan lymph node sectionsin competition must create algorithm identify metastatic cancer small image patch taken larger digital pathology scan data competition slightly modified version patchcamelyon pcam benchmark dataset original pcam dataset contains duplicate image due probabilistic sampling however version presented kaggle contain duplicate pcam highly interesting size simplicity get started approachability author word pcam pack clinicallyrelevant task metastasis detection straightforward binary image classification task akin cifar10 mnist model easily trained single gpu couple hour achieve competitive score camelyon16 task tumor detection wholeslide image diagnosis furthermore balance taskdifficulty tractability make prime suspect fundamental machine learning research topic active learning model uncertainty explainability acknowledgement kaggle hosting competition machine learning community use fun practice dataset provided ba veeling additional input babak ehteshami bejnordi geert litjens jeroen van der laak may view download official pcam dataset github data provided cc0 license following license camelyon16 use pcam scientific publication please reference following paper 1 b veeling j linmans j winkens cohen welling rotation equivariant cnns digital pathology arxiv180603962 2 ehteshami bejnordi et al diagnostic assessment deep learning algorithm detection lymph node metastasis woman breast cancer jama journal american medical association 31822 21992210 doijama201714585 photo ousa chea", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Computer Vision (CV)", "Classification", "Convolutional Neural Network (CNN)"]}