{"title": "TrackML Particle Tracking Challenge", "description": "High Energy Physics particle tracking in CERN detectorsTo explore what our universe is made of, scientists at CERN are colliding protons, essentially recreating mini big bangs, and meticulously observing these collisions with intricate silicon detectors. While orchestrating the collisions and observations is already a massive scientific accomplishment, analyzing the enormous amounts of data produced from the experiments is becoming an overwhelming challenge. Event rates have already reached hundreds of millions of collisions per second, meaning physicists must sift through tens of petabytes of data per year. And, as the resolution of detectors improve, ever better software is needed for real-time pre-processing and filtering of the most promising events, producing even more data. To help address this problem, a team of Machine Learning experts and physics scientists working at CERN (the world largest high energy physics laboratory),  has partnered with Kaggle and prestigious sponsors to answer the question: can machine learning assist high energy physics in discovering and characterizing new particles? Specifically, in this competition, you’re challenged to build an algorithm that quickly reconstructs particle tracks from 3D points left in the silicon detectors. This challenge consists of two phases:   The Accuracy phase has run on Kaggle from May to 13th August 2018 (Winners to be announced by end September). Here we’ll be focusing on the highest score, irrespective of the evaluation time. This phase is an official IEEE WCCI competition (Rio de Janeiro, Jul 2018).    The Throughput phase will run on Codalab starting in September 2018. Participants will submit their software which is evaluated by the platform. Incentive is on the throughput (or speed) of the evaluation while reaching a good score. This phase is an official NIPS competition (Montreal, Dec 2018).   All the necessary information for the Accuracy phase is available here on Kaggle site. The overall TrackML challenge web site is there.", "link": "https://www.kaggle.com/c/trackml-particle-identification", "tags": ["Exploratory Data Analysis", "Physics", "CLustering"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-08-14 01:59:00", "words": 312, "sentences": 14, "sum_nltk": "High Energy Physics particle tracking in CERN detectorsTo explore what our universe is made of, scientists at CERN are colliding protons, essentially recreating mini big bangs, and meticulously observing these collisions with intricate silicon detectors.\nWhile orchestrating the collisions and observations is already a massive scientific accomplishment, analyzing the enormous amounts of data produced from the experiments is becoming an overwhelming challenge.\nAnd, as the resolution of detectors improve, ever better software is needed for real-time pre-processing and filtering of the most promising events, producing even more data.\nSpecifically, in this competition, you’re challenged to build an algorithm that quickly reconstructs particle tracks from 3D points left in the silicon detectors.\nThis challenge consists of two phases:   The Accuracy phase has run on Kaggle from May to 13th August 2018 (Winners to be announced by end September).\nThis phase is an official IEEE WCCI competition (Rio de Janeiro, Jul 2018).\nThe Throughput phase will run on Codalab starting in September 2018.\nIncentive is on the throughput (or speed) of the evaluation while reaching a good score.\nThis phase is an official NIPS competition (Montreal, Dec 2018).\nAll the necessary information for the Accuracy phase is available here on Kaggle site.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.003, "sum_t5": "a team of machine learning experts and physics scientists have teamed with Kaggle to solve the problem of particle tracking. the aim of the competition is to build an algorithm that quickly reconstructs particle tracks from 3D points left in the silicon detectors. the highest score will be determined by the software that is evaluated by the platform. the overall trackML challenge web site is there... the overall challenge web site is there.. the overall trackML challenge web site is there.", "sum_t5_words": 81, "sum_t5_runtime": 6.3, "runtime": 0.003, "nltk_category": "Physics", "nltk_category_score": 0.9704037308692932, "nltk_category_runtime": 18.45, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.5484696626663208, "nltk_subcategory_runtime": 29.921, "category": "Physics", "category_score": 0.9704037308692932, "subcategory": "Student", "subcategory_score": 0.5484696626663208, "runtime_cat": 48.372, "engagement_score": "0.621", "language_code": "en", "language": "english", "language_score": "0.999995139663305", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "high energy physic particle tracking cern detectorsto explore universe made scientist cern colliding proton essentially recreating mini big bang meticulously observing collision intricate silicon detector orchestrating collision observation already massive scientific accomplishment analyzing enormous amount data produced experiment becoming overwhelming challenge event rate already reached hundred million collision per second meaning physicist must sift ten petabyte data per year resolution detector improve ever better software needed realtime preprocessing filtering promising event producing even data help address problem team machine learning expert physic scientist working cern world largest high energy physic laboratory partnered kaggle prestigious sponsor answer question machine learning assist high energy physic discovering characterizing new particle specifically competition youre challenged build algorithm quickly reconstructs particle track 3d point left silicon detector challenge consists two phase accuracy phase run kaggle may 13th august 2018 winner announced end september well focusing highest score irrespective evaluation time phase official ieee wcci competition rio de janeiro jul 2018 throughput phase run codalab starting september 2018 participant submit software evaluated platform incentive throughput speed evaluation reaching good score phase official nip competition montreal dec 2018 necessary information accuracy phase available kaggle site overall trackml challenge web site", "tags_descriptive": ["Exploratory Data Analysis", "Physics", "CLustering"]}