{"title": "Grupo Bimbo Inventory Demand", "description": "Maximize sales and minimize returns of bakery goodsPlanning a celebration is a balancing act of preparing just enough food to go around without being stuck eating the same leftovers for the next week. The key is anticipating how many guests will come. Grupo Bimbo must weigh similar considerations as it strives to meet daily consumer demand for fresh bakery products on the shelves of over 1 million stores along its 45,000 routes across Mexico.  Currently, daily inventory calculations are performed by direct delivery sales employees who must single-handedly predict the forces of supply, demand, and hunger based on their personal experiences with each store. With some breads carrying a one week shelf life, the acceptable margin for error is small. In this competition, Grupo Bimbo invites Kagglers to develop a model to accurately forecast inventory demand based on historical sales data. Doing so will make sure consumers of its over 100 bakery products aren’t staring at empty shelves, while also reducing the amount spent on refunds to store owners with surplus product unfit for sale.", "link": "https://www.kaggle.com/c/grupo-bimbo-inventory-demand", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-08-31 01:59:00", "words": 172, "sentences": 7, "runtime": 0.002, "description_category": "Accommodation & Food", "description_category_score": 0.7632548809051514, "description_category_runtime": 14.95, "description_subcategory": "Retail", "description_subcategory_score": 0.699214518070221, "description_subcategory_runtime": 23.434, "category": "Accommodation & Food", "category_score": 0.7632548809051514, "subcategory": "Retail", "subcategory_score": 0.699214518070221, "runtime_cat": 38.384, "engagement_score": "0.679", "language_code": "en", "language": "english", "language_score": "0.9999966870550816", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "maximize sale minimize return bakery goodsplanning celebration balancing act preparing enough food go around without stuck eating leftover next week key anticipating many guest come grupo bimbo must weigh similar consideration strives meet daily consumer demand fresh bakery product shelf 1 million store along 45000 route across mexico currently daily inventory calculation performed direct delivery sale employee must singlehandedly predict force supply demand hunger based personal experience store bread carrying one week shelf life acceptable margin error small competition grupo bimbo invite kagglers develop model accurately forecast inventory demand based historical sale data make sure consumer 100 bakery product arent staring empty shelf also reducing amount spent refund store owner surplus product unfit sale", "tags_descriptive": []}