{"title": "Human Protein Atlas Image Classification", "description": "Classify subcellular protein patterns in human cellsIn this competition, Kagglers will develop models capable of classifying mixed patterns of proteins in microscope images. The Human Protein Atlas will use these models to build a tool integrated with their smart-microscopy system to identify a protein's location(s) from a high-throughput image. Proteins are “the doers” in the human cell, executing many functions that together enable life. Historically, classification of proteins has been limited to single patterns in one or a few cell types, but in order to fully understand the complexity of the human cell, models must classify mixed patterns across a range of different human cells. Images visualizing proteins in cells are commonly used for biomedical research, and these cells could hold the key for the next breakthrough in medicine. However, thanks to advances in high-throughput microscopy, these images are generated at a far greater pace than what can be manually evaluated. Therefore, the need is greater than ever for automating biomedical image analysis to accelerate the understanding of human cells and disease.   Nature Methods has indicated interest in considering a paper discussing the outcome and approaches of the challenge. The Human Protein Atlas team would like to invite top performing teams to join as co-authors in the writing of this paper. Top performing teams will also be eligible to compete for the special prize. Additional information for both the special prize and co-authoring for Nature Methods will become available through the Discussion posts once the main competition is complete.    Acknowledgements  The Human Protein Atlas is a Sweden-based initiative aimed at mapping all human proteins in cells, tissues and organs. All the data in the knowledge resource is open access to allow anyone to pursue exploration of the human proteome. In a recent publication, the Human Protein Atlas team has demonstrated the promise of both citizen science and artificial intelligence approaches in describing the location of human proteins in images, however current results are yet to approach expert-level annotations (Sullivan et al, Nature Biotechnology, Oct 2018).", "link": "https://www.kaggle.com/c/human-protein-atlas-image-classification", "tags": ["DL", "CLustering", "CNN", "Transfer Learning", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-01-11 00:59:00", "words": 336, "sentences": 13, "sum_nltk": "Classify subcellular protein patterns in human cellsIn this competition, Kagglers will develop models capable of classifying mixed patterns of proteins in microscope images.\nThe Human Protein Atlas will use these models to build a tool integrated with their smart-microscopy system to identify a protein's location(s) from a high-throughput image.\nHistorically, classification of proteins has been limited to single patterns in one or a few cell types, but in order to fully understand the complexity of the human cell, models must classify mixed patterns across a range of different human cells.\nTherefore, the need is greater than ever for automating biomedical image analysis to accelerate the understanding of human cells and disease.\nThe Human Protein Atlas team would like to invite top performing teams to join as co-authors in the writing of this paper.\nAdditional information for both the special prize and co-authoring for Nature Methods will become available through the Discussion posts once the main competition is complete.\nIn a recent publication, the Human Protein Atlas team has demonstrated the promise of both citizen science and artificial intelligence approaches in describing the location of human proteins in images, however current results are yet to approach expert-level annotations (Sullivan et al, Nature Biotechnology, Oct 2018).", "sum_nltk_words": 197, "sum_nltk_runtime": 0.004, "sum_t5": "the Human Protein Atlas will use models to classify mixed patterns of proteins. the team will use their smart-microscopy system to identify a protein's location. images visualizing proteins in cells are commonly used for biomedical research. top performing teams will also be eligible to compete for the special prize. the human protein Atlas is a Sweden-based initiative aimed at mapping all human proteins. a swedish team will also be able to use the results of the competition to help improve human health", "sum_t5_words": 82, "sum_t5_runtime": 6.724, "runtime": 0.003, "nltk_category": "Healthcare", "nltk_category_score": 0.2559475302696228, "nltk_category_runtime": 17.964, "nltk_subcategory": "General", "nltk_subcategory_score": 0.36567336320877075, "nltk_subcategory_runtime": 27.891, "category": "Healthcare", "category_score": 0.2559475302696228, "subcategory": "General", "subcategory_score": 0.36567336320877075, "runtime_cat": 45.855, "engagement_score": "0.684", "language_code": "en", "language": "english", "language_score": "0.9999951750686985", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "classify subcellular protein pattern human cellsin competition kagglers develop model capable classifying mixed pattern protein microscope image human protein atlas use model build tool integrated smartmicroscopy system identify protein location highthroughput image protein doer human cell executing many function together enable life historically classification protein limited single pattern one cell type order fully understand complexity human cell model must classify mixed pattern across range different human cell image visualizing protein cell commonly used biomedical research cell could hold key next breakthrough medicine however thanks advance highthroughput microscopy image generated far greater pace manually evaluated therefore need greater ever automating biomedical image analysis accelerate understanding human cell disease nature method indicated interest considering paper discussing outcome approach challenge human protein atlas team would like invite top performing team join coauthor writing paper top performing team also eligible compete special prize additional information special prize coauthoring nature method become available discussion post main competition complete acknowledgement human protein atlas swedenbased initiative aimed mapping human protein cell tissue organ data knowledge resource open access allow anyone pursue exploration human proteome recent publication human protein atlas team demonstrated promise citizen science artificial intelligence approach describing location human protein image however current result yet approach expertlevel annotation sullivan et al nature biotechnology oct 2018", "tags_descriptive": ["Deep Learning (DL)", "CLustering", "Convolutional Neural Network (CNN)", "Transfer Learning", "Classification"]}