{"title": "Predict Grant Applications", "description": "This task requires participants to predict the outcome of grant applications for the University of Melbourne.Around the world, the pool of funds available for research grants is steadily shrinking (in a relative sense). In Australia, success rates have fallen to 20-25 per cent, meaning that most academics are spending valuable time making applications that end up being rejected. With this problem in mind, the University of Melbourne is hosting a competition to predict the success of grant applications. The winning model will be used by the university to predict which grant applications are likely to be successful, so that less time is wasted on applications that are unlikely to succeed. The university hopes the competition will also shed some light on what factors are important in determining whether an application will succeed. The university has provided a dataset containing 249 features, including variables that represent the size of the grant, the general area of study and de-identified information on the investigators who are applying for the grant. Participants train their models on 8,707 grant applications made between 2004 and 2008. They then make predictions on a further 2,176 applications made in 2009 and the first half of 2010.The winner of this competition will receive US$5,000. To be eligible for the prize, the winning method must be implementable by the University of Melbourne.", "link": "https://www.kaggle.com/c/unimelb", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2011-02-20 23:00:00", "words": 221, "sentences": 9, "sum_nltk": "This task requires participants to predict the outcome of grant applications for the University of Melbourne.Around the world, the pool of funds available for research grants is steadily shrinking (in a relative sense).\nIn Australia, success rates have fallen to 20-25 per cent, meaning that most academics are spending valuable time making applications that end up being rejected.\nWith this problem in mind, the University of Melbourne is hosting a competition to predict the success of grant applications.\nThe winning model will be used by the university to predict which grant applications are likely to be successful, so that less time is wasted on applications that are unlikely to succeed.\nThe university hopes the competition will also shed some light on what factors are important in determining whether an application will succeed.\nParticipants train their models on 8,707 grant applications made between 2004 and 2008.\nThey then make predictions on a further 2,176 applications made in 2009 and the first half of 2010.The winner of this competition will receive US$5,000.\nTo be eligible for the prize, the winning method must be implementable by the University of Melbourne.", "sum_nltk_words": 180, "sum_nltk_runtime": 0.003, "sum_t5": "the university of Melbourne is hosting a competition to predict the success of grant applications. the winning model will be used to predict which applications are likely to be successful. the university hopes the competition will shed some light on what factors are important in determining whether an application will succeed. the winner of this competition will receive US$5,000. the winning method must be implementable by the university of Melbourne. if the model is successful, the university will award the prize.", "sum_t5_words": 81, "sum_t5_runtime": 4.621, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.7476545572280884, "nltk_category_runtime": 15.922, "nltk_subcategory": "General", "nltk_subcategory_score": 0.7438918352127075, "nltk_subcategory_runtime": 24.9, "category": "Education & Research", "category_score": 0.7476545572280884, "subcategory": "General", "subcategory_score": 0.7438918352127075, "runtime_cat": 40.822, "engagement_score": "0.55", "language_code": "en", "language": "english", "language_score": "0.9999969560276232", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "task requires participant predict outcome grant application university melbournearound world pool fund available research grant steadily shrinking relative sense australia success rate fallen 2025 per cent meaning academic spending valuable time making application end rejected problem mind university melbourne hosting competition predict success grant application winning model used university predict grant application likely successful le time wasted application unlikely succeed university hope competition also shed light factor important determining whether application succeed university provided dataset containing 249 feature including variable represent size grant general area study deidentified information investigator applying grant participant train model 8707 grant application made 2004 2008 make prediction 2176 application made 2009 first half 2010the winner competition receive us5000 eligible prize winning method must implementable university melbourne", "tags_descriptive": []}