{"title": "Loan Default Prediction - Imperial College London", "description": "Constructing an optimal portfolio of loansThis competition asks you to determine whether a loan will default, as well as the loss incurred if it does default. Unlike traditional finance-based approaches to this problem, where one distinguishes between good or bad counterparties in a binary way, we seek to anticipate and incorporate both the default and the severity of the losses that result. In doing so, we are building a bridge between traditional banking, where we are looking at reducing the consumption of economic capital, to an asset-management perspective, where we optimize on the risk to the financial investor. This competition is sponsored by researchers at Imperial College London.", "link": "https://www.kaggle.com/c/loan-default-prediction", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2014-03-15 00:59:00", "words": 108, "sentences": 4, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.4087766408920288, "description_category_runtime": 9.474, "description_subcategory": "Preventative and Reactive", "description_subcategory_score": 0.5907227993011475, "description_subcategory_runtime": 14.508, "category": "Finance", "category_score": 0.4087766408920288, "subcategory": "Preventative and Reactive", "subcategory_score": 0.5907227993011475, "runtime_cat": 23.983, "engagement_score": "0.623", "language_code": "en", "language": "english", "language_score": "0.9999960598293988", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "constructing optimal portfolio loansthis competition asks determine whether loan default well loss incurred default unlike traditional financebased approach problem one distinguishes good bad counterparties binary way seek anticipate incorporate default severity loss result building bridge traditional banking looking reducing consumption economic capital assetmanagement perspective optimize risk financial investor competition sponsored researcher imperial college london", "tags_descriptive": []}