{"title": "iNaturalist 2019 at FGVC6", "description": "Fine-grained classification spanning a thousand speciesAs part of the FGVC6 workshop at CVPR 2019 we are conducting the iNat Challenge 2019 large scale species classification competition,  sponsored by Microsoft. It is estimated that the natural world contains several million species of plants and animals. Without expert knowledge, many of these species are extremely difficult to accurately classify due to their visual similarity. The goal of this competition is to push the state of the art in automatic image classification for real world data that features a large number of fine-grained categories. Previous versions of the challenge have focused on classifying large numbers of species. This year features a smaller number of highly similar categories captured in a wide variety of situations, from all over the world. In total, the iNat Challenge 2019 dataset contains 1,010 species, with a combined training and validation set of 268,243 images that have been collected and verified by multiple users from iNaturalist. Teams with top submissions, at the discretion of the workshop organizers, will be invited to present their work at the FGVC6 workshop.  Participants who make a submission that beats the sample submission can fill out this form to receive $150 in Google Cloud credits.   Kaggle is excited to partner with research groups to push forward the frontier of machine learning. Research competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team. Any questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "link": "https://www.kaggle.com/c/inaturalist-2019-fgvc6", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-06-11 01:59:00", "words": 257, "sentences": 12, "sum_nltk": "Fine-grained classification spanning a thousand speciesAs part of the FGVC6 workshop at CVPR 2019 we are conducting the iNat Challenge 2019 large scale species classification competition,  sponsored by Microsoft.\nIt is estimated that the natural world contains several million species of plants and animals.\nWithout expert knowledge, many of these species are extremely difficult to accurately classify due to their visual similarity.\nThe goal of this competition is to push the state of the art in automatic image classification for real world data that features a large number of fine-grained categories.\nPrevious versions of the challenge have focused on classifying large numbers of species.\nThis year features a smaller number of highly similar categories captured in a wide variety of situations, from all over the world.\nIn total, the iNat Challenge 2019 dataset contains 1,010 species, with a combined training and validation set of 268,243 images that have been collected and verified by multiple users from iNaturalist.\nResearch competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team.\nAny questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "sum_nltk_words": 186, "sum_nltk_runtime": 0.003, "sum_t5": "iNat Challenge 2019 is a large scale species classification competition. the competition is sponsored by Microsoft. participants who beat the sample submission can receive $150 in Google Cloud credits. the goal of the competition is to push the state of the art in automatic image classification. iNat Challenge 2019 dataset contains 1,010 species.. a total of 268,243 images have been collected and verified by multiple users from iNaturalist. a winner will be invited to present their work at the FGVC6", "sum_t5_words": 80, "sum_t5_runtime": 5.286, "runtime": 0.004, "nltk_category": "Education & Research", "nltk_category_score": 0.2880468964576721, "nltk_category_runtime": 16.745, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.5257487893104553, "nltk_subcategory_runtime": 26.443, "category": "Education & Research", "category_score": 0.2880468964576721, "subcategory": "Machine Learning", "subcategory_score": 0.5257487893104553, "runtime_cat": 43.188, "engagement_score": "0.553", "language_code": "en", "language": "english", "language_score": "0.9999958525291722", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "finegrained classification spanning thousand speciesas part fgvc6 workshop cvpr 2019 conducting inat challenge 2019 large scale specie classification competition sponsored microsoft estimated natural world contains several million specie plant animal without expert knowledge many specie extremely difficult accurately classify due visual similarity goal competition push state art automatic image classification real world data feature large number finegrained category previous version challenge focused classifying large number specie year feature smaller number highly similar category captured wide variety situation world total inat challenge 2019 dataset contains 1010 specie combined training validation set 268243 image collected verified multiple user inaturalist team top submission discretion workshop organizer invited present work fgvc6 workshop participant make submission beat sample submission fill form receive 150 google cloud credit kaggle excited partner research group push forward frontier machine learning research competition make use kaggles platform experience largely organized research group data science team question concern regarding competition data quality topic addressed", "tags_descriptive": []}