{"title": "Google Landmark Recognition Challenge", "description": "Label famous (and not-so-famous) landmarks in images[UPDATE] 2019 challenge launched: https://kaggle.com/c/landmark-recognition-2019 Did you ever go through your vacation photos and ask yourself: What is the name of this temple I visited in China? Who created this monument I saw in France? Landmark recognition can help! This technology can predict landmark labels directly from image pixels, to help people better understand and organize their photo collections. Today, a great obstacle to landmark recognition research is the lack of large annotated datasets. In this competition, we present the largest worldwide dataset to date, to foster progress in this problem. This competition challenges Kagglers to build models that recognize the correct landmark (if any) in a dataset of challenging test images. Many Kagglers are familiar with image classification challenges like the ImageNet Large Scale Visual Recognition Challenge (ILSVRC), which aims to recognize 1K general object categories. Landmark recognition is a little different from that: it contains a much larger number of classes (there are a total of 15K classes in this challenge), and the number of training examples per class may not be very large. Landmark recognition is challenging in its own way. This challenge is organized in conjunction with the Landmark Retrieval Challenge ( https://www.kaggle.com/c/landmark-retrieval-challenge ). In particular, note that the test set for both challenges is the same, to encourage participants to compete in both. We also encourage participants to use the training data from the recognition challenge to train models which could be useful for the retrieval challenge. Note, however, that there are no landmarks in common between the training/index sets of the two challenges.", "link": "https://www.kaggle.com/c/landmark-recognition-challenge", "tags": ["DL", "Exploratory Data Analysis", "CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-05-30 01:59:00", "words": 265, "sentences": 11, "sum_nltk": "Label famous (and not-so-famous) landmarks in images[UPDATE] 2019 challenge launched: https://kaggle.com/c/landmark-recognition-2019 Did you ever go through your vacation photos and ask yourself: What is the name of this temple I visited in China?\nThis technology can predict landmark labels directly from image pixels, to help people better understand and organize their photo collections.\nThis competition challenges Kagglers to build models that recognize the correct landmark (if any) in a dataset of challenging test images.\nMany Kagglers are familiar with image classification challenges like the ImageNet Large Scale Visual Recognition Challenge (ILSVRC), which aims to recognize 1K general object categories.\nLandmark recognition is a little different from that: it contains a much larger number of classes (there are a total of 15K classes in this challenge), and the number of training examples per class may not be very large.\nThis challenge is organized in conjunction with the Landmark Retrieval Challenge ( https://www.kaggle.com/c/landmark-retrieval-challenge ).\nIn particular, note that the test set for both challenges is the same, to encourage participants to compete in both.\nWe also encourage participants to use the training data from the recognition challenge to train models which could be useful for the retrieval challenge.\nNote, however, that there are no landmarks in common between the training/index sets of the two challenges.", "sum_nltk_words": 205, "sum_nltk_runtime": 0.003, "sum_t5": "this competition challenges Kagglers to build models that recognize landmarks in test images. the test set for both challenges is the same, to encourage participants to compete. there are no landmarks in common between the training/index sets of the two challenges. the competition is organized in conjunction with the Landmark Retrieval Challenge. a total of 15K classes are in this challenge. a total of 2,000 landmarks are recognized in the competition.", "sum_t5_words": 71, "sum_t5_runtime": 5.885, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.3052731156349182, "nltk_category_runtime": 20.853, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.614090621471405, "nltk_subcategory_runtime": 33.409, "category": "Education & Research", "category_score": 0.3052731156349182, "subcategory": "Machine Learning", "subcategory_score": 0.614090621471405, "runtime_cat": 54.266, "engagement_score": "0.604", "language_code": "en", "language": "english", "language_score": "0.9999976608187721", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "label famous notsofamous landmark imagesupdate 2019 challenge launched httpskagglecomclandmarkrecognition2019 ever go vacation photo ask name temple visited china created monument saw france landmark recognition help technology predict landmark label directly image pixel help people better understand organize photo collection today great obstacle landmark recognition research lack large annotated datasets competition present largest worldwide dataset date foster progress problem competition challenge kagglers build model recognize correct landmark dataset challenging test image many kagglers familiar image classification challenge like imagenet large scale visual recognition challenge ilsvrc aim recognize 1k general object category landmark recognition little different contains much larger number class total 15k class challenge number training example per class may large landmark recognition challenging way challenge organized conjunction landmark retrieval challenge httpswwwkagglecomclandmarkretrievalchallenge particular note test set challenge encourage participant compete also encourage participant use training data recognition challenge train model could useful retrieval challenge note however landmark common trainingindex set two challenge", "tags_descriptive": ["Deep Learning (DL)", "Exploratory Data Analysis", "Computer Vision (CV)"]}