{"title": "Dstl Satellite Imagery Feature Detection", "description": "Can you train an eye in the sky?The proliferation of satellite imagery has given us a radically improved understanding of our planet. It has enabled us to better achieve everything from mobilizing resources during disasters to monitoring effects of global warming. What is often taken for granted is that advancements such as these have relied on labeling features of significance like building footprints and roadways fully by hand or through imperfect semi-automated methods. As these large, complex datasets continue to increase exponentially in number, the Defence Science and Technology Laboratory (Dstl) is seeking novel solutions to alleviate the burden on their image analysts. In this competition, Kagglers are challenged to accurately classify features in overhead imagery. Automating feature labeling will not only help Dstl make smart decisions more quickly around the defense and security of the UK, but also bring innovation to computer vision methodologies applied to satellite imagery.", "link": "https://www.kaggle.com/c/dstl-satellite-imagery-feature-detection", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-03-08 00:59:00", "words": 145, "sentences": 6, "runtime": 0.001, "description_category": "Government and Public Works", "description_category_score": 0.16580542922019958, "description_category_runtime": 13.087, "description_subcategory": "Physical", "description_subcategory_score": 0.41527366638183594, "description_subcategory_runtime": 19.912, "category": "Government and Public Works", "category_score": 0.16580542922019958, "subcategory": "Physical", "subcategory_score": 0.41527366638183594, "runtime_cat": 33.0, "engagement_score": "0.596", "language_code": "en", "language": "english", "language_score": "0.9999963884853036", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "train eye skythe proliferation satellite imagery given u radically improved understanding planet enabled u better achieve everything mobilizing resource disaster monitoring effect global warming often taken granted advancement relied labeling feature significance like building footprint roadway fully hand imperfect semiautomated method large complex datasets continue increase exponentially number defence science technology laboratory dstl seeking novel solution alleviate burden image analyst competition kagglers challenged accurately classify feature overhead imagery automating feature labeling help dstl make smart decision quickly around defense security uk also bring innovation computer vision methodology applied satellite imagery", "tags_descriptive": []}