{"title": "Don't call me turkey!", "description": "Thanksgiving Edition: Find the turkey in the sound biteHungry for a new competition? Give thanks for this opportunity to avoid those awkward family political dinner discussions and endless holiday movie marathons over the Thanksgiving break. Spend time with your Kaggle family instead to find the real turkey!  In this competition you are tasked with finding the turkey sound signature from pre-extracted audio features. A simple binary problem, or is it? What does a turkey really sound like? How many sounds are similar? Will you be able to find the turkey or will you go a-fowl?  This is a short, fun, holiday, playground competition. Please, do not ruin the fun for yourself and for everyone by using a model trained on the answers.  Don't be a turkey!", "link": "https://www.kaggle.com/c/dont-call-me-turkey", "tags": ["DL", "Classification", "Xgboost", "Exploratory Data Analysis", "Keras", "LSTM"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-11-27 00:59:00", "words": 129, "sentences": 5, "runtime": 0.002, "description_category": "Agriculture", "description_category_score": 0.13393597304821014, "description_category_runtime": 11.367, "description_subcategory": "Quality", "description_subcategory_score": 0.6139298677444458, "description_subcategory_runtime": 17.654, "category": "Agriculture", "category_score": 0.13393597304821014, "subcategory": "Quality", "subcategory_score": 0.6139298677444458, "runtime_cat": 29.02, "engagement_score": "0.568", "language_code": "en", "language": "english", "language_score": "0.999996737993896", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "thanksgiving edition find turkey sound bitehungry new competition give thanks opportunity avoid awkward family political dinner discussion endless holiday movie marathon thanksgiving break spend time kaggle family instead find real turkey competition tasked finding turkey sound signature preextracted audio feature simple binary problem turkey really sound like many sound similar able find turkey go afowl short fun holiday playground competition please ruin fun everyone using model trained answer dont turkey", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Xgboost", "Exploratory Data Analysis", "Keras", "Long short-term memory (LSTM)"]}