{"title": "Walmart Recruiting - Store Sales Forecasting", "description": "Use historical markdown data to predict store salesOne challenge of modeling retail data is the need to make decisions based on limited history. If Christmas comes but once a year, so does the chance to see how strategic decisions impacted the bottom line.  In this recruiting competition, job-seekers are provided with historical sales data for 45 Walmart stores located in different regions. Each store contains many departments, and participants must project the sales for each department in each store. To add to the challenge, selected holiday markdown events are included in the dataset. These markdowns are known to affect sales, but it is challenging to predict which departments are affected and the extent of the impact. Want to work in a great environment with some of the world's largest data sets? This is a chance to display your modeling mettle to the Walmart hiring teams. This competition counts towards rankings & achievements.  If you wish to be considered for an interview at Walmart, check the box \"Allow host to contact me\" when you make your first entry.  You must compete as an individual in recruiting competitions. You may only use the provided data to make your predictions.", "link": "https://www.kaggle.com/c/walmart-recruiting-store-sales-forecasting", "tags": ["Xgboost", "Random Forest", "Regression"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2014-05-06 01:59:00", "words": 197, "sentences": 10, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.4448006749153137, "description_category_runtime": 15.894, "description_subcategory": "Retail", "description_subcategory_score": 0.8329483866691589, "description_subcategory_runtime": 25.39, "category": "Wholesale & Retail", "category_score": 0.4448006749153137, "subcategory": "Retail", "subcategory_score": 0.8329483866691589, "runtime_cat": 41.284, "engagement_score": "0.625", "language_code": "en", "language": "english", "language_score": "0.9999968290068698", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "use historical markdown data predict store salesone challenge modeling retail data need make decision based limited history christmas come year chance see strategic decision impacted bottom line recruiting competition jobseekers provided historical sale data 45 walmart store located different region store contains many department participant must project sale department store add challenge selected holiday markdown event included dataset markdowns known affect sale challenging predict department affected extent impact want work great environment world largest data set chance display modeling mettle walmart hiring team competition count towards ranking achievement wish considered interview walmart check box allow host contact make first entry must compete individual recruiting competition may use provided data make prediction", "tags_descriptive": ["Xgboost", "Random Forest", "Regression"]}