{"title": "Open Images Instance Segmentation RVC 2020 edition", "description": "Outline segmentation masks of objects in imagesIntroduction Computer vision has advanced considerably but is still challenged in matching the precision of human perception. Open Images is a collaborative release of ~9 million images annotated with image-level labels, object bounding boxes, object segmentation masks, visual relationships, and localized narratives. This uniquely large and diverse dataset is designed to spur state of the art advances in analyzing and understanding images. This year the Open Images  Instance Segmentation competition is a part of the larger Robust Vision Challenge 2020. This challenge encourages the participants to develop robust computer vision algorithms able to perform well across multiple datasets. Please refer to the RVC 2020 page and the Open Images Challenge page for more details.  Participants are also welcome to submit to this playground competition beyond the context of RVC. Instance Segmentation Track In this track of the Challenge, you are asked to provide segmentation masks of objects. This track’s training set represents 2.1M segmentation masks for object instances in 300 categories; with a validation set containing an additional 23k masks. The train set masks were produced by our state-of-the-art interactive segmentation process, where professional human annotators iteratively correct the output of a segmentation neural network. The validation and test set masks have been annotated manually with a strong focus on quality.   Example train set annotations. Left: Wuxi science park, 1995 by Gary Stevens. Right: Cat Cafe Shinjuku calico by Ari Helminen. Both images used under CC BY 2.0 license.  The training data, format, and submission modalities are identical to the 2019 Open Images Challenge.", "link": "https://www.kaggle.com/c/open-images-instance-segmentation-rvc-2020", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-08-14 18:00:00", "words": 265, "sentences": 16, "sum_nltk": "Outline segmentation masks of objects in imagesIntroduction Computer vision has advanced considerably but is still challenged in matching the precision of human perception.\nOpen Images is a collaborative release of ~9 million images annotated with image-level labels, object bounding boxes, object segmentation masks, visual relationships, and localized narratives.\nThis year the Open Images  Instance Segmentation competition is a part of the larger Robust Vision Challenge 2020.\nThis challenge encourages the participants to develop robust computer vision algorithms able to perform well across multiple datasets.\nPlease refer to the RVC 2020 page and the Open Images Challenge page for more details.\nInstance Segmentation Track In this track of the Challenge, you are asked to provide segmentation masks of objects.\nThis track’s training set represents 2.1M segmentation masks for object instances in 300 categories; with a validation set containing an additional 23k masks.\nThe train set masks were produced by our state-of-the-art interactive segmentation process, where professional human annotators iteratively correct the output of a segmentation neural network.\nThe validation and test set masks have been annotated manually with a strong focus on quality.\nExample train set annotations.\nThe training data, format, and submission modalities are identical to the 2019 Open Images Challenge.", "sum_nltk_words": 192, "sum_nltk_runtime": 0.004, "sum_t5": "open images is a collaborative release of 9 million images annotated with image-level labels, object bounding boxes, object segmentation masks, visual relationships, and localized narratives. this year the Open Images Instance Segmentation competition is a part of the larger Robust Vision Challenge 2020. this challenge encourages the participants to develop robust computer vision algorithms able to perform well across multiple datasets. participants are also welcome to submit to this playground competition beyond the context of RVC 2020.", "sum_t5_words": 77, "sum_t5_runtime": 6.296, "runtime": 0.005, "nltk_category": "Construction & Engineering", "nltk_category_score": 0.12780283391475677, "nltk_category_runtime": 18.514, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.23684406280517578, "nltk_subcategory_runtime": 29.415, "category": "Construction & Engineering", "category_score": 0.12780283391475677, "subcategory": "Student", "subcategory_score": 0.23684406280517578, "runtime_cat": 47.929, "engagement_score": "0.357", "language_code": "en", "language": "english", "language_score": "0.9999964662397713", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "outline segmentation mask object imagesintroduction computer vision advanced considerably still challenged matching precision human perception open image collaborative release 9 million image annotated imagelevel label object bounding box object segmentation mask visual relationship localized narrative uniquely large diverse dataset designed spur state art advance analyzing understanding image year open image instance segmentation competition part larger robust vision challenge 2020 challenge encourages participant develop robust computer vision algorithm able perform well across multiple datasets please refer rvc 2020 page open image challenge page detail participant also welcome submit playground competition beyond context rvc instance segmentation track track challenge asked provide segmentation mask object track training set represents 21m segmentation mask object instance 300 category validation set containing additional 23k mask train set mask produced stateoftheart interactive segmentation process professional human annotator iteratively correct output segmentation neural network validation test set mask annotated manually strong focus quality example train set annotation left wuxi science park 1995 gary stevens right cat cafe shinjuku calico ari helminen image used cc 20 license training data format submission modality identical 2019 open image challenge", "tags_descriptive": []}