{"title": "Home Credit Default Risk", "description": "Can you predict how capable each applicant is of repaying a loan?Many people struggle to get loans due to insufficient or non-existent credit histories. And, unfortunately, this population is often taken advantage of by untrustworthy lenders.  Home Credit strives to broaden financial inclusion for the unbanked population by providing a positive and safe borrowing experience. In order to make sure this underserved population has a positive loan experience, Home Credit makes use of a variety of alternative data--including telco and transactional information--to predict their clients' repayment abilities. While Home Credit is currently using various statistical and machine learning methods to make these predictions, they're challenging Kagglers to help them unlock the full potential of their data. Doing so will ensure that clients capable of repayment are not rejected and that loans are given with a principal, maturity, and repayment calendar that will empower their clients to be successful.", "link": "https://www.kaggle.com/c/home-credit-default-risk", "tags": ["DL", "Finance", "Classification", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-08-30 01:59:00", "words": 149, "sentences": 6, "runtime": 0.002, "description_category": "Finance", "description_category_score": 0.7439022660255432, "description_category_runtime": 12.779, "description_subcategory": "Quality", "description_subcategory_score": 0.5944926142692566, "description_subcategory_runtime": 19.761, "category": "Finance", "category_score": 0.7439022660255432, "subcategory": "Quality", "subcategory_score": 0.5944926142692566, "runtime_cat": 32.541, "engagement_score": "0.736", "language_code": "en", "language": "english", "language_score": "0.9999957773808263", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict capable applicant repaying loanmany people struggle get loan due insufficient nonexistent credit history unfortunately population often taken advantage untrustworthy lender home credit strives broaden financial inclusion unbanked population providing positive safe borrowing experience order make sure underserved population positive loan experience home credit make use variety alternative dataincluding telco transactional informationto predict client repayment ability home credit currently using various statistical machine learning method make prediction theyre challenging kagglers help unlock full potential data ensure client capable repayment rejected loan given principal maturity repayment calendar empower client successful", "tags_descriptive": ["Deep Learning (DL)", "Finance", "Classification", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting"]}