{"title": "ALASKA2 Image Steganalysis", "description": "Detect secret data hidden within digital imagesThat file you downloaded may contain hidden messages that aren’t part of its regular contents. The same technology employed for digital watermarking is also misused by crime rings. Law enforcement must now use steganalysis to detect these messages as part of their investigations. Machine learning is an important tool in the discovery of this secret data.  Current methods produce unreliable results, raising false alarms. One reason for inaccuracy is the many different devices and processing combinations. Yet, detection models are trained on a homogeneous dataset. To increase accuracy, researchers must put data hidden within digital images “into the wild” (hence the name ALASKA) to mimic real world conditions. In the competition, you’ll create an efficient and reliable method to detect secret data hidden within innocuous-seeming digital images. Rather than limiting the data source, these images have been acquired with as many as 50 different cameras (from smartphone to full-format high end) and processed in different fashions. Successful entries will include robust detection algorithms with minimal false positives. The IEEE WIFS (Workshop on Information Forensics and Security) is eager to make this happen again, as a follow up to the ALASKA#1 Challenge. WIFS is an annual event where researchers gather to discuss emerging challenges, exchange fresh ideas, and share state-of-the-art results and technical expertise in the areas of information security and forensics. WIFS has teamed up with Troyes University of Technology, CRIStAL Lab, Lille University, and CNRS to enable more accurate steganalysis.  Law enforcement officers need better methods to combat criminals using hidden messages. The data science community and other researchers can help with better automated detection. More accurate methods could help catch criminals whose communications are hidden in plain sight.  The challenge is organized by Rémi COGRANNE (UTT), Patrick BAS (CRIStAL / CNRS) and Quentin Giboulot (UTT) ; in addition to Kaggle, we have been greatly helped by the following sponsors:", "link": "https://www.kaggle.com/c/alaska2-image-steganalysis", "tags": ["DL", "Ensembling", "Feature Engineering", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-07-21 01:59:00", "words": 320, "sentences": 18, "sum_nltk": "Detect secret data hidden within digital imagesThat file you downloaded may contain hidden messages that aren’t part of its regular contents.\nLaw enforcement must now use steganalysis to detect these messages as part of their investigations.\nTo increase accuracy, researchers must put data hidden within digital images “into the wild” (hence the name ALASKA) to mimic real world conditions.\nIn the competition, you’ll create an efficient and reliable method to detect secret data hidden within innocuous-seeming digital images.\nThe IEEE WIFS (Workshop on Information Forensics and Security) is eager to make this happen again, as a follow up to the ALASKA#1 Challenge.\nWIFS is an annual event where researchers gather to discuss emerging challenges, exchange fresh ideas, and share state-of-the-art results and technical expertise in the areas of information security and forensics.\nWIFS has teamed up with Troyes University of Technology, CRIStAL Lab, Lille University, and CNRS to enable more accurate steganalysis.\nLaw enforcement officers need better methods to combat criminals using hidden messages.\nThe data science community and other researchers can help with better automated detection.\nMore accurate methods could help catch criminals whose communications are hidden in plain sight.", "sum_nltk_words": 182, "sum_nltk_runtime": 0.005, "sum_t5": "the same technology employed for digital watermarking is also misused by crime rings. law enforcement must now use steganalysis to detect these messages. current methods produce unreliable results, raising false alarms. to increase accuracy, researchers must put data hidden within digital images \"into the wild\" to mimic real world conditions. the IEEE WIFS is eager to make this happen again, as a follow up to the ALASKA#1 Challenge.", "sum_t5_words": 68, "sum_t5_runtime": 6.129, "runtime": 0.0, "nltk_category": "Justice, Law and Regulations", "nltk_category_score": 0.7027686834335327, "nltk_category_runtime": 18.457, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.7702505588531494, "nltk_subcategory_runtime": 28.968, "category": "Justice, Law and Regulations", "category_score": 0.7027686834335327, "subcategory": "Judicial Applied", "subcategory_score": 0.7702505588531494, "runtime_cat": 47.428, "engagement_score": "0.65", "language_code": "en", "language": "english", "language_score": "0.9999978502238985", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "detect secret data hidden within digital imagesthat file downloaded may contain hidden message arent part regular content technology employed digital watermarking also misused crime ring law enforcement must use steganalysis detect message part investigation machine learning important tool discovery secret data current method produce unreliable result raising false alarm one reason inaccuracy many different device processing combination yet detection model trained homogeneous dataset increase accuracy researcher must put data hidden within digital image wild hence name alaska mimic real world condition competition youll create efficient reliable method detect secret data hidden within innocuousseeming digital image rather limiting data source image acquired many 50 different camera smartphone fullformat high end processed different fashion successful entry include robust detection algorithm minimal false positive ieee wifs workshop information forensics security eager make happen follow alaska1 challenge wifs annual event researcher gather discus emerging challenge exchange fresh idea share stateoftheart result technical expertise area information security forensics wifs teamed troyes university technology cristal lab lille university cnrs enable accurate steganalysis law enforcement officer need better method combat criminal using hidden message data science community researcher help better automated detection accurate method could help catch criminal whose communication hidden plain sight challenge organized remi cogranne utt patrick ba cristal cnrs quentin giboulot utt addition kaggle greatly helped following sponsor", "tags_descriptive": ["Deep Learning (DL)", "Ensembling", "Feature Engineering", "Convolutional Neural Network (CNN)"]}