{"title": "Painter by Numbers", "description": "Does every painter leave a fingerprint?With an original Picasso carrying a 106 million dollar price tag, identifying an authentic work of art from a forgery is a high-stakes industry. While algorithms have gotten good at telling us if a still life is of a basket of apples or a sunflower bouquet, they aren't yet able to tell us with certainty if both paintings are by van Gogh.   In this playground competition, we're challenging Kagglers to examine pairs of paintings and determine if they are by the same artist. This is an excellent opportunity to improve your computer vision skills and engage with a unique dataset of art. From the movement of brushstrokes to the use of light and dark, successful algorithms will likely incorporate many aspects of a painter's unique style.  Resources  neural algorithm How Do We See Art: An Eye-Tracker Study  Acknowledgments Many of the images in this dataset were obtained from wikiart.org. Additional paintings were provided by artists whose contributions will be acknowledged at the close of the competition. This playground competition and its datasets were prepared by Small Yellow Duck (Kiri Nichol). This includes the design of the pairwise-evaluation scheme.", "link": "https://www.kaggle.com/c/painter-by-numbers", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-11-01 00:59:00", "words": 188, "sentences": 5, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.1754532754421234, "description_category_runtime": 17.158, "description_subcategory": "Student", "description_subcategory_score": 0.3494614362716675, "description_subcategory_runtime": 27.42, "category": "Education & Research", "category_score": 0.1754532754421234, "subcategory": "Student", "subcategory_score": 0.3494614362716675, "runtime_cat": 44.578, "engagement_score": "0.429", "language_code": "en", "language": "english", "language_score": "0.999997132177496", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "every painter leave fingerprintwith original picasso carrying 106 million dollar price tag identifying authentic work art forgery highstakes industry algorithm gotten good telling u still life basket apple sunflower bouquet arent yet able tell u certainty painting van gogh playground competition challenging kagglers examine pair painting determine artist excellent opportunity improve computer vision skill engage unique dataset art movement brushstrokes use light dark successful algorithm likely incorporate many aspect painter unique style resource neural algorithm see art eyetracker study acknowledgment many image dataset obtained wikiartorg additional painting provided artist whose contribution acknowledged close competition playground competition datasets prepared small yellow duck kiri nichol includes design pairwiseevaluation scheme", "tags_descriptive": []}