{"title": "Denoising Dirty Documents", "description": "Remove noise from printed textOptical Character Recognition (OCR) is the process of getting type or handwritten documents into a digitized format. If you've read a classic novel on a digital reading device or had your doctor pull up old healthcare records via the hospital computer system, you've probably benefited from OCR. OCR makes previously static content editable, searchable, and much easier to share. But, a lot of documents eager for digitization are being held back. Coffee stains, faded sun spots, dog-eared pages, and lot of wrinkles are keeping some printed documents offline and in the past.  This competition challenges you to give these documents a machine learning makeover. Given a dataset of images of scanned text that has seen better days, you're challenged to remove the noise. Improving the ease of document enhancement will help us get that rare mathematics book on our e-reader before the next beach vacation. We've kicked off the fun with a few handy scripts to get you started on the dataset. Acknowledgements Kaggle is hosting this competition for the machine learning community to use for fun and practice. This dataset was created by RM.J. Castro-Bleda, S. España-Boquera, J. Pastor-Pellicer, F. Zamora-Martinez. We also thank the UCI machine learning repository for hosting the dataset. If you use the problem in publication, please cite: Bache, K. & Lichman, M. (2013). UCI Machine Learning Repository. Irvine, CA: University of California, School of Information and Computer Science", "link": "https://www.kaggle.com/c/denoising-dirty-documents", "tags": ["DL", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-10-06 01:59:00", "words": 223, "sentences": 20, "sum_nltk": "Remove noise from printed textOptical Character Recognition (OCR) is the process of getting type or handwritten documents into a digitized format.\nIf you've read a classic novel on a digital reading device or had your doctor pull up old healthcare records via the hospital computer system, you've probably benefited from OCR.\nBut, a lot of documents eager for digitization are being held back.\nCoffee stains, faded sun spots, dog-eared pages, and lot of wrinkles are keeping some printed documents offline and in the past.\nThis competition challenges you to give these documents a machine learning makeover.\nGiven a dataset of images of scanned text that has seen better days, you're challenged to remove the noise.\nImproving the ease of document enhancement will help us get that rare mathematics book on our e-reader before the next beach vacation.\nWe've kicked off the fun with a few handy scripts to get you started on the dataset.\nAcknowledgements Kaggle is hosting this competition for the machine learning community to use for fun and practice.\nThis dataset was created by RM.J. Castro-Bleda, S.\nWe also thank the UCI machine learning repository for hosting the dataset.\nUCI Machine Learning Repository.", "sum_nltk_words": 169, "sum_nltk_runtime": 0.003, "sum_t5": "a competition challenges you to give scanned documents a machine learning makeover. coffee stains, faded sun spots, dog-eared pages, and lot of wrinkles are keeping some printed documents offline. the dataset was created by RM. Castro-Bleda, S. Espaa-Boquera, J. Pastor-Pellicer, F. Zamora-Martinez. the winner will be announced on november 8.", "sum_t5_words": 50, "sum_t5_runtime": 5.836, "runtime": 0.002, "nltk_category": "Utilities", "nltk_category_score": 0.7596263289451599, "nltk_category_runtime": 18.986, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9234030842781067, "nltk_subcategory_runtime": 30.108, "category": "Utilities", "category_score": 0.7596263289451599, "subcategory": "Machine Learning", "subcategory_score": 0.9234030842781067, "runtime_cat": 49.094, "engagement_score": "0.534", "language_code": "en", "language": "english", "language_score": "0.9999962589725366", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "remove noise printed textoptical character recognition ocr process getting type handwritten document digitized format youve read classic novel digital reading device doctor pull old healthcare record via hospital computer system youve probably benefited ocr ocr make previously static content editable searchable much easier share lot document eager digitization held back coffee stain faded sun spot dogeared page lot wrinkle keeping printed document offline past competition challenge give document machine learning makeover given dataset image scanned text seen better day youre challenged remove noise improving ease document enhancement help u get rare mathematics book ereader next beach vacation weve kicked fun handy script get started dataset acknowledgement kaggle hosting competition machine learning community use fun practice dataset created rmj castrobleda espanaboquera j pastorpellicer f zamoramartinez also thank uci machine learning repository hosting dataset use problem publication please cite bache k lichman 2013 uci machine learning repository irvine ca university california school information computer science", "tags_descriptive": ["Deep Learning (DL)", "Convolutional Neural Network (CNN)"]}