{"title": "Bosch Production Line Performance", "description": "Reduce manufacturing failuresA good chocolate soufflé is decadent, delicious, and delicate. But, it's a challenge to prepare. When you pull a disappointingly deflated dessert out of the oven, you instinctively retrace your steps to identify at what point you went wrong. Bosch, one of the world's leading manufacturing companies, has an imperative to ensure that the recipes for the production of its advanced mechanical components are of the highest quality and safety standards. Part of doing so is closely monitoring its parts as they progress through the manufacturing processes.  Because Bosch records data at every step along its assembly lines, they have the ability to apply advanced analytics to improve these manufacturing processes. However, the intricacies of the data and complexities of the production line pose problems for current methods. In this competition, Bosch is challenging Kagglers to predict internal failures using thousands of measurements and tests made for each component along the assembly line. This would enable Bosch to bring quality products at lower costs to the end user.", "link": "https://www.kaggle.com/c/bosch-production-line-performance", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-11-12 00:59:00", "words": 168, "sentences": 9, "runtime": 0.0, "description_category": "Manufacturing", "description_category_score": 0.9156089425086975, "description_category_runtime": 15.347, "description_subcategory": "Quality", "description_subcategory_score": 0.8394461870193481, "description_subcategory_runtime": 23.133, "category": "Manufacturing", "category_score": 0.9156089425086975, "subcategory": "Quality", "subcategory_score": 0.8394461870193481, "runtime_cat": 38.48, "engagement_score": "0.662", "language_code": "en", "language": "english", "language_score": "0.9999977063138665", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "reduce manufacturing failuresa good chocolate souffle decadent delicious delicate challenge prepare pull disappointingly deflated dessert oven instinctively retrace step identify point went wrong bosch one world leading manufacturing company imperative ensure recipe production advanced mechanical component highest quality safety standard part closely monitoring part progress manufacturing process bosch record data every step along assembly line ability apply advanced analytics improve manufacturing process however intricacy data complexity production line pose problem current method competition bosch challenging kagglers predict internal failure using thousand measurement test made component along assembly line would enable bosch bring quality product lower cost end user", "tags_descriptive": []}