{"title": "Dogs vs. Cats Redux: Kernels Edition", "description": "Distinguish images of dogs from catsIn 2013, we hosted one of our favorite for-fun competitions:  Dogs vs. Cats. Much has since changed in the machine learning landscape, particularly in deep learning and image analysis. Back then, a tensor flow was the diffusion of the creamer in a bored mathematician's cup of coffee. Now, even the cucumber farmers are neural netting their way to a bounty. Much has changed at Kaggle as well. Our online coding environment Kernels didn't exist in 2013, and so it was that we approached sharing by scratching primitive glpyhs on cave walls with sticks and sharp objects. No more. Now, Kernels have taken over as the way to share code on Kaggle. IPython is out and Jupyter Notebook is in. We even have TensorFlow. What more could a data scientist ask for? But seriously, what more? Pull requests welcome.  We are excited to bring back the infamous Dogs vs. Cats classification problem as a playground competition with kernels enabled. Although modern techniques may make light of this once-difficult problem, it is through practice of new techniques on old datasets that we will make light of machine learning's future challenges.", "link": "https://www.kaggle.com/c/dogs-vs-cats-redux-kernels-edition", "tags": ["Classification", "CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-03-03 00:59:00", "words": 182, "sentences": 13, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.23961985111236572, "description_category_runtime": 18.184, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8412549495697021, "description_subcategory_runtime": 29.399, "category": "Education & Research", "category_score": 0.23961985111236572, "subcategory": "Machine Learning", "subcategory_score": 0.8412549495697021, "runtime_cat": 47.582, "engagement_score": "0.659", "language_code": "en", "language": "english", "language_score": "0.9999976930640941", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "distinguish image dog catsin 2013 hosted one favorite forfun competition dog v cat much since changed machine learning landscape particularly deep learning image analysis back tensor flow diffusion creamer bored mathematician cup coffee even cucumber farmer neural netting way bounty much changed kaggle well online coding environment kernel didnt exist 2013 approached sharing scratching primitive glpyhs cave wall stick sharp object kernel taken way share code kaggle ipython jupyter notebook even tensorflow could data scientist ask seriously pull request welcome excited bring back infamous dog v cat classification problem playground competition kernel enabled although modern technique may make light oncedifficult problem practice new technique old datasets make light machine learning future challenge", "tags_descriptive": ["Classification", "Computer Vision (CV)"]}