{"title": "Microsoft Malware Prediction", "description": "Can you predict if a machine will soon be hit with malware?The malware industry continues to be a well-organized, well-funded market dedicated to evading traditional security measures. Once a computer is infected by malware, criminals can hurt consumers and enterprises in many ways.   With more than one billion  enterprise and consumer customers, Microsoft takes this problem very seriously and is deeply invested in improving security. As one part of their overall strategy for doing so, Microsoft is challenging the data science community to develop techniques to predict if a machine will soon be hit with malware. As with their previous, Malware Challenge (2015), Microsoft is providing Kagglers with an unprecedented malware dataset to encourage open-source progress on effective techniques for predicting malware occurrences. Can you help protect more than one billion machines from damage BEFORE it happens? Acknowledgements This competition is hosted by Microsoft, Windows Defender ATP Research, Northeastern University College of Computer and Information Science, and Georgia Tech Institute for Information Security & Privacy.      Microsoft contacts  Rob McCann (Robert.McCann@microsoft.com) Christian Seifert (chriseif@microsoft.com) Susan Higgs (Susan.Higgs@microsoft.com) Matt Duncan (Matthew.Duncan@microsoft.com)      Northeastern University contact  Mansour Ahmadi (m.ahmadi@northeastern.edu)      Georgia Tech contacts  Brendan Saltaformaggio (brendan@ece.gatech.edu) Taesoo Kim (taesoo@gatech.edu)", "link": "https://www.kaggle.com/c/microsoft-malware-prediction", "tags": ["Classification", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-03-14 00:59:00", "words": 215, "sentences": 7, "sum_nltk": "Can you predict if a machine will soon be hit with malware?The malware industry continues to be a well-organized, well-funded market dedicated to evading traditional security measures.\nOnce a computer is infected by malware, criminals can hurt consumers and enterprises in many ways.\nWith more than one billion  enterprise and consumer customers, Microsoft takes this problem very seriously and is deeply invested in improving security.\nAs one part of their overall strategy for doing so, Microsoft is challenging the data science community to develop techniques to predict if a machine will soon be hit with malware.\nAs with their previous, Malware Challenge (2015), Microsoft is providing Kagglers with an unprecedented malware dataset to encourage open-source progress on effective techniques for predicting malware occurrences.\nCan you help protect more than one billion machines from damage BEFORE it happens?\nAcknowledgements This competition is hosted by Microsoft, Windows Defender ATP Research, Northeastern University College of Computer and Information Science, and Georgia Tech Institute for Information Security & Privacy.\nMicrosoft contacts  Rob McCann (Robert.McCann@microsoft.com) Christian Seifert (chriseif@microsoft.com) Susan Higgs (Susan.Higgs@microsoft.com) Matt Duncan (Matthew.Duncan@microsoft.com)      Northeastern University contact  Mansour Ahmadi (m.ahmadi@northeastern.edu)      Georgia Tech contacts  Brendan Saltaformaggio (brendan@ece.gatech.edu) Taesoo Kim (taesoo@gatech.edu)", "sum_nltk_words": 201, "sum_nltk_runtime": 0.002, "sum_t5": "Microsoft is challenging the data science community to develop techniques to predict if a machine will be hit with malware. can you help protect more than one billion machines from damage BEFORE it happens? a computer is infected by malware, criminals can hurt consumers and enterprises in many ways. can you predict if a machine will be hit with malware? click here to enter the competition. a winner will be announced on november 8. a spokesman for the competition says it is not a \"", "sum_t5_words": 85, "sum_t5_runtime": 6.338, "runtime": 0.002, "nltk_category": "Education & Research", "nltk_category_score": 0.5494120121002197, "nltk_category_runtime": 22.202, "nltk_subcategory": "Preventative and Reactive", "nltk_subcategory_score": 0.6831533312797546, "nltk_subcategory_runtime": 35.589, "category": "Education & Research", "category_score": 0.5494120121002197, "subcategory": "Preventative and Reactive", "subcategory_score": 0.6831533312797546, "runtime_cat": 57.793, "engagement_score": "0.689", "language_code": "en", "language": "english", "language_score": "0.9999989640123393", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict machine soon hit malwarethe malware industry continues wellorganized wellfunded market dedicated evading traditional security measure computer infected malware criminal hurt consumer enterprise many way one billion enterprise consumer customer microsoft take problem seriously deeply invested improving security one part overall strategy microsoft challenging data science community develop technique predict machine soon hit malware previous malware challenge 2015 microsoft providing kagglers unprecedented malware dataset encourage opensource progress effective technique predicting malware occurrence help protect one billion machine damage happens acknowledgement competition hosted microsoft window defender atp research northeastern university college computer information science georgia tech institute information security privacy microsoft contact rob mccann robertmccannmicrosoftcom christian seifert chriseifmicrosoftcom susan higgs susanhiggsmicrosoftcom matt duncan matthewduncanmicrosoftcom northeastern university contact mansour ahmadi mahmadinortheasternedu georgia tech contact brendan saltaformaggio brendanecegatechedu taesoo kim taesoogatechedu", "tags_descriptive": ["Classification", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting"]}