{"title": "What's Cooking? (Kernels Only)", "description": "Use recipe ingredients to categorize the cuisinePicture yourself strolling through your local, open-air market... What do you see? What do you smell? What will you make for dinner tonight? If you're in Northern California, you'll be walking past the inevitable bushels of leafy greens, spiked with dark purple kale and the bright pinks and yellows of chard. Across the world in South Korea, mounds of bright red kimchi greet you, while the smell of the sea draws your attention to squids squirming nearby. India’s market is perhaps the most colorful, awash in the rich hues and aromas of dozens of spices: turmeric, star anise, poppy seeds, and garam masala as far as the eye can see. Some of our strongest geographic and cultural associations are tied to a region's local foods. This playground competitions asks you to predict the category of a dish's cuisine given a list of its ingredients.  Acknowledgements We want to thank Yummly for providing this unique dataset. Kaggle is hosting this playground competition for fun and practice.", "link": "https://www.kaggle.com/c/whats-cooking-kernels-only", "tags": ["DL", "Ensembling", "Feature Engineering", "SVM", "Exploratory Data Analysis", "Logistic Regression", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-09-25 01:59:00", "words": 160, "sentences": 6, "runtime": 0.0, "description_category": "Accommodation & Food", "description_category_score": 0.6680886745452881, "description_category_runtime": 16.694, "description_subcategory": "Food", "description_subcategory_score": 0.7542816996574402, "description_subcategory_runtime": 27.022, "category": "Accommodation & Food", "category_score": 0.6680886745452881, "subcategory": "Food", "subcategory_score": 0.7542816996574402, "runtime_cat": 43.717, "engagement_score": "0.609", "language_code": "en", "language": "english", "language_score": "0.9999979354060531", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "use recipe ingredient categorize cuisinepicture strolling local openair market see smell make dinner tonight youre northern california youll walking past inevitable bushel leafy green spiked dark purple kale bright pink yellow chard across world south korea mound bright red kimchi greet smell sea draw attention squid squirming nearby india market perhaps colorful awash rich hue aroma dozen spice turmeric star anise poppy seed garam masala far eye see strongest geographic cultural association tied region local food playground competition asks predict category dish cuisine given list ingredient acknowledgement want thank yummly providing unique dataset kaggle hosting playground competition fun practice", "tags_descriptive": ["Deep Learning (DL)", "Ensembling", "Feature Engineering", "Support Vector Machines (SVM)", "Exploratory Data Analysis", "Logistic Regression", "Classification"]}