{"title": "Corporación Favorita Grocery Sales Forecasting", "description": "Can you accurately predict sales for a large grocery chain?Brick-and-mortar grocery stores are always in a delicate dance with purchasing and sales forecasting. Predict a little over, and grocers are stuck with overstocked, perishable goods. Guess a little under, and popular items quickly sell out, leaving money on the table and customers fuming. The problem becomes more complex as retailers add new locations with unique needs, new products, ever transitioning seasonal tastes, and unpredictable product marketing. Corporación Favorita, a large Ecuadorian-based grocery retailer, knows this all too well. They operate hundreds of supermarkets, with over 200,000 different products on their shelves. Corporación Favorita has challenged the Kaggle community to build a model that more accurately forecasts product sales. They currently rely on subjective forecasting methods with very little data to back them up and very little automation to execute plans. They’re excited to see how machine learning could better ensure they please customers by having just enough of the right products at the right time.", "link": "https://www.kaggle.com/c/favorita-grocery-sales-forecasting", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-01-16 00:59:00", "words": 165, "sentences": 9, "runtime": 0.003, "description_category": "Wholesale & Retail", "description_category_score": 0.5247550010681152, "description_category_runtime": 14.972, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8550103902816772, "description_subcategory_runtime": 24.109, "category": "Wholesale & Retail", "category_score": 0.5247550010681152, "subcategory": "Machine Learning", "subcategory_score": 0.8550103902816772, "runtime_cat": 39.084, "engagement_score": "0.672", "language_code": "en", "language": "english", "language_score": "0.999998275997273", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "accurately predict sale large grocery chainbrickandmortar grocery store always delicate dance purchasing sale forecasting predict little grocer stuck overstocked perishable good guess little popular item quickly sell leaving money table customer fuming problem becomes complex retailer add new location unique need new product ever transitioning seasonal taste unpredictable product marketing corporacion favorita large ecuadorianbased grocery retailer know well operate hundred supermarket 200000 different product shelf corporacion favorita challenged kaggle community build model accurately forecast product sale currently rely subjective forecasting method little data back little automation execute plan theyre excited see machine learning could better ensure please customer enough right product right time", "tags_descriptive": ["Exploratory Data Analysis"]}