{"title": "Challenges in Representation Learning: Facial Expression Recognition Challenge", "description": "Learn facial expressions from an imageExample baseline submissions are available as part of the pylearn2 python package available at https://github.com/lisa-lab/pylearn2 The baseline submissions for this contest are in pylearn2/scripts/icml_2013_wrepl/emotions Because this task is very easy for humans to do, we will not provide the final test inputs until one week before the contest closes. Preliminary winners will need to release their winning code and demonstrate that they did not manually label the test set. We reserve the right to disqualify entries that may involve any manually labeling of the test set. Preliminary winners will need to release their winning code and demonstrate that they did not manually label the test set. We reserve the right to disqualify entries that may involve any manually labeling of the test set.", "link": "https://www.kaggle.com/c/challenges-in-representation-learning-facial-expression-recognition-challenge", "tags": ["Keras", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2013-05-25 01:59:00", "words": 127, "sentences": 5, "runtime": 0.004, "description_category": "Healthcare", "description_category_score": 0.15243937075138092, "description_category_runtime": 12.362, "description_subcategory": "Student", "description_subcategory_score": 0.45601505041122437, "description_subcategory_runtime": 19.394, "category": "Healthcare", "category_score": 0.15243937075138092, "subcategory": "Student", "subcategory_score": 0.45601505041122437, "runtime_cat": 31.757, "engagement_score": "0.455", "language_code": "en", "language": "english", "language_score": "0.9999975037055444", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "learn facial expression imageexample baseline submission available part pylearn2 python package available httpsgithubcomlisalabpylearn2 baseline submission contest pylearn2scriptsicml_2013_wreplemotions task easy human provide final test input one week contest close preliminary winner need release winning code demonstrate manually label test set reserve right disqualify entry may involve manually labeling test set preliminary winner need release winning code demonstrate manually label test set reserve right disqualify entry may involve manually labeling test set", "tags_descriptive": ["Keras", "Convolutional Neural Network (CNN)"]}