{"title": "Predicting a Biological Response", "description": "Predict a biological response of molecules from their chemical propertiesThe objective of the competition is to help us build as good a model as possible so that we can, as optimally as this data allows, relate molecular information, to an actual biological response. We have shared the data in the comma separated values (CSV) format. Each row in this data set represents a molecule. The first column contains experimental data describing an actual biological response; the molecule was seen to elicit this response (1),  or not (0). The remaining columns represent molecular descriptors (d1 through d1776), these are calculated properties that can capture some of the characteristics of the molecule - for example size, shape, or elemental constitution. The descriptor matrix has  been normalized.", "link": "https://www.kaggle.com/c/bioresponse", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2012-06-16 01:59:59", "words": 126, "sentences": 6, "runtime": 0.0, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.3899531662464142, "description_category_runtime": 11.305, "description_subcategory": "Tools", "description_subcategory_score": 0.3464686870574951, "description_subcategory_runtime": 16.907, "category": "Biotechnological & Life Sciences", "category_score": 0.3899531662464142, "subcategory": "Tools", "subcategory_score": 0.3464686870574951, "runtime_cat": 28.212, "engagement_score": "0.626", "language_code": "en", "language": "english", "language_score": "0.999997291820843", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict biological response molecule chemical propertiesthe objective competition help u build good model possible optimally data allows relate molecular information actual biological response shared data comma separated value csv format row data set represents molecule first column contains experimental data describing actual biological response molecule seen elicit response 1 0 remaining column represent molecular descriptor d1 d1776 calculated property capture characteristic molecule example size shape elemental constitution descriptor matrix normalized", "tags_descriptive": []}