{"title": "Flower Classification with TPUs", "description": "Use TPUs to classify 104 types of flowersTensor Processing Units (TPUs) are Now Available on Kaggle Tensor Processing Unit (TPU) quotas are now available on Kaggle, at no cost to you! TPUs are powerful hardware accelerators specialized in deep learning tasks. They were developed (and first used) by Google to process large image databases, such as extracting all the text from Street View. This competition is designed for you to give TPUs a try. The latest Tensorflow release (TF 2.1) was focused on TPUs and they’re now supported both through the Keras high-level API and at a lower level, in models using a custom training loop. We can’t wait to see how your solutions are accelerated by TPUs! The Challenge It’s difficult to fathom just how vast and diverse our natural world is. There are over 5,000 species of mammals, 10,000 species of birds, 30,000 species of fish – and astonishingly, over 400,000 different types of flowers. In this competition, you’re challenged to build a machine learning model that identifies the type of flowers in a dataset of images (for simplicity, we’re sticking to just over 100 types).  To get started with TPUs:  Read the TPU documentation one-pager Then jump right into the Getting Started Notebook for this competition  Quick note: a TPU is a network-connected accelerator and requires a couple extra lines in your code. Flipping the TPU switch in your notebook will not, by itself, accelerate your code.  Have Questions? Martin Görner, Google Developer Advocate and author of Tensorflow without a PhD will be actively engaged in the competition forum. If you have a question or need help troubleshooting, that’s the best place to find help.", "link": "https://www.kaggle.com/c/flower-classification-with-tpus", "tags": ["DL", "Classification", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-05-12 01:59:00", "words": 282, "sentences": 11, "sum_nltk": "TPUs are powerful hardware accelerators specialized in deep learning tasks.\nThey were developed (and first used) by Google to process large image databases, such as extracting all the text from Street View.\nThis competition is designed for you to give TPUs a try.\nThe latest Tensorflow release (TF 2.1) was focused on TPUs and they’re now supported both through the Keras high-level API and at a lower level, in models using a custom training loop.\nWe can’t wait to see how your solutions are accelerated by TPUs!\nIn this competition, you’re challenged to build a machine learning model that identifies the type of flowers in a dataset of images (for simplicity, we’re sticking to just over 100 types).\nTo get started with TPUs:  Read the TPU documentation one-pager Then jump right into the Getting Started Notebook for this competition  Quick note: a TPU is a network-connected accelerator and requires a couple extra lines in your code.\nFlipping the TPU switch in your notebook will not, by itself, accelerate your code.\nHave Questions?\nMartin Görner, Google Developer Advocate and author of Tensorflow without a PhD will be actively engaged in the competition forum.\nIf you have a question or need help troubleshooting, that’s the best place to find help.", "sum_nltk_words": 200, "sum_nltk_runtime": 0.004, "sum_t5": "the latest Tensorflow release (TF 2.1) was focused on TPUs. they’re now supported both through the Keras high-level API and at a lower level, in models using a custom training loop. the competition is designed for you to give TPUs a try. you’re challenged to build a machine learning model that identifies the type of flowers in a dataset of images. a TPU is a network-connected accelerator and requires a couple extra lines", "sum_t5_words": 73, "sum_t5_runtime": 6.59, "runtime": 0.002, "nltk_category": "Wholesale & Retail", "nltk_category_score": 0.4811590611934662, "nltk_category_runtime": 20.211, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9084254503250122, "nltk_subcategory_runtime": 32.052, "category": "Wholesale & Retail", "category_score": 0.4811590611934662, "subcategory": "Machine Learning", "subcategory_score": 0.9084254503250122, "runtime_cat": 52.264, "engagement_score": "0.636", "language_code": "en", "language": "english", "language_score": "0.9999941707877928", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "use tpus classify 104 type flowerstensor processing unit tpus available kaggle tensor processing unit tpu quota available kaggle cost tpus powerful hardware accelerator specialized deep learning task developed first used google process large image database extracting text street view competition designed give tpus try latest tensorflow release tf 21 focused tpus theyre supported kera highlevel api lower level model using custom training loop cant wait see solution accelerated tpus challenge difficult fathom vast diverse natural world 5000 specie mammal 10000 specie bird 30000 specie fish astonishingly 400000 different type flower competition youre challenged build machine learning model identifies type flower dataset image simplicity sticking 100 type get started tpus read tpu documentation onepager jump right getting started notebook competition quick note tpu networkconnected accelerator requires couple extra line code flipping tpu switch notebook accelerate code question martin gorner google developer advocate author tensorflow without phd actively engaged competition forum question need help troubleshooting thats best place find help", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Convolutional Neural Network (CNN)"]}