{"title": "Kobe Bryant Shot Selection", "description": "Which shots did Kobe sink?Kobe Bryant marked his retirement from the NBA by scoring 60 points in his final game as a Los Angeles Laker on Wednesday, April 12, 2016. Drafted into the NBA at the age of 17, Kobe earned the sport’s highest accolades throughout his long career. Using 20 years of data on Kobe's swishes and misses, can you predict which shots will find the bottom of the net? This competition is well suited for practicing classification basics, feature engineering, and time series analysis. Practice got Kobe an eight-figure contract and 5 championship rings. What will it get you? Acknowledgements Kaggle is hosting this competition for the data science community to use for fun and education. For more data on Kobe and other NBA greats, visit stats.nba.com.", "link": "https://www.kaggle.com/c/kobe-bryant-shot-selection", "tags": ["Sports", "Sports"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-06-14 01:59:00", "words": 122, "sentences": 5, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.8472134470939636, "description_category_runtime": 12.51, "description_subcategory": "Student", "description_subcategory_score": 0.6006031036376953, "description_subcategory_runtime": 19.289, "category": "Education & Research", "category_score": 0.8472134470939636, "subcategory": "Student", "subcategory_score": 0.6006031036376953, "runtime_cat": 31.8, "engagement_score": "0.651", "language_code": "en", "language": "english", "language_score": "0.9999963170096013", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "shot kobe sinkkobe bryant marked retirement nba scoring 60 point final game los angeles laker wednesday april 12 2016 drafted nba age 17 kobe earned sport highest accolade throughout long career using 20 year data kobe swish miss predict shot find bottom net competition well suited practicing classification basic feature engineering time series analysis practice got kobe eightfigure contract 5 championship ring get acknowledgement kaggle hosting competition data science community use fun education data kobe nba great visit statsnbacom", "tags_descriptive": ["Sports", "Sports"]}