{"title": "NFL Big Data Bowl", "description": "How many yards will an NFL player gain after receiving a handoff?“The running back takes the handoff… he breaks a tackle…spins… and breaks free! One man to beat! Past the 50-yard-line! To the 40! The 30! He! Could! Go! All! The! Way!” But will he?  American football is a complex sport. From the 22 players on the field to specific characteristics that ebb and flow throughout the game, it can be challenging to quantify the value of specific plays and actions within a play.  Fundamentally, the goal of football is for the offense to run (rush) or throw (pass) the ball to gain yards, moving towards, then across, the opposing team’s side of the field in order to score. And the goal of the defense is to prevent the offensive team from scoring.  In the National Football League (NFL), roughly a third of teams’ offensive yardage comes from run plays.. Ball carriers are generally assigned the most credit for these plays, but their teammates (by way of blocking), coach (by way of play call), and the opposing defense also play a critical role. Traditional metrics such as ‘yards per carry’ or ‘total rushing yards’ can be flawed; in this competition, the NFL aims to provide better context into what contributes to a successful run play. As an “armchair quarterback” watching the game, you may think you can predict the result of a play when a ball carrier takes the handoff - but what does the data say? In this competition, you will develop a model to predict how many yards a team will gain on given rushing plays as they happen. You'll be provided game, play, and player-level data, including the position and speed of players as provided in the NFL’s Next Gen Stats data. And the best part - you can see how your model performs from your living room, as the leaderboard will be updated week after week on the current season’s game data as it plays out.  Deeper insight into rushing plays will help teams, media, and fans better understand the skill of players and the strategies of coaches. It will also assist the NFL and its teams evaluate the ball carrier, his teammates, his coach, and the opposing defense, in order to make adjustments as necessary. Additionally, the winning model will be provided to the NFL’s Next Gen Stats group to potentially share with teams. You could help the NFL Network generate models to use during games, or for pre-game/post-game breakdowns.", "link": "https://www.kaggle.com/c/nfl-big-data-bowl-2020", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-01-07 00:59:00", "words": 419, "sentences": 14, "sum_nltk": "How many yards will an NFL player gain after receiving a handoff?“The running back takes the handoff… he breaks a tackle…spins… and breaks free!\nFundamentally, the goal of football is for the offense to run (rush) or throw (pass) the ball to gain yards, moving towards, then across, the opposing team’s side of the field in order to score.\nTraditional metrics such as ‘yards per carry’ or ‘total rushing yards’ can be flawed; in this competition, the NFL aims to provide better context into what contributes to a successful run play.\nAs an “armchair quarterback” watching the game, you may think you can predict the result of a play when a ball carrier takes the handoff - but what does the data say?\nIn this competition, you will develop a model to predict how many yards a team will gain on given rushing plays as they happen.\nDeeper insight into rushing plays will help teams, media, and fans better understand the skill of players and the strategies of coaches.\nIt will also assist the NFL and its teams evaluate the ball carrier, his teammates, his coach, and the opposing defense, in order to make adjustments as necessary.", "sum_nltk_words": 191, "sum_nltk_runtime": 0.004, "sum_t5": "in the National Football League (NFL), roughly a third of teams’ offensive yardage comes from run plays. you will be provided game, play, and player-level data. you'll be provided game, play, and player-level data. you'll be provided game, play, and player-level data. you'll be provided game, play, and player-level data. you'll be provided game, play, and player-level data.", "sum_t5_words": 58, "sum_t5_runtime": 6.495, "runtime": 0.007, "nltk_category": "Education & Research", "nltk_category_score": 0.6391770839691162, "nltk_category_runtime": 17.554, "nltk_subcategory": "General", "nltk_subcategory_score": 0.737447202205658, "nltk_subcategory_runtime": 29.119, "category": "Education & Research", "category_score": 0.6391770839691162, "subcategory": "General", "subcategory_score": 0.737447202205658, "runtime_cat": 46.674, "engagement_score": "0.681", "language_code": "en", "language": "english", "language_score": "0.9999969562768887", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "many yard nfl player gain receiving handoffthe running back take handoff break tacklespins break free one man beat past 50yardline 40 30 could go way american football complex sport 22 player field specific characteristic ebb flow throughout game challenging quantify value specific play action within play fundamentally goal football offense run rush throw pas ball gain yard moving towards across opposing team side field order score goal defense prevent offensive team scoring national football league nfl roughly third team offensive yardage come run play ball carrier generally assigned credit play teammate way blocking coach way play call opposing defense also play critical role traditional metric yard per carry total rushing yard flawed competition nfl aim provide better context contributes successful run play armchair quarterback watching game may think predict result play ball carrier take handoff data say competition develop model predict many yard team gain given rushing play happen youll provided game play playerlevel data including position speed player provided nfls next gen stats data best part see model performs living room leaderboard updated week week current season game data play deeper insight rushing play help team medium fan better understand skill player strategy coach also assist nfl team evaluate ball carrier teammate coach opposing defense order make adjustment necessary additionally winning model provided nfls next gen stats group potentially share team could help nfl network generate model use game pregamepostgame breakdown", "tags_descriptive": []}