{"title": "Mercedes-Benz Greener Manufacturing", "description": "Can you cut the time a Mercedes-Benz spends on the test bench?Since the first automobile, the Benz Patent Motor Car in 1886, Mercedes-Benz has stood for important automotive innovations. These include, for example, the passenger safety cell with crumple zone, the airbag and intelligent assistance systems. Mercedes-Benz applies for nearly 2000 patents per year, making the brand the European leader among premium car makers. Daimler’s Mercedes-Benz cars are leaders in the premium car industry. With a huge selection of features and options, customers can choose the customized Mercedes-Benz of their dreams. . To ensure the safety and reliability of each and every unique car configuration before they hit the road, Daimler’s engineers have developed a robust testing system. But, optimizing the speed of their testing system for so many possible feature combinations is complex and time-consuming without a powerful algorithmic approach. As one of the world’s biggest manufacturers of premium cars, safety and efficiency are paramount on Daimler’s production lines.  In this competition, Daimler is challenging Kagglers to tackle the curse of dimensionality and reduce the time that cars spend on the test bench. Competitors will work with a dataset representing different permutations of Mercedes-Benz car features to predict the time it takes to pass testing. Winning algorithms will contribute to speedier testing, resulting in lower carbon dioxide emissions without reducing Daimler’s standards.", "link": "https://www.kaggle.com/c/mercedes-benz-greener-manufacturing", "tags": ["Xgboost", "Exploratory Data Analysis", "Model Comparison"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-07-11 01:59:00", "words": 224, "sentences": 12, "sum_nltk": "Can you cut the time a Mercedes-Benz spends on the test bench?Since the first automobile, the Benz Patent Motor Car in 1886, Mercedes-Benz has stood for important automotive innovations.\nMercedes-Benz applies for nearly 2000 patents per year, making the brand the European leader among premium car makers.\nDaimler’s Mercedes-Benz cars are leaders in the premium car industry.\nWith a huge selection of features and options, customers can choose the customized Mercedes-Benz of their dreams.\n. To ensure the safety and reliability of each and every unique car configuration before they hit the road, Daimler’s engineers have developed a robust testing system.\nBut, optimizing the speed of their testing system for so many possible feature combinations is complex and time-consuming without a powerful algorithmic approach.\nAs one of the world’s biggest manufacturers of premium cars, safety and efficiency are paramount on Daimler’s production lines.\nIn this competition, Daimler is challenging Kagglers to tackle the curse of dimensionality and reduce the time that cars spend on the test bench.\nCompetitors will work with a dataset representing different permutations of Mercedes-Benz car features to predict the time it takes to pass testing.\nWinning algorithms will contribute to speedier testing, resulting in lower carbon dioxide emissions without reducing Daimler’s standards.", "sum_nltk_words": 197, "sum_nltk_runtime": 0.003, "sum_t5": "Daimler's Mercedes-Benz cars are leaders in the premium car industry. with a huge selection of features and options, customers can choose the customized Mercedes-Benz of their dreams. can you reduce the time that cars spend on the test bench?.. can you predict the time it takes to pass testing?.. can you predict the time it takes to pass testing?.. can you predict the time it takes to pass testing?.", "sum_t5_words": 69, "sum_t5_runtime": 4.688, "runtime": 0.003, "nltk_category": "Finance", "nltk_category_score": 0.6740649938583374, "nltk_category_runtime": 19.208, "nltk_subcategory": "Transportation", "nltk_subcategory_score": 0.7261790037155151, "nltk_subcategory_runtime": 31.32, "category": "Finance", "category_score": 0.6740649938583374, "subcategory": "Transportation", "subcategory_score": 0.7261790037155151, "runtime_cat": 50.53, "engagement_score": "0.71", "language_code": "en", "language": "english", "language_score": "0.9999988266676662", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "cut time mercedesbenz spends test benchsince first automobile benz patent motor car 1886 mercedesbenz stood important automotive innovation include example passenger safety cell crumple zone airbag intelligent assistance system mercedesbenz applies nearly 2000 patent per year making brand european leader among premium car maker daimler mercedesbenz car leader premium car industry huge selection feature option customer choose customized mercedesbenz dream ensure safety reliability every unique car configuration hit road daimler engineer developed robust testing system optimizing speed testing system many possible feature combination complex timeconsuming without powerful algorithmic approach one world biggest manufacturer premium car safety efficiency paramount daimler production line competition daimler challenging kagglers tackle curse dimensionality reduce time car spend test bench competitor work dataset representing different permutation mercedesbenz car feature predict time take pas testing winning algorithm contribute speedier testing resulting lower carbon dioxide emission without reducing daimler standard", "tags_descriptive": ["Xgboost", "Exploratory Data Analysis", "Model Comparison"]}