{"title": "Google Landmark Retrieval 2020", "description": "Given an image, can you find all of the same landmarks in a dataset?Welcome to the third Landmark Retrieval competition! This year, we have worked to set this up as a code competition and we have completely refreshed the test and index image sets.  Image retrieval is a fundamental problem in computer vision: given a query image, can you find similar images in a large database? This is especially important for query images containing landmarks, which accounts for a large portion of what people like to photograph. In this competition, the developed models are expected to retrieve relevant database images to a given query image (ie, the model should retrieve database images containing the same landmark as the query). This challenge is organized in conjunction with the Landmark Recognition Challenge 2020. Both challenges will be discussed at the Instance-Level Recognition workshop in ECCV’20. In the previous editions of this challenge (2018 and  2019), submissions were handled by uploading prediction files to the system. This year's competition is structured in a representation learning format: rather than creating a submission file with retrieved images, you will create a model that extracts a feature embedding for the images and submit the model via Kaggle Notebooks. Kaggle will run your model on a held-out test set, perform a k-nearest-neighbors lookup, and score the resulting embedding quality with mean average precision.  This is a Code Competition. Refer to Code Requirements for details.", "link": "https://www.kaggle.com/c/landmark-retrieval-2020", "tags": ["DL", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-08-18 01:59:00", "words": 240, "sentences": 10, "sum_nltk": "Given an image, can you find all of the same landmarks in a dataset?Welcome to the third Landmark Retrieval competition!\nThis year, we have worked to set this up as a code competition and we have completely refreshed the test and index image sets.\nImage retrieval is a fundamental problem in computer vision: given a query image, can you find similar images in a large database?\nThis is especially important for query images containing landmarks, which accounts for a large portion of what people like to photograph.\nIn this competition, the developed models are expected to retrieve relevant database images to a given query image (ie, the model should retrieve database images containing the same landmark as the query).\nThis challenge is organized in conjunction with the Landmark Recognition Challenge 2020.\nIn the previous editions of this challenge (2018 and  2019), submissions were handled by uploading prediction files to the system.\nThis year's competition is structured in a representation learning format: rather than creating a submission file with retrieved images, you will create a model that extracts a feature embedding for the images and submit the model via Kaggle Notebooks.\nThis is a Code Competition.", "sum_nltk_words": 188, "sum_nltk_runtime": 0.003, "sum_t5": "this year's competition is a code competition. the developed models are expected to retrieve relevant database images. the challenge is organized in conjunction with the Landmark Recognition Challenge 2020. the challenge will be discussed at the Instance-Level Recognition workshop in ECCV’20. click here for more information.. to enter, click here.............", "sum_t5_words": 50, "sum_t5_runtime": 4.746, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.5848466753959656, "nltk_category_runtime": 16.319, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.818087100982666, "nltk_subcategory_runtime": 26.262, "category": "Education & Research", "category_score": 0.5848466753959656, "subcategory": "Machine Learning", "subcategory_score": 0.818087100982666, "runtime_cat": 42.582, "engagement_score": "0.611", "language_code": "en", "language": "english", "language_score": "0.9999948922973337", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "given image find landmark datasetwelcome third landmark retrieval competition year worked set code competition completely refreshed test index image set image retrieval fundamental problem computer vision given query image find similar image large database especially important query image containing landmark account large portion people like photograph competition developed model expected retrieve relevant database image given query image ie model retrieve database image containing landmark query challenge organized conjunction landmark recognition challenge 2020 challenge discussed instancelevel recognition workshop eccv20 previous edition challenge 2018 2019 submission handled uploading prediction file system year competition structured representation learning format rather creating submission file retrieved image create model extract feature embedding image submit model via kaggle notebook kaggle run model heldout test set perform knearestneighbors lookup score resulting embedding quality mean average precision code competition refer code requirement detail", "tags_descriptive": ["Deep Learning (DL)", "Classification"]}