{"title": "RSNA Intracranial Hemorrhage Detection", "description": "Identify acute intracranial hemorrhage and its subtypesIntracranial hemorrhage, bleeding that occurs inside the cranium, is a serious health problem requiring rapid and often intensive medical treatment. For example, intracranial hemorrhages account for approximately 10% of strokes in the U.S., where stroke is the fifth-leading cause of death. Identifying the location and type of any hemorrhage present is a critical step in treating the patient.  Diagnosis requires an urgent procedure. When a patient shows acute neurological symptoms such as severe headache or loss of consciousness, highly trained specialists review medical images of the patient’s cranium to look for the presence, location and type of hemorrhage. The process is complicated and often time consuming.  In this competition, your challenge is to build an algorithm to detect acute intracranial hemorrhage and its subtypes.  You’ll develop your solution using a rich image dataset provided by the Radiological Society of North America (RSNA®) in collaboration with members of the American Society of Neuroradiology and MD.ai.  If successful, you’ll help the medical community identify the presence, location and type of hemorrhage in order to quickly and effectively treat affected patients. Challenge participants may be invited to present their AI models and methodologies during an award ceremony at the RSNA Annual Meeting which will be held in Chicago, Illinois, USA, from December 1-6, 2019. Collaborators Four research institutions provided large volumes of de-identified CT studies that were assembled to create the challenge dataset: Stanford University, Thomas Jefferson University, Unity Health Toronto and Universidade Federal de São Paulo (UNIFESP), The American Society of Neuroradiology (ASNR) organized a cadre of more than 60 volunteers to label over 25,000 exams for the challenge dataset. ASNR is the world’s leading organization for the future of neuroradiology representing more than 5,300 radiologists, researchers, interventionalists, and imaging scientists. MD.ai provided tooling and support for the data annotation process.  The RSNA is an international society of radiologists, medical physicists and other medical professionals with more than 54,000 members from 146 countries across the globe. They see the potential for AI to assist in detection and classification of hemorrhages in order to prioritize and expedite their clinical work. A full set of acknowledgments can be found on this page.", "link": "https://www.kaggle.com/c/rsna-intracranial-hemorrhage-detection", "tags": ["DL", "Classification", "Exploratory Data Analysis", "CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-11-14 00:59:00", "words": 369, "sentences": 16, "sum_nltk": "Identify acute intracranial hemorrhage and its subtypesIntracranial hemorrhage, bleeding that occurs inside the cranium, is a serious health problem requiring rapid and often intensive medical treatment.\nIdentifying the location and type of any hemorrhage present is a critical step in treating the patient.\nWhen a patient shows acute neurological symptoms such as severe headache or loss of consciousness, highly trained specialists review medical images of the patient’s cranium to look for the presence, location and type of hemorrhage.\nYou’ll develop your solution using a rich image dataset provided by the Radiological Society of North America (RSNA®) in collaboration with members of the American Society of Neuroradiology and MD.ai.\nIf successful, you’ll help the medical community identify the presence, location and type of hemorrhage in order to quickly and effectively treat affected patients.\nCollaborators Four research institutions provided large volumes of de-identified CT studies that were assembled to create the challenge dataset: Stanford University, Thomas Jefferson University, Unity Health Toronto and Universidade Federal de São Paulo (UNIFESP), The American Society of Neuroradiology (ASNR) organized a cadre of more than 60 volunteers to label over 25,000 exams for the challenge dataset.\nASNR is the world’s leading organization for the future of neuroradiology representing more than 5,300 radiologists, researchers, interventionalists, and imaging scientists.", "sum_nltk_words": 204, "sum_nltk_runtime": 0.005, "sum_t5": "intracranial hemorrhages account for approximately 10% of strokes in the u.s., where stroke is the fifth-leading cause of death. if successful, you’ll help the medical community identify the presence, location and type of hemorrhage in order to quickly and effectively treat affected patients. if successful, you’ll help the medical community identify the presence, location and type of hemorrhage in order to quickly and effectively treat affected patients.", "sum_t5_words": 67, "sum_t5_runtime": 6.541, "runtime": 0.006, "nltk_category": "Emergency & Relief", "nltk_category_score": 0.5093684792518616, "nltk_category_runtime": 21.074, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.6492767930030823, "nltk_subcategory_runtime": 34.13, "category": "Emergency & Relief", "category_score": 0.5093684792518616, "subcategory": "Judicial Applied", "subcategory_score": 0.6492767930030823, "runtime_cat": 55.204, "engagement_score": "0.661", "language_code": "en", "language": "english", "language_score": "0.9999979946467776", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify acute intracranial hemorrhage subtypesintracranial hemorrhage bleeding occurs inside cranium serious health problem requiring rapid often intensive medical treatment example intracranial hemorrhage account approximately 10 stroke u stroke fifthleading cause death identifying location type hemorrhage present critical step treating patient diagnosis requires urgent procedure patient show acute neurological symptom severe headache loss consciousness highly trained specialist review medical image patient cranium look presence location type hemorrhage process complicated often time consuming competition challenge build algorithm detect acute intracranial hemorrhage subtypes youll develop solution using rich image dataset provided radiological society north america rsna collaboration member american society neuroradiology mdai successful youll help medical community identify presence location type hemorrhage order quickly effectively treat affected patient challenge participant may invited present ai model methodology award ceremony rsna annual meeting held chicago illinois usa december 16 2019 collaborator four research institution provided large volume deidentified ct study assembled create challenge dataset stanford university thomas jefferson university unity health toronto universidade federal de sao paulo unifesp american society neuroradiology asnr organized cadre 60 volunteer label 25000 exam challenge dataset asnr world leading organization future neuroradiology representing 5300 radiologist researcher interventionalists imaging scientist mdai provided tooling support data annotation process rsna international society radiologist medical physicist medical professional 54000 member 146 country across globe see potential ai assist detection classification hemorrhage order prioritize expedite clinical work full set acknowledgment found page", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Exploratory Data Analysis", "Computer Vision (CV)"]}