{"title": "Deepfake Detection Challenge", "description": "Identify videos with facial or voice manipulationsThis competition is closed for submissions. Participants' selected code submissions were re-run by the host on a privately-held test set and the private leaderboard results have been finalized. Late submissions will not be opened, due to an inability to replicate the unique design of this competition. Deepfake techniques, which present realistic AI-generated videos of people doing and saying fictional things, have the potential to have a significant impact on how people determine the legitimacy of information presented online. These content generation and modification technologies may affect the quality of public discourse and the safeguarding of human rights—especially given that deepfakes may be used maliciously as a source of misinformation, manipulation, harassment, and persuasion. Identifying manipulated media is a technically demanding and rapidly evolving challenge that requires collaborations across the entire tech industry and beyond.  AWS, Facebook, Microsoft, the Partnership on AI’s Media Integrity Steering Committee, and academics have come together to build the Deepfake Detection Challenge (DFDC). The goal of the challenge is to spur researchers around the world to build innovative new technologies that can help detect deepfakes and manipulated media. Challenge participants must submit their code into a black box environment for testing. Participants will have the option to make their submission open or closed when accepting the prize. Open proposals will be eligible for challenge prizes as long as they abide by the open source licensing terms. Closed proposals will be proprietary and not be eligible to accept the prizes. Regardless of which track is chosen, all submissions will be evaluated in the same way. Results will be shown on the leaderboard.  The PAI Steering Committee has emphasized the need to ensure that all technical efforts incorporate attention to how the resulting code and products based on it can be made as accessible and useful as possible to key frontline defenders of information quality such as journalists and civic leaders around the world. The DFDC results will be a contribution to this effort and building a robust response to the emergent threat deepfakes pose globally.", "link": "https://www.kaggle.com/c/deepfake-detection-challenge", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-04-24 00:17:00", "words": 346, "sentences": 16, "sum_nltk": "Identify videos with facial or voice manipulationsThis competition is closed for submissions.\nParticipants' selected code submissions were re-run by the host on a privately-held test set and the private leaderboard results have been finalized.\nAWS, Facebook, Microsoft, the Partnership on AI’s Media Integrity Steering Committee, and academics have come together to build the Deepfake Detection Challenge (DFDC).\nThe goal of the challenge is to spur researchers around the world to build innovative new technologies that can help detect deepfakes and manipulated media.\nParticipants will have the option to make their submission open or closed when accepting the prize.\nOpen proposals will be eligible for challenge prizes as long as they abide by the open source licensing terms.\nClosed proposals will be proprietary and not be eligible to accept the prizes.\nThe PAI Steering Committee has emphasized the need to ensure that all technical efforts incorporate attention to how the resulting code and products based on it can be made as accessible and useful as possible to key frontline defenders of information quality such as journalists and civic leaders around the world.\nThe DFDC results will be a contribution to this effort and building a robust response to the emergent threat deepfakes pose globally.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.004, "sum_t5": "Identify videos with facial or voice manipulations competition is closed for submissions. late submissions will not be opened due to an inability to replicate the unique design of this competition. the goal of the challenge is to spur researchers around the world to build innovative new technologies that can help detect deepfakes and manipulated media. participants must submit their code into a black box environment for testing. participants will have the option to make their submission open or closed when accepting the prize.", "sum_t5_words": 83, "sum_t5_runtime": 6.237, "runtime": 0.004, "nltk_category": "Finance", "nltk_category_score": 0.5626850724220276, "nltk_category_runtime": 17.323, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.6858524680137634, "nltk_subcategory_runtime": 28.103, "category": "Finance", "category_score": 0.5626850724220276, "subcategory": "Judicial Applied", "subcategory_score": 0.6858524680137634, "runtime_cat": 45.427, "engagement_score": "0.686", "language_code": "en", "language": "english", "language_score": "0.9999967639266804", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify video facial voice manipulationsthis competition closed submission participant selected code submission rerun host privatelyheld test set private leaderboard result finalized late submission opened due inability replicate unique design competition deepfake technique present realistic aigenerated video people saying fictional thing potential significant impact people determine legitimacy information presented online content generation modification technology may affect quality public discourse safeguarding human rightsespecially given deepfakes may used maliciously source misinformation manipulation harassment persuasion identifying manipulated medium technically demanding rapidly evolving challenge requires collaboration across entire tech industry beyond aws facebook microsoft partnership ai medium integrity steering committee academic come together build deepfake detection challenge dfdc goal challenge spur researcher around world build innovative new technology help detect deepfakes manipulated medium challenge participant must submit code black box environment testing participant option make submission open closed accepting prize open proposal eligible challenge prize long abide open source licensing term closed proposal proprietary eligible accept prize regardless track chosen submission evaluated way result shown leaderboard pai steering committee emphasized need ensure technical effort incorporate attention resulting code product based made accessible useful possible key frontline defender information quality journalist civic leader around world dfdc result contribution effort building robust response emergent threat deepfakes pose globally", "tags_descriptive": []}