{"title": "RSNA Pneumonia Detection Challenge", "description": "Can you build an algorithm that automatically detects potential pneumonia cases?In this competition, you’re challenged to build an algorithm to detect a visual signal for pneumonia in medical images. Specifically, your algorithm needs to automatically locate lung opacities on chest radiographs. Here’s the backstory and why solving this problem matters. Pneumonia accounts for over 15% of all deaths of children under 5 years old internationally. In 2015, 920,000 children under the age of 5 died from the disease. In the United States, pneumonia accounts for over 500,000 visits to emergency departments [1] and over 50,000 deaths in 2015 [2], keeping the ailment on the list of top 10 causes of death in the country. While common, accurately diagnosing pneumonia is a tall order. It requires review of a chest radiograph (CXR) by highly trained specialists and confirmation through clinical history, vital signs and laboratory exams. Pneumonia usually manifests as an area or areas of increased opacity [3] on CXR. However, the diagnosis of pneumonia on CXR is complicated because of a number of other conditions in the lungs such as fluid overload (pulmonary edema), bleeding, volume loss (atelectasis or collapse), lung cancer, or post-radiation or surgical changes. Outside of the lungs, fluid in the pleural space (pleural effusion) also appears as increased opacity on CXR. When available, comparison of CXRs of the patient taken at different time points and correlation with clinical symptoms and history are helpful in making the diagnosis. CXRs are the most commonly performed diagnostic imaging study. A number of factors such as positioning of the patient and depth of inspiration can alter the appearance of the CXR [4], complicating interpretation further. In addition, clinicians are faced with reading high volumes of images every shift. To improve the efficiency and reach of diagnostic services, the Radiological Society of North America (RSNA®) has reached out to Kaggle’s machine learning community and collaborated with the US National Institutes of Health, The Society of Thoracic Radiology, and MD.ai to develop a rich dataset for this challenge.  The RSNA is an international society of radiologists, medical physicists and other medical professionals with more than 54,000 members from 146 countries across the globe. They see the potential for ML to automate initial detection (imaging screening) of potential pneumonia cases in order to prioritize and expedite their review. Challenge participants may be invited to present their AI models and methodologies during an award ceremony at the RSNA Annual Meeting which will be held in Chicago, Illinois, USA, from November 25-30, 2018. Acknowledgements Thank you to the National Institutes of Health Clinical Center for publicly providing the Chest X-Ray dataset [5].  NIH News release: NIH Clinical Center provides one of the largest publicly available chest x-ray datasets to scientific community Original source files and documents  Also, a big thank you to the competition organizers! References  Rui P, Kang K. National Ambulatory Medical Care Survey: 2015 Emergency Department Summary Tables.  Table 27.  Available from: www.cdc.gov/nchs/data/nhamcs/webtables/2015edwebtables.pdf Deaths: Final Data for 2015.  Supplemental Tables. Tables I-21, I-22.  Available from: www.cdc.gov/nchs/data/nvsr/nvsr66/nvsr6606tables.pdf Franquet T.  Imaging of community-acquired pneumonia.  J Thorac Imaging 2018 (epub ahead of print).  PMID 30036297 Kelly B.  The Chest Radiograph. Ulster Med J 2012;81(3):143-148 Wang X, Peng Y, Lu L, Lu Z, Bagheri M, Summers RM. ChestX-ray8: Hospital-scale Chest X-ray Database and Benchmarks on Weakly-Supervised Classification and Localization of Common Thorax Diseases. IEEE CVPR 2017, http://openaccess.thecvf.com/content_cvpr_2017/papers/Wang_ChestX-ray8_Hospital-Scale_Chest_CVPR_2017_paper.pdf", "link": "https://www.kaggle.com/c/rsna-pneumonia-detection-challenge", "tags": ["DL", "Classification", "Healthcare", "Exploratory Data Analysis", "CNN", "Transfer Learning"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-11-01 00:59:00", "words": 572, "sentences": 34, "sum_nltk": "It requires review of a chest radiograph (CXR) by highly trained specialists and confirmation through clinical history, vital signs and laboratory exams.\nHowever, the diagnosis of pneumonia on CXR is complicated because of a number of other conditions in the lungs such as fluid overload (pulmonary edema), bleeding, volume loss (atelectasis or collapse), lung cancer, or post-radiation or surgical changes.\nTo improve the efficiency and reach of diagnostic services, the Radiological Society of North America (RSNA®) has reached out to Kaggle’s machine learning community and collaborated with the US National Institutes of Health, The Society of Thoracic Radiology, and MD.ai to develop a rich dataset for this challenge.\nThey see the potential for ML to automate initial detection (imaging screening) of potential pneumonia cases in order to prioritize and expedite their review.\nAcknowledgements Thank you to the National Institutes of Health Clinical Center for publicly providing the Chest X-Ray dataset [5].\nNIH News release: NIH Clinical Center provides one of the largest publicly available chest x-ray datasets to scientific community Original source files and documents  Also, a big thank you to the competition organizers!\nNational Ambulatory Medical Care Survey: 2015 Emergency Department Summary Tables.\nImaging of community-acquired pneumonia.\nIEEE CVPR 2017, http://openaccess.thecvf.com/content_cvpr_2017/papers/Wang_ChestX-ray8_Hospital-Scale_Chest_CVPR_2017_paper.pdf", "sum_nltk_words": 195, "sum_nltk_runtime": 0.007, "sum_t5": "in 2015, 920,000 children under the age of 5 died from the disease. pneumonia accounts for over 500,000 visits to emergency departments. in the united states, pneumonia accounts for over 50,000 deaths in 2015. the ailment is on the list of top 10 causes of death in the country. the radiological society of north america has reached out to Kaggle’s machine learning community to develop a rich dataset for this challenge. a machine learning algorithm can be used to automatically detect lung opacities on", "sum_t5_words": 84, "sum_t5_runtime": 7.005, "runtime": 0.01, "nltk_category": "Healthcare", "nltk_category_score": 0.3302061855792999, "nltk_category_runtime": 22.415, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.4442134201526642, "nltk_subcategory_runtime": 35.76, "category": "Healthcare", "category_score": 0.3302061855792999, "subcategory": "Physical", "subcategory_score": 0.4442134201526642, "runtime_cat": 58.174, "engagement_score": "0.666", "language_code": "en", "language": "english", "language_score": "0.99999762673316", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "build algorithm automatically detects potential pneumonia casesin competition youre challenged build algorithm detect visual signal pneumonia medical image specifically algorithm need automatically locate lung opacity chest radiograph here backstory solving problem matter pneumonia account 15 death child 5 year old internationally 2015 920000 child age 5 died disease united state pneumonia account 500000 visit emergency department 1 50000 death 2015 2 keeping ailment list top 10 cause death country common accurately diagnosing pneumonia tall order requires review chest radiograph cxr highly trained specialist confirmation clinical history vital sign laboratory exam pneumonia usually manifest area area increased opacity 3 cxr however diagnosis pneumonia cxr complicated number condition lung fluid overload pulmonary edema bleeding volume loss atelectasis collapse lung cancer postradiation surgical change outside lung fluid pleural space pleural effusion also appears increased opacity cxr available comparison cxrs patient taken different time point correlation clinical symptom history helpful making diagnosis cxrs commonly performed diagnostic imaging study number factor positioning patient depth inspiration alter appearance cxr 4 complicating interpretation addition clinician faced reading high volume image every shift improve efficiency reach diagnostic service radiological society north america rsna reached kaggles machine learning community collaborated u national institute health society thoracic radiology mdai develop rich dataset challenge rsna international society radiologist medical physicist medical professional 54000 member 146 country across globe see potential ml automate initial detection imaging screening potential pneumonia case order prioritize expedite review challenge participant may invited present ai model methodology award ceremony rsna annual meeting held chicago illinois usa november 2530 2018 acknowledgement thank national institute health clinical center publicly providing chest xray dataset 5 nih news release nih clinical center provides one largest publicly available chest xray datasets scientific community original source file document also big thank competition organizer reference rui p kang k national ambulatory medical care survey 2015 emergency department summary table table 27 available wwwcdcgovnchsdatanhamcswebtables2015edwebtablespdf death final data 2015 supplemental table table i21 i22 available wwwcdcgovnchsdatanvsrnvsr66nvsr6606tablespdf franquet imaging communityacquired pneumonia j thorac imaging 2018 epub ahead print pmid 30036297 kelly b chest radiograph ulster med j 2012813143148 wang x peng lu l lu z bagheri summer rm chestxray8 hospitalscale chest xray database benchmark weaklysupervised classification localization common thorax disease ieee cvpr 2017 httpopenaccessthecvfcomcontent_cvpr_2017paperswang_chestxray8_hospitalscale_chest_cvpr_2017_paperpdf", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Healthcare", "Exploratory Data Analysis", "Convolutional Neural Network (CNN)", "Transfer Learning"]}