{"title": "Google AI Open Images - Object Detection Track", "description": "Detect objects in varied and complex images.Introduction Google AI (Google’s AI research arm, tasked with advancing AI for everyone) is challenging you to build an algorithm that detects objects automatically using an absolutely massive training dataset ― one with more varied and complex bounding-box annotations and object classes than ever before. Here's the background. Computers are getting better and better at vision. But in a few critical ways, they still can't match a human’s intuitive perception. For example, what do you see when you look at this photo?  Most of us would answer, “a sandy beach, the ocean, a few people walking, some trees, grass, and buildings…a woman walking her dog right there! Oh yeah, and there is a man holding a plastic cup.” Can a computer provide as precise an image description? Google AI wants to further push the capabilities of computer vision. We hope that providing very large training set will stimulate research into more sophisticated object and relationship detection models that will exceed current state-of-the-art performance. The results of this Challenge will be presented at a workshop at the European Conference on Computer Vision 2018.  Object Detection Track Object detection is a central task in computer vision, with applications ranging across search, robotics, self-driving cars, and many others.  As deep network solutions become deeper and more complex, they are often limited by the amount of training data available. With this in mind, to spur advances in analyzing and understanding images, Google AI has publicly released the Open Images dataset.  Open Images follows the tradition of PASCAL VOC, ImageNet and COCO, now at an unprecedented scale. The Open Images Challenge is based on Open Images dataset. The training set of the Challenge contains:  12M bounding-box annotations for 500 object classes on 1.7M training images Images of complex scenes with several objects–an average of 7 boxes per image Highly varied images that contain brand new objects like “fedora” and “snowman” Class hierarchy that reflects the relationships between classes of Open Images.   In this track of the Challenge, you are asked to build the best performing algorithm for automatically detecting objects.  Please refer to the Open Images Challenge page for additional details on the dataset. In addition to this Object Detection track, the Challenge also includes a Visual Relationship Detection track to detect pairs of objects in particular relations, e.g. \"woman playing guitar,\" \"beer on table,\" \"dog inside car\", \"man holding coffee\", etc. The Visual Relationship Detection track is available here.      Example annotations. Left: Mark Paul Gosselaar plays the guitar by Rhys A. Right: the house by anita kluska. Both images used under CC BY 2.0 license.", "link": "https://www.kaggle.com/c/google-ai-open-images-object-detection-track", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-08-31 01:59:00", "words": 450, "sentences": 22, "sum_nltk": "Detect objects in varied and complex images.Introduction Google AI (Google’s AI research arm, tasked with advancing AI for everyone) is challenging you to build an algorithm that detects objects automatically using an absolutely massive training dataset ― one with more varied and complex bounding-box annotations and object classes than ever before.\nWe hope that providing very large training set will stimulate research into more sophisticated object and relationship detection models that will exceed current state-of-the-art performance.\nObject Detection Track Object detection is a central task in computer vision, with applications ranging across search, robotics, self-driving cars, and many others.\nThe training set of the Challenge contains:  12M bounding-box annotations for 500 object classes on 1.7M training images Images of complex scenes with several objects–an average of 7 boxes per image Highly varied images that contain brand new objects like “fedora” and “snowman” Class hierarchy that reflects the relationships between classes of Open Images.\nIn this track of the Challenge, you are asked to build the best performing algorithm for automatically detecting objects.\nPlease refer to the Open Images Challenge page for additional details on the dataset.\n\"woman playing guitar,\" \"beer on table,\" \"dog inside car\", \"man holding coffee\", etc.\nThe Visual Relationship Detection track is available here.", "sum_nltk_words": 201, "sum_nltk_runtime": 0.007, "sum_t5": "the Open Images Challenge is based on open images dataset. it contains 12M bounding-box annotations for 500 object classes on 1.7M training images. images of complex scenes with several objects – an average of 7 boxes per image. the results of this challenge will be presented at a workshop at the European Conference on Computer Vision 2018. a total of 67 objects will be spotted in the challenge. a total of 67 objects will be spotted in the challenge.", "sum_t5_words": 79, "sum_t5_runtime": 6.715, "runtime": 0.003, "nltk_category": "Manufacturing", "nltk_category_score": 0.19046048820018768, "nltk_category_runtime": 18.979, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.5514665842056274, "nltk_subcategory_runtime": 30.575, "category": "Manufacturing", "category_score": 0.19046048820018768, "subcategory": "Machine Learning", "subcategory_score": 0.5514665842056274, "runtime_cat": 49.554, "engagement_score": "0.601", "language_code": "en", "language": "english", "language_score": "0.9999970694470598", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "detect object varied complex imagesintroduction google ai google ai research arm tasked advancing ai everyone challenging build algorithm detects object automatically using absolutely massive training dataset one varied complex boundingbox annotation object class ever here background computer getting better better vision critical way still cant match human intuitive perception example see look photo u would answer sandy beach ocean people walking tree grass buildingsa woman walking dog right oh yeah man holding plastic cup computer provide precise image description google ai want push capability computer vision hope providing large training set stimulate research sophisticated object relationship detection model exceed current stateoftheart performance result challenge presented workshop european conference computer vision 2018 object detection track object detection central task computer vision application ranging across search robotics selfdriving car many others deep network solution become deeper complex often limited amount training data available mind spur advance analyzing understanding image google ai publicly released open image dataset open image follows tradition pascal voc imagenet coco unprecedented scale open image challenge based open image dataset training set challenge contains 12m boundingbox annotation 500 object class 17m training image image complex scene several objectsan average 7 box per image highly varied image contain brand new object like fedora snowman class hierarchy reflects relationship class open image track challenge asked build best performing algorithm automatically detecting object please refer open image challenge page additional detail dataset addition object detection track challenge also includes visual relationship detection track detect pair object particular relation eg woman playing guitar beer table dog inside car man holding coffee etc visual relationship detection track available example annotation left mark paul gosselaar play guitar rhys right house anita kluska image used cc 20 license", "tags_descriptive": []}