{"title": "NOAA Fisheries Steller Sea Lion Population Count", "description": "How many sea lions do you see?Steller sea lions in the western Aleutian Islands have declined 94 percent in the last 30 years. The endangered western population, found in the North Pacific, are the focus of conservation efforts which require annual population counts. Specially trained scientists at NOAA Fisheries Alaska Fisheries Science Center conduct these surveys using airplanes and unoccupied aircraft systems to collect aerial images. Having accurate population estimates enables us to better understand factors that may be contributing to lack of recovery of Stellers in this area. Currently, it takes biologists up to four months to count sea lions from the thousands of images NOAA Fisheries collects each year. Once individual counts are conducted, the tallies must be reconciled to confirm their reliability. The results of these counts are time-sensitive. In this competition, Kagglers are invited to develop algorithms which accurately count the number of sea lions in aerial photographs. Automating the annual population count will free up critical resources allowing NOAA Fisheries to focus on ensuring we hear the sea lion’s roar for many years to come. Plus, advancements in computer vision applied to aerial population counts may also greatly benefit other endangered species.  Resources Learn more about research being done to better understand what's going on with the endangered Steller sea lion populations by joining scientists on a research vessel to the western Aleutian Islands in the video below.", "link": "https://www.kaggle.com/c/noaa-fisheries-steller-sea-lion-population-count", "tags": ["CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-06-28 01:59:00", "words": 234, "sentences": 11, "sum_nltk": "How many sea lions do you see?Steller sea lions in the western Aleutian Islands have declined 94 percent in the last 30 years.\nThe endangered western population, found in the North Pacific, are the focus of conservation efforts which require annual population counts.\nSpecially trained scientists at NOAA Fisheries Alaska Fisheries Science Center conduct these surveys using airplanes and unoccupied aircraft systems to collect aerial images.\nCurrently, it takes biologists up to four months to count sea lions from the thousands of images NOAA Fisheries collects each year.\nIn this competition, Kagglers are invited to develop algorithms which accurately count the number of sea lions in aerial photographs.\nAutomating the annual population count will free up critical resources allowing NOAA Fisheries to focus on ensuring we hear the sea lion’s roar for many years to come.\nPlus, advancements in computer vision applied to aerial population counts may also greatly benefit other endangered species.\nResources Learn more about research being done to better understand what's going on with the endangered Steller sea lion populations by joining scientists on a research vessel to the western Aleutian Islands in the video below.", "sum_nltk_words": 182, "sum_nltk_runtime": 0.003, "sum_t5": "the endangered western population has declined 94 percent in the last 30 years. it takes biologists up to four months to count sea lions from the thousands of images NOAA collects each year. the results of these counts must be reconciled to confirm their reliability. the results of this competition, Kagglers are invited to develop algorithms which accurately count the number of sea lions in aerial photographs. a new technology could help scientists better understand the situation of Steller sea lions in the western aleutian", "sum_t5_words": 85, "sum_t5_runtime": 5.241, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.7897374629974365, "nltk_category_runtime": 15.699, "nltk_subcategory": "Life-sciences", "nltk_subcategory_score": 0.6903167366981506, "nltk_subcategory_runtime": 24.798, "category": "Education & Research", "category_score": 0.7897374629974365, "subcategory": "Life-sciences", "subcategory_score": 0.6903167366981506, "runtime_cat": 40.496, "engagement_score": "0.591", "language_code": "en", "language": "english", "language_score": "0.9999987235209842", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "many sea lion seesteller sea lion western aleutian island declined 94 percent last 30 year endangered western population found north pacific focus conservation effort require annual population count specially trained scientist noaa fishery alaska fishery science center conduct survey using airplane unoccupied aircraft system collect aerial image accurate population estimate enables u better understand factor may contributing lack recovery steller area currently take biologist four month count sea lion thousand image noaa fishery collect year individual count conducted tally must reconciled confirm reliability result count timesensitive competition kagglers invited develop algorithm accurately count number sea lion aerial photograph automating annual population count free critical resource allowing noaa fishery focus ensuring hear sea lion roar many year come plus advancement computer vision applied aerial population count may also greatly benefit endangered specie resource learn research done better understand whats going endangered steller sea lion population joining scientist research vessel western aleutian island video", "tags_descriptive": ["Convolutional Neural Network (CNN)"]}