{"title": "Amazon.com - Employee Access Challenge", "description": "Predict an employee's access needs, given his/her job roleWhen an employee at any company starts work, they first need to obtain the computer access necessary to fulfill their role. This access may allow an employee to read/manipulate resources through various applications or web portals. It is assumed that employees fulfilling the functions of a given role will access the same or similar resources. It is often the case that employees figure out the access they need as they encounter roadblocks during their daily work (e.g. not able to log into a reporting portal). A knowledgeable supervisor then takes time to manually grant the needed access in order to overcome access obstacles. As employees move throughout a company, this access discovery/recovery cycle wastes a nontrivial amount of time and money. There is a considerable amount of data regarding an employee’s role within an organization and the resources to which they have access. Given the data related to current employees and their provisioned access, models can be built that automatically determine access privileges as employees enter and leave roles within a company. These auto-access models seek to minimize the human involvement required to grant or revoke employee access. Objective The objective of this competition is to build a model, learned using historical data, that will determine an employee's access needs, such that manual access transactions (grants and revokes) are minimized as the employee's attributes change over time. The model will take an employee's role information and a resource code and will return whether or not access should be granted. Partners This competition is hosted in collaboration with the IEEE International Workshop on Machine Learning for Signal Processing (MLSP 2013)", "link": "https://www.kaggle.com/c/amazon-employee-access-challenge", "tags": ["DL", "Classification", "Feature Engineering", "Gradient Boosting", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2013-08-01 01:59:00", "words": 277, "sentences": 13, "sum_nltk": "Predict an employee's access needs, given his/her job roleWhen an employee at any company starts work, they first need to obtain the computer access necessary to fulfill their role.\nIt is assumed that employees fulfilling the functions of a given role will access the same or similar resources.\nA knowledgeable supervisor then takes time to manually grant the needed access in order to overcome access obstacles.\nThere is a considerable amount of data regarding an employee’s role within an organization and the resources to which they have access.\nGiven the data related to current employees and their provisioned access, models can be built that automatically determine access privileges as employees enter and leave roles within a company.\nThese auto-access models seek to minimize the human involvement required to grant or revoke employee access.\nObjective The objective of this competition is to build a model, learned using historical data, that will determine an employee's access needs, such that manual access transactions (grants and revokes) are minimized as the employee's attributes change over time.\nThe model will take an employee's role information and a resource code and will return whether or not access should be granted.", "sum_nltk_words": 187, "sum_nltk_runtime": 0.003, "sum_t5": "competition to build a model that will determine an employee's access needs. model will take an employee's role information and a resource code and will return whether or not access should be granted. it is often the case that employees figure out the access they need as they encounter roadblocks during their daily work. as employees move throughout a company, this access discovery/recovery cycle wastes a nontrivial amount of time and money.", "sum_t5_words": 72, "sum_t5_runtime": 5.718, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.5617738962173462, "nltk_category_runtime": 16.084, "nltk_subcategory": "Restaurant", "nltk_subcategory_score": 0.6038298606872559, "nltk_subcategory_runtime": 25.349, "category": "Utilities", "category_score": 0.5617738962173462, "subcategory": "Restaurant", "subcategory_score": 0.6038298606872559, "runtime_cat": 41.433, "engagement_score": "0.672", "language_code": "en", "language": "english", "language_score": "0.9999975585842577", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict employee access need given hisher job rolewhen employee company start work first need obtain computer access necessary fulfill role access may allow employee readmanipulate resource various application web portal assumed employee fulfilling function given role access similar resource often case employee figure access need encounter roadblock daily work eg able log reporting portal knowledgeable supervisor take time manually grant needed access order overcome access obstacle employee move throughout company access discoveryrecovery cycle waste nontrivial amount time money considerable amount data regarding employee role within organization resource access given data related current employee provisioned access model built automatically determine access privilege employee enter leave role within company autoaccess model seek minimize human involvement required grant revoke employee access objective objective competition build model learned using historical data determine employee access need manual access transaction grant revoke minimized employee attribute change time model take employee role information resource code return whether access granted partner competition hosted collaboration ieee international workshop machine learning signal processing mlsp 2013", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Feature Engineering", "Gradient Boosting", "Classification"]}