{"title": "APTOS 2019 Blindness Detection", "description": "Detect diabetic retinopathy to stop blindness before it's too lateImagine being able to detect blindness before it happened. Millions of people suffer from diabetic retinopathy, the leading cause of blindness among working aged adults. Aravind Eye Hospital in India hopes to detect and prevent this disease among people living in rural areas where medical screening is difficult to conduct. Successful entries in this competition will improve the hospital’s ability to identify potential patients. Further, the solutions will be spread to other Ophthalmologists through the 4th Asia Pacific Tele-Ophthalmology Society (APTOS) Symposium Currently, Aravind technicians travel to these rural areas to capture images and then rely on highly trained doctors to review the images and provide diagnosis. Their goal is to scale their efforts through technology; to gain the ability to automatically screen images for disease and provide information on how severe the condition may be. In this synchronous Kernels-only competition, you'll build a machine learning model to speed up disease detection. You’ll work with thousands of images collected in rural areas to help identify diabetic retinopathy automatically. If successful, you will not only help to prevent lifelong blindness, but these models may be used to detect other sorts of diseases in the future, like glaucoma and macular degeneration.   Get started today!", "link": "https://www.kaggle.com/c/aptos2019-blindness-detection", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-09-08 01:59:00", "words": 213, "sentences": 10, "sum_nltk": "Detect diabetic retinopathy to stop blindness before it's too lateImagine being able to detect blindness before it happened.\nMillions of people suffer from diabetic retinopathy, the leading cause of blindness among working aged adults.\nAravind Eye Hospital in India hopes to detect and prevent this disease among people living in rural areas where medical screening is difficult to conduct.\nSuccessful entries in this competition will improve the hospital’s ability to identify potential patients.\nFurther, the solutions will be spread to other Ophthalmologists through the 4th Asia Pacific Tele-Ophthalmology Society (APTOS) Symposium Currently, Aravind technicians travel to these rural areas to capture images and then rely on highly trained doctors to review the images and provide diagnosis.\nTheir goal is to scale their efforts through technology; to gain the ability to automatically screen images for disease and provide information on how severe the condition may be.\nIn this synchronous Kernels-only competition, you'll build a machine learning model to speed up disease detection.\nYou’ll work with thousands of images collected in rural areas to help identify diabetic retinopathy automatically.\nIf successful, you will not only help to prevent lifelong blindness, but these models may be used to detect other sorts of diseases in the future, like glaucoma and macular degeneration.", "sum_nltk_words": 200, "sum_nltk_runtime": 0.003, "sum_t5": "millions of people suffer from diabetic retinopathy, the leading cause of blindness among working aged adults. successful entries in this competition will improve the hospital’s ability to identify potential patients. solutions will be spread to other Ophthalmologists through the 4th Asia Pacific Tele-Ophthalmology Society (APTOS) Symposium. if successful, you'll work with thousands of images collected in rural areas to help identify diabetic retinopathy automatically.", "sum_t5_words": 64, "sum_t5_runtime": 4.7, "runtime": 0.002, "nltk_category": "Healthcare", "nltk_category_score": 0.8436802625656128, "nltk_category_runtime": 18.741, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9344136714935303, "nltk_subcategory_runtime": 30.246, "category": "Healthcare", "category_score": 0.8436802625656128, "subcategory": "Machine Learning", "subcategory_score": 0.9344136714935303, "runtime_cat": 48.988, "engagement_score": "0.698", "language_code": "en", "language": "english", "language_score": "0.9999961019155453", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "detect diabetic retinopathy stop blindness lateimagine able detect blindness happened million people suffer diabetic retinopathy leading cause blindness among working aged adult aravind eye hospital india hope detect prevent disease among people living rural area medical screening difficult conduct successful entry competition improve hospital ability identify potential patient solution spread ophthalmologist 4th asia pacific teleophthalmology society aptos symposium currently aravind technician travel rural area capture image rely highly trained doctor review image provide diagnosis goal scale effort technology gain ability automatically screen image disease provide information severe condition may synchronous kernelsonly competition youll build machine learning model speed disease detection youll work thousand image collected rural area help identify diabetic retinopathy automatically successful help prevent lifelong blindness model may used detect sort disease future like glaucoma macular degeneration get started today", "tags_descriptive": []}