{"title": "Instacart Market Basket Analysis", "description": "Which products will an Instacart consumer purchase again?Whether you shop from meticulously planned grocery lists or let whimsy guide your grazing, our unique food rituals define who we are. Instacart, a grocery ordering and delivery app, aims to make it easy to fill your refrigerator and pantry with your personal favorites and staples when you need them. After selecting products through the Instacart app, personal shoppers review your order and do the in-store shopping and delivery for you. Instacart’s data science team plays a big part in providing this delightful shopping experience. Currently they use transactional data to develop models that predict which products a user will buy again, try for the first time, or add to their cart next during a session. Recently, Instacart open sourced this data - see their blog post on 3 Million Instacart Orders, Open Sourced. In this competition, Instacart is challenging the Kaggle community to use this anonymized data on customer orders over time to predict which previously purchased products will be in a user’s next order. They’re not only looking for the best model, Instacart’s also looking for machine learning engineers to grow their team. Winners of this competition will receive both a cash prize and a fast track through the recruiting process. For more information about exciting opportunities at Instacart, check out their careers page here or e-mail their recruiting team directly at ml.jobs@instacart.com.", "link": "https://www.kaggle.com/c/instacart-market-basket-analysis", "tags": ["Classification", "Recommender", "Xgboost"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-08-15 01:59:00", "words": 232, "sentences": 10, "sum_nltk": "Which products will an Instacart consumer purchase again?Whether you shop from meticulously planned grocery lists or let whimsy guide your grazing, our unique food rituals define who we are.\nInstacart, a grocery ordering and delivery app, aims to make it easy to fill your refrigerator and pantry with your personal favorites and staples when you need them.\nAfter selecting products through the Instacart app, personal shoppers review your order and do the in-store shopping and delivery for you.\nInstacart’s data science team plays a big part in providing this delightful shopping experience.\nCurrently they use transactional data to develop models that predict which products a user will buy again, try for the first time, or add to their cart next during a session.\nIn this competition, Instacart is challenging the Kaggle community to use this anonymized data on customer orders over time to predict which previously purchased products will be in a user’s next order.\nThey’re not only looking for the best model, Instacart’s also looking for machine learning engineers to grow their team.\nFor more information about exciting opportunities at Instacart, check out their careers page here or e-mail their recruiting team directly at ml.jobs@instacart.com.", "sum_nltk_words": 189, "sum_nltk_runtime": 0.003, "sum_t5": "the instacart app aims to make it easy to fill your refrigerator and pantry with your personal favorites and staples when you need them. after selecting products through the app, personal shoppers review your order and do the in-store shopping and delivery for you. recently, Instacart open sourced this data. the company is also looking for machine learning engineers to grow their team. winner of this competition will receive both a cash prize and a fast track through the recruiting process.", "sum_t5_words": 81, "sum_t5_runtime": 5.041, "runtime": 0.005, "nltk_category": "Accommodation & Food", "nltk_category_score": 0.6406296491622925, "nltk_category_runtime": 18.303, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9401639699935913, "nltk_subcategory_runtime": 29.332, "category": "Accommodation & Food", "category_score": 0.6406296491622925, "subcategory": "Machine Learning", "subcategory_score": 0.9401639699935913, "runtime_cat": 47.635, "engagement_score": "0.693", "language_code": "en", "language": "english", "language_score": "0.9999962748443205", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "product instacart consumer purchase againwhether shop meticulously planned grocery list let whimsy guide grazing unique food ritual define instacart grocery ordering delivery app aim make easy fill refrigerator pantry personal favorite staple need selecting product instacart app personal shopper review order instore shopping delivery instacarts data science team play big part providing delightful shopping experience currently use transactional data develop model predict product user buy try first time add cart next session recently instacart open sourced data see blog post 3 million instacart order open sourced competition instacart challenging kaggle community use anonymized data customer order time predict previously purchased product user next order theyre looking best model instacarts also looking machine learning engineer grow team winner competition receive cash prize fast track recruiting process information exciting opportunity instacart check career page email recruiting team directly mljobsinstacartcom", "tags_descriptive": ["Classification", "Recommender", "Xgboost"]}