{"title": "Predicting Red Hat Business Value", "description": "Classify customer potentialLike most companies, Red Hat is able to gather a great deal of information over time about the behavior of individuals who interact with them. They’re in search of better methods of using this behavioral data to predict which individuals they should approach—and even when and how to approach them. In this competition, Kagglers are challenged to create a classification algorithm that accurately identifies which customers have the most potential business value for Red Hat based on their characteristics and activities. With an improved prediction model in place, Red Hat will be able to more efficiently prioritize resources to generate more business and better serve their customers.", "link": "https://www.kaggle.com/c/predicting-red-hat-business-value", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-09-20 01:59:00", "words": 109, "sentences": 4, "runtime": 0.001, "description_category": "Wholesale & Retail", "description_category_score": 0.222084641456604, "description_category_runtime": 9.368, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.48032617568969727, "description_subcategory_runtime": 14.253, "category": "Wholesale & Retail", "category_score": 0.222084641456604, "subcategory": "Machine Learning", "subcategory_score": 0.48032617568969727, "runtime_cat": 23.624, "engagement_score": "0.686", "language_code": "en", "language": "english", "language_score": "0.9999962777926727", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "classify customer potentiallike company red hat able gather great deal information time behavior individual interact theyre search better method using behavioral data predict individual approachand even approach competition kagglers challenged create classification algorithm accurately identifies customer potential business value red hat based characteristic activity improved prediction model place red hat able efficiently prioritize resource generate business better serve customer", "tags_descriptive": []}