{"title": "PLAsTiCC Astronomical Classification", "description": "Can you help make sense of the Universe?Help some of the world's leading astronomers grasp the deepest properties of the universe. The human eye has been the arbiter for the classification of astronomical sources in the night sky for hundreds of years. But a new facility -- the Large Synoptic Survey Telescope (LSST) -- is about to revolutionize the field, discovering 10 to 100 times more astronomical sources that vary in the night sky than we've ever known. Some of these sources will be completely unprecedented! The Photometric LSST Astronomical Time-Series Classification Challenge (PLAsTiCC) asks Kagglers to help prepare to classify the data from this new survey. Competitors will classify astronomical sources that vary with time into different classes, scaling from a small training set to a very large test set of the type the LSST will discover.  More background information is available here.  Acknowledgements  PLAsTiCC is funded through LSST Corporation Grant Award # 2017-03 and administered by the University of Toronto.  Financial support for LSST comes from the National Science Foundation (NSF) through Cooperative Agreement No. 1258333, the Department of Energy (DOE) Office of Science under Contract No. DE-AC02-76SF00515, and private funding raised by the LSST Corporation. The NSF-funded LSST Project Office for construction was established as an operating center under management of the Association of Universities for Research in Astronomy (AURA).  The DOE-funded effort to build the LSST camera is managed by the SLAC National Accelerator Laboratory (SLAC). The National Science Foundation (NSF) is an independent federal agency created by Congress in 1950 to promote the progress of science. NSF supports basic research and people to create knowledge that transforms the future.        Photo Credit: M. Park/Inigo Films/LSST/AURA/NSF", "link": "https://www.kaggle.com/c/PLAsTiCC-2018", "tags": ["Astronomy", "Classification", "Feature Engineering"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-12-18 00:59:00", "words": 291, "sentences": 16, "sum_nltk": "The human eye has been the arbiter for the classification of astronomical sources in the night sky for hundreds of years.\nBut a new facility -- the Large Synoptic Survey Telescope (LSST) -- is about to revolutionize the field, discovering 10 to 100 times more astronomical sources that vary in the night sky than we've ever known.\nThe Photometric LSST Astronomical Time-Series Classification Challenge (PLAsTiCC) asks Kagglers to help prepare to classify the data from this new survey.\nCompetitors will classify astronomical sources that vary with time into different classes, scaling from a small training set to a very large test set of the type the LSST will discover.\nFinancial support for LSST comes from the National Science Foundation (NSF) through Cooperative Agreement No. 1258333, the Department of Energy (DOE) Office of Science under Contract No. DE-AC02-76SF00515, and private funding raised by the LSST Corporation.\nThe NSF-funded LSST Project Office for construction was established as an operating center under management of the Association of Universities for Research in Astronomy (AURA).\nThe DOE-funded effort to build the LSST camera is managed by the SLAC National Accelerator Laboratory (SLAC).\nThe National Science Foundation (NSF) is an independent federal agency created by Congress in 1950 to promote the progress of science.", "sum_nltk_words": 201, "sum_nltk_runtime": 0.004, "sum_t5": "the Large Synoptic Survey Telescope (LSST) is about to revolutionize the field. it will discover 10 to 100 times more astronomical sources than we've ever known. the photometric LSST Astronomical Time-Series Classification Challenge is a challenge. the competition is funded by the national science foundation (NSF) and DOE. the LSST is the first telescope to be built in the u.s. and is expected to be operational by 2020.", "sum_t5_words": 68, "sum_t5_runtime": 6.37, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.6841092109680176, "nltk_category_runtime": 19.676, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.6421756148338318, "nltk_subcategory_runtime": 30.832, "category": "Finance", "category_score": 0.6841092109680176, "subcategory": "Student", "subcategory_score": 0.6421756148338318, "runtime_cat": 50.508, "engagement_score": "0.65", "language_code": "en", "language": "english", "language_score": "0.9999972585502812", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "help make sense universehelp world leading astronomer grasp deepest property universe human eye arbiter classification astronomical source night sky hundred year new facility large synoptic survey telescope lsst revolutionize field discovering 10 100 time astronomical source vary night sky weve ever known source completely unprecedented photometric lsst astronomical timeseries classification challenge plasticc asks kagglers help prepare classify data new survey competitor classify astronomical source vary time different class scaling small training set large test set type lsst discover background information available acknowledgement plasticc funded lsst corporation grant award 201703 administered university toronto financial support lsst come national science foundation nsf cooperative agreement 1258333 department energy doe office science contract deac0276sf00515 private funding raised lsst corporation nsffunded lsst project office construction established operating center management association university research astronomy aura doefunded effort build lsst camera managed slac national accelerator laboratory slac national science foundation nsf independent federal agency created congress 1950 promote progress science nsf support basic research people create knowledge transforms future photo credit parkinigo filmslsstauransf", "tags_descriptive": ["Astronomy", "Classification", "Feature Engineering"]}