{"title": "Humpback Whale Identification Challenge", "description": "Can you identify a whale by the picture of its fluke?After centuries of intense whaling, recovering whale populations still have a hard time adapting to warming oceans and struggle to compete every day with the industrial fishing industry for food. To aid whale conservation efforts, scientists use photo surveillance systems to monitor ocean activity. They use the shape of whales’ tails and unique markings found in footage to identify what species of whale they’re analyzing and meticulously log whale pod dynamics and movements. For the past 40 years, most of this work has been done manually by individual scientists, leaving a huge trove of data untapped and underutilized. In this competition, you’re challenged to build an algorithm to identifying whale species in images. You’ll analyze Happy Whale’s database of over 25,000 images, gathered from research institutions and public contributors. By contributing, you’ll help to open rich fields of understanding for marine mammal population dynamics around the globe. We'd like to thank Happy Whale  for providing this data and problem. Happy Whale is a platform that uses image process algorithms to let anyone to submit their whale photo and have it automatically identified.", "link": "https://www.kaggle.com/c/whale-categorization-playground", "tags": ["Exploratory Data Analysis", "CV", "Transfer Learning", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-07-10 01:59:00", "words": 193, "sentences": 9, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.42230671644210815, "description_category_runtime": 16.343, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.5568546652793884, "description_subcategory_runtime": 25.923, "category": "Education & Research", "category_score": 0.42230671644210815, "subcategory": "Judicial Applied", "subcategory_score": 0.5568546652793884, "runtime_cat": 42.266, "engagement_score": "0.61", "language_code": "en", "language": "english", "language_score": "0.9999964650668169", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify whale picture flukeafter century intense whaling recovering whale population still hard time adapting warming ocean struggle compete every day industrial fishing industry food aid whale conservation effort scientist use photo surveillance system monitor ocean activity use shape whale tail unique marking found footage identify specie whale theyre analyzing meticulously log whale pod dynamic movement past 40 year work done manually individual scientist leaving huge trove data untapped underutilized competition youre challenged build algorithm identifying whale specie image youll analyze happy whale database 25000 image gathered research institution public contributor contributing youll help open rich field understanding marine mammal population dynamic around globe wed like thank happy whale providing data problem happy whale platform us image process algorithm let anyone submit whale photo automatically identified", "tags_descriptive": ["Exploratory Data Analysis", "Computer Vision (CV)", "Transfer Learning", "Classification"]}