{"title": "Toxic Comment Classification Challenge", "description": "Identify and classify toxic online commentsDiscussing things you care about can be difficult. The threat of abuse and harassment online means that many people stop expressing themselves and give up on seeking different opinions. Platforms struggle to effectively facilitate conversations, leading many communities to limit or completely shut down user comments. The Conversation AI team, a research initiative founded by Jigsaw and Google (both a part of Alphabet) are working on tools to help improve online conversation. One area of focus is the study of negative online behaviors, like toxic comments (i.e. comments that are rude, disrespectful or otherwise likely to make someone leave a discussion). So far they’ve built a range of publicly available models served through the Perspective API, including toxicity. But the current models still make errors, and they don’t allow users to select which types of toxicity they’re interested in finding (e.g. some platforms may be fine with profanity, but not with other types of toxic content). In this competition, you’re challenged to build a multi-headed model that’s capable of detecting different types of of toxicity like threats, obscenity, insults, and identity-based hate better than Perspective’s current models. You’ll be using a dataset of comments from Wikipedia’s talk page edits. Improvements to the current model will hopefully help online discussion become more productive and respectful. Disclaimer: the dataset for this competition contains text that may be considered profane, vulgar, or offensive.", "link": "https://www.kaggle.com/c/jigsaw-toxic-comment-classification-challenge", "tags": ["NLP", "Classification", "Logistic Regression", "Naive Bayes"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-03-21 00:59:00", "words": 235, "sentences": 13, "sum_nltk": "Platforms struggle to effectively facilitate conversations, leading many communities to limit or completely shut down user comments.\nThe Conversation AI team, a research initiative founded by Jigsaw and Google (both a part of Alphabet) are working on tools to help improve online conversation.\nOne area of focus is the study of negative online behaviors, like toxic comments (i.e. comments that are rude, disrespectful or otherwise likely to make someone leave a discussion).\nSo far they’ve built a range of publicly available models served through the Perspective API, including toxicity.\nBut the current models still make errors, and they don’t allow users to select which types of toxicity they’re interested in finding (e.g. some platforms may be fine with profanity, but not with other types of toxic content).\nIn this competition, you’re challenged to build a multi-headed model that’s capable of detecting different types of of toxicity like threats, obscenity, insults, and identity-based hate better than Perspective’s current models.\nYou’ll be using a dataset of comments from Wikipedia’s talk page edits.\nImprovements to the current model will hopefully help online discussion become more productive and respectful.\nDisclaimer: the dataset for this competition contains text that may be considered profane, vulgar, or offensive.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.003, "sum_t5": "the Conversation AI team is a research initiative founded by Jigsaw and google. they're working on tools to help improve online conversation. the current models still make errors and don't allow users to select which types of toxicity they're interested in finding. you'll be using a dataset of comments from Wikipedia's talk page edits. the dataset for this competition contains text that may be considered profane, vulgar, or offensive.", "sum_t5_words": 69, "sum_t5_runtime": 4.687, "runtime": 0.005, "nltk_category": "Justice, Law and Regulations", "nltk_category_score": 0.4926373064517975, "nltk_category_runtime": 19.181, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6347053050994873, "nltk_subcategory_runtime": 30.914, "category": "Justice, Law and Regulations", "category_score": 0.4926373064517975, "subcategory": "Machine Learning", "subcategory_score": 0.6347053050994873, "runtime_cat": 50.095, "engagement_score": "0.717", "language_code": "en", "language": "english", "language_score": "0.9999970974378315", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify classify toxic online commentsdiscussing thing care difficult threat abuse harassment online mean many people stop expressing give seeking different opinion platform struggle effectively facilitate conversation leading many community limit completely shut user comment conversation ai team research initiative founded jigsaw google part alphabet working tool help improve online conversation one area focus study negative online behavior like toxic comment ie comment rude disrespectful otherwise likely make someone leave discussion far theyve built range publicly available model served perspective api including toxicity current model still make error dont allow user select type toxicity theyre interested finding eg platform may fine profanity type toxic content competition youre challenged build multiheaded model thats capable detecting different type toxicity like threat obscenity insult identitybased hate better perspective current model youll using dataset comment wikipedias talk page edits improvement current model hopefully help online discussion become productive respectful disclaimer dataset competition contains text may considered profane vulgar offensive", "tags_descriptive": ["Natural Language Processing (NLP)", "Classification", "Logistic Regression", "Naive Bayes"]}