{"title": "Dogs vs. Cats", "description": "Create an algorithm to distinguish dogs from catsIn this competition, you'll write an algorithm to classify whether images contain either a dog or a cat.  This is easy for humans, dogs, and cats. Your computer will find it a bit more difficult.  Deep Blue beat Kasparov at chess in 1997.Watson beat the brightest trivia minds at Jeopardy in 2011.Can you tell Fido from Mittens in 2013? The Asirra data set Web services are often protected with a challenge that's supposed to be easy for people to solve, but difficult for computers. Such a challenge is often called a CAPTCHA (Completely Automated Public Turing test to tell Computers and Humans Apart) or HIP (Human Interactive Proof). HIPs are used for many purposes, such as to reduce email and blog spam and prevent brute-force attacks on web site passwords. Asirra (Animal Species Image Recognition for Restricting Access) is a HIP that works by asking users to identify photographs of cats and dogs. This task is difficult for computers, but studies have shown that people can accomplish it quickly and accurately. Many even think it's fun! Here is an example of the Asirra interface: Asirra is unique because of its partnership with Petfinder.com, the world's largest site devoted to finding homes for homeless pets. They've provided Microsoft Research with over three million images of cats and dogs, manually classified by people at thousands of animal shelters across the United States. Kaggle is fortunate to offer a subset of this data for fun and research.  Image recognition attacks While random guessing is the easiest form of attack, various forms of image recognition can allow an attacker to make guesses that are better than random. There is enormous diversity in the photo database (a wide variety of backgrounds, angles, poses, lighting, etc.), making accurate automatic classification difficult. In an informal poll conducted many years ago, computer vision experts posited that a classifier with better than 60% accuracy would be difficult without a major advance in the state of the art. For reference, a 60% classifier improves the guessing probability of a 12-image HIP from 1/4096 to 1/459. State of the art The current literature suggests machine classifiers can score above 80% accuracy on this task [1]. Therfore, Asirra is no longer considered safe from attack.  We have created this contest to benchmark the latest computer vision and deep learning approaches to this problem. Can you crack the CAPTCHA? Can you improve the state of the art? Can you create lasting peace between cats and dogs? Okay, we'll settle for the former.  Acknowledgements We extend our thanks to Microsoft Research for providing the data for this competition.", "link": "https://www.kaggle.com/c/dogs-vs-cats", "tags": ["DL", "Classification", "Model Explainability", "CV", "Classification", "CNN", "Transfer Learning"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2014-02-02 00:59:00", "words": 436, "sentences": 18, "sum_nltk": "Create an algorithm to distinguish dogs from catsIn this competition, you'll write an algorithm to classify whether images contain either a dog or a cat.\nThe Asirra data set Web services are often protected with a challenge that's supposed to be easy for people to solve, but difficult for computers.\nSuch a challenge is often called a CAPTCHA (Completely Automated Public Turing test to tell Computers and Humans Apart) or HIP (Human Interactive Proof).\nAsirra (Animal Species Image Recognition for Restricting Access) is a HIP that works by asking users to identify photographs of cats and dogs.\nThey've provided Microsoft Research with over three million images of cats and dogs, manually classified by people at thousands of animal shelters across the United States.\nIn an informal poll conducted many years ago, computer vision experts posited that a classifier with better than 60% accuracy would be difficult without a major advance in the state of the art.\nFor reference, a 60% classifier improves the guessing probability of a 12-image HIP from 1/4096 to 1/459.\nState of the art The current literature suggests machine classifiers can score above 80% accuracy on this task [1].", "sum_nltk_words": 181, "sum_nltk_runtime": 0.006, "sum_t5": "create an algorithm to distinguish dogs from cats. the asirra challenge is often called a CAPTCHA. studies show people can accomplish it quickly and accurately. a 60% classifier improves the guessing probability of a 12-image HIP. a symphony of e-mails can be used to classify images of cats and dogs. a symphony of e-mails can be used to classify images of cats and dogs.", "sum_t5_words": 64, "sum_t5_runtime": 6.98, "runtime": 0.005, "nltk_category": "Finance", "nltk_category_score": 0.4986485540866852, "nltk_category_runtime": 17.214, "nltk_subcategory": "Restaurant", "nltk_subcategory_score": 0.5550885200500488, "nltk_subcategory_runtime": 27.679, "category": "Finance", "category_score": 0.4986485540866852, "subcategory": "Restaurant", "subcategory_score": 0.5550885200500488, "runtime_cat": 44.893, "engagement_score": "0.553", "language_code": "en", "language": "english", "language_score": "0.999996128689721", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "create algorithm distinguish dog catsin competition youll write algorithm classify whether image contain either dog cat easy human dog cat computer find bit difficult deep blue beat kasparov chess 1997watson beat brightest trivia mind jeopardy 2011can tell fido mitten 2013 asirra data set web service often protected challenge thats supposed easy people solve difficult computer challenge often called captcha completely automated public turing test tell computer human apart hip human interactive proof hip used many purpose reduce email blog spam prevent bruteforce attack web site password asirra animal specie image recognition restricting access hip work asking user identify photograph cat dog task difficult computer study shown people accomplish quickly accurately many even think fun example asirra interface asirra unique partnership petfindercom world largest site devoted finding home homeless pet theyve provided microsoft research three million image cat dog manually classified people thousand animal shelter across united state kaggle fortunate offer subset data fun research image recognition attack random guessing easiest form attack various form image recognition allow attacker make guess better random enormous diversity photo database wide variety background angle pose lighting etc making accurate automatic classification difficult informal poll conducted many year ago computer vision expert posited classifier better 60 accuracy would difficult without major advance state art reference 60 classifier improves guessing probability 12image hip 14096 1459 state art current literature suggests machine classifier score 80 accuracy task 1 therfore asirra longer considered safe attack created contest benchmark latest computer vision deep learning approach problem crack captcha improve state art create lasting peace cat dog okay well settle former acknowledgement extend thanks microsoft research providing data competition", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Model Explainability", "Computer Vision (CV)", "Classification", "Convolutional Neural Network (CNN)", "Transfer Learning"]}