{"title": "Data Science for Good: City of Los Angeles", "description": "Help the City of Los Angeles to structure and analyze its job descriptionsData Science for Good: City of Los Angeles Help the City of Los Angeles to structure and analyze its job descriptions The City of Los Angeles faces a big hiring challenge: 1/3 of its 50,000 workers are eligible to retire by July of 2020. The city has partnered with Kaggle to create a competition to improve the job bulletins that will fill all those open positions. Problem Statement The content, tone, and format of job bulletins can influence the quality of the applicant pool. Overly-specific job requirements may discourage diversity. The Los Angeles Mayor’s Office wants to reimagine the city’s job bulletins by using text analysis to identify needed improvements.   The goal is to convert a folder full of plain-text job postings into a single structured CSV file and then to use this data to: (1) identify language that can negatively bias the pool of applicants; (2) improve the diversity and quality of the applicant pool; and/or (3) make it easier to determine which promotions are available to employees in each job class. How to Participate  Accept the Rules   Accept the competition rules.     Make Your Submission   Follow the submission instructions.  WIth your help, Los Angeles will overcome a wave of retirements and fill those jobs with a strong and diverse workforce. Good luck and happy Kaggling! Do you think companies can find better candidates by improving their job postings? We hope to create an open-sourced body of work focused on this topic by hosting another Data Science for Good competition, this time in partnership with the City of Los Angeles.", "link": "https://www.kaggle.com/c/data-science-for-good-city-of-los-angeles", "tags": ["NLP", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-06-22 01:59:00", "words": 284, "sentences": 10, "sum_nltk": "Help the City of Los Angeles to structure and analyze its job descriptionsData Science for Good: City of Los Angeles Help the City of Los Angeles to structure and analyze its job descriptions The City of Los Angeles faces a big hiring challenge: 1/3 of its 50,000 workers are eligible to retire by July of 2020.\nThe city has partnered with Kaggle to create a competition to improve the job bulletins that will fill all those open positions.\nThe Los Angeles Mayor’s Office wants to reimagine the city’s job bulletins by using text analysis to identify needed improvements.\nThe goal is to convert a folder full of plain-text job postings into a single structured CSV file and then to use this data to: (1) identify language that can negatively bias the pool of applicants; (2) improve the diversity and quality of the applicant pool; and/or (3) make it easier to determine which promotions are available to employees in each job class.\nWIth your help, Los Angeles will overcome a wave of retirements and fill those jobs with a strong and diverse workforce.\nWe hope to create an open-sourced body of work focused on this topic by hosting another Data Science for Good competition, this time in partnership with the City of Los Angeles.", "sum_nltk_words": 208, "sum_nltk_runtime": 0.004, "sum_t5": "1/3 of 50,000 workers are eligible to retire by July of 2020. the city has partnered with Kaggle to create a competition to improve the job bulletins that will fill all those open positions. the goal is to convert a folder full of plain-text job postings into a single structured CSV file. the goal is to improve the diversity and quality of the applicant pool.. do you think companies can find better candidates by improving their job bulletins?", "sum_t5_words": 78, "sum_t5_runtime": 4.996, "runtime": 0.003, "nltk_category": "Government and Public Works", "nltk_category_score": 0.5079024434089661, "nltk_category_runtime": 17.922, "nltk_subcategory": "General", "nltk_subcategory_score": 0.7852687835693359, "nltk_subcategory_runtime": 28.855, "category": "Government and Public Works", "category_score": 0.5079024434089661, "subcategory": "General", "subcategory_score": 0.7852687835693359, "runtime_cat": 46.777, "engagement_score": "0.0", "language_code": "en", "language": "english", "language_score": "0.9999963630706119", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "help city los angeles structure analyze job descriptionsdata science good city los angeles help city los angeles structure analyze job description city los angeles face big hiring challenge 13 50000 worker eligible retire july 2020 city partnered kaggle create competition improve job bulletin fill open position problem statement content tone format job bulletin influence quality applicant pool overlyspecific job requirement may discourage diversity los angeles mayor office want reimagine city job bulletin using text analysis identify needed improvement goal convert folder full plaintext job posting single structured csv file use data 1 identify language negatively bias pool applicant 2 improve diversity quality applicant pool andor 3 make easier determine promotion available employee job class participate accept rule accept competition rule make submission follow submission instruction help los angeles overcome wave retirement fill job strong diverse workforce good luck happy kaggling think company find better candidate improving job posting hope create opensourced body work focused topic hosting another data science good competition time partnership city los angeles", "tags_descriptive": ["Natural Language Processing (NLP)", "Exploratory Data Analysis"]}