{"title": "Santander Product Recommendation", "description": "Can you pair products with people?Ready to make a downpayment on your first house? Or looking to leverage the equity in the home you have? To support needs for a range of financial decisions, Santander Bank offers a lending hand to their customers through personalized product recommendations.  Under their current system, a small number of Santander’s customers receive many recommendations while many others rarely see any resulting in an uneven customer experience. In their second competition, Santander is challenging Kagglers to predict which products their existing customers will use in the next month based on their past behavior and that of similar customers. With a more effective recommendation system in place, Santander can better meet the individual needs of all customers and ensure their satisfaction no matter where they are in life. Disclaimer: This data set does not include any real Santander Spain's customer, and thus it is not representative of Spain's customer base.", "link": "https://www.kaggle.com/c/santander-product-recommendation", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-12-22 00:59:00", "words": 151, "sentences": 5, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.5968661308288574, "description_category_runtime": 13.566, "description_subcategory": "Real Estate", "description_subcategory_score": 0.4284760057926178, "description_subcategory_runtime": 20.604, "category": "Finance", "category_score": 0.5968661308288574, "subcategory": "Real Estate", "subcategory_score": 0.4284760057926178, "runtime_cat": 34.171, "engagement_score": "0.675", "language_code": "en", "language": "english", "language_score": "0.9999977906412596", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "pair product peopleready make downpayment first house looking leverage equity home support need range financial decision santander bank offer lending hand customer personalized product recommendation current system small number santanders customer receive many recommendation many others rarely see resulting uneven customer experience second competition santander challenging kagglers predict product existing customer use next month based past behavior similar customer effective recommendation system place santander better meet individual need customer ensure satisfaction matter life disclaimer data set include real santander spain customer thus representative spain customer base", "tags_descriptive": []}