{"title": "Personalize Expedia Hotel Searches - ICDM 2013", "description": "Learning to rank hotels to maximize purchasesExpedia is the world’s largest online travel agency (OTA) and powers search results for millions of travel shoppers every day. In this competitive market matching users to hotel inventory is very important since users easily jump from website to website. As such, having the best ranking of hotels (“sort”) for specific users with the best integration of price competitiveness gives an OTA the best chance of winning the sale. For this contest, Expedia has provided a dataset that includes shopping and purchase data as well as information on price competitiveness. The data are organized around a set of “search result impressions”, or the ordered list of hotels that the user sees after they search for a hotel on the Expedia website. In addition to impressions from the existing algorithm, the data contain impressions where the hotels were randomly sorted, to avoid the position bias of the existing algorithm. The user response is provided as a click on a hotel or/and a purchase of a hotel room. Appended to impressions are the following: 1) Hotel characteristics2) Location attractiveness of hotels3) User’s aggregate purchase history4) Competitive OTA information Models will be scored via performance on a hold-out set.", "link": "https://www.kaggle.com/c/expedia-personalized-sort", "tags": ["DL", "CLustering"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2013-11-05 00:59:00", "words": 202, "sentences": 8, "sum_nltk": "Learning to rank hotels to maximize purchasesExpedia is the world’s largest online travel agency (OTA) and powers search results for millions of travel shoppers every day.\nIn this competitive market matching users to hotel inventory is very important since users easily jump from website to website.\nAs such, having the best ranking of hotels (“sort”) for specific users with the best integration of price competitiveness gives an OTA the best chance of winning the sale.\nFor this contest, Expedia has provided a dataset that includes shopping and purchase data as well as information on price competitiveness.\nThe data are organized around a set of “search result impressions”, or the ordered list of hotels that the user sees after they search for a hotel on the Expedia website.\nIn addition to impressions from the existing algorithm, the data contain impressions where the hotels were randomly sorted, to avoid the position bias of the existing algorithm.\nThe user response is provided as a click on a hotel or/and a purchase of a hotel room.\nAppended to impressions are the following: 1) Hotel characteristics2) Location attractiveness of hotels3) User’s aggregate purchase history4) Competitive OTA information Models will be scored via performance on a hold-out set.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.002, "sum_t5": "OTAs are ranked based on user's search history and price competitiveness. the best ranking of hotels is based on user's location and purchase history. the data is organized around a set of “search result impressions”. the data contain impressions where the hotels were randomly sorted. the user response is provided as a click on a hotel or/and a purchase of a hotel room. the competition is open to all OTAs and is open to all OTAs", "sum_t5_words": 76, "sum_t5_runtime": 5.146, "runtime": 0.003, "nltk_category": "Finance", "nltk_category_score": 0.3658822476863861, "nltk_category_runtime": 17.721, "nltk_subcategory": "Restaurant", "nltk_subcategory_score": 0.532355546951294, "nltk_subcategory_runtime": 28.271, "category": "Finance", "category_score": 0.3658822476863861, "subcategory": "Restaurant", "subcategory_score": 0.532355546951294, "runtime_cat": 45.993, "engagement_score": "0.582", "language_code": "en", "language": "english", "language_score": "0.999997858958219", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "learning rank hotel maximize purchasesexpedia world largest online travel agency ota power search result million travel shopper every day competitive market matching user hotel inventory important since user easily jump website website best ranking hotel sort specific user best integration price competitiveness give ota best chance winning sale contest expedia provided dataset includes shopping purchase data well information price competitiveness data organized around set search result impression ordered list hotel user see search hotel expedia website addition impression existing algorithm data contain impression hotel randomly sorted avoid position bias existing algorithm user response provided click hotel orand purchase hotel room appended impression following 1 hotel characteristics2 location attractiveness hotels3 user aggregate purchase history4 competitive ota information model scored via performance holdout set", "tags_descriptive": ["Deep Learning (DL)", "CLustering"]}