{"title": "ASHRAE - Great Energy Predictor III", "description": "How much energy will a building consume?Q: How much does it cost to cool a skyscraper in the summer? A: A lot! And not just in dollars, but in environmental impact. Thankfully, significant investments are being made to improve building efficiencies to reduce costs and emissions. The question is, are the improvements working? That’s where you come in. Under pay-for-performance financing, the building owner makes payments based on the difference between their real energy consumption and what they would have used without any retrofits. The latter values have to come from a model. Current methods of estimation are fragmented and do not scale well. Some assume a specific meter type or don’t work with different building types. In this competition, you’ll develop accurate models of metered building energy usage in the following areas: chilled water, electric, hot water, and steam meters. The data comes from over 1,000 buildings over a three-year timeframe. With better estimates of these energy-saving investments, large scale investors and financial institutions will be more inclined to invest in this area to enable progress in building efficiencies. About the Host  Founded in 1894, ASHRAE serves to advance the arts and sciences of heating, ventilation, air conditioning refrigeration and their allied fields. ASHRAE members represent building system design and industrial process professionals around the world. With over 54,000 members serving in 132 countries, ASHRAE supports research, standards writing, publishing and continuing education - shaping tomorrow’s built environment today. Banner photo by Federico Beccari on Unsplash", "link": "https://www.kaggle.com/c/ashrae-energy-prediction", "tags": ["Ensembling", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting", "Regression"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-12-20 00:59:00", "words": 248, "sentences": 14, "sum_nltk": "How much energy will a building consume?Q: How much does it cost to cool a skyscraper in the summer?\nThankfully, significant investments are being made to improve building efficiencies to reduce costs and emissions.\nThe question is, are the improvements working?\nUnder pay-for-performance financing, the building owner makes payments based on the difference between their real energy consumption and what they would have used without any retrofits.\nThe latter values have to come from a model.\nSome assume a specific meter type or don’t work with different building types.\nIn this competition, you’ll develop accurate models of metered building energy usage in the following areas: chilled water, electric, hot water, and steam meters.\nThe data comes from over 1,000 buildings over a three-year timeframe.\nWith better estimates of these energy-saving investments, large scale investors and financial institutions will be more inclined to invest in this area to enable progress in building efficiencies.\nAbout the Host  Founded in 1894, ASHRAE serves to advance the arts and sciences of heating, ventilation, air conditioning refrigeration and their allied fields.\nASHRAE members represent building system design and industrial process professionals around the world.\nWith over 54,000 members serving in 132 countries, ASHRAE supports research, standards writing, publishing and continuing education - shaping tomorrow’s built environment today.", "sum_nltk_words": 202, "sum_nltk_runtime": 0.004, "sum_t5": "pay-for-performance financing is a competition to develop accurate models of metered building energy usage. data comes from over 1,000 buildings over a three-year timeframe. ASHRAE members represent building system design and industrial process professionals around the world. with over 54,000 members serving in 132 countries, ASHRAE supports research, standards writing, publishing and continuing education. ASHRAE is a non-profit organisation that aims to promote the use of renewable energy in building efficiencies.", "sum_t5_words": 71, "sum_t5_runtime": 6.148, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.5727295279502869, "nltk_category_runtime": 19.741, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.6625295281410217, "nltk_subcategory_runtime": 31.821, "category": "Education & Research", "category_score": 0.5727295279502869, "subcategory": "Quality", "subcategory_score": 0.6625295281410217, "runtime_cat": 51.561, "engagement_score": "0.707", "language_code": "en", "language": "english", "language_score": "0.9999963693990673", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "much energy building consumeq much cost cool skyscraper summer lot dollar environmental impact thankfully significant investment made improve building efficiency reduce cost emission question improvement working thats come payforperformance financing building owner make payment based difference real energy consumption would used without retrofit latter value come model current method estimation fragmented scale well assume specific meter type dont work different building type competition youll develop accurate model metered building energy usage following area chilled water electric hot water steam meter data come 1000 building threeyear timeframe better estimate energysaving investment large scale investor financial institution inclined invest area enable progress building efficiency host founded 1894 ashrae serf advance art science heating ventilation air conditioning refrigeration allied field ashrae member represent building system design industrial process professional around world 54000 member serving 132 country ashrae support research standard writing publishing continuing education shaping tomorrow built environment today banner photo federico beccari unsplash", "tags_descriptive": ["Ensembling", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting", "Regression"]}