{"title": "Yelp Restaurant Photo Classification", "description": "Predict attribute labels for restaurants using user-submitted photosDoes your favorite Ethiopian restaurant take reservations? Will a first date at that authentic looking bistro break your wallet? Is the diner down the street a good call for breakfast? Restaurant labels help Yelp users quickly answer questions like these, narrowing down their results to only restaurants that fit their nuanced needs. In this competition, Yelp is challenging Kagglers to build a model that automatically tags restaurants with multiple labels using a dataset of user-submitted photos. Currently, restaurant labels are manually selected by Yelp users when they submit a review. Selecting the labels is optional, leaving some restaurants un- or only partially-categorized.  In an age of food selfies and photo-centric social storytelling, it may be no surprise to hear that Yelp's users upload an enormous amount of photos every day alongside their written reviews. Can you turn their pictures into (less than a thousand) words?  Yelp isn’t only looking for your best model; we’re looking for data mining engineers that can help us use our data in novel ways while pushing code to production. The prize for this competition is a fast track through the recruiting process and an opportunity to show our data mining teams just what you’ve got! For more information about exciting opportunities at Yelp, check out the Jobs at Yelp competition page and Yelp's own careers page.", "link": "https://www.kaggle.com/c/yelp-restaurant-photo-classification", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-04-13 01:59:00", "words": 209, "sentences": 6, "sum_nltk": "Predict attribute labels for restaurants using user-submitted photosDoes your favorite Ethiopian restaurant take reservations?\nWill a first date at that authentic looking bistro break your wallet?\nRestaurant labels help Yelp users quickly answer questions like these, narrowing down their results to only restaurants that fit their nuanced needs.\nIn this competition, Yelp is challenging Kagglers to build a model that automatically tags restaurants with multiple labels using a dataset of user-submitted photos.\nCurrently, restaurant labels are manually selected by Yelp users when they submit a review.\nSelecting the labels is optional, leaving some restaurants un- or only partially-categorized.\nIn an age of food selfies and photo-centric social storytelling, it may be no surprise to hear that Yelp's users upload an enormous amount of photos every day alongside their written reviews.\nYelp isn’t only looking for your best model; we’re looking for data mining engineers that can help us use our data in novel ways while pushing code to production.\nThe prize for this competition is a fast track through the recruiting process and an opportunity to show our data mining teams just what you’ve got!\nFor more information about exciting opportunities at Yelp, check out the Jobs at Yelp competition page and Yelp's own careers page.", "sum_nltk_words": 181, "sum_nltk_runtime": 0.003, "sum_t5": "Yelp is challenging Kagglers to build a model that automatically tags restaurants with multiple labels using user-submitted photos. currently, restaurant labels are manually selected by Yelp users when they submit a review. selecting the labels is optional, leaving some restaurants un- or only partially-categorized. the prize for this competition is a fast track through the recruiting process and an opportunity to show our data mining teams just what you’ve got.", "sum_t5_words": 70, "sum_t5_runtime": 4.571, "runtime": 0.0, "nltk_category": "Accommodation & Food", "nltk_category_score": 0.7274674773216248, "nltk_category_runtime": 19.456, "nltk_subcategory": "Restaurant", "nltk_subcategory_score": 0.7163335084915161, "nltk_subcategory_runtime": 32.073, "category": "Accommodation & Food", "category_score": 0.7274674773216248, "subcategory": "Restaurant", "subcategory_score": 0.7163335084915161, "runtime_cat": 51.529, "engagement_score": "0.586", "language_code": "en", "language": "english", "language_score": "0.9999961850856991", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict attribute label restaurant using usersubmitted photosdoes favorite ethiopian restaurant take reservation first date authentic looking bistro break wallet diner street good call breakfast restaurant label help yelp user quickly answer question like narrowing result restaurant fit nuanced need competition yelp challenging kagglers build model automatically tag restaurant multiple label using dataset usersubmitted photo currently restaurant label manually selected yelp user submit review selecting label optional leaving restaurant un partiallycategorized age food selfies photocentric social storytelling may surprise hear yelp user upload enormous amount photo every day alongside written review turn picture le thousand word yelp isnt looking best model looking data mining engineer help u use data novel way pushing code production prize competition fast track recruiting process opportunity show data mining team youve got information exciting opportunity yelp check job yelp competition page yelp career page", "tags_descriptive": ["Exploratory Data Analysis"]}