{"title": "iMaterialist (Fashion) 2020 at FGVC7", "description": "Fine-grained segmentation task for fashion and apparelDesigners know what they are creating, but what, and how, do people really wear their products? What combinations of products are people using? In this competition, we challenge you to develop algorithms that will help with an important step towards automatic product detection – to accurately assign segmentations and attribute labels for fashion images.  Visual analysis of clothing is a topic that has received increasing attention in recent years. Being able to recognize apparel products and associated attributes from pictures could enhance the shopping experience for consumers, and increase work efficiency for fashion professionals. We present a clothing dataset with the goal of introducing a novel fine-grained segmentation task by joining forces between the fashion and computer vision communities. The proposed task unifies both categorization and segmentation of rich and complete apparel attributes, an important step toward real-world applications.   While early work in computer vision addressed related clothing recognition tasks, these are not designed with fashion insiders’ needs in mind, possibly due to the research gap in fashion design and computer vision. To address this, we first propose a fashion taxonomy built by fashion experts, informed by product description from the internet. To capture the complex structure of fashion objects and ambiguity in descriptions obtained from crawling the web, our standardized taxonomy contains 46 apparel objects (27 main apparel items and 19 apparel parts), and 294 related fine-grained attributes. Secondly, a total of 50K clothing images (with both segmentation masks and fine-grained attributes) in daily-life, celebrity events, and online shopping are labeled by both domain experts and crowd workers for fine-grained segmentation. Individuals/Teams with top submissions will be invited to present their work live at the FGVC7 workshop at the Conference on Computer Vision and Pattern Recognition (CVPR) 2020. Acknowledgments The iMat-Fashion Challenge 2020 is sponsored by Google AI, CVDF, Fashionpedia and Hearst Magazine.", "link": "https://www.kaggle.com/c/imaterialist-fashion-2020-fgvc7", "tags": ["DL"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-05-27 01:59:00", "words": 313, "sentences": 11, "sum_nltk": "Fine-grained segmentation task for fashion and apparelDesigners know what they are creating, but what, and how, do people really wear their products?\nIn this competition, we challenge you to develop algorithms that will help with an important step towards automatic product detection – to accurately assign segmentations and attribute labels for fashion images.\nBeing able to recognize apparel products and associated attributes from pictures could enhance the shopping experience for consumers, and increase work efficiency for fashion professionals.\nWe present a clothing dataset with the goal of introducing a novel fine-grained segmentation task by joining forces between the fashion and computer vision communities.\nThe proposed task unifies both categorization and segmentation of rich and complete apparel attributes, an important step toward real-world applications.\nWhile early work in computer vision addressed related clothing recognition tasks, these are not designed with fashion insiders’ needs in mind, possibly due to the research gap in fashion design and computer vision.\nTo address this, we first propose a fashion taxonomy built by fashion experts, informed by product description from the internet.\nTo capture the complex structure of fashion objects and ambiguity in descriptions obtained from crawling the web, our standardized taxonomy contains 46 apparel objects (27 main apparel items and 19 apparel parts), and 294 related fine-grained attributes.", "sum_nltk_words": 206, "sum_nltk_runtime": 0.004, "sum_t5": "iMat-Fashion Challenge 2020 is sponsored by Google AI, CVDF, Fashionpedia and Hearst Magazine. aims to create a novel fine-grained segmentation task for fashion and apparel. aims to unify categorization and segmentation of rich and complete apparel attributes. a total of 50K clothing images are labeled by both domain experts and crowd workers. iMat-Fashion Challenge 2020 is sponsored by Google AI, CVDF, Fashionpedia and He", "sum_t5_words": 64, "sum_t5_runtime": 6.755, "runtime": 0.003, "nltk_category": "Wholesale & Retail", "nltk_category_score": 0.34482184052467346, "nltk_category_runtime": 18.212, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.5275896191596985, "nltk_subcategory_runtime": 29.064, "category": "Wholesale & Retail", "category_score": 0.34482184052467346, "subcategory": "Physical", "subcategory_score": 0.5275896191596985, "runtime_cat": 47.275, "engagement_score": "0.455", "language_code": "en", "language": "english", "language_score": "0.9999963538885612", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "finegrained segmentation task fashion appareldesigners know creating people really wear product combination product people using competition challenge develop algorithm help important step towards automatic product detection accurately assign segmentation attribute label fashion image visual analysis clothing topic received increasing attention recent year able recognize apparel product associated attribute picture could enhance shopping experience consumer increase work efficiency fashion professional present clothing dataset goal introducing novel finegrained segmentation task joining force fashion computer vision community proposed task unifies categorization segmentation rich complete apparel attribute important step toward realworld application early work computer vision addressed related clothing recognition task designed fashion insider need mind possibly due research gap fashion design computer vision address first propose fashion taxonomy built fashion expert informed product description internet capture complex structure fashion object ambiguity description obtained crawling web standardized taxonomy contains 46 apparel object 27 main apparel item 19 apparel part 294 related finegrained attribute secondly total 50k clothing image segmentation mask finegrained attribute dailylife celebrity event online shopping labeled domain expert crowd worker finegrained segmentation individualsteams top submission invited present work live fgvc7 workshop conference computer vision pattern recognition cvpr 2020 acknowledgment imatfashion challenge 2020 sponsored google ai cvdf fashionpedia hearst magazine", "tags_descriptive": ["Deep Learning (DL)"]}