{"title": "Google Landmark Recognition 2019", "description": "Label famous (and not-so-famous) landmarks in imagesDid you ever go through your vacation photos and ask yourself: What is the name of this temple I visited in China? Who created this monument I saw in France? Landmark recognition can help! This technology can predict landmark labels directly from image pixels, to help people better understand and organize their photo collections. Today, a great obstacle to landmark recognition research is the lack of large annotated datasets. In this competition, we present the largest worldwide dataset to date, to foster progress in this problem. This competition challenges Kagglers to build models that recognize the correct landmark (if any) in a dataset of challenging test images. Many Kagglers are familiar with image classification challenges like the ImageNet Large Scale Visual Recognition Challenge (ILSVRC), which aims to recognize 1K general object categories. Landmark recognition is a little different from that: it contains a much larger number of classes (there are more than 200K classes in this challenge), and the number of training examples per class may not be very large. Landmark recognition is challenging in its own way. This is the second edition of this challenge. Compared to the first edition, the new dataset is more comprehensive and diverse. See the Data tab for more in-depth discussion on the new released dataset. This challenge is organized in conjunction with the Landmark Retrieval Challenge. In particular, note that the test set for both challenges is the same, to encourage participants to compete in both. We encourage participants to use the training data from the recognition challenge (either from this year’s or last year’s dataset) to develop models which could be useful for the retrieval challenge.", "link": "https://www.kaggle.com/c/landmark-recognition-2019", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-06-04 01:59:00", "words": 280, "sentences": 13, "sum_nltk": "This technology can predict landmark labels directly from image pixels, to help people better understand and organize their photo collections.\nToday, a great obstacle to landmark recognition research is the lack of large annotated datasets.\nThis competition challenges Kagglers to build models that recognize the correct landmark (if any) in a dataset of challenging test images.\nMany Kagglers are familiar with image classification challenges like the ImageNet Large Scale Visual Recognition Challenge (ILSVRC), which aims to recognize 1K general object categories.\nLandmark recognition is a little different from that: it contains a much larger number of classes (there are more than 200K classes in this challenge), and the number of training examples per class may not be very large.\nLandmark recognition is challenging in its own way.\nCompared to the first edition, the new dataset is more comprehensive and diverse.\nThis challenge is organized in conjunction with the Landmark Retrieval Challenge.\nIn particular, note that the test set for both challenges is the same, to encourage participants to compete in both.\nWe encourage participants to use the training data from the recognition challenge (either from this year’s or last year’s dataset) to develop models which could be useful for the retrieval challenge.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.004, "sum_t5": "this competition challenges Kagglers to build models that recognize the correct landmark. the competition is organized in conjunction with the Landmark Retrieval Challenge. the test set for both challenges is the same, to encourage participants to compete. the competition is open to all ages and is open to all ages. if you have any questions, please contact eric saunders@ericsa.org. if you have any questions, please contact eric saunders@e", "sum_t5_words": 68, "sum_t5_runtime": 6.359, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.6900420784950256, "nltk_category_runtime": 17.848, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.7440928220748901, "nltk_subcategory_runtime": 27.431, "category": "Education & Research", "category_score": 0.6900420784950256, "subcategory": "Judicial Applied", "subcategory_score": 0.7440928220748901, "runtime_cat": 45.28, "engagement_score": "0.571", "language_code": "en", "language": "english", "language_score": "0.9999954076786035", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "label famous notsofamous landmark imagesdid ever go vacation photo ask name temple visited china created monument saw france landmark recognition help technology predict landmark label directly image pixel help people better understand organize photo collection today great obstacle landmark recognition research lack large annotated datasets competition present largest worldwide dataset date foster progress problem competition challenge kagglers build model recognize correct landmark dataset challenging test image many kagglers familiar image classification challenge like imagenet large scale visual recognition challenge ilsvrc aim recognize 1k general object category landmark recognition little different contains much larger number class 200k class challenge number training example per class may large landmark recognition challenging way second edition challenge compared first edition new dataset comprehensive diverse see data tab indepth discussion new released dataset challenge organized conjunction landmark retrieval challenge particular note test set challenge encourage participant compete encourage participant use training data recognition challenge either year last year dataset develop model could useful retrieval challenge", "tags_descriptive": []}