{"title": "Leaf Classification", "description": "Can you see the random forest for the leaves?There are estimated to be nearly half a million species of plant in the world. Classification of species has been historically problematic and often results in duplicate identifications. Automating plant recognition might have many applications, including:       The objective of this playground competition is to use binary leaf images and extracted features, including shape, margin & texture, to accurately identify 99 species of plants. Leaves, due to their volume, prevalence, and unique characteristics, are an effective means of differentiating plant species. They also provide a fun introduction to applying techniques that involve image-based features. As a first step, try building a classifier that uses the provided pre-extracted features. Next, try creating a set of your own features. Finally, examine the errors you're making and see what you can do to improve. Acknowledgments Kaggle is hosting this competition for the data science community to use for fun and education. This dataset originates from leaf images collected by  James Cope, Thibaut Beghin, Paolo Remagnino, & Sarah Barman of the Royal Botanic Gardens, Kew, UK. Charles Mallah, James Cope, James Orwell. Plant Leaf Classification Using Probabilistic Integration of Shape, Texture and Margin Features. Signal Processing, Pattern Recognition and Applications, in press. 2013. We thank the UCI machine learning repository for hosting the dataset.", "link": "https://www.kaggle.com/c/leaf-classification", "tags": ["Classification", "Random Forest", "K-means", "Model Comparison", "Naive Bayes", "Logistic Regression"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-03-01 00:59:00", "words": 220, "sentences": 15, "sum_nltk": "Can you see the random forest for the leaves?There are estimated to be nearly half a million species of plant in the world.\nClassification of species has been historically problematic and often results in duplicate identifications.\nAutomating plant recognition might have many applications, including:       The objective of this playground competition is to use binary leaf images and extracted features, including shape, margin & texture, to accurately identify 99 species of plants.\nLeaves, due to their volume, prevalence, and unique characteristics, are an effective means of differentiating plant species.\nThey also provide a fun introduction to applying techniques that involve image-based features.\nAs a first step, try building a classifier that uses the provided pre-extracted features.\nNext, try creating a set of your own features.\nAcknowledgments Kaggle is hosting this competition for the data science community to use for fun and education.\nThis dataset originates from leaf images collected by  James Cope, Thibaut Beghin, Paolo Remagnino, & Sarah Barman of the Royal Botanic Gardens, Kew, UK.\nCharles Mallah, James Cope, James Orwell.\nPlant Leaf Classification Using Probabilistic Integration of Shape, Texture and Margin Features.\nSignal Processing, Pattern Recognition and Applications, in press.\nWe thank the UCI machine learning repository for hosting the dataset.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.003, "sum_t5": "the objective of this playground competition is to use binary leaf images to identify 99 species of plants. leaves are an effective means of differentiating plant species. they also provide a fun introduction to applying techniques that involve image-based features. the dataset originates from leaf images collected by the royal botanic gardens, Kew, uk. the competition is open to the data science community to use for fun and education. a winner will be announced on november 14.", "sum_t5_words": 77, "sum_t5_runtime": 4.86, "runtime": 0.0, "nltk_category": "Agriculture", "nltk_category_score": 0.12142395973205566, "nltk_category_runtime": 20.497, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.17416523396968842, "nltk_subcategory_runtime": 32.485, "category": "Agriculture", "category_score": 0.12142395973205566, "subcategory": "Student", "subcategory_score": 0.17416523396968842, "runtime_cat": 52.983, "engagement_score": "0.669", "language_code": "en", "language": "english", "language_score": "0.999997598114314", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "see random forest leavesthere estimated nearly half million specie plant world classification specie historically problematic often result duplicate identification automating plant recognition might many application including objective playground competition use binary leaf image extracted feature including shape margin texture accurately identify 99 specie plant leaf due volume prevalence unique characteristic effective mean differentiating plant specie also provide fun introduction applying technique involve imagebased feature first step try building classifier us provided preextracted feature next try creating set feature finally examine error youre making see improve acknowledgment kaggle hosting competition data science community use fun education dataset originates leaf image collected james cope thibaut beghin paolo remagnino sarah barman royal botanic garden kew uk charles mallah james cope james orwell plant leaf classification using probabilistic integration shape texture margin feature signal processing pattern recognition application press 2013 thank uci machine learning repository hosting dataset", "tags_descriptive": ["Classification", "Random Forest", "K-means", "Model Comparison", "Naive Bayes", "Logistic Regression"]}