{"title": "Lyft 3D Object Detection for Autonomous Vehicles", "description": "Can you advance the state of the art in 3D object detection?Self-driving technology presents a rare opportunity to improve the quality of life in many of our communities. Avoidable collisions, single-occupant commuters, and vehicle emissions are choking cities, while infrastructure strains under rapid urban growth. Autonomous vehicles are expected to redefine transportation and unlock a myriad of societal, environmental, and economic benefits. You can apply your data analysis skills in this competition to advance the state of self-driving technology. Lyft, whose mission is to improve people’s lives with the world’s best transportation, is investing in the future of self-driving vehicles. Level 5, their self-driving division, is working on a fleet of autonomous vehicles, and currently has a team of 450+ across Palo Alto, London, and Munich working to build a leading self-driving system (they’re hiring!). Their goal is to democratize access to self-driving technology for hundreds of millions of Lyft passengers. From a technical standpoint, however,  the bar to unlock technical research and development on higher-level autonomy functions like perception, prediction, and planning is extremely high. This implies technical R&D on self-driving cars has traditionally been inaccessible to the broader research community. This dataset aims to democratize access to such data, and foster innovation in higher-level autonomy functions for everyone, everywhere. By conducting a competition, we hope to encourage the research community to focus on hard problems in this space—namely, 3D object detection over semantic maps.  In this competition, you will build and optimize algorithms based on a large-scale dataset. This dataset features the raw sensor camera inputs as perceived by a fleet of multiple, high-end, autonomous vehicles in a restricted geographic area.  If successful, you’ll make a significant contribution towards stimulating further development in autonomous vehicles and empowering communities around the world.", "link": "https://www.kaggle.com/c/3d-object-detection-for-autonomous-vehicles", "tags": ["DL", "Exploratory Data Analysis", "Automotive"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-11-13 00:59:00", "words": 296, "sentences": 14, "sum_nltk": "Can you advance the state of the art in 3D object detection?Self-driving technology presents a rare opportunity to improve the quality of life in many of our communities.\nYou can apply your data analysis skills in this competition to advance the state of self-driving technology.\nLyft, whose mission is to improve people’s lives with the world’s best transportation, is investing in the future of self-driving vehicles.\nLevel 5, their self-driving division, is working on a fleet of autonomous vehicles, and currently has a team of 450+ across Palo Alto, London, and Munich working to build a leading self-driving system (they’re hiring!).\nTheir goal is to democratize access to self-driving technology for hundreds of millions of Lyft passengers.\nFrom a technical standpoint, however,  the bar to unlock technical research and development on higher-level autonomy functions like perception, prediction, and planning is extremely high.\nThis implies technical R&D on self-driving cars has traditionally been inaccessible to the broader research community.\nThis dataset aims to democratize access to such data, and foster innovation in higher-level autonomy functions for everyone, everywhere.\nBy conducting a competition, we hope to encourage the research community to focus on hard problems in this space—namely, 3D object detection over semantic maps.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.004, "sum_t5": "avoidable collisions, single-occupant commuters, and vehicle emissions are choking cities. autonomous vehicles are expected to redefine transportation and unlock societal, environmental, and economic benefits. level 5's self-driving division is working on a fleet of autonomous vehicles. the goal is to democratize access to self-driving technology for hundreds of millions of Lyft passengers. the dataset aims to democratize access to such data, and foster innovation in higher-level autonomy functions for", "sum_t5_words": 69, "sum_t5_runtime": 6.823, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.7023458480834961, "nltk_category_runtime": 19.069, "nltk_subcategory": "Transportation", "nltk_subcategory_score": 0.8872193694114685, "nltk_subcategory_runtime": 30.109, "category": "Education & Research", "category_score": 0.7023458480834961, "subcategory": "Transportation", "subcategory_score": 0.8872193694114685, "runtime_cat": 49.178, "engagement_score": "0.612", "language_code": "en", "language": "english", "language_score": "0.9999964484388231", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "advance state art 3d object detectionselfdriving technology present rare opportunity improve quality life many community avoidable collision singleoccupant commuter vehicle emission choking city infrastructure strain rapid urban growth autonomous vehicle expected redefine transportation unlock myriad societal environmental economic benefit apply data analysis skill competition advance state selfdriving technology lyft whose mission improve people life world best transportation investing future selfdriving vehicle level 5 selfdriving division working fleet autonomous vehicle currently team 450 across palo alto london munich working build leading selfdriving system theyre hiring goal democratize access selfdriving technology hundred million lyft passenger technical standpoint however bar unlock technical research development higherlevel autonomy function like perception prediction planning extremely high implies technical rd selfdriving car traditionally inaccessible broader research community dataset aim democratize access data foster innovation higherlevel autonomy function everyone everywhere conducting competition hope encourage research community focus hard problem spacenamely 3d object detection semantic map competition build optimize algorithm based largescale dataset dataset feature raw sensor camera input perceived fleet multiple highend autonomous vehicle restricted geographic area successful youll make significant contribution towards stimulating development autonomous vehicle empowering community around world", "tags_descriptive": ["Deep Learning (DL)", "Exploratory Data Analysis", "Automotive"]}