{"title": "Google Cloud & NCAA® ML Competition 2018-Men's", "description": "Apply Machine Learning to NCAA® March Madness®Google Cloud and NCAA® have teamed up to bring you this year’s version of the Kaggle machine learning competition. Another year, another chance to anticipate the upsets, call the probabilities, and put your bracketology skills to the leaderboard test. Kagglers will join the millions of fans who attempt to forecast the outcomes of March Madness® during this year's NCAA Division I Men’s and Women’s Basketball Championships. But unlike most fans, you will pick your bracket using a combination of NCAA’s historical data and your computing power, while the ground truth unfolds on national television.   In the first stage of the competition, Kagglers will rely on results of past tournaments to build and test models. We encourage you to post any useful external data as a dataset. In the second stage, competitors will forecast outcomes of all possible match-ups in the 2018 NCAA Division I Men’s and Women’s Basketball Championships. You don't need to participate in the first stage to enter the second. The first stage exists to incentivize model building and provide a means to score predictions. The real competition is forecasting the 2018 results. This page is for the NCAA Division I Men's tournament. Check out the NCAA Division I Women's tournament here.", "link": "https://www.kaggle.com/c/mens-machine-learning-competition-2018", "tags": ["Logistic Regression", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-04-03 01:59:00", "words": 212, "sentences": 12, "sum_nltk": "Apply Machine Learning to NCAA® March Madness®Google Cloud and NCAA® have teamed up to bring you this year’s version of the Kaggle machine learning competition.\nAnother year, another chance to anticipate the upsets, call the probabilities, and put your bracketology skills to the leaderboard test.\nKagglers will join the millions of fans who attempt to forecast the outcomes of March Madness® during this year's NCAA Division I Men’s and Women’s Basketball Championships.\nBut unlike most fans, you will pick your bracket using a combination of NCAA’s historical data and your computing power, while the ground truth unfolds on national television.\nIn the first stage of the competition, Kagglers will rely on results of past tournaments to build and test models.\nWe encourage you to post any useful external data as a dataset.\nIn the second stage, competitors will forecast outcomes of all possible match-ups in the 2018 NCAA Division I Men’s and Women’s Basketball Championships.\nYou don't need to participate in the first stage to enter the second.\nThe first stage exists to incentivize model building and provide a means to score predictions.\nThe real competition is forecasting the 2018 results.\nThis page is for the NCAA Division I Men's tournament.\nCheck out the NCAA Division I Women's tournament here.", "sum_nltk_words": 199, "sum_nltk_runtime": 0.003, "sum_t5": "Google Cloud and NCAA® have teamed up to bring you this year’s version of the Kaggle machine learning competition. you will pick your bracket using a combination of NCAA’s historical data and your computing power, while the ground truth unfolds on national television. in the first stage of the competition, Kagglers will rely on results of past tournaments to build and test models. in the second stage, competitors will forecast outcomes of all possible match-ups in the 2018 NCAA Division I men’s and women", "sum_t5_words": 84, "sum_t5_runtime": 5.176, "runtime": 0.005, "nltk_category": "Utilities", "nltk_category_score": 0.13833416998386383, "nltk_category_runtime": 18.897, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.5854675769805908, "nltk_subcategory_runtime": 30.89, "category": "Utilities", "category_score": 0.13833416998386383, "subcategory": "Student", "subcategory_score": 0.5854675769805908, "runtime_cat": 49.787, "engagement_score": "0.642", "language_code": "en", "language": "english", "language_score": "0.9999948465597625", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "apply machine learning ncaa march madnessgoogle cloud ncaa teamed bring year version kaggle machine learning competition another year another chance anticipate upset call probability put bracketology skill leaderboard test kagglers join million fan attempt forecast outcome march madness year ncaa division men woman basketball championship unlike fan pick bracket using combination ncaas historical data computing power ground truth unfolds national television first stage competition kagglers rely result past tournament build test model encourage post useful external data dataset second stage competitor forecast outcome possible matchup 2018 ncaa division men woman basketball championship dont need participate first stage enter second first stage exists incentivize model building provide mean score prediction real competition forecasting 2018 result page ncaa division men tournament check ncaa division woman tournament", "tags_descriptive": ["Logistic Regression", "Exploratory Data Analysis"]}