{"title": "How Much Did It Rain?", "description": "Predict probabilistic distribution of hourly rain given polarimetric radar measurementsFor agriculture, it is extremely important to know how much it rained on a particular field. However, rainfall is variable in space and time and it is impossible to have rain gauges everywhere. Therefore, remote sensing instruments such as radar are used to provide wide spatial coverage. Rainfall estimates drawn from remotely sensed observations will never exactly match the measurements that are carried out using rain gauges, due to the inherent characteristics of both sensors. Currently, radar observations are \"corrected\" using nearby gauges and a single estimate of rainfall is provided to users who need to know how much it rained. This competition will explore how to address this problem in a probabilistic manner.  Knowing the full probabilistic spread of rainfall amounts can be very useful to drive hydrological and agronomic models -- much more than a single estimate of rainfall.  Image courtesy of NOAA Unlike a conventional Doppler radar, a polarimetric radar transmits radio wave pulses that have both horizontal and vertical orientations. Because rain drops become flatter as they increase in size and because ice crystals tend to be elongated vertically, whereas liquid droplets tend to be flattened, it is possible to infer the size of rain drops and the type of hydrometeor from the differential reflectivity of the two orientations. In this competition, you are given polarimetric radar values and derived quantities at a location over the period of one hour. You will need to produce a probabilistic distribution of the hourly rain gauge total. More details are on the data page. This competition is sponsored by the Artificial Intelligence Committee of the American Meteorological Society. The Climate Corporation has kindly agreed to sponsor the prizes.", "link": "https://www.kaggle.com/c/how-much-did-it-rain", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-05-16 01:59:00", "words": 280, "sentences": 14, "sum_nltk": "Predict probabilistic distribution of hourly rain given polarimetric radar measurementsFor agriculture, it is extremely important to know how much it rained on a particular field.\nHowever, rainfall is variable in space and time and it is impossible to have rain gauges everywhere.\nTherefore, remote sensing instruments such as radar are used to provide wide spatial coverage.\nRainfall estimates drawn from remotely sensed observations will never exactly match the measurements that are carried out using rain gauges, due to the inherent characteristics of both sensors.\nCurrently, radar observations are \"corrected\" using nearby gauges and a single estimate of rainfall is provided to users who need to know how much it rained.\nThis competition will explore how to address this problem in a probabilistic manner.\nKnowing the full probabilistic spread of rainfall amounts can be very useful to drive hydrological and agronomic models -- much more than a single estimate of rainfall.\nIn this competition, you are given polarimetric radar values and derived quantities at a location over the period of one hour.\nYou will need to produce a probabilistic distribution of the hourly rain gauge total.\nThis competition is sponsored by the Artificial Intelligence Committee of the American Meteorological Society.", "sum_nltk_words": 187, "sum_nltk_runtime": 0.003, "sum_t5": "polarimetric radars transmit radio wave pulses that have both horizontal and vertical orientations. rain drops become flatter as they grow in size, whereas liquid droplets tend to be flattened. you will need to produce a probabilistic distribution of the hourly rain gauge total. the competition is sponsored by the artificial intelligence committee of the ams. a total of 2,000 rain gauges will be used to predict the spread of rainfall.", "sum_t5_words": 70, "sum_t5_runtime": 5.792, "runtime": 0.002, "nltk_category": "Agriculture", "nltk_category_score": 0.9354607462882996, "nltk_category_runtime": 17.243, "nltk_subcategory": "General", "nltk_subcategory_score": 0.5399654507637024, "nltk_subcategory_runtime": 27.98, "category": "Agriculture", "category_score": 0.9354607462882996, "subcategory": "General", "subcategory_score": 0.5399654507637024, "runtime_cat": 45.222, "engagement_score": "0.579", "language_code": "en", "language": "english", "language_score": "0.9999979908424295", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict probabilistic distribution hourly rain given polarimetric radar measurementsfor agriculture extremely important know much rained particular field however rainfall variable space time impossible rain gauge everywhere therefore remote sensing instrument radar used provide wide spatial coverage rainfall estimate drawn remotely sensed observation never exactly match measurement carried using rain gauge due inherent characteristic sensor currently radar observation corrected using nearby gauge single estimate rainfall provided user need know much rained competition explore address problem probabilistic manner knowing full probabilistic spread rainfall amount useful drive hydrological agronomic model much single estimate rainfall image courtesy noaa unlike conventional doppler radar polarimetric radar transmits radio wave pulse horizontal vertical orientation rain drop become flatter increase size ice crystal tend elongated vertically whereas liquid droplet tend flattened possible infer size rain drop type hydrometeor differential reflectivity two orientation competition given polarimetric radar value derived quantity location period one hour need produce probabilistic distribution hourly rain gauge total detail data page competition sponsored artificial intelligence committee american meteorological society climate corporation kindly agreed sponsor prize", "tags_descriptive": []}