{"title": "Passenger Screening Algorithm Challenge", "description": "Improve the accuracy of the Department of Homeland Security's threat recognition algorithmsWhile long lines and frantically shuffling luggage into plastic bins isn’t a fun experience, airport security is a critical and necessary requirement for safe travel. No one understands the need for both thorough security screenings and short wait times more than U.S. Transportation Security Administration (TSA). They’re responsible for all U.S. airport security, screening more than two million passengers daily. As part of their Apex Screening at Speed Program, DHS has identified high false alarm rates as creating significant bottlenecks at the airport checkpoints. Whenever TSA’s sensors and algorithms predict a potential threat, TSA staff needs to engage in a secondary, manual screening process that slows everything down. And as the number of travelers increase every year and new threats develop, their prediction algorithms need to continually improve to meet the increased demand. Currently, TSA purchases updated algorithms exclusively from the manufacturers of the scanning equipment used. These algorithms are proprietary, expensive, and often released in long cycles. In this competition, TSA is stepping outside their established procurement process and is challenging the broader data science community to help improve the accuracy of their threat prediction algorithms. Using a dataset of images collected on the latest generation of scanners, participants are challenged to identify the presence of simulated threats under a variety of object types, clothing types, and body types. Even a modest decrease in false alarms will help TSA significantly improve the passenger experience while maintaining high levels of security. This is a two-stage competition. Please read our two-stage FAQs to understand more about what this means. All persons contained in the dataset are volunteers who have agreed to have their images used for this competition. The images may contain sensitive content. We kindly request that you conduct yourself with professionalism, respect, and maturity when working with this data.", "link": "https://www.kaggle.com/c/passenger-screening-algorithm-challenge", "tags": ["Exploratory Data Analysis", "CV", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-12-16 00:59:00", "words": 311, "sentences": 18, "sum_nltk": "Improve the accuracy of the Department of Homeland Security's threat recognition algorithmsWhile long lines and frantically shuffling luggage into plastic bins isn’t a fun experience, airport security is a critical and necessary requirement for safe travel.\nNo one understands the need for both thorough security screenings and short wait times more than U.S. Transportation Security Administration (TSA).\nWhenever TSA’s sensors and algorithms predict a potential threat, TSA staff needs to engage in a secondary, manual screening process that slows everything down.\nAnd as the number of travelers increase every year and new threats develop, their prediction algorithms need to continually improve to meet the increased demand.\nIn this competition, TSA is stepping outside their established procurement process and is challenging the broader data science community to help improve the accuracy of their threat prediction algorithms.\nUsing a dataset of images collected on the latest generation of scanners, participants are challenged to identify the presence of simulated threats under a variety of object types, clothing types, and body types.\nEven a modest decrease in false alarms will help TSA significantly improve the passenger experience while maintaining high levels of security.\nAll persons contained in the dataset are volunteers who have agreed to have their images used for this competition.", "sum_nltk_words": 201, "sum_nltk_runtime": 0.004, "sum_t5": "the department of homeland security is responsible for all U.s. airport security, screening more than two million passengers daily. high false alarm rates are creating significant bottlenecks at the airport checkpoints. a modest decrease in false alarms will help TSA significantly improve the passenger experience while maintaining high levels of security. the images contained in the dataset are volunteers who have agreed to have their images used for this competition. if you are interested in competing, please contact sarah mccartney@sa.", "sum_t5_words": 80, "sum_t5_runtime": 6.578, "runtime": 0.004, "nltk_category": "Justice, Law and Regulations", "nltk_category_score": 0.24335423111915588, "nltk_category_runtime": 16.814, "nltk_subcategory": "Transportation", "nltk_subcategory_score": 0.701460599899292, "nltk_subcategory_runtime": 27.082, "category": "Justice, Law and Regulations", "category_score": 0.24335423111915588, "subcategory": "Transportation", "subcategory_score": 0.701460599899292, "runtime_cat": 43.897, "engagement_score": "0.609", "language_code": "en", "language": "english", "language_score": "0.9999971374801884", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "improve accuracy department homeland security threat recognition algorithmswhile long line frantically shuffling luggage plastic bin isnt fun experience airport security critical necessary requirement safe travel one understands need thorough security screening short wait time u transportation security administration tsa theyre responsible u airport security screening two million passenger daily part apex screening speed program dhs identified high false alarm rate creating significant bottleneck airport checkpoint whenever tsa sensor algorithm predict potential threat tsa staff need engage secondary manual screening process slows everything number traveler increase every year new threat develop prediction algorithm need continually improve meet increased demand currently tsa purchase updated algorithm exclusively manufacturer scanning equipment used algorithm proprietary expensive often released long cycle competition tsa stepping outside established procurement process challenging broader data science community help improve accuracy threat prediction algorithm using dataset image collected latest generation scanner participant challenged identify presence simulated threat variety object type clothing type body type even modest decrease false alarm help tsa significantly improve passenger experience maintaining high level security twostage competition please read twostage faq understand mean person contained dataset volunteer agreed image used competition image may contain sensitive content kindly request conduct professionalism respect maturity working data", "tags_descriptive": ["Exploratory Data Analysis", "Computer Vision (CV)", "Convolutional Neural Network (CNN)"]}