{"title": "Herbarium 2020 - FGVC7", "description": "Identify plant species from herbarium specimens. Data from New York Botanical Garden.The Herbarium 2020 FGVC7 Challenge is to identify vascular plant species from a large, long-tailed collection herbarium specimens provided by the New York Botanical Garden (NYBG). The Herbarium 2020 dataset contains over 1M images representing over 32,000 plant species. This is a dataset with a long tail; there are a minimum of 3 specimens per species, however, some species are represented by more than a hundred specimens. This dataset only contains vascular land plants which includes lycophytes, ferns, gymnosperms, and flowering plants. The extinct forms of lycophytes are the major component of coal deposits, ferns are indicators of ecosystem health, gymnosperms provide major habitats for animals, and flowering plants provide all of our crops, vegetables, and fruits.        The teams with the most accurate models will be contacted, with the intention of using them on the un-named plant collections in the NYBG herbarium collection, and assessed by the NYBG plant specialists. Background The New York Botanical Garden (NYBG) herbarium contains more than 7.8 million plant and fungal specimens. Herbaria are a massive repository of plant diversity data.  These collections not only represent a vast amount of plant diversity, but since herbarium collections include specimens dating back hundreds of years, they provide snapshots of plant diversity through time.  The integrity of the plant is maintained in herbaria as a pressed, dried specimen; a specimen collected nearly two hundred years ago by Darwin looks much the same as one collected a month ago by an NYBG botanist.  All specimens not only maintain their morphological features but also include collection dates and locations, and the name of the person who collected the specimen.  This information, multiplied by millions of plant collections, provides the framework for understanding plant diversity on a massive scale and learning how it has changed over time. About This is an FGVC competition hosted as part of the FGVC7 workshop at CVPR 2020 and sponsored by NYBG. Details of this competition are mirrored on the github page. Please post in the forum or open an issue if you have any questions or problems with the dataset.", "link": "https://www.kaggle.com/c/herbarium-2020-fgvc7", "tags": ["DL", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-05-27 01:59:00", "words": 367, "sentences": 16, "sum_nltk": "Data from New York Botanical Garden.The Herbarium 2020 FGVC7 Challenge is to identify vascular plant species from a large, long-tailed collection herbarium specimens provided by the New York Botanical Garden (NYBG).\nThe Herbarium 2020 dataset contains over 1M images representing over 32,000 plant species.\nThis is a dataset with a long tail; there are a minimum of 3 specimens per species, however, some species are represented by more than a hundred specimens.\nThis dataset only contains vascular land plants which includes lycophytes, ferns, gymnosperms, and flowering plants.\nBackground The New York Botanical Garden (NYBG) herbarium contains more than 7.8 million plant and fungal specimens.\nThese collections not only represent a vast amount of plant diversity, but since herbarium collections include specimens dating back hundreds of years, they provide snapshots of plant diversity through time.\nThe integrity of the plant is maintained in herbaria as a pressed, dried specimen; a specimen collected nearly two hundred years ago by Darwin looks much the same as one collected a month ago by an NYBG botanist.\nAll specimens not only maintain their morphological features but also include collection dates and locations, and the name of the person who collected the specimen.", "sum_nltk_words": 190, "sum_nltk_runtime": 0.004, "sum_t5": "the herbarium 2020 FGVC7 challenge is to identify plant species from herbarium specimens. the dataset contains over 1M images representing over 32,000 plant species. the teams with the most accurate models will be contacted. the teams will use the models on the un-named plant collections in the NYBG herbarium collection. a winning team will be contacted by the team with the most accurate models. a winner will be announced on november 8.", "sum_t5_words": 72, "sum_t5_runtime": 6.598, "runtime": 0.003, "nltk_category": "Agriculture", "nltk_category_score": 0.41158124804496765, "nltk_category_runtime": 18.312, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.6810184121131897, "nltk_subcategory_runtime": 29.054, "category": "Agriculture", "category_score": 0.41158124804496765, "subcategory": "Physical", "subcategory_score": 0.6810184121131897, "runtime_cat": 47.366, "engagement_score": "0.53", "language_code": "en", "language": "english", "language_score": "0.99999504704659", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify plant specie herbarium specimen data new york botanical gardenthe herbarium 2020 fgvc7 challenge identify vascular plant specie large longtailed collection herbarium specimen provided new york botanical garden nybg herbarium 2020 dataset contains 1m image representing 32000 plant specie dataset long tail minimum 3 specimen per specie however specie represented hundred specimen dataset contains vascular land plant includes lycophytes fern gymnosperm flowering plant extinct form lycophytes major component coal deposit fern indicator ecosystem health gymnosperm provide major habitat animal flowering plant provide crop vegetable fruit team accurate model contacted intention using unnamed plant collection nybg herbarium collection assessed nybg plant specialist background new york botanical garden nybg herbarium contains 78 million plant fungal specimen herbarium massive repository plant diversity data collection represent vast amount plant diversity since herbarium collection include specimen dating back hundred year provide snapshot plant diversity time integrity plant maintained herbarium pressed dried specimen specimen collected nearly two hundred year ago darwin look much one collected month ago nybg botanist specimen maintain morphological feature also include collection date location name person collected specimen information multiplied million plant collection provides framework understanding plant diversity massive scale learning changed time fgvc competition hosted part fgvc7 workshop cvpr 2020 sponsored nybg detail competition mirrored github page please post forum open issue question problem dataset", "tags_descriptive": ["Deep Learning (DL)", "Classification"]}