{"title": "Airbus Ship Detection Challenge", "description": "Find ships on satellite images as quickly as possibleAirbus is excited to challenge Kagglers to build a model that detects all ships in satellite images as quickly as possible. Can you find them even in imagery with clouds or haze?  Here’s the backstory: Shipping traffic is growing fast.  More ships increase the chances of infractions at sea like environmentally devastating ship accidents, piracy, illegal fishing, drug trafficking, and illegal cargo movement. This has compelled many organizations, from environmental protection agencies to insurance companies and national government authorities, to have a closer watch over the open seas.   Airbus offers comprehensive maritime monitoring services by building a meaningful solution for wide coverage, fine details, intensive monitoring, premium reactivity and interpretation response. Combining its proprietary-data with highly-trained analysts, they help to support the maritime industry to increase knowledge, anticipate threats, trigger alerts, and improve efficiency at sea. A lot of work has been done over the last 10 years to automatically extract objects from satellite images with significative results but no effective operational effects.  Now Airbus is turning to Kagglers to increase the accuracy and  speed of automatic ship detection. Algorithm Speed Prize: After the Kaggle challenge is complete,  competitors may submit their model via a private Kaggle kernel for a speed evaluation based upon the inference time on over 40.000  images chips (typical size of a full satellite image) to win a special algorithm speed prize.   If you're interested to explore more Airbus data, you are welcomed to check out the OneAtlas Sandbox. And for more insights on our Maritime Surveillance capabilities, have a look at Airbus Intelligence page.", "link": "https://www.kaggle.com/c/airbus-ship-detection", "tags": ["DL", "Classification", "Classification", "CNN", "Transfer Learning"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-11-15 00:59:00", "words": 276, "sentences": 11, "sum_nltk": "Find ships on satellite images as quickly as possibleAirbus is excited to challenge Kagglers to build a model that detects all ships in satellite images as quickly as possible.\nMore ships increase the chances of infractions at sea like environmentally devastating ship accidents, piracy, illegal fishing, drug trafficking, and illegal cargo movement.\nAirbus offers comprehensive maritime monitoring services by building a meaningful solution for wide coverage, fine details, intensive monitoring, premium reactivity and interpretation response.\nCombining its proprietary-data with highly-trained analysts, they help to support the maritime industry to increase knowledge, anticipate threats, trigger alerts, and improve efficiency at sea.\nNow Airbus is turning to Kagglers to increase the accuracy and  speed of automatic ship detection.\nAlgorithm Speed Prize: After the Kaggle challenge is complete,  competitors may submit their model via a private Kaggle kernel for a speed evaluation based upon the inference time on over 40.000  images chips (typical size of a full satellite image) to win a special algorithm speed prize.\nIf you're interested to explore more Airbus data, you are welcomed to check out the OneAtlas Sandbox.\nAnd for more insights on our Maritime Surveillance capabilities, have a look at Airbus Intelligence page.", "sum_nltk_words": 192, "sum_nltk_runtime": 0.004, "sum_t5": "Airbus is excited to challenge Kagglers to build a model that detects all ships in satellite images as quickly as possible. the model will be able to detect ships even in imagery with clouds or haze. competitors may submit their model via a private Kaggle kernel for a speed evaluation based upon the inference time on over 40.000 images chips. the results will be evaluated by a special algorithm speed prize. if you can't find ships in satellite images, you can enter the competition", "sum_t5_words": 84, "sum_t5_runtime": 6.627, "runtime": 0.005, "nltk_category": "Justice, Law and Regulations", "nltk_category_score": 0.6332260966300964, "nltk_category_runtime": 17.497, "nltk_subcategory": "Preventative and Reactive", "nltk_subcategory_score": 0.8361198902130127, "nltk_subcategory_runtime": 27.509, "category": "Justice, Law and Regulations", "category_score": 0.6332260966300964, "subcategory": "Preventative and Reactive", "subcategory_score": 0.8361198902130127, "runtime_cat": 45.006, "engagement_score": "0.639", "language_code": "en", "language": "english", "language_score": "0.9999979685361258", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "find ship satellite image quickly possibleairbus excited challenge kagglers build model detects ship satellite image quickly possible find even imagery cloud haze here backstory shipping traffic growing fast ship increase chance infraction sea like environmentally devastating ship accident piracy illegal fishing drug trafficking illegal cargo movement compelled many organization environmental protection agency insurance company national government authority closer watch open sea airbus offer comprehensive maritime monitoring service building meaningful solution wide coverage fine detail intensive monitoring premium reactivity interpretation response combining proprietarydata highlytrained analyst help support maritime industry increase knowledge anticipate threat trigger alert improve efficiency sea lot work done last 10 year automatically extract object satellite image significative result effective operational effect airbus turning kagglers increase accuracy speed automatic ship detection algorithm speed prize kaggle challenge complete competitor may submit model via private kaggle kernel speed evaluation based upon inference time 40000 image chip typical size full satellite image win special algorithm speed prize youre interested explore airbus data welcomed check oneatlas sandbox insight maritime surveillance capability look airbus intelligence page", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Classification", "Convolutional Neural Network (CNN)", "Transfer Learning"]}