{"title": "Santander Value Prediction Challenge", "description": "Predict the value of transactions for potential customers.According to Epsilon research, 80% of customers are more likely to do business with you if you provide personalized service. Banking is no exception.  The digitalization of everyday lives means that customers expect services to be delivered in a personalized and timely manner… and often before they´ve even realized they need the service.  In their 3rd Kaggle competition, Santander Group aims to go a step beyond recognizing that there is a need to provide a customer a financial service and intends to determine the amount or value of the customer's transaction.  This means anticipating customer needs in a more concrete, but also simple and personal way.  With so many choices for financial services, this need is greater now than ever before.  In this competition, Santander Group is asking Kagglers to help them identify the value of transactions for each potential customer. This is a first step that Santander needs to nail in order to personalize their services at scale.", "link": "https://www.kaggle.com/c/santander-value-prediction-challenge", "tags": ["Ensembling", "Feature Engineering", "Dimensionality Reduction", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-08-21 01:59:00", "words": 171, "sentences": 8, "runtime": 0.005, "description_category": "Finance", "description_category_score": 0.7287973165512085, "description_category_runtime": 13.869, "description_subcategory": "Preventative and Reactive", "description_subcategory_score": 0.48093071579933167, "description_subcategory_runtime": 21.952, "category": "Finance", "category_score": 0.7287973165512085, "subcategory": "Preventative and Reactive", "subcategory_score": 0.48093071579933167, "runtime_cat": 35.821, "engagement_score": "0.717", "language_code": "en", "language": "english", "language_score": "0.999996753777739", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict value transaction potential customersaccording epsilon research 80 customer likely business provide personalized service banking exception digitalization everyday life mean customer expect service delivered personalized timely manner often even realized need service 3rd kaggle competition santander group aim go step beyond recognizing need provide customer financial service intends determine amount value customer transaction mean anticipating customer need concrete also simple personal way many choice financial service need greater ever competition santander group asking kagglers help identify value transaction potential customer first step santander need nail order personalize service scale", "tags_descriptive": ["Ensembling", "Feature Engineering", "Dimensionality Reduction", "Exploratory Data Analysis"]}