{"title": "Conway's Reverse Game of Life", "description": "Reverse the arrow of time in the Game of LifeThe Game of Life is a cellular automaton created by mathematician John Conway in 1970. The game consists of a board of cells that are either on or off. One creates an initial configuration of these on/off states and observes how it evolves. There are four simple rules to determine the next state of the game board, given the current state:  Any live cell with fewer than two live neighbours dies, as if by underpopulation. Any live cell with two or three live neighbours lives on to the next generation. Any live cell with more than three live neighbours dies, as if by overpopulation. Any dead cell with exactly three live neighbours becomes a live cell, as if by reproduction.  These simple rules result in many interesting behaviors and have been the focus of a large body of mathematics.  As Wikipedia tells it,  Ever since its publication, Conway's Game of Life has attracted much interest, because of the surprising ways in which the patterns can evolve. Life provides an example of emergence and self-organization. It is interesting for computer scientists, physicists, biologists, biochemists, economists, mathematicians, philosophers, generative scientists and others to observe the way that complex patterns can emerge from the implementation of very simple rules. The game can also serve as a didactic analogy, used to convey the somewhat counter-intuitive notion that \"design\" and \"organization\" can spontaneously emerge in the absence of a designer. For example, philosopher and cognitive scientist Daniel Dennett has used the analogue of Conway's Life \"universe\" extensively to illustrate the possible evolution of complex philosophical constructs, such as consciousness and free will, from the relatively simple set of deterministic physical laws governing our own universe.  The emergence of order from simple rules begs an interesting question--what happens if we set time backwards? This competition is an experiment to see if machine learning (or optimization, or any method) can predict the game of life in reverse.  Is the chaotic start of Life predictable from its orderly ends?  We have created many games, evolved them, and provided only the end boards. You are asked to predict the starting board that resulted in each end board. Although some people have examined this problem, it is unknown (at least, to us...) just how difficult this will be.", "link": "https://www.kaggle.com/c/conway-s-reverse-game-of-life", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2014-03-03 00:59:00", "words": 391, "sentences": 17, "sum_nltk": "Reverse the arrow of time in the Game of LifeThe Game of Life is a cellular automaton created by mathematician John Conway in 1970.\nThere are four simple rules to determine the next state of the game board, given the current state:  Any live cell with fewer than two live neighbours dies, as if by underpopulation.\nAny live cell with more than three live neighbours dies, as if by overpopulation.\nAs Wikipedia tells it,  Ever since its publication, Conway's Game of Life has attracted much interest, because of the surprising ways in which the patterns can evolve.\nIt is interesting for computer scientists, physicists, biologists, biochemists, economists, mathematicians, philosophers, generative scientists and others to observe the way that complex patterns can emerge from the implementation of very simple rules.\nThe emergence of order from simple rules begs an interesting question--what happens if we set time backwards?\nThis competition is an experiment to see if machine learning (or optimization, or any method) can predict the game of life in reverse.\nIs the chaotic start of Life predictable from its orderly ends?\nWe have created many games, evolved them, and provided only the end boards.\nYou are asked to predict the starting board that resulted in each end board.", "sum_nltk_words": 200, "sum_nltk_runtime": 0.005, "sum_t5": "a game of life is a cellular automaton created by mathematician John Conway in 1970. john sutter: the game of life provides an example of emergence and self-organization. he says the game is an experiment to see if machine learning can predict the game of life in reverse. sutter: the game is a great way to see how life can evolve and evolve. a game of life can be played in a variety of ways, he says", "sum_t5_words": 77, "sum_t5_runtime": 7.019, "runtime": 0.004, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.22821664810180664, "nltk_category_runtime": 17.61, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.7075148820877075, "nltk_subcategory_runtime": 28.12, "category": "Biotechnological & Life Sciences", "category_score": 0.22821664810180664, "subcategory": "Machine Learning", "subcategory_score": 0.7075148820877075, "runtime_cat": 45.731, "engagement_score": "0.524", "language_code": "en", "language": "english", "language_score": "0.9999971018814819", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "reverse arrow time game lifethe game life cellular automaton created mathematician john conway 1970 game consists board cell either one creates initial configuration onoff state observes evolves four simple rule determine next state game board given current state live cell fewer two live neighbour dy underpopulation live cell two three live neighbour life next generation live cell three live neighbour dy overpopulation dead cell exactly three live neighbour becomes live cell reproduction simple rule result many interesting behavior focus large body mathematics wikipedia tell ever since publication conways game life attracted much interest surprising way pattern evolve life provides example emergence selforganization interesting computer scientist physicist biologist biochemist economist mathematician philosopher generative scientist others observe way complex pattern emerge implementation simple rule game also serve didactic analogy used convey somewhat counterintuitive notion design organization spontaneously emerge absence designer example philosopher cognitive scientist daniel dennett used analogue conways life universe extensively illustrate possible evolution complex philosophical construct consciousness free relatively simple set deterministic physical law governing universe emergence order simple rule begs interesting questionwhat happens set time backwards competition experiment see machine learning optimization method predict game life reverse chaotic start life predictable orderly end created many game evolved provided end board asked predict starting board resulted end board although people examined problem unknown least u difficult", "tags_descriptive": []}