{"title": "Intel & MobileODT Cervical Cancer Screening", "description": "Which cancer treatment will be most effective?Cervical cancer is so easy to prevent if caught in its pre-cancerous stage that every woman should have access to effective, life-saving treatment no matter where they live. Today, women worldwide in low-resource settings are benefiting from programs where cancer is identified and treated in a single visit. However, due in part to lacking expertise in the field, one of the greatest challenges of these cervical cancer screen and treat programs is determining the appropriate method of treatment which can vary depending on patients’ physiological differences.  Especially in rural parts of the world, many women at high risk for cervical cancer are receiving treatment that will not work for them due to the position of their cervix. This is a tragedy: health providers are able to identify high risk patients, but may not have the skills to reliably discern which treatment which will prevent cancer in these women. Even worse, applying the wrong treatment has a high cost. A treatment which works effectively for one woman may obscure future cancerous growth in another woman, greatly increasing health risks. Currently, MobileODT offers a Quality Assurance workflow to support remote supervision which helps healthcare providers make better treatment decisions in rural settings. However, their workflow would be greatly improved given the ability to make real-time determinations about patients’ treatment eligibility based on cervix type. In this competition, Intel is partnering with MobileODT to challenge Kagglers to develop an algorithm which accurately identifies a woman’s cervix type based on images. Doing so will prevent ineffectual treatments and allow healthcare providers to give proper referral for cases that require more advanced treatment.  Competition Partner MobileODT has developed and sells the Enhanced Visual Assessment (EVA) System, a digital toolkit for health care workers of every level to provide expert services to patients, anchored at the point-of-care by an FDA-approved, intelligent, mobile-phone based medical device. Combining the algorithmic power of biomedical optics with the computational capabilities and connectivity of mobile phones, MobileODT's connected, intelligent medical systems can be used everywhere, under nearly any conditions. MobileODT's first product, the FDA approved EVA System for colposcopy, is in use by health providers in 31 hospital systems across the US, and in 22 countries, to better screen and treat women for cervical cancer and to conduct forensic colposcopy.", "link": "https://www.kaggle.com/c/intel-mobileodt-cervical-cancer-screening", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-06-22 01:59:00", "words": 387, "sentences": 14, "sum_nltk": "However, due in part to lacking expertise in the field, one of the greatest challenges of these cervical cancer screen and treat programs is determining the appropriate method of treatment which can vary depending on patients’ physiological differences.\nEspecially in rural parts of the world, many women at high risk for cervical cancer are receiving treatment that will not work for them due to the position of their cervix.\nThis is a tragedy: health providers are able to identify high risk patients, but may not have the skills to reliably discern which treatment which will prevent cancer in these women.\nIn this competition, Intel is partnering with MobileODT to challenge Kagglers to develop an algorithm which accurately identifies a woman’s cervix type based on images.\nCompetition Partner MobileODT has developed and sells the Enhanced Visual Assessment (EVA) System, a digital toolkit for health care workers of every level to provide expert services to patients, anchored at the point-of-care by an FDA-approved, intelligent, mobile-phone based medical device.\nMobileODT's first product, the FDA approved EVA System for colposcopy, is in use by health providers in 31 hospital systems across the US, and in 22 countries, to better screen and treat women for cervical cancer and to conduct forensic colposcopy.", "sum_nltk_words": 202, "sum_nltk_runtime": 0.005, "sum_t5": "mobileODT is partnering with Intel to challenge Kagglers to develop an algorithm which accurately identifies a woman’s cervix type based on images. this will allow healthcare providers to give proper referral for cases that require more advanced treatment. the first product, the FDA approved EVA System for colposcopy, is in use by health providers in 31 hospital systems across the us and in 22 countries. it is a digital toolkit for health care workers of every level to provide expert services to patients.", "sum_t5_words": 83, "sum_t5_runtime": 7.046, "runtime": 0.003, "nltk_category": "Healthcare", "nltk_category_score": 0.7566717267036438, "nltk_category_runtime": 18.244, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.627560019493103, "nltk_subcategory_runtime": 28.725, "category": "Healthcare", "category_score": 0.7566717267036438, "subcategory": "Tools", "subcategory_score": 0.627560019493103, "runtime_cat": 46.969, "engagement_score": "0.636", "language_code": "en", "language": "english", "language_score": "0.9999966761624579", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "cancer treatment effectivecervical cancer easy prevent caught precancerous stage every woman access effective lifesaving treatment matter live today woman worldwide lowresource setting benefiting program cancer identified treated single visit however due part lacking expertise field one greatest challenge cervical cancer screen treat program determining appropriate method treatment vary depending patient physiological difference especially rural part world many woman high risk cervical cancer receiving treatment work due position cervix tragedy health provider able identify high risk patient may skill reliably discern treatment prevent cancer woman even worse applying wrong treatment high cost treatment work effectively one woman may obscure future cancerous growth another woman greatly increasing health risk currently mobileodt offer quality assurance workflow support remote supervision help healthcare provider make better treatment decision rural setting however workflow would greatly improved given ability make realtime determination patient treatment eligibility based cervix type competition intel partnering mobileodt challenge kagglers develop algorithm accurately identifies woman cervix type based image prevent ineffectual treatment allow healthcare provider give proper referral case require advanced treatment competition partner mobileodt developed sell enhanced visual assessment eva system digital toolkit health care worker every level provide expert service patient anchored pointofcare fdaapproved intelligent mobilephone based medical device combining algorithmic power biomedical optic computational capability connectivity mobile phone mobileodts connected intelligent medical system used everywhere nearly condition mobileodts first product fda approved eva system colposcopy use health provider 31 hospital system across u 22 country better screen treat woman cervical cancer conduct forensic colposcopy", "tags_descriptive": []}