{"title": "Google Cloud & YouTube-8M Video Understanding Challenge", "description": "Can you produce the best video tag predictions?Video captures a cross-section of our society. And major advances in analyzing and understanding video have the potential to touch all aspects of life from learning and communication to entertainment and play. In this competition, Google is inviting the Kaggle community to join efforts to accelerate research in large-scale video understanding, while giving participants access to the Google Cloud Machine Learning Engine. Today, one of the greatest obstacles to rapid improvements in video understanding research has been the lack of large-scale, labeled datasets open to the public. For example, the availability of large, labeled datasets such as ImageNet has enabled continued breakthroughs in machine learning and machine perception. To that end, Google’s recent release of the YouTube-8M (YT-8M) dataset represents a significant step in this direction. Making this resource open to everyone from students and industry professionals is expected to kickstart innovation in areas such as representation learning and video modeling architectures. In this competition, you are challenged to develop classification algorithms which accurately assign video-level labels using the new and improved YT-8M V2 dataset. The dataset was created from over 7 million YouTube videos (450,000 hours of video) and includes video labels from a vocabulary of 4716 classes (3.4 labels/video on average).  It also comes with pre-extracted audio & visual features from every second of video (3.2B feature vectors in total). By taking part, Kagglers will not only play a pivotal role in setting state-of-the-art benchmarks, but also improve search and organization of video archives.  Getting Started  Review the data page for special instructions on how to access the competition's data. It will be hosted on Google Cloud. Participants have the option to download the data to work locally or work within the Google Cloud ML beta Platform. Review the tutorial on Getting Started with Google Cloud, and try the starter code.  Sign up for a Google Cloud ML Platform free trial account. The free trial account includes $300 in credits!   We've also provided a subsample of the data to explore on Kernels. Take a look at this Python notebook and create your own. Don't forget to review the prize eligibility details, which includes requirements for code open-sourcing and a paper submission.  Because Cloud ML is currently a beta product, Google welcomes the opportunity to hear your feedback about using the tool. Please share your questions and thoughts on the competition's forums. Additional resources specific to the YT-8M dataset and Google Cloud ML can be found here. Acknowledgements Google Cloud Machine Learning, Competition Sponsor Google Cloud Machine Learning is a managed service that enables you to easily build machine learning models, that work on any type of data, of any size. Create your model with the powerful TensorFlow framework that powers many Google products, from GooglePhotos to Google Cloud Speech. Build models of any size with our managed scalable infrastructure. Your trained model is immediately available for use with our global prediction platform that can support thousands of users and TBs of data. The service is integrated with Google Cloud Dataflow for pre-processing, allowing you to access data from Google Cloud Storage, Google BigQuery, and others.", "link": "https://www.kaggle.com/c/youtube8m", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-06-03 01:59:00", "words": 524, "sentences": 26, "sum_nltk": "In this competition, Google is inviting the Kaggle community to join efforts to accelerate research in large-scale video understanding, while giving participants access to the Google Cloud Machine Learning Engine.\nToday, one of the greatest obstacles to rapid improvements in video understanding research has been the lack of large-scale, labeled datasets open to the public.\nIn this competition, you are challenged to develop classification algorithms which accurately assign video-level labels using the new and improved YT-8M V2 dataset.\nParticipants have the option to download the data to work locally or work within the Google Cloud ML beta Platform.\nReview the tutorial on Getting Started with Google Cloud, and try the starter code.\nSign up for a Google Cloud ML Platform free trial account.\nAdditional resources specific to the YT-8M dataset and Google Cloud ML can be found here.\nAcknowledgements Google Cloud Machine Learning, Competition Sponsor Google Cloud Machine Learning is a managed service that enables you to easily build machine learning models, that work on any type of data, of any size.\nCreate your model with the powerful TensorFlow framework that powers many Google products, from GooglePhotos to Google Cloud Speech.", "sum_nltk_words": 183, "sum_nltk_runtime": 0.007, "sum_t5": "competition invites the Kaggle community to join efforts to accelerate research in large-scale video understanding. participants will have access to the Google Cloud Machine Learning Engine. competition will be hosted on google cloud. participants will be able to download the data to work locally or within the Google Cloud ML beta platform. if you can't work with the dataset, you can submit a paper. if you can, you can submit a code to be used in the competition.", "sum_t5_words": 78, "sum_t5_runtime": 6.567, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.792819082736969, "nltk_category_runtime": 16.474, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9443891644477844, "nltk_subcategory_runtime": 26.297, "category": "Education & Research", "category_score": 0.792819082736969, "subcategory": "Machine Learning", "subcategory_score": 0.9443891644477844, "runtime_cat": 42.771, "engagement_score": "0.622", "language_code": "en", "language": "english", "language_score": "0.999996511463221", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "produce best video tag predictionsvideo capture crosssection society major advance analyzing understanding video potential touch aspect life learning communication entertainment play competition google inviting kaggle community join effort accelerate research largescale video understanding giving participant access google cloud machine learning engine today one greatest obstacle rapid improvement video understanding research lack largescale labeled datasets open public example availability large labeled datasets imagenet enabled continued breakthrough machine learning machine perception end google recent release youtube8m yt8m dataset represents significant step direction making resource open everyone student industry professional expected kickstart innovation area representation learning video modeling architecture competition challenged develop classification algorithm accurately assign videolevel label using new improved yt8m v2 dataset dataset created 7 million youtube video 450000 hour video includes video label vocabulary 4716 class 34 labelsvideo average also come preextracted audio visual feature every second video 32b feature vector total taking part kagglers play pivotal role setting stateoftheart benchmark also improve search organization video archive getting started review data page special instruction access competition data hosted google cloud participant option download data work locally work within google cloud ml beta platform review tutorial getting started google cloud try starter code sign google cloud ml platform free trial account free trial account includes 300 credit weve also provided subsample data explore kernel take look python notebook create dont forget review prize eligibility detail includes requirement code opensourcing paper submission cloud ml currently beta product google welcome opportunity hear feedback using tool please share question thought competition forum additional resource specific yt8m dataset google cloud ml found acknowledgement google cloud machine learning competition sponsor google cloud machine learning managed service enables easily build machine learning model work type data size create model powerful tensorflow framework power many google product googlephotos google cloud speech build model size managed scalable infrastructure trained model immediately available use global prediction platform support thousand user tb data service integrated google cloud dataflow preprocessing allowing access data google cloud storage google bigquery others", "tags_descriptive": []}