{"title": "Mechanisms of Action (MoA) Prediction", "description": "Can you improve the algorithm that classifies drugs based on their biological activity?The Connectivity Map, a project within the Broad Institute of MIT and Harvard,  the Laboratory for Innovation Science at Harvard (LISH), and the NIH Common Funds Library of Integrated Network-Based Cellular Signatures (LINCS), present this challenge with the goal of advancing drug development through improvements to MoA prediction algorithms. What is the Mechanism of Action (MoA) of a drug? And why is it important?  In the past, scientists derived drugs from natural products or were inspired by traditional remedies. Very common drugs, such as paracetamol, known in the US as acetaminophen, were put into clinical use decades before the biological mechanisms driving their pharmacological activities were understood. Today, with the advent of more powerful technologies, drug discovery has changed from the serendipitous approaches of the past to a more targeted model based on an understanding of the underlying biological mechanism of a disease. In this new framework, scientists seek to identify a protein target associated with a disease and develop a molecule that can modulate that protein target. As a shorthand to describe the biological activity of a given molecule, scientists assign a label referred to as mechanism-of-action or MoA for short. How do we determine the MoAs of a new drug?  One approach is to treat a sample of human cells with the drug and then analyze the cellular responses with algorithms that search for similarity to known patterns in large genomic databases, such as libraries of gene expression or cell viability patterns of drugs with known MoAs. In this competition, you will have access to a unique dataset that combines gene expression and cell viability data. The data is based on a new technology that measures simultaneously (within the same samples) human cells’ responses to drugs in a pool of 100 different cell types (thus solving the problem of identifying ex-ante, which cell types are better suited for a given drug). In addition, you will have access to MoA annotations for more than 5,000 drugs in this dataset. As is customary, the dataset has been split into testing and training subsets. Hence, your task is to use the training dataset to develop an algorithm that automatically labels each case in the test set as one or more MoA classes. Note that since drugs can have multiple MoA annotations, the task is formally a multi-label classification problem.     How to evaluate the accuracy of a solution?  Based on the MoA annotations, the accuracy of solutions will be evaluated on the average value of the logarithmic  loss function applied to each drug-MoA annotation pair. If successful, you’ll help to develop an algorithm to predict a compound’s MoA given its cellular signature, thus helping scientists advance the drug discovery process.      This is a Code Competition. Refer to Code Requirements for details.", "link": "https://www.kaggle.com/c/lish-moa", "tags": ["Xgboost", "Biology", "Exploratory Data Analysis", "Genetics", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-12-01 00:59:00", "words": 485, "sentences": 17, "sum_nltk": "Can you improve the algorithm that classifies drugs based on their biological activity?The Connectivity Map, a project within the Broad Institute of MIT and Harvard,  the Laboratory for Innovation Science at Harvard (LISH), and the NIH Common Funds Library of Integrated Network-Based Cellular Signatures (LINCS), present this challenge with the goal of advancing drug development through improvements to MoA prediction algorithms.\nAs a shorthand to describe the biological activity of a given molecule, scientists assign a label referred to as mechanism-of-action or MoA for short.\nOne approach is to treat a sample of human cells with the drug and then analyze the cellular responses with algorithms that search for similarity to known patterns in large genomic databases, such as libraries of gene expression or cell viability patterns of drugs with known MoAs. In this competition, you will have access to a unique dataset that combines gene expression and cell viability data.\nHence, your task is to use the training dataset to develop an algorithm that automatically labels each case in the test set as one or more MoA classes.\nIf successful, you’ll help to develop an algorithm to predict a compound’s MoA given its cellular signature, thus helping scientists advance the drug discovery process.", "sum_nltk_words": 201, "sum_nltk_runtime": 0.005, "sum_t5": "the Connectivity Map is a project within the Broad Institute of MIT and Harvard. it is aimed at improving the algorithm that classifies drugs based on their biological activity. the goal is to identify a protein target associated with a disease. the model is based on an understanding of the underlying biological mechanism of a disease. the competition is open to anyone with an interest in moA prediction. if you can improve the algorithm, you will be able to use it to classify drugs based on", "sum_t5_words": 86, "sum_t5_runtime": 7.002, "runtime": 0.005, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.7785508036613464, "nltk_category_runtime": 17.379, "nltk_subcategory": "Genomics", "nltk_subcategory_score": 0.7623357772827148, "nltk_subcategory_runtime": 27.427, "category": "Biotechnological & Life Sciences", "category_score": 0.7785508036613464, "subcategory": "Genomics", "subcategory_score": 0.7623357772827148, "runtime_cat": 44.805, "engagement_score": "0.716", "language_code": "en", "language": "english", "language_score": "0.9999950431266491", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "improve algorithm classifies drug based biological activitythe connectivity map project within broad institute mit harvard laboratory innovation science harvard lish nih common fund library integrated networkbased cellular signature lincs present challenge goal advancing drug development improvement moa prediction algorithm mechanism action moa drug important past scientist derived drug natural product inspired traditional remedy common drug paracetamol known u acetaminophen put clinical use decade biological mechanism driving pharmacological activity understood today advent powerful technology drug discovery changed serendipitous approach past targeted model based understanding underlying biological mechanism disease new framework scientist seek identify protein target associated disease develop molecule modulate protein target shorthand describe biological activity given molecule scientist assign label referred mechanismofaction moa short determine moa new drug one approach treat sample human cell drug analyze cellular response algorithm search similarity known pattern large genomic database library gene expression cell viability pattern drug known moa competition access unique dataset combine gene expression cell viability data data based new technology measure simultaneously within sample human cell response drug pool 100 different cell type thus solving problem identifying exante cell type better suited given drug addition access moa annotation 5000 drug dataset customary dataset split testing training subset hence task use training dataset develop algorithm automatically label case test set one moa class note since drug multiple moa annotation task formally multilabel classification problem evaluate accuracy solution based moa annotation accuracy solution evaluated average value logarithmic loss function applied drugmoa annotation pair successful youll help develop algorithm predict compound moa given cellular signature thus helping scientist advance drug discovery process code competition refer code requirement detail", "tags_descriptive": ["Xgboost", "Biology", "Exploratory Data Analysis", "Genetics", "Classification"]}