{"title": "Data Science Bowl 2017", "description": "Can you improve lung cancer detection?In the United States, lung cancer strikes 225,000 people every year, and accounts for $12 billion in health care costs. Early detection is critical to give patients the best chance at recovery and survival. One year ago, the office of the U.S. Vice President spearheaded a bold new initiative, the Cancer Moonshot, to make a decade's worth of progress in cancer prevention, diagnosis, and treatment in just 5 years. In 2017, the Data Science Bowl will be a critical milestone in support of the Cancer Moonshot by convening the data science and medical communities to develop lung cancer detection algorithms. Using a data set of thousands of high-resolution lung scans provided by the National Cancer Institute, participants will develop algorithms that accurately determine when lesions in the lungs are cancerous. This will dramatically reduce the false positive rate that plagues the current detection technology, get patients earlier access to life-saving interventions, and give radiologists more time to spend with their patients. This year, the Data Science Bowl will award $1 million in prizes to those who observe the right patterns, ask the right questions, and in turn, create unprecedented impact around cancer screening care and prevention. The funds for the prize purse will be provided by the Laura and John Arnold Foundation. Visit DataScienceBowl.com to:  Sign up to receive news about the competition Learn about the history of the Data Science Bowl and past competitions Read our latest insights on emerging analytics techniques  Acknowledgments The Data Science Bowl is presented by  Competition Sponsors Laura and John Arnold FoundationCancer Imaging Program of the National Cancer InstituteAmerican College of RadiologyAmazon Web ServicesNVIDIA Data Support Providers National Lung Screening TrialThe Cancer Imaging ArchiveDiagnostic Image Analysis Group, Radboud UniversityLahey Hospital & Medical CenterCopenhagen University Hospital Supporting Organizations  Bayes ImpactBlack Data Processng AssociatesCode the ChangeData Community DCDataKindGalvanizeGreat Minds in STEMHortonworksINFORMSLesbians Who TechNSBESociety of Asian Scientists & EngineersSociety of Women EngineersUniversity of Texas Austin, Business Analytics Program,McCombs School of BusinessUS Dept. of Health and Human ServicesUS Food and Drug AdministrationWomen in TechnologyWomen of Cyberjutsu", "link": "https://www.kaggle.com/c/data-science-bowl-2017", "tags": ["DL", "Exploratory Data Analysis", "CV", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-04-13 01:59:00", "words": 343, "sentences": 11, "sum_nltk": "Can you improve lung cancer detection?In the United States, lung cancer strikes 225,000 people every year, and accounts for $12 billion in health care costs.\nIn 2017, the Data Science Bowl will be a critical milestone in support of the Cancer Moonshot by convening the data science and medical communities to develop lung cancer detection algorithms.\nUsing a data set of thousands of high-resolution lung scans provided by the National Cancer Institute, participants will develop algorithms that accurately determine when lesions in the lungs are cancerous.\nThis year, the Data Science Bowl will award $1 million in prizes to those who observe the right patterns, ask the right questions, and in turn, create unprecedented impact around cancer screening care and prevention.\nVisit DataScienceBowl.com to:  Sign up to receive news about the competition Learn about the history of the Data Science Bowl and past competitions Read our latest insights on emerging analytics techniques  Acknowledgments The Data Science Bowl is presented by  Competition Sponsors Laura and John Arnold FoundationCancer Imaging Program of the National Cancer InstituteAmerican College of RadiologyAmazon Web ServicesNVIDIA Data Support Providers National Lung Screening TrialThe Cancer Imaging ArchiveDiagnostic Image Analysis Group, Radboud UniversityLahey Hospital & Medical CenterCopenhagen University Hospital Supporting Organizations  Bayes ImpactBlack Data Processng AssociatesCode the ChangeData Community DCDataKindGalvanizeGreat Minds in STEMHortonworksINFORMSLesbians Who TechNSBESociety of Asian Scientists & EngineersSociety of Women EngineersUniversity of Texas Austin, Business Analytics Program,McCombs School of BusinessUS Dept.", "sum_nltk_words": 230, "sum_nltk_runtime": 0.004, "sum_t5": "the data science bowl will be a critical milestone in support of the cancer moonshot. participants will develop algorithms that accurately determine when lesions in the lungs are cancerous. this year, the data science bowl will award $1 million in prizes to those who observe the right patterns. the data science bowl will be held in november and will run through november. a total of 225,000 people are diagnosed with lung cancer each year in the united states.", "sum_t5_words": 78, "sum_t5_runtime": 6.278, "runtime": 0.003, "nltk_category": "Healthcare", "nltk_category_score": 0.7215712070465088, "nltk_category_runtime": 23.135, "nltk_subcategory": "School", "nltk_subcategory_score": 0.6602635979652405, "nltk_subcategory_runtime": 37.181, "category": "Healthcare", "category_score": 0.7215712070465088, "subcategory": "School", "subcategory_score": 0.6602635979652405, "runtime_cat": 60.316, "engagement_score": "0.68", "language_code": "en", "language": "english", "language_score": "0.9999945288261254", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "improve lung cancer detectionin united state lung cancer strike 225000 people every year account 12 billion health care cost early detection critical give patient best chance recovery survival one year ago office u vice president spearheaded bold new initiative cancer moonshot make decade worth progress cancer prevention diagnosis treatment 5 year 2017 data science bowl critical milestone support cancer moonshot convening data science medical community develop lung cancer detection algorithm using data set thousand highresolution lung scan provided national cancer institute participant develop algorithm accurately determine lesion lung cancerous dramatically reduce false positive rate plague current detection technology get patient earlier access lifesaving intervention give radiologist time spend patient year data science bowl award 1 million prize observe right pattern ask right question turn create unprecedented impact around cancer screening care prevention fund prize purse provided laura john arnold foundation visit datasciencebowlcom sign receive news competition learn history data science bowl past competition read latest insight emerging analytics technique acknowledgment data science bowl presented competition sponsor laura john arnold foundationcancer imaging program national cancer instituteamerican college radiologyamazon web servicesnvidia data support provider national lung screening trialthe cancer imaging archivediagnostic image analysis group radboud universitylahey hospital medical centercopenhagen university hospital supporting organization bayes impactblack data processng associatescode changedata community dcdatakindgalvanizegreat mind stemhortonworksinformslesbians technsbesociety asian scientist engineerssociety woman engineersuniversity texas austin business analytics programmccombs school businessus dept health human servicesus food drug administrationwomen technologywomen cyberjutsu", "tags_descriptive": ["Deep Learning (DL)", "Exploratory Data Analysis", "Computer Vision (CV)", "Convolutional Neural Network (CNN)"]}