{"title": "COVID19 Local US-CA Forecasting (Week 1)", "description": "Forecast daily COVID-19 spread in California, USAThis is one of the two complementary forecasting tasks to predict COVID-19 spread. This one is based on a single state-level subcomponent in California, USA. Our intent in having this region-specific version is to offer a more manageable starting point for the global forecasting task. To start on the global version, please see the companion forecasting task. Background The White House Office of Science and Technology Policy (OSTP) pulled together a coalition research groups and companies (including Kaggle)  to prepare the COVID-19 Open Research Dataset (CORD-19) to attempt to address key open scientific questions on COVID-19. Those questions are drawn from National Academies of Sciences, Engineering, and Medicine’s (NASEM) and the World Health Organization (WHO). The Challenge Kaggle is launching two companion COVID-19 forecasting challenges to help answer a subset of the NASEM/WHO questions. While the challenge involves forecasting confirmed cases and fatalities between March 25 and April 22 in California, the primary goal isn't to produce accurate forecasts. It’s to identify factors that appear to impact the transmission rate of COVID-19. You are encouraged to pull in, curate and share data sources that might be helpful. If you find variables that look like they impact the transmission rate, please share your finding in a notebook.  As the data becomes available, we will update the leaderboard with live results based on data made available from the Johns Hopkins University Center for Systems Science and Engineering (JHU CSSE). We have received support and guidance from health and policy organizations in launching these challenges. We're hopeful the Kaggle community can make valuable contributions to developing a better understanding of factors that impact the transmission of COVID-19.  Companies and Organizations There is also a call to action for companies and other organizations: If you have datasets that might be useful, please upload them to Kaggle’s dataset platform and reference them in this forum thread. That will make them accessible to those participating in this challenge and a resource to the wider scientific community. Acknowledgements JHU CSSE for making the data available to the public. The White House OSTP for pulling together the key open questions. The image comes from the Center for Disease Control.  This is a Code Competition. Refer to Code Requirements for details.", "link": "https://www.kaggle.com/c/covid19-local-us-ca-forecasting-week-1", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-03-26 00:59:00", "words": 382, "sentences": 21, "sum_nltk": "Our intent in having this region-specific version is to offer a more manageable starting point for the global forecasting task.\nTo start on the global version, please see the companion forecasting task.\nBackground The White House Office of Science and Technology Policy (OSTP) pulled together a coalition research groups and companies (including Kaggle)  to prepare the COVID-19 Open Research Dataset (CORD-19) to attempt to address key open scientific questions on COVID-19.\nThose questions are drawn from National Academies of Sciences, Engineering, and Medicine’s (NASEM) and the World Health Organization (WHO).\nThe Challenge Kaggle is launching two companion COVID-19 forecasting challenges to help answer a subset of the NASEM/WHO questions.\nIt’s to identify factors that appear to impact the transmission rate of COVID-19.\nAs the data becomes available, we will update the leaderboard with live results based on data made available from the Johns Hopkins University Center for Systems Science and Engineering (JHU CSSE).\nWe have received support and guidance from health and policy organizations in launching these challenges.\nWe're hopeful the Kaggle community can make valuable contributions to developing a better understanding of factors that impact the transmission of COVID-19.\nThe White House OSTP for pulling together the key open questions.\nRefer to Code Requirements for details.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.005, "sum_t5": "the task is based on a single state-level subcomponent in California, USA. the intent in having this region-specific version is to offer a more manageable starting point for the global forecasting task. the challenge involves forecasting confirmed cases and fatalities between March 25 and April 22 in California. the primary goal isn't to produce accurate forecasts. it's to identify factors that appear to impact the transmission rate of COVID-19.", "sum_t5_words": 69, "sum_t5_runtime": 6.425, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.3764626681804657, "nltk_category_runtime": 19.797, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.4789476692676544, "nltk_subcategory_runtime": 31.757, "category": "Utilities", "category_score": 0.3764626681804657, "subcategory": "Student", "subcategory_score": 0.4789476692676544, "runtime_cat": 51.555, "engagement_score": "0.545", "language_code": "en", "language": "english", "language_score": "0.9999965251133268", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "forecast daily covid19 spread california usathis one two complementary forecasting task predict covid19 spread one based single statelevel subcomponent california usa intent regionspecific version offer manageable starting point global forecasting task start global version please see companion forecasting task background white house office science technology policy ostp pulled together coalition research group company including kaggle prepare covid19 open research dataset cord19 attempt address key open scientific question covid19 question drawn national academy science engineering medicine nasem world health organization challenge kaggle launching two companion covid19 forecasting challenge help answer subset nasemwho question challenge involves forecasting confirmed case fatality march 25 april 22 california primary goal isnt produce accurate forecast identify factor appear impact transmission rate covid19 encouraged pull curate share data source might helpful find variable look like impact transmission rate please share finding notebook data becomes available update leaderboard live result based data made available john hopkins university center system science engineering jhu csse received support guidance health policy organization launching challenge hopeful kaggle community make valuable contribution developing better understanding factor impact transmission covid19 company organization also call action company organization datasets might useful please upload kaggles dataset platform reference forum thread make accessible participating challenge resource wider scientific community acknowledgement jhu csse making data available public white house ostp pulling together key open question image come center disease control code competition refer code requirement detail", "tags_descriptive": []}