{"title": "Transfer Learning on Stack Exchange Tags", "description": "Predict tags from models trained on unrelated topicsWhat does physics have in common with biology, cooking, cryptography, diy, robotics, and travel? If you answered \"all pursuits are governed by the immutable laws of physics\" we'll begrudgingly give you partial credit. If you answered \"all were chosen randomly by a scheming Kaggle employee for a twisted transfer learning competition\", congratulations, we accept your answer and mark the question as solved. In this competition, we provide the titles, text, and tags of Stack Exchange questions from six different sites. We then ask for tag predictions on unseen physics questions. Solving this problem via a standard machine approach might involve training an algorithm on a corpus of related text. Here, you are challenged to train on material from outside the field. Can an algorithm learn appropriate physics tags from \"extreme-tourism Antarctica\"? Let's find out. Kaggle is hosting this competition for the data science community to use for fun and education. This dataset originates from the Stack Exchange data dump.", "link": "https://www.kaggle.com/c/transfer-learning-on-stack-exchange-tags", "tags": ["CLustering"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-03-26 00:59:00", "words": 157, "sentences": 9, "runtime": 0.0, "description_category": "Physics", "description_category_score": 0.8690550327301025, "description_category_runtime": 15.446, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7312002778053284, "description_subcategory_runtime": 24.39, "category": "Physics", "category_score": 0.8690550327301025, "subcategory": "Machine Learning", "subcategory_score": 0.7312002778053284, "runtime_cat": 39.837, "engagement_score": "0.59", "language_code": "en", "language": "english", "language_score": "0.9999971779757626", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict tag model trained unrelated topicswhat physic common biology cooking cryptography diy robotics travel answered pursuit governed immutable law physic well begrudgingly give partial credit answered chosen randomly scheming kaggle employee twisted transfer learning competition congratulation accept answer mark question solved competition provide title text tag stack exchange question six different site ask tag prediction unseen physic question solving problem via standard machine approach might involve training algorithm corpus related text challenged train material outside field algorithm learn appropriate physic tag extremetourism antarctica let find kaggle hosting competition data science community use fun education dataset originates stack exchange data dump", "tags_descriptive": ["CLustering"]}