{"title": "Gendered Pronoun Resolution", "description": "Pair pronouns to their correct entitiesCan you help end gender bias in pronoun resolution?   Pronoun resolution is part of coreference resolution, the task of pairing an expression to its referring entity. This is an important task for natural language understanding, and the resolution of ambiguous pronouns is a longstanding challenge.   Unfortunately, recent studies have suggested gender bias among state-of-the-art coreference resolvers.  Google AI Language aims to improve gender-fairness in modeling by releasing the Gendered Ambiguous Pronouns (GAP) dataset, containing gender-balanced pronouns (50% of its examples containing feminine pronouns, and 50% containing masculine pronouns).   In this two-stage competition, Kagglers are challenged to build pronoun resolution systems that perform equally well regardless of pronoun gender. Stage two's final evaluation will use a new dataset following the same format. To encourage gender-fair modeling, the ratio of masculine to feminine examples in the official test data will not be known ahead of time.    ----------    Please cite the original paper if you use GAP in your work:   @inproceedings{webster2018gap,   title =     {Mind the GAP: A Balanced Corpus of Gendered Ambiguous Pronouns},   author =    {Webster, Kellie and Recasens, Marta and Axelrod, Vera and Baldridge, Jason},   booktitle = {Transactions of the ACL},   year =      {2018},   pages =     {to appear}, }", "link": "https://www.kaggle.com/c/gendered-pronoun-resolution", "tags": ["NLP", "Exploratory Data Analysis", "Logistic Regression"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-04-23 01:59:00", "words": 243, "sentences": 8, "sum_nltk": "Pair pronouns to their correct entitiesCan you help end gender bias in pronoun resolution?\nPronoun resolution is part of coreference resolution, the task of pairing an expression to its referring entity.\nThis is an important task for natural language understanding, and the resolution of ambiguous pronouns is a longstanding challenge.\nUnfortunately, recent studies have suggested gender bias among state-of-the-art coreference resolvers.\nGoogle AI Language aims to improve gender-fairness in modeling by releasing the Gendered Ambiguous Pronouns (GAP) dataset, containing gender-balanced pronouns (50% of its examples containing feminine pronouns, and 50% containing masculine pronouns).\nIn this two-stage competition, Kagglers are challenged to build pronoun resolution systems that perform equally well regardless of pronoun gender.\nStage two's final evaluation will use a new dataset following the same format.\nTo encourage gender-fair modeling, the ratio of masculine to feminine examples in the official test data will not be known ahead of time.\n----------    Please cite the original paper if you use GAP in your work:   @inproceedings{webster2018gap,   title =     {Mind the GAP: A Balanced Corpus of Gendered Ambiguous Pronouns},   author =    {Webster, Kellie and Recasens, Marta and Axelrod, Vera and Baldridge, Jason},   booktitle = {Transactions of the ACL},   year =      {2018},   pages =     {to appear}, }", "sum_nltk_words": 225, "sum_nltk_runtime": 0.003, "sum_t5": "Google releases dataset containing gender-balanced pronouns. a competition is held to build systems that perform equally well. to encourage gender-fair modeling, the ratio of masculine to feminine examples will not be known ahead of time. if you use the dataset in your work, please cite the original paper. if you use the dataset in your work, please cite the original paper. if you use the dataset in your work, please cite the original paper.", "sum_t5_words": 74, "sum_t5_runtime": 6.23, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.3644872307777405, "nltk_category_runtime": 23.049, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.5139802098274231, "nltk_subcategory_runtime": 36.992, "category": "Utilities", "category_score": 0.3644872307777405, "subcategory": "Tools", "subcategory_score": 0.5139802098274231, "runtime_cat": 60.042, "engagement_score": "0.636", "language_code": "en", "language": "english", "language_score": "0.9999975436472988", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "pair pronoun correct entitiescan help end gender bias pronoun resolution pronoun resolution part coreference resolution task pairing expression referring entity important task natural language understanding resolution ambiguous pronoun longstanding challenge unfortunately recent study suggested gender bias among stateoftheart coreference resolvers google ai language aim improve genderfairness modeling releasing gendered ambiguous pronoun gap dataset containing genderbalanced pronoun 50 example containing feminine pronoun 50 containing masculine pronoun twostage competition kagglers challenged build pronoun resolution system perform equally well regardless pronoun gender stage two final evaluation use new dataset following format encourage genderfair modeling ratio masculine feminine example official test data known ahead time please cite original paper use gap work inproceedingswebster2018gap title mind gap balanced corpus gendered ambiguous pronoun author webster kellie recasens marta axelrod vera baldridge jason booktitle transaction acl year 2018 page appear", "tags_descriptive": ["Natural Language Processing (NLP)", "Exploratory Data Analysis", "Logistic Regression"]}