{"title": "Avito Demand Prediction Challenge", "description": "Predict demand for an online classified adWhen selling used goods online, a combination of tiny, nuanced details in a product description can make a big difference in drumming up interest. Details like:   And, even with an optimized product listing, demand for a product may simply not exist–frustrating sellers who may have over-invested in marketing. Avito, Russia’s largest classified advertisements website, is deeply familiar with this problem. Sellers on their platform sometimes feel frustrated with both too little demand (indicating something is wrong with the product or the product listing) or too much demand (indicating a hot item with a good description was underpriced). In their fourth Kaggle competition, Avito is challenging you to predict demand for an online advertisement based on its full description (title, description, images, etc.), its context (geographically where it was posted, similar ads already posted) and historical demand for similar ads in similar contexts. With this information, Avito can inform sellers on how to best optimize their listing and provide some indication of how much interest they should realistically expect to receive.", "link": "https://www.kaggle.com/c/avito-demand-prediction", "tags": ["NLP", "Feature Engineering", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-06-28 01:59:00", "words": 178, "sentences": 6, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.2980812191963196, "description_category_runtime": 15.462, "description_subcategory": "General", "description_subcategory_score": 0.38388749957084656, "description_subcategory_runtime": 24.742, "category": "Finance", "category_score": 0.2980812191963196, "subcategory": "General", "subcategory_score": 0.38388749957084656, "runtime_cat": 40.206, "engagement_score": "0.677", "language_code": "en", "language": "english", "language_score": "0.9999961097233171", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict demand online classified adwhen selling used good online combination tiny nuanced detail product description make big difference drumming interest detail like even optimized product listing demand product may simply existfrustrating seller may overinvested marketing avito russia largest classified advertisement website deeply familiar problem seller platform sometimes feel frustrated little demand indicating something wrong product product listing much demand indicating hot item good description underpriced fourth kaggle competition avito challenging predict demand online advertisement based full description title description image etc context geographically posted similar ad already posted historical demand similar ad similar context information avito inform seller best optimize listing provide indication much interest realistically expect receive", "tags_descriptive": ["Natural Language Processing (NLP)", "Feature Engineering", "Exploratory Data Analysis"]}