{"title": "Event Recommendation Engine Challenge", "description": "Predict what events our users will be interested in based on user actions, event metadata, and demographic information.We (the competition hosts) are excited to sponsor the Event Recommendation Engine Challenge, which asks you to predict what events our users will be interested in based on events they’ve responded to in the past, user demographic information, and what events  they’ve seen and clicked on in our app. The insights you discover from this data, and the algorithms the winners create, will allow us to improve our event recommendation algorithm, a core part of our applications and a key element in improving user experience. This is the first competition launching under the  Kaggle Startup Program!", "link": "https://www.kaggle.com/c/event-recommendation-engine-challenge", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2013-02-21 00:59:00", "words": 115, "sentences": 3, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.304802268743515, "description_category_runtime": 10.311, "description_subcategory": "General", "description_subcategory_score": 0.531856119632721, "description_subcategory_runtime": 15.877, "category": "Education & Research", "category_score": 0.304802268743515, "subcategory": "General", "subcategory_score": 0.531856119632721, "runtime_cat": 26.188, "engagement_score": "0.556", "language_code": "en", "language": "english", "language_score": "0.9999976567301556", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict event user interested based user action event metadata demographic informationwe competition host excited sponsor event recommendation engine challenge asks predict event user interested based event theyve responded past user demographic information event theyve seen clicked app insight discover data algorithm winner create allow u improve event recommendation algorithm core part application key element improving user experience first competition launching kaggle startup program", "tags_descriptive": []}