{"title": "NFL 1st and Future - Analytics", "description": "Can you investigate the relationship between the playing surface and the injury and performance of NFL athletes?Welcome In this challenge, you're tasked to investigate the relationship between the playing surface and the injury and performance of National Football League (NFL) athletes and to examine factors that may contribute to lower extremity injuries. You'll also notice there isn't a leaderboard, and you are not required to develop a predictive model. This isn't a traditional supervised Kaggle machine learning competition. For more information on this challenge format, see this forum thread. This challenge is part of NFL 1st & Future, the NFL’s annual Super Bowl competition designed to spur innovation in player health, safety and performance. The Challenge In the NFL, 12 stadiums have fields with synthetic turf.  Recent investigations of lower limb injuries among football athletes have indicated significantly higher injury rates on synthetic turf compared with natural turf (Mack et al., 2018; Loughran et al., 2019).  In conjunction with the epidemiologic investigations, biomechanical studies of football cleat-surface interactions have shown that synthetic turf surfaces do not release cleats as readily as natural turf and may contribute to the incidence of non-contact lower limb injuries (Kent et al., 2015).  Given these differences in cleat-turf interactions, it has yet to be determined whether player movement patterns and other measures of player performance differ across playing surfaces and how these may contribute to the incidence of lower limb injury.   Now, the NFL is challenging Kagglers to help them examine the effects that playing on synthetic turf versus natural turf can have on player movements and the factors that may contribute to lower extremity injuries.  NFL player tracking, also known as Next Gen Stats, is the capture of real time location data, speed and acceleration for every player, every play on every inch of the field. As part of this challenge, the NFL has provided full player tracking of on-field position for 250 players over two regular season schedules.  One hundred of the athletes in the study data set sustained one or more injuries during the study period that were identified as a non-contact injury of a type that may have turf interaction as a contributing factor to injury.  The remaining 150 athletes serve as a representative sample of the larger NFL population that did not sustain a non-contact lower-limb injury during the study period.  Details of the surface type and environmental parameters that may influence performance and outcome are also provided.  Your challenge is to characterize any differences in player movement between the playing surfaces and identify specific scenarios (e.g., field surface, weather, position, play type, etc.) that interact with player movement to present an elevated risk of injury.  More details on the entry criteria are available in Evaluation Tab. About The NFL The National Football League is America's most popular sports league, comprised of 32 franchises that compete each year to win the Super Bowl, the world's biggest annual sporting event. Founded in 1920, the NFL developed the model for the successful modern sports league, including national and international distribution, extensive revenue sharing, competitive excellence, and strong franchises across the country. The NFL is committed to advancing progress in the diagnosis, prevention and treatment of sports-related injuries. The NFL's ongoing health and safety efforts include support for independent medical research and engineering advancements and a commitment to work to better protect players and make the game safer, including enhancements to medical protocols and improvements to how our game is taught and played. As more is learned, the league evaluates and changes rules to evolve the game and try to improve protections for players. Since 2002 alone, the NFL has made 50 rules changes intended to eliminate potentially dangerous tactics and reduce the risk of injuries. For more information about the NFL's health and safety efforts, please visit www.PlaySmartPlaySafe.com  Evaluation", "link": "https://www.kaggle.com/c/nfl-playing-surface-analytics", "tags": ["Sports", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-01-03 00:59:00", "words": 649, "sentences": 24, "sum_nltk": "This challenge is part of NFL 1st & Future, the NFL’s annual Super Bowl competition designed to spur innovation in player health, safety and performance.\nIn conjunction with the epidemiologic investigations, biomechanical studies of football cleat-surface interactions have shown that synthetic turf surfaces do not release cleats as readily as natural turf and may contribute to the incidence of non-contact lower limb injuries (Kent et al., 2015).\nGiven these differences in cleat-turf interactions, it has yet to be determined whether player movement patterns and other measures of player performance differ across playing surfaces and how these may contribute to the incidence of lower limb injury.\nNow, the NFL is challenging Kagglers to help them examine the effects that playing on synthetic turf versus natural turf can have on player movements and the factors that may contribute to lower extremity injuries.\nOne hundred of the athletes in the study data set sustained one or more injuries during the study period that were identified as a non-contact injury of a type that may have turf interaction as a contributing factor to injury.", "sum_nltk_words": 176, "sum_nltk_runtime": 0.008, "sum_t5": "this challenge is part of NFL 1st & Future, the NFL’s annual Super Bowl competition designed to spur innovation in player health, safety and performance. recent investigations of lower limb injuries among football athletes have indicated significantly higher injury rates on synthetic turf compared with natural turf. the NFL is challenging Kagglers to help them examine the effects that playing on synthetic turf versus natural turf can have on player movements. the challenge is part of the league's annual'super bowl' competition.", "sum_t5_words": 81, "sum_t5_runtime": 6.697, "runtime": 0.006, "nltk_category": "Education & Research", "nltk_category_score": 0.29979297518730164, "nltk_category_runtime": 15.161, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.6873186826705933, "nltk_subcategory_runtime": 24.536, "category": "Education & Research", "category_score": 0.29979297518730164, "subcategory": "Physical", "subcategory_score": 0.6873186826705933, "runtime_cat": 39.697, "engagement_score": "0.0", "language_code": "en", "language": "english", "language_score": "0.9999980061945742", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "investigate relationship playing surface injury performance nfl athleteswelcome challenge youre tasked investigate relationship playing surface injury performance national football league nfl athlete examine factor may contribute lower extremity injury youll also notice isnt leaderboard required develop predictive model isnt traditional supervised kaggle machine learning competition information challenge format see forum thread challenge part nfl 1st future nfls annual super bowl competition designed spur innovation player health safety performance challenge nfl 12 stadium field synthetic turf recent investigation lower limb injury among football athlete indicated significantly higher injury rate synthetic turf compared natural turf mack et al 2018 loughran et al 2019 conjunction epidemiologic investigation biomechanical study football cleatsurface interaction shown synthetic turf surface release cleat readily natural turf may contribute incidence noncontact lower limb injury kent et al 2015 given difference cleatturf interaction yet determined whether player movement pattern measure player performance differ across playing surface may contribute incidence lower limb injury nfl challenging kagglers help examine effect playing synthetic turf versus natural turf player movement factor may contribute lower extremity injury nfl player tracking also known next gen stats capture real time location data speed acceleration every player every play every inch field part challenge nfl provided full player tracking onfield position 250 player two regular season schedule one hundred athlete study data set sustained one injury study period identified noncontact injury type may turf interaction contributing factor injury remaining 150 athlete serve representative sample larger nfl population sustain noncontact lowerlimb injury study period detail surface type environmental parameter may influence performance outcome also provided challenge characterize difference player movement playing surface identify specific scenario eg field surface weather position play type etc interact player movement present elevated risk injury detail entry criterion available evaluation tab nfl national football league america popular sport league comprised 32 franchise compete year win super bowl world biggest annual sporting event founded 1920 nfl developed model successful modern sport league including national international distribution extensive revenue sharing competitive excellence strong franchise across country nfl committed advancing progress diagnosis prevention treatment sportsrelated injury nfls ongoing health safety effort include support independent medical research engineering advancement commitment work better protect player make game safer including enhancement medical protocol improvement game taught played learned league evaluates change rule evolve game try improve protection player since 2002 alone nfl made 50 rule change intended eliminate potentially dangerous tactic reduce risk injury information nfls health safety effort please visit wwwplaysmartplaysafecom evaluation", "tags_descriptive": ["Sports", "Exploratory Data Analysis"]}