{"title": "Quick, Draw! Doodle Recognition Challenge", "description": "How accurately can you identify a doodle?\"Quick, Draw!\" was released as an experimental game to educate the public in a playful way about how AI works. The game prompts users to draw an image depicting a certain category, such as ”banana,” “table,” etc. The game generated more than 1B drawings, of which a subset was publicly released as the basis for this competition’s training set. That subset contains 50M drawings encompassing 340 label categories. Sounds fun, right? Here's the challenge: since the training data comes from the game itself, drawings can be incomplete or may not match the label. You’ll need to build a recognizer that can effectively learn from this noisy data and perform well on a manually-labeled test set from a different distribution. Your task is to build a better classifier for the existing Quick, Draw! dataset. By advancing models on this dataset, Kagglers can improve pattern recognition solutions more broadly. This will have an immediate impact on handwriting recognition and its robust applications in areas including OCR (Optical Character Recognition), ASR (Automatic Speech Recognition) & NLP (Natural Language Processing).", "link": "https://www.kaggle.com/c/quickdraw-doodle-recognition", "tags": ["Classification", "CV", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-12-05 00:59:00", "words": 182, "sentences": 9, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.3153456151485443, "description_category_runtime": 17.16, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9538321495056152, "description_subcategory_runtime": 26.588, "category": "Education & Research", "category_score": 0.3153456151485443, "subcategory": "Machine Learning", "subcategory_score": 0.9538321495056152, "runtime_cat": 43.748, "engagement_score": "0.66", "language_code": "en", "language": "english", "language_score": "0.999997945382237", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "accurately identify doodlequick draw released experimental game educate public playful way ai work game prompt user draw image depicting certain category banana table etc game generated 1b drawing subset publicly released basis competition training set subset contains 50m drawing encompassing 340 label category sound fun right here challenge since training data come game drawing incomplete may match label youll need build recognizer effectively learn noisy data perform well manuallylabeled test set different distribution task build better classifier existing quick draw dataset advancing model dataset kagglers improve pattern recognition solution broadly immediate impact handwriting recognition robust application area including ocr optical character recognition asr automatic speech recognition nlp natural language processing", "tags_descriptive": ["Classification", "Computer Vision (CV)", "Classification"]}