{"title": "Two Sigma Financial Modeling Challenge", "description": "Can you uncover predictive value in an uncertain world?How can we use the world’s tools and intelligence to forecast economic outcomes that can never be entirely predictable? This question is at the core of countless economic activities around the world – including at Two Sigma Investments, who has been applying technology and systematic strategies to financial trading since 2001. For over 15 years, Two Sigma has been at the forefront of applying technology and data science to financial forecasts. While their pioneering advances in big data, AI, and machine learning in the financial world have been pushing the industry forward, as with all other scientific progress, they are driven to make continual progress. Through this exclusive partnership, Two Sigma is excited to explore what untapped value Kaggle's diverse data science community can discover in the financial markets. Economic opportunity depends on the ability to deliver singularly accurate forecasts in a world of uncertainty. By accurately predicting financial movements, Kagglers will learn about scientifically-driven approaches to unlocking significant predictive capability. Two Sigma is excited to find predictive value and gain a better understanding of the skills offered by the global data science crowd. What is a Code Competition? Welcome to Kaggle's very first Code Competition! In contrast to our traditional competitions, where competitors submit only prediction outputs, participants in Code Competitions will submit their code via Kaggle Kernels. All kernels are private by default in Code Competitions. You can build your models in Kernels by running them on a training set and, once you're ready to submit your code, your model's performance will be evaluated against the test set and your score and public leaderboard position revealed. As with our traditional competitions, we still maintain a private leaderboard test set, which your code is also evaluated against for final scoring, but is not revealed until the competition closes. Since Code Competitions are brand new, we ask for your patience if you encounter bugs or frustrating platform quirks. Please report any issues you find in the forums and we'll do our best to respond. Who owns my code? You do. Even though you are submitting code, the intellectual property exchange here works similarly to a standard prediction competition, whereby prize winners have the option to grant a non-exclusive license in exchange for a prize. There is a new addition to the terms for Code Competitions: Kaggle and the competition host reserve a right to review submissions \"for purposes related to evaluation and scoring in this Competition, including but not limited to the assessment of potential cheating behavior.\" Please refer to the official competition rules for full details. Getting Started  Review the data page for details about the data and the evaluation metric. You may download the train set for local training. Take a look at the tutorial covering the new code submission process under the submission instructions tab. You'll find step-by-step instructions, some helpful pointers, plus details on environment constraints. Get feedback on your benchmark code and share exploratory analyses with the community by making any of your kernels public. Improve your score!  Note: there is no cost of entry for participation.", "link": "https://www.kaggle.com/c/two-sigma-financial-modeling", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-03-02 00:59:00", "words": 500, "sentences": 21, "sum_nltk": "For over 15 years, Two Sigma has been at the forefront of applying technology and data science to financial forecasts.\nThrough this exclusive partnership, Two Sigma is excited to explore what untapped value Kaggle's diverse data science community can discover in the financial markets.\nIn contrast to our traditional competitions, where competitors submit only prediction outputs, participants in Code Competitions will submit their code via Kaggle Kernels.\nYou can build your models in Kernels by running them on a training set and, once you're ready to submit your code, your model's performance will be evaluated against the test set and your score and public leaderboard position revealed.\nAs with our traditional competitions, we still maintain a private leaderboard test set, which your code is also evaluated against for final scoring, but is not revealed until the competition closes.\nThere is a new addition to the terms for Code Competitions: Kaggle and the competition host reserve a right to review submissions \"for purposes related to evaluation and scoring in this Competition, including but not limited to the assessment of potential cheating behavior.\" Please refer to the official competition rules for full details.", "sum_nltk_words": 176, "sum_nltk_runtime": 0.006, "sum_t5": "two Sigma Investments has been applying technology and data science to financial forecasts since 2001. two Sigma is excited to explore what untapped value Kaggle's diverse data science community can discover in the financial markets. participants in Code Competitions will submit their code via Kaggle Kernels. participants will learn about scientifically-driven approaches to unlocking significant predictive capability. if you're not happy with your code, you can submit it to Kaggle and the competition host will give you a non-exclusive license", "sum_t5_words": 80, "sum_t5_runtime": 7.085, "runtime": 0.005, "nltk_category": "Finance", "nltk_category_score": 0.2582874000072479, "nltk_category_runtime": 16.631, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.40371477603912354, "nltk_subcategory_runtime": 26.26, "category": "Finance", "category_score": 0.2582874000072479, "subcategory": "Student", "subcategory_score": 0.40371477603912354, "runtime_cat": 42.891, "engagement_score": "0.682", "language_code": "en", "language": "english", "language_score": "0.9999963834420338", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "uncover predictive value uncertain worldhow use world tool intelligence forecast economic outcome never entirely predictable question core countless economic activity around world including two sigma investment applying technology systematic strategy financial trading since 2001 15 year two sigma forefront applying technology data science financial forecast pioneering advance big data ai machine learning financial world pushing industry forward scientific progress driven make continual progress exclusive partnership two sigma excited explore untapped value kaggles diverse data science community discover financial market economic opportunity depends ability deliver singularly accurate forecast world uncertainty accurately predicting financial movement kagglers learn scientificallydriven approach unlocking significant predictive capability two sigma excited find predictive value gain better understanding skill offered global data science crowd code competition welcome kaggles first code competition contrast traditional competition competitor submit prediction output participant code competition submit code via kaggle kernel kernel private default code competition build model kernel running training set youre ready submit code model performance evaluated test set score public leaderboard position revealed traditional competition still maintain private leaderboard test set code also evaluated final scoring revealed competition close since code competition brand new ask patience encounter bug frustrating platform quirk please report issue find forum well best respond owns code even though submitting code intellectual property exchange work similarly standard prediction competition whereby prize winner option grant nonexclusive license exchange prize new addition term code competition kaggle competition host reserve right review submission purpose related evaluation scoring competition including limited assessment potential cheating behavior please refer official competition rule full detail getting started review data page detail data evaluation metric may download train set local training take look tutorial covering new code submission process submission instruction tab youll find stepbystep instruction helpful pointer plus detail environment constraint get feedback benchmark code share exploratory analysis community making kernel public improve score note cost entry participation", "tags_descriptive": []}