{"title": "Forest Cover Type (Kernels Only)", "description": "Use cartographic variables to classify forest categoriesRandom forests? Cover trees? Not so fast, computer nerds. We're talking about the real thing. In this competition you are asked to predict the forest cover type (the predominant kind of tree cover) from cartographic variables. The actual forest cover type for a given 30 x 30 meter cell was determined from US Forest Service (USFS) Region 2 Resource Information System data. Independent variables were then derived from data obtained from the US Geological Survey and USFS. The data is in raw form and contains binary columns of data for qualitative independent variables such as wilderness areas and soil type. This study area includes four wilderness areas located in the Roosevelt National Forest of northern Colorado. These areas represent forests with minimal human-caused disturbances, so that existing forest cover types are more a result of ecological processes rather than forest management practices. This competition originally ran in 2015. We are relaunching it as a kernels-only version here. Acknowledgements Kaggle is hosting this competition for the machine learning community to use for fun and practice. This dataset was provided by Jock A. Blackard and Colorado State University. We also thank the UCI machine learning repository for hosting the dataset. If you use the problem in publication, please cite: Bache, K. & Lichman, M. (2013). UCI Machine Learning Repository. Irvine, CA: University of California, School of Information and Computer Science", "link": "https://www.kaggle.com/c/forest-cover-type-kernels-only", "tags": ["Forestry", "Classification", "Ensembling", "Feature Engineering", "Xgboost", "Random Forest", "Exploratory Data Analysis", "Gradient Boosting", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-09-25 01:59:00", "words": 228, "sentences": 18, "sum_nltk": "Use cartographic variables to classify forest categoriesRandom forests?\nCover trees?\nIn this competition you are asked to predict the forest cover type (the predominant kind of tree cover) from cartographic variables.\nThe actual forest cover type for a given 30 x 30 meter cell was determined from US Forest Service (USFS) Region 2 Resource Information System data.\nIndependent variables were then derived from data obtained from the US Geological Survey and USFS.\nThe data is in raw form and contains binary columns of data for qualitative independent variables such as wilderness areas and soil type.\nThis study area includes four wilderness areas located in the Roosevelt National Forest of northern Colorado.\nThese areas represent forests with minimal human-caused disturbances, so that existing forest cover types are more a result of ecological processes rather than forest management practices.\nThis competition originally ran in 2015.\nAcknowledgements Kaggle is hosting this competition for the machine learning community to use for fun and practice.\nBlackard and Colorado State University.\nWe also thank the UCI machine learning repository for hosting the dataset.\nIf you use the problem in publication, please cite: Bache, K.\nUCI Machine Learning Repository.\nIrvine, CA: University of California, School of Information and Computer Science", "sum_nltk_words": 187, "sum_nltk_runtime": 0.004, "sum_t5": "competition asks you to predict the forest cover type from cartographic variables. actual forest cover type determined from US Forest Service data. a kernel version of the competition is now available. cnn.com's john sutter is hosting the competition. he says it's a fun way to learn about machine learning. a sutter: \"we're talking about the real thing\". a sutter: \"we're not going to be able to predict the", "sum_t5_words": 68, "sum_t5_runtime": 5.233, "runtime": 0.002, "nltk_category": "Utilities", "nltk_category_score": 0.2311021089553833, "nltk_category_runtime": 18.026, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8205762505531311, "nltk_subcategory_runtime": 28.229, "category": "Utilities", "category_score": 0.2311021089553833, "subcategory": "Machine Learning", "subcategory_score": 0.8205762505531311, "runtime_cat": 46.255, "engagement_score": "0.586", "language_code": "en", "language": "english", "language_score": "0.9999970818821092", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "use cartographic variable classify forest categoriesrandom forest cover tree fast computer nerd talking real thing competition asked predict forest cover type predominant kind tree cover cartographic variable actual forest cover type given 30 x 30 meter cell determined u forest service usfs region 2 resource information system data independent variable derived data obtained u geological survey usfs data raw form contains binary column data qualitative independent variable wilderness area soil type study area includes four wilderness area located roosevelt national forest northern colorado area represent forest minimal humancaused disturbance existing forest cover type result ecological process rather forest management practice competition originally ran 2015 relaunching kernelsonly version acknowledgement kaggle hosting competition machine learning community use fun practice dataset provided jock blackard colorado state university also thank uci machine learning repository hosting dataset use problem publication please cite bache k lichman 2013 uci machine learning repository irvine ca university california school information computer science", "tags_descriptive": ["Forestry", "Classification", "Ensembling", "Feature Engineering", "Xgboost", "Random Forest", "Exploratory Data Analysis", "Gradient Boosting", "Classification"]}