{"title": "Costa Rican Household Poverty Level Prediction", "description": "Can you identify which households have the highest need for social welfare assistance?The Inter-American Development Bank is asking the Kaggle community for help with income qualification for some of the world's poorest families. Are you up for the challenge?   Here's the backstory: Many social programs have a hard time making sure the right people are given enough aid. It’s especially tricky when a program focuses on the poorest segment of the population. The world’s poorest typically can’t provide the necessary income and expense records to prove that they qualify.   In Latin America, one popular method uses an algorithm to verify income qualification. It’s called the Proxy Means Test (or PMT). With PMT, agencies use a model that considers a family’s observable household attributes like the material of their walls and ceiling, or the assets found in the home to classify them and predict their level of need. While this is an improvement, accuracy remains a problem as the region’s population grows and poverty declines. To improve on PMT, the IDB (the largest source of development financing for Latin America and the Caribbean) has turned to the Kaggle community. They believe that new methods beyond traditional econometrics, based on a dataset of Costa Rican household characteristics, might help improve PMT’s performance. Beyond Costa Rica, many countries face this same problem of inaccurately assessing social need. If Kagglers can generate an improvement, the new algorithm could be implemented in other countries around the world. This is a Kernels-Only Competition, so you must submit your code through Kernels, rather than uploading .csv predictions. You can create private Kernels and even share/edit your work with teammates by adding them as collaborators.", "link": "https://www.kaggle.com/c/costa-rican-household-poverty-prediction", "tags": ["Classification", "Feature Engineering", "Xgboost", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-09-20 01:59:00", "words": 281, "sentences": 14, "sum_nltk": "Can you identify which households have the highest need for social welfare assistance?The Inter-American Development Bank is asking the Kaggle community for help with income qualification for some of the world's poorest families.\nIt’s especially tricky when a program focuses on the poorest segment of the population.\nIn Latin America, one popular method uses an algorithm to verify income qualification.\nWith PMT, agencies use a model that considers a family’s observable household attributes like the material of their walls and ceiling, or the assets found in the home to classify them and predict their level of need.\nWhile this is an improvement, accuracy remains a problem as the region’s population grows and poverty declines.\nTo improve on PMT, the IDB (the largest source of development financing for Latin America and the Caribbean) has turned to the Kaggle community.\nThey believe that new methods beyond traditional econometrics, based on a dataset of Costa Rican household characteristics, might help improve PMT’s performance.\nBeyond Costa Rica, many countries face this same problem of inaccurately assessing social need.\nIf Kagglers can generate an improvement, the new algorithm could be implemented in other countries around the world.", "sum_nltk_words": 184, "sum_nltk_runtime": 0.004, "sum_t5": "the inter-American development bank is asking the Kaggle community for help with income qualification for some of the world's poorest families. the world's poorest typically can't provide the necessary income and expense records to prove that they qualify. in Latin America, one popular method uses an algorithm to verify income qualification. it's called the Proxy Means Test (or PMT) with a model that considers a family’s observable household attributes like the material of their walls and ceiling.", "sum_t5_words": 77, "sum_t5_runtime": 6.474, "runtime": 0.004, "nltk_category": "Finance", "nltk_category_score": 0.6435596346855164, "nltk_category_runtime": 16.916, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8293396234512329, "nltk_subcategory_runtime": 27.364, "category": "Finance", "category_score": 0.6435596346855164, "subcategory": "Machine Learning", "subcategory_score": 0.8293396234512329, "runtime_cat": 44.28, "engagement_score": "0.619", "language_code": "en", "language": "english", "language_score": "0.9999949821496971", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify household highest need social welfare assistancethe interamerican development bank asking kaggle community help income qualification world poorest family challenge here backstory many social program hard time making sure right people given enough aid especially tricky program focus poorest segment population world poorest typically cant provide necessary income expense record prove qualify latin america one popular method us algorithm verify income qualification called proxy mean test pmt pmt agency use model considers family observable household attribute like material wall ceiling asset found home classify predict level need improvement accuracy remains problem region population grows poverty decline improve pmt idb largest source development financing latin america caribbean turned kaggle community believe new method beyond traditional econometrics based dataset costa rican household characteristic might help improve pmts performance beyond costa rica many country face problem inaccurately assessing social need kagglers generate improvement new algorithm could implemented country around world kernelsonly competition must submit code kernel rather uploading csv prediction create private kernel even shareedit work teammate adding collaborator", "tags_descriptive": ["Classification", "Feature Engineering", "Xgboost", "Exploratory Data Analysis"]}