{"title": "iWildCam 2020 - FGVC7", "description": "Categorize animals in the wildCamera Traps (or Wild Cams) enable the automatic collection of large quantities of image data. Biologists all over the world use camera traps to monitor biodiversity and population density of animal species. We have recently been making strides towards automatic species classification in camera trap images. However, as we try to expand the scope of these models we are faced with an interesting problem: how do we train models that perform well on new (unseen during training) camera trap locations? Can we leverage data from other modalities, such as citizen science data and remote sensing data?    In order to tackle this problem, we have prepared a challenge where the training data and test data are from different cameras spread across the globe. The set of species seen in each camera overlap, but are not identical. The challenge is to classify species in the test cameras correctly. To explore multimodal solutions, we allow competitors to train on the following data: (i) our camera trap training set (data provided by WCS), (ii) iNaturalist 2017-2019 data, and (iii) multispectral imagery (from Landsat 8) for each of the camera trap locations. On the competition GitHub page we provide the multispectral data, a taxonomy file mapping our classes into the iNat taxonomy, a subset of iNat data mapped into our class set, and a camera trap detection model (the MegaDetector) along with the corresponding detections. If you use this dataset in publication, please cite: @article{beery2020iwildcam,     title={The iWildCam 2020 Competition Dataset},     author={Beery, Sara and Cole, Elijah and Gjoka, Arvi},     journal={arXiv preprint arXiv:2004.10340},     year={2020} }  This is an FGVCx competition as part of the FGVC7 workshop at CVPR 2020, and is sponsored by Microsoft AI for Earth and Wildlife Insights. There is a GitHub page for the competition here. Please open an issue if you have questions or problems with the dataset.    You can find the iWildCam 2018 Competition here, and the iWildCam 2019 Competition here. Kaggle is excited to partner with research groups to push forward the frontier of machine learning. Research competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team. Any questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "link": "https://www.kaggle.com/c/iwildcam-2020-fgvc7", "tags": ["Classification", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-05-27 01:59:00", "words": 398, "sentences": 15, "sum_nltk": "Categorize animals in the wildCamera Traps (or Wild Cams) enable the automatic collection of large quantities of image data.\nBiologists all over the world use camera traps to monitor biodiversity and population density of animal species.\nWe have recently been making strides towards automatic species classification in camera trap images.\nHowever, as we try to expand the scope of these models we are faced with an interesting problem: how do we train models that perform well on new (unseen during training) camera trap locations?\nIn order to tackle this problem, we have prepared a challenge where the training data and test data are from different cameras spread across the globe.\nThe challenge is to classify species in the test cameras correctly.\nOn the competition GitHub page we provide the multispectral data, a taxonomy file mapping our classes into the iNat taxonomy, a subset of iNat data mapped into our class set, and a camera trap detection model (the MegaDetector) along with the corresponding detections.\nResearch competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team.\nAny questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "sum_nltk_words": 192, "sum_nltk_runtime": 0.005, "sum_t5": "iWildCam 2020 competition provides data for a competition to classify animals in camera traps. competition is part of the FGVC7 workshop at CVPR 2020. competition is open to anyone with questions or problems about the dataset. iWildCam 2018 and iWildCam 2019 competitions are now open. iWildCam 2019 competition is a 'data-driven' competition.", "sum_t5_words": 52, "sum_t5_runtime": 6.311, "runtime": 0.0, "nltk_category": "Education & Research", "nltk_category_score": 0.3996509611606598, "nltk_category_runtime": 17.185, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.5810843110084534, "nltk_subcategory_runtime": 27.793, "category": "Education & Research", "category_score": 0.3996509611606598, "subcategory": "Student", "subcategory_score": 0.5810843110084534, "runtime_cat": 44.978, "engagement_score": "0.514", "language_code": "en", "language": "english", "language_score": "0.9999976202678998", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "categorize animal wildcamera trap wild cam enable automatic collection large quantity image data biologist world use camera trap monitor biodiversity population density animal specie recently making stride towards automatic specie classification camera trap image however try expand scope model faced interesting problem train model perform well new unseen training camera trap location leverage data modality citizen science data remote sensing data order tackle problem prepared challenge training data test data different camera spread across globe set specie seen camera overlap identical challenge classify specie test camera correctly explore multimodal solution allow competitor train following data camera trap training set data provided wcs ii inaturalist 20172019 data iii multispectral imagery landsat 8 camera trap location competition github page provide multispectral data taxonomy file mapping class inat taxonomy subset inat data mapped class set camera trap detection model megadetector along corresponding detection use dataset publication please cite articlebeery2020iwildcam titlethe iwildcam 2020 competition dataset authorbeery sara cole elijah gjoka arvi journalarxiv preprint arxiv200410340 year2020 fgvcx competition part fgvc7 workshop cvpr 2020 sponsored microsoft ai earth wildlife insight github page competition please open issue question problem dataset find iwildcam 2018 competition iwildcam 2019 competition kaggle excited partner research group push forward frontier machine learning research competition make use kaggles platform experience largely organized research group data science team question concern regarding competition data quality topic addressed", "tags_descriptive": ["Classification", "Exploratory Data Analysis"]}