{"title": "Google Analytics Customer Revenue Prediction", "description": "Predict how much GStore customers will spendThe 80/20 rule has proven true for many businesses–only a small percentage of customers produce most of the revenue. As such, marketing teams are challenged to make appropriate investments in promotional strategies.  RStudio, the developer of free and open tools for R and enterprise-ready products for teams to scale and share work, has partnered with Google Cloud and Kaggle to demonstrate the business impact that thorough data analysis can have. In this competition, you’re challenged to analyze a Google Merchandise Store (also known as GStore, where Google swag is sold) customer dataset to predict revenue per customer. Hopefully, the outcome will be more actionable operational changes and a better use of marketing budgets for those companies who choose to use data analysis on top of GA data.", "link": "https://www.kaggle.com/c/ga-customer-revenue-prediction", "tags": ["Finance", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting", "E-Commerce"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-02-21 21:04:00", "words": 134, "sentences": 5, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.17386683821678162, "description_category_runtime": 11.843, "description_subcategory": "Marketing", "description_subcategory_score": 0.7451379299163818, "description_subcategory_runtime": 18.679, "category": "Wholesale & Retail", "category_score": 0.17386683821678162, "subcategory": "Marketing", "subcategory_score": 0.7451379299163818, "runtime_cat": 30.522, "engagement_score": "0.707", "language_code": "en", "language": "english", "language_score": "0.9999956366483034", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict much gstore customer spendthe 8020 rule proven true many businessesonly small percentage customer produce revenue marketing team challenged make appropriate investment promotional strategy rstudio developer free open tool r enterpriseready product team scale share work partnered google cloud kaggle demonstrate business impact thorough data analysis competition youre challenged analyze google merchandise store also known gstore google swag sold customer dataset predict revenue per customer hopefully outcome actionable operational change better use marketing budget company choose use data analysis top ga data", "tags_descriptive": ["Finance", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting", "E-Commerce"]}