{"title": "Plant Pathology 2020 - FGVC7", "description": "Identify the category of foliar diseases in apple treesProblem Statement Misdiagnosis of the many diseases impacting agricultural crops can lead to misuse of chemicals leading to the emergence of resistant pathogen strains, increased input costs, and more outbreaks with significant economic loss and environmental impacts. Current disease diagnosis based on human scouting is time-consuming and expensive, and although computer-vision based models have the promise to increase efficiency, the great variance in symptoms due to age of infected tissues, genetic variations, and light conditions within trees decreases the accuracy of detection.  Specific Objectives Objectives of ‘Plant Pathology Challenge’ are to train a model using images of training dataset to 1) Accurately classify a given image from testing dataset into different diseased category or a healthy leaf; 2) Accurately distinguish between many diseases, sometimes more than one on a single leaf; 3) Deal with rare classes and novel symptoms; 4) Address depth perception—angle, light, shade, physiological age of the leaf; and 5) Incorporate expert knowledge in identification, annotation, quantification, and guiding computer vision to search for relevant features during learning.  Resources If you use the dataset for your project, please cite the preprint https://arxiv.org/abs/2004.11958 Acknowledgments We acknowledge financial support from Cornell Initiative for Digital Agriculture (CIDA) and special thanks to Zach Guillian for help with data collection.    Kaggle is excited to partner with research groups to push forward the frontier of machine learning. Research competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team. Any questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "link": "https://www.kaggle.com/c/plant-pathology-2020-fgvc7", "tags": ["DL", "Classification", "Ensembling", "Plants", "Exploratory Data Analysis", "CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-05-27 01:59:00", "words": 272, "sentences": 7, "sum_nltk": "Current disease diagnosis based on human scouting is time-consuming and expensive, and although computer-vision based models have the promise to increase efficiency, the great variance in symptoms due to age of infected tissues, genetic variations, and light conditions within trees decreases the accuracy of detection.\nSpecific Objectives Objectives of ‘Plant Pathology Challenge’ are to train a model using images of training dataset to 1) Accurately classify a given image from testing dataset into different diseased category or a healthy leaf; 2) Accurately distinguish between many diseases, sometimes more than one on a single leaf; 3) Deal with rare classes and novel symptoms; 4) Address depth perception—angle, light, shade, physiological age of the leaf; and 5) Incorporate expert knowledge in identification, annotation, quantification, and guiding computer vision to search for relevant features during learning.\nKaggle is excited to partner with research groups to push forward the frontier of machine learning.\nResearch competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team.\nAny questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "sum_nltk_words": 181, "sum_nltk_runtime": 0.003, "sum_t5": "misdiagnosis of the many diseases impacting agricultural crops can lead to the emergence of resistant pathogen strains. current disease diagnosis based on human scouting is time-consuming and expensive. but the great variance in symptoms due to age of infected tissues, genetic variations, and light conditions within trees decreases the accuracy of detection. the aim of the ‘Plant Pathology Challenge’ is to train a model using images of training dataset to classify a given image into different diseased category or a", "sum_t5_words": 80, "sum_t5_runtime": 6.492, "runtime": 0.005, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.20338855683803558, "nltk_category_runtime": 16.667, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.7177359461784363, "nltk_subcategory_runtime": 26.567, "category": "Biotechnological & Life Sciences", "category_score": 0.20338855683803558, "subcategory": "Machine Learning", "subcategory_score": 0.7177359461784363, "runtime_cat": 43.234, "engagement_score": "0.66", "language_code": "en", "language": "english", "language_score": "0.9999959879760689", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify category foliar disease apple treesproblem statement misdiagnosis many disease impacting agricultural crop lead misuse chemical leading emergence resistant pathogen strain increased input cost outbreak significant economic loss environmental impact current disease diagnosis based human scouting timeconsuming expensive although computervision based model promise increase efficiency great variance symptom due age infected tissue genetic variation light condition within tree decrease accuracy detection specific objective objective plant pathology challenge train model using image training dataset 1 accurately classify given image testing dataset different diseased category healthy leaf 2 accurately distinguish many disease sometimes one single leaf 3 deal rare class novel symptom 4 address depth perceptionangle light shade physiological age leaf 5 incorporate expert knowledge identification annotation quantification guiding computer vision search relevant feature learning resource use dataset project please cite preprint httpsarxivorgabs200411958 acknowledgment acknowledge financial support cornell initiative digital agriculture cida special thanks zach guillian help data collection kaggle excited partner research group push forward frontier machine learning research competition make use kaggles platform experience largely organized research group data science team question concern regarding competition data quality topic addressed", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Ensembling", "Plants", "Exploratory Data Analysis", "Computer Vision (CV)"]}