{"title": "Humpback Whale Identification", "description": "Can you identify a whale by its tail?After centuries of intense whaling, recovering whale populations still have a hard time adapting to warming oceans and struggle to compete every day with the industrial fishing industry for food. To aid whale conservation efforts, scientists use photo surveillance systems to monitor ocean activity. They use the shape of whales’ tails and unique markings found in footage to identify what species of whale they’re analyzing and meticulously log whale pod dynamics and movements. For the past 40 years, most of this work has been done manually by individual scientists, leaving a huge trove of data untapped and underutilized. In this competition, you’re challenged to build an algorithm to identify individual whales in images. You’ll analyze Happywhale’s database of over 25,000 images, gathered from research institutions and public contributors. By contributing, you’ll help to open rich fields of understanding for marine mammal population dynamics around the globe. Note, this competition is similar in nature to this competition  with an expanded and updated dataset.  We'd like to thank Happywhale  for providing this data and problem. Happywhale is a platform that uses image process algorithms to let anyone to submit their whale photo and have it automatically identified.", "link": "https://www.kaggle.com/c/humpback-whale-identification", "tags": ["DL", "Classification", "Exploratory Data Analysis", "CV", "CNN", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-03-01 00:59:00", "words": 205, "sentences": 10, "sum_nltk": "Can you identify a whale by its tail?After centuries of intense whaling, recovering whale populations still have a hard time adapting to warming oceans and struggle to compete every day with the industrial fishing industry for food.\nTo aid whale conservation efforts, scientists use photo surveillance systems to monitor ocean activity.\nThey use the shape of whales’ tails and unique markings found in footage to identify what species of whale they’re analyzing and meticulously log whale pod dynamics and movements.\nFor the past 40 years, most of this work has been done manually by individual scientists, leaving a huge trove of data untapped and underutilized.\nIn this competition, you’re challenged to build an algorithm to identify individual whales in images.\nYou’ll analyze Happywhale’s database of over 25,000 images, gathered from research institutions and public contributors.\nBy contributing, you’ll help to open rich fields of understanding for marine mammal population dynamics around the globe.\nNote, this competition is similar in nature to this competition  with an expanded and updated dataset.\nWe'd like to thank Happywhale  for providing this data and problem.\nHappywhale is a platform that uses image process algorithms to let anyone to submit their whale photo and have it automatically identified.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.003, "sum_t5": "after centuries of intense whaling, recovering whale populations still struggle to adapt to warming oceans. recovering whale populations struggle to compete every day with the industrial fishing industry for food. for the past 40 years, most of this work has been done manually by individual scientists, leaving a huge trove of data untapped and underutilized. in this competition, you're challenged to build an algorithm to identify individual whales in images. you'll analyze Happywhale's database of over 25,000 images, gathered from", "sum_t5_words": 80, "sum_t5_runtime": 5.154, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.405908465385437, "nltk_category_runtime": 17.898, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.5585712790489197, "nltk_subcategory_runtime": 28.595, "category": "Education & Research", "category_score": 0.405908465385437, "subcategory": "Quality", "subcategory_score": 0.5585712790489197, "runtime_cat": 46.493, "engagement_score": "0.683", "language_code": "en", "language": "english", "language_score": "0.9999965332749091", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify whale tailafter century intense whaling recovering whale population still hard time adapting warming ocean struggle compete every day industrial fishing industry food aid whale conservation effort scientist use photo surveillance system monitor ocean activity use shape whale tail unique marking found footage identify specie whale theyre analyzing meticulously log whale pod dynamic movement past 40 year work done manually individual scientist leaving huge trove data untapped underutilized competition youre challenged build algorithm identify individual whale image youll analyze happywhales database 25000 image gathered research institution public contributor contributing youll help open rich field understanding marine mammal population dynamic around globe note competition similar nature competition expanded updated dataset wed like thank happywhale providing data problem happywhale platform us image process algorithm let anyone submit whale photo automatically identified", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Exploratory Data Analysis", "Computer Vision (CV)", "Convolutional Neural Network (CNN)", "Classification"]}