{"title": "New York City Taxi Trip Duration", "description": "Share code and data to improve ride time predictionsIn this competition, Kaggle is challenging you to build a model that predicts the total ride duration of taxi trips in New York City. Your primary dataset is one released by the NYC Taxi and Limousine Commission, which includes pickup time, geo-coordinates, number of passengers, and several other variables. Longtime Kagglers will recognize that this competition objective is similar to the ECML/PKDD trip time challenge we hosted in 2015. But, this challenge comes with a twist. Instead of awarding prizes to the top finishers on the leaderboard, this playground competition was created to reward collaboration and collective learning.  We are encouraging you (with cash prizes!) to publish additional training data that other participants can use for their predictions. We also have designated bi-weekly and final prizes to reward authors of kernels that are particularly insightful or valuable to the community.", "link": "https://www.kaggle.com/c/nyc-taxi-trip-duration", "tags": ["Feature Engineering", "Exploratory Data Analysis", "K-means", "Geospatial Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-09-16 01:59:00", "words": 149, "sentences": 7, "runtime": 0.005, "description_category": "Media & Publishing", "description_category_score": 0.5309356451034546, "description_category_runtime": 13.045, "description_subcategory": "Transportation", "description_subcategory_score": 0.7307647466659546, "description_subcategory_runtime": 20.274, "category": "Media & Publishing", "category_score": 0.5309356451034546, "subcategory": "Transportation", "subcategory_score": 0.7307647466659546, "runtime_cat": 33.318, "engagement_score": "0.657", "language_code": "en", "language": "english", "language_score": "0.999998097867842", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "share code data improve ride time predictionsin competition kaggle challenging build model predicts total ride duration taxi trip new york city primary dataset one released nyc taxi limousine commission includes pickup time geocoordinates number passenger several variable longtime kagglers recognize competition objective similar ecmlpkdd trip time challenge hosted 2015 challenge come twist instead awarding prize top finisher leaderboard playground competition created reward collaboration collective learning encouraging cash prize publish additional training data participant use prediction also designated biweekly final prize reward author kernel particularly insightful valuable community", "tags_descriptive": ["Feature Engineering", "Exploratory Data Analysis", "K-means", "Geospatial Analysis"]}