{"title": "Ultrasound Nerve Segmentation", "description": "Identify nerve structures in ultrasound images of the neckEven the bravest patient cringes at the mention of a surgical procedure. Surgery inevitably brings discomfort, and oftentimes involves significant post-surgical pain. Currently, patient pain is frequently managed through the use of narcotics that bring a bevy of unwanted side effects. This competition's sponsor is working to improve pain management through the use of indwelling catheters that block or mitigate pain at the source. Pain management catheters reduce dependence on narcotics and speed up patient recovery. Accurately identifying nerve structures in ultrasound images is a critical step in effectively inserting a patient’s pain management catheter. In this competition, Kagglers are challenged to build a model that can identify nerve structures in a dataset of ultrasound images of the neck. Doing so would improve catheter placement and contribute to a more pain free future.", "link": "https://www.kaggle.com/c/ultrasound-nerve-segmentation", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-08-19 01:59:00", "words": 136, "sentences": 7, "runtime": 0.0, "description_category": "Healthcare", "description_category_score": 0.7008243203163147, "description_category_runtime": 12.927, "description_subcategory": "Physical", "description_subcategory_score": 0.6889600157737732, "description_subcategory_runtime": 20.28, "category": "Healthcare", "category_score": 0.7008243203163147, "subcategory": "Physical", "subcategory_score": 0.6889600157737732, "runtime_cat": 33.207, "engagement_score": "0.641", "language_code": "en", "language": "english", "language_score": "0.9999942253476395", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify nerve structure ultrasound image neckeven bravest patient cringes mention surgical procedure surgery inevitably brings discomfort oftentimes involves significant postsurgical pain currently patient pain frequently managed use narcotic bring bevy unwanted side effect competition sponsor working improve pain management use indwelling catheter block mitigate pain source pain management catheter reduce dependence narcotic speed patient recovery accurately identifying nerve structure ultrasound image critical step effectively inserting patient pain management catheter competition kagglers challenged build model identify nerve structure dataset ultrasound image neck would improve catheter placement contribute pain free future", "tags_descriptive": []}