{"title": "Santa Gift Matching Challenge", "description": "Down through the chimney with lots of toys...‘Tis the night before Christmas year: two thousand seventeen. Santa’s grown grouchy, borderline mean. What used to be simple for Old St. Nick, is now too puzzling, it’s making him sick! See, Santa always knew, deep down in his gut,  what toy each kid wanted–no ifs, ands, or buts. But fierce population growth, more twins, and toy innovation, has left too complex a problem, in dire need of optimization. “Don’t worry, Mr. Santa”, said an Elf named McMaggle, “I have a solution! Have you heard of Kaggle?” As she explained Kaggle in-depth, Santa’s doubt began turning, he became a believer in the magic of...machine learning. So, Santa’s team needs YOU more than ever this year, to solve this painful problem and save Christmas cheer. The Challenge In this playground competition, you’re challenged to build a toy matching algorithm that maximizes happiness by pairing kids with toys they want. In the dataset, each kid has 10 preferences for their gift (from 1000) and Santa has 1000 preferred kids for every gift available. What makes this extra difficult is that 0.4% of the kids are twins, and by their parents’ request, require the same gift.", "link": "https://www.kaggle.com/c/santa-gift-matching", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-01-13 00:59:00", "words": 201, "sentences": 11, "sum_nltk": "Down through the chimney with lots of toys...‘Tis the night before Christmas year: two thousand seventeen.\nSanta’s grown grouchy, borderline mean.\nWhat used to be simple for Old St. Nick, is now too puzzling, it’s making him sick!\nSee, Santa always knew, deep down in his gut,  what toy each kid wanted–no ifs, ands, or buts.\nBut fierce population growth, more twins, and toy innovation, has left too complex a problem, in dire need of optimization.\n“Don’t worry, Mr. Santa”, said an Elf named McMaggle, “I have a solution!\nHave you heard of Kaggle?” As she explained Kaggle in-depth, Santa’s doubt began turning, he became a believer in the magic of...machine learning.\nSo, Santa’s team needs YOU more than ever this year, to solve this painful problem and save Christmas cheer.\nThe Challenge In this playground competition, you’re challenged to build a toy matching algorithm that maximizes happiness by pairing kids with toys they want.\nIn the dataset, each kid has 10 preferences for their gift (from 1000) and Santa has 1000 preferred kids for every gift available.\nWhat makes this extra difficult is that 0.4% of the kids are twins, and by their parents’ request, require the same gift.", "sum_nltk_words": 191, "sum_nltk_runtime": 0.002, "sum_t5": "the challenge is a playground competition to build a toy matching algorithm that maximizes happiness by pairing kids with toys they want. 0.4% of the kids are twins, and by their parents’ request, require the same gift. the algorithm is based on a dataset of 10 kids who have 10 preferences for their gift. the competition is open to all ages and abilities. you can help solve the problem by submitting a toy matching algorithm.", "sum_t5_words": 75, "sum_t5_runtime": 4.632, "runtime": 0.004, "nltk_category": "Utilities", "nltk_category_score": 0.23783329129219055, "nltk_category_runtime": 20.828, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.7600653171539307, "nltk_subcategory_runtime": 32.905, "category": "Utilities", "category_score": 0.23783329129219055, "subcategory": "Machine Learning", "subcategory_score": 0.7600653171539307, "runtime_cat": 53.733, "engagement_score": "0.597", "language_code": "en", "language": "english", "language_score": "0.9999937224294353", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "chimney lot toystis night christmas year two thousand seventeen santa grown grouchy borderline mean used simple old st nick puzzling making sick see santa always knew deep gut toy kid wantedno ifs ands buts fierce population growth twin toy innovation left complex problem dire need optimization dont worry mr santa said elf named mcmaggle solution heard kaggle explained kaggle indepth santa doubt began turning became believer magic ofmachine learning santa team need ever year solve painful problem save christmas cheer challenge playground competition youre challenged build toy matching algorithm maximizes happiness pairing kid toy want dataset kid 10 preference gift 1000 santa 1000 preferred kid every gift available make extra difficult 04 kid twin parent request require gift", "tags_descriptive": []}