{"title": "Google Landmark Retrieval Challenge", "description": "Given an image, can you find all of the same landmarks in a dataset?[UPDATE] 2019 challenge launched: https://kaggle.com/c/landmark-retrieval-2019 Image retrieval is a fundamental problem in computer vision: given a query image, can you find similar images in a large database? This is especially important for query images containing landmarks, which accounts for a large portion of what people like to photograph. In this competition, Kagglers are given query images and, for each query, are expected to retrieve all database images containing the same landmarks (if any). The new dataset is the largest worldwide dataset for image retrieval research, comprising more than a million images of 15K unique landmarks. We hope that this release will accelerate progress in this important research problem. This challenge is organized in conjunction with the Landmark Recognition Challenge (https://www.kaggle.com/c/landmark-recognition-challenge). In particular, note that the test set for both challenges is the same, to encourage participants to compete in both. We also encourage participants to use the training data from the recognition challenge to train models which could be useful for the retrieval challenge. Note, however, that there are no landmarks in common between the training/index sets of the two challenges.", "link": "https://www.kaggle.com/c/landmark-retrieval-challenge", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-05-30 01:59:00", "words": 194, "sentences": 8, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.310958594083786, "description_category_runtime": 18.009, "description_subcategory": "Quality", "description_subcategory_score": 0.4566858410835266, "description_subcategory_runtime": 28.993, "category": "Education & Research", "category_score": 0.310958594083786, "subcategory": "Quality", "subcategory_score": 0.4566858410835266, "runtime_cat": 47.002, "engagement_score": "0.552", "language_code": "en", "language": "english", "language_score": "0.9999968128388992", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "given image find landmark datasetupdate 2019 challenge launched httpskagglecomclandmarkretrieval2019 image retrieval fundamental problem computer vision given query image find similar image large database especially important query image containing landmark account large portion people like photograph competition kagglers given query image query expected retrieve database image containing landmark new dataset largest worldwide dataset image retrieval research comprising million image 15k unique landmark hope release accelerate progress important research problem challenge organized conjunction landmark recognition challenge httpswwwkagglecomclandmarkrecognitionchallenge particular note test set challenge encourage participant compete also encourage participant use training data recognition challenge train model could useful retrieval challenge note however landmark common trainingindex set two challenge", "tags_descriptive": []}