{"title": "Home Depot Product Search Relevance", "description": "Predict the relevance of search results on homedepot.comShoppers rely on Home Depot’s product authority to find and buy the latest products and to get timely solutions to their home improvement needs. From installing a new ceiling fan to remodeling an entire kitchen, with the click of a mouse or tap of the screen, customers expect the correct results to their queries – quickly. Speed, accuracy and delivering a frictionless customer experience are essential. In this competition, Home Depot is asking Kagglers to help them improve their customers' shopping experience by developing a model that can accurately predict the relevance of search results. Search relevancy is an implicit measure Home Depot uses to gauge how quickly they can get customers to the right products. Currently, human raters evaluate the impact of potential changes to their search algorithms, which is a slow and subjective process. By removing or minimizing human input in search relevance evaluation, Home Depot hopes to increase the number of iterations their team can perform on the current search algorithms.", "link": "https://www.kaggle.com/c/home-depot-product-search-relevance", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-04-26 01:59:00", "words": 170, "sentences": 7, "runtime": 0.003, "description_category": "Construction & Engineering", "description_category_score": 0.40164998173713684, "description_category_runtime": 14.249, "description_subcategory": "Retail", "description_subcategory_score": 0.6849808692932129, "description_subcategory_runtime": 22.514, "category": "Construction & Engineering", "category_score": 0.40164998173713684, "subcategory": "Retail", "subcategory_score": 0.6849808692932129, "runtime_cat": 36.764, "engagement_score": "0.683", "language_code": "en", "language": "english", "language_score": "0.9999971204103677", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict relevance search result homedepotcomshoppers rely home depot product authority find buy latest product get timely solution home improvement need installing new ceiling fan remodeling entire kitchen click mouse tap screen customer expect correct result query quickly speed accuracy delivering frictionless customer experience essential competition home depot asking kagglers help improve customer shopping experience developing model accurately predict relevance search result search relevancy implicit measure home depot us gauge quickly get customer right product currently human raters evaluate impact potential change search algorithm slow subjective process removing minimizing human input search relevance evaluation home depot hope increase number iteration team perform current search algorithm", "tags_descriptive": []}