{"title": "Ciphertext Challenge III", "description": "BRBTvl0LNstxQLyxulCEEq1czSFje0Z6iajczo6ktGmitTE=Ciphertext Challenge III: Wherefore Art Thou, Simple Ciphers? We've done the 2010's, the 1990s… now it's time for the 80s. The 1580s!! In this new decryption competition's dataset, we've gone from perfectly respectable sources of electronic horror to a time before computers—heck, before calculus was called \"calculus\"!  Shakespeare's plays are encrypted, and we time travelers must un-encrypt them so people can do innovative stage productions with intricate makeup, costumes, and possibly—possibly!—Leonardo DiCaprio. Think about it, folks: Leo.* As in previous ciphertext challenges, simple classic ciphers have been used to encrypt this dataset, along with a slightly less simple surprise that expands our definition of \"classic\" into the modern age. The mission is the same: to correctly match each piece of ciphertext with its corresponding piece of plaintext. Daunting! Meta-puzzles and difficulty await! Swag prizes go to the first three teams to crack all four ciphers OR to the top three teams on the leaderboard (in case the ciphers are not all cracked). Additionally, swag prizes will be awarded to the best competition-related kernels, in both visualization and cryptanalysis, based on upvotes.  Last, the coveted \"Phil Prize\"—for the team that correctly deduces the form AND key of the final cipher—is up for grabs again. Go ahead. Get cracking! * - Leo! Acknowledgements Many thanks to Kaggler LiamLarson for their excellent Shakespeare dataset.", "link": "https://www.kaggle.com/c/ciphertext-challenge-iii", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-09-06 01:59:00", "words": 223, "sentences": 9, "sum_nltk": "BRBTvl0LNstxQLyxulCEEq1czSFje0Z6iajczo6ktGmitTE=Ciphertext Challenge III: Wherefore Art Thou, Simple Ciphers?\nIn this new decryption competition's dataset, we've gone from perfectly respectable sources of electronic horror to a time before computers—heck, before calculus was called \"calculus\"!\nShakespeare's plays are encrypted, and we time travelers must un-encrypt them so people can do innovative stage productions with intricate makeup, costumes, and possibly—possibly!—Leonardo DiCaprio.\nThink about it, folks: Leo.* As in previous ciphertext challenges, simple classic ciphers have been used to encrypt this dataset, along with a slightly less simple surprise that expands our definition of \"classic\" into the modern age.\nThe mission is the same: to correctly match each piece of ciphertext with its corresponding piece of plaintext.\nSwag prizes go to the first three teams to crack all four ciphers OR to the top three teams on the leaderboard (in case the ciphers are not all cracked).\nAdditionally, swag prizes will be awarded to the best competition-related kernels, in both visualization and cryptanalysis, based on upvotes.\nLast, the coveted \"Phil Prize\"—for the team that correctly deduces the form AND key of the final cipher—is up for grabs again.\n* - Leo!\nAcknowledgements Many thanks to Kaggler LiamLarson for their excellent Shakespeare dataset.", "sum_nltk_words": 189, "sum_nltk_runtime": 0.003, "sum_t5": "the ciphertext challenge is a competition to decrypt Shakespeare's plays. the challenge is based on the classic ciphers used in the 2010's and 1990s. the ciphers are encrypted to make it easier to decrypt. the ciphers are also encrypted to make it easier to decrypt. a swag prize is up for grabs for the first three teams to crack all four ciphers.", "sum_t5_words": 62, "sum_t5_runtime": 6.437, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.15553349256515503, "nltk_category_runtime": 21.898, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.35626286268234253, "nltk_subcategory_runtime": 35.027, "category": "Education & Research", "category_score": 0.15553349256515503, "subcategory": "Quality", "subcategory_score": 0.35626286268234253, "runtime_cat": 56.925, "engagement_score": "0.502", "language_code": "en", "language": "english", "language_score": "0.9999967486331118", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "brbtvl0lnstxqlyxulceeq1czsfje0z6iajczo6ktgmitteciphertext challenge iii wherefore art thou simple cipher weve done 2010s 1990s time 80 1580s new decryption competition dataset weve gone perfectly respectable source electronic horror time computersheck calculus called calculus shakespeare play encrypted time traveler must unencrypt people innovative stage production intricate makeup costume possiblypossiblyleonardo dicaprio think folk leo previous ciphertext challenge simple classic cipher used encrypt dataset along slightly le simple surprise expands definition classic modern age mission correctly match piece ciphertext corresponding piece plaintext daunting metapuzzles difficulty await swag prize go first three team crack four cipher top three team leaderboard case cipher cracked additionally swag prize awarded best competitionrelated kernel visualization cryptanalysis based upvotes last coveted phil prizefor team correctly deduces form key final cipheris grab go ahead get cracking leo acknowledgement many thanks kaggler liamlarson excellent shakespeare dataset", "tags_descriptive": ["Exploratory Data Analysis"]}