{"title": "Cdiscount’s Image Classification Challenge", "description": "Categorize e-commerce photosRules Update: The CDiscount team has updated their rules to allow for use of this dataset for research and academic purposes only. To access the data, go to rules and accept the terms to download the data. Cdiscount.com generated nearly 3 billion euros last year, making it France’s largest non-food e-commerce company. While the company already sells everything from TVs to trampolines, the list of products is still rapidly growing. By the end of this year, Cdiscount.com will have over 30 million products up for sale. This is up from 10 million products only 2 years ago. Ensuring that so many products are well classified is a challenging task. Currently, Cdiscount.com applies machine learning algorithms to the text description of the products in order to automatically predict their category. As these methods now seem close to their maximum potential, Cdiscount.com believes that the next quantitative improvement will be driven by the application of data science techniques to images. In this challenge you will be building a model that automatically classifies the products based on their images. As a quick tour of Cdiscount.com's website can confirm, one product can have one or several images. The data set Cdiscount.com is making available is unique and characterized by superlative numbers in several ways:  Almost 9 million products: half of the current catalogue More than 15 million images at 180x180 resolution More than 5000 categories: yes this is quite an extreme multi-class classification!", "link": "https://www.kaggle.com/c/cdiscount-image-classification-challenge", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-12-15 00:59:00", "words": 242, "sentences": 12, "sum_nltk": "Categorize e-commerce photosRules Update: The CDiscount team has updated their rules to allow for use of this dataset for research and academic purposes only.\nCdiscount.com generated nearly 3 billion euros last year, making it France’s largest non-food e-commerce company.\nBy the end of this year, Cdiscount.com will have over 30 million products up for sale.\nThis is up from 10 million products only 2 years ago.\nEnsuring that so many products are well classified is a challenging task.\nCurrently, Cdiscount.com applies machine learning algorithms to the text description of the products in order to automatically predict their category.\nAs these methods now seem close to their maximum potential, Cdiscount.com believes that the next quantitative improvement will be driven by the application of data science techniques to images.\nIn this challenge you will be building a model that automatically classifies the products based on their images.\nAs a quick tour of Cdiscount.com's website can confirm, one product can have one or several images.\nThe data set Cdiscount.com is making available is unique and characterized by superlative numbers in several ways:  Almost 9 million products: half of the current catalogue More than 15 million images at 180x180 resolution More than 5000 categories: yes this is quite an extreme multi-class classification!", "sum_nltk_words": 200, "sum_nltk_runtime": 0.003, "sum_t5": "the data set is being used for research and academic purposes only. Cdiscount.com generated nearly 3 billion euros last year. by the end of this year, the company will have over 30 million products up for sale. this is up from 10 million products only 2 years ago. the company believes the next quantitative improvement will be driven by the application of data science techniques to images. a challenge is being created to build a model that automatically classifies the products based on their images.", "sum_t5_words": 85, "sum_t5_runtime": 5.07, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.5502347350120544, "nltk_category_runtime": 19.357, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.560911238193512, "nltk_subcategory_runtime": 31.342, "category": "Finance", "category_score": 0.5502347350120544, "subcategory": "Tools", "subcategory_score": 0.560911238193512, "runtime_cat": 50.7, "engagement_score": "0.619", "language_code": "en", "language": "english", "language_score": "0.9999977673528502", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "categorize ecommerce photosrules update cdiscount team updated rule allow use dataset research academic purpose access data go rule accept term download data cdiscountcom generated nearly 3 billion euro last year making france largest nonfood ecommerce company company already sell everything tv trampoline list product still rapidly growing end year cdiscountcom 30 million product sale 10 million product 2 year ago ensuring many product well classified challenging task currently cdiscountcom applies machine learning algorithm text description product order automatically predict category method seem close maximum potential cdiscountcom belief next quantitative improvement driven application data science technique image challenge building model automatically classifies product based image quick tour cdiscountcoms website confirm one product one several image data set cdiscountcom making available unique characterized superlative number several way almost 9 million product half current catalogue 15 million image 180x180 resolution 5000 category yes quite extreme multiclass classification", "tags_descriptive": []}