{"title": "iWildCam 2019 - FGVC6", "description": "Categorize animals in the wildCamera Traps (or Wild Cams) enable the automatic collection of large quantities of image data. Biologists all over the world use camera traps to monitor biodiversity and population density of animal species. We have recently been making strides towards automating the species classification challenge in camera traps, but as we try to expand the scope of these models from specific regions where we have collected training data to nearby areas we are faced with an interesting probem: how do you classify a species in a new region that you may not have seen in previous training data? In order to tackle this problem, we have prepared a challenge where the training data and test data are from different regions, namely The American Southwest and the American Northwest. The species seen in each region overlap, but are not identical, and the challenge is to classify the test species correctly. To this end, we will allow training on our American Southwest data (from CaltechCameraTraps), on iNaturalist 2017/2018 data, and on simulated data generated from Microsoft AirSim. We have provided a taxonomy file mapping our classes into the iNat taxonomy. This is an FGVCx competition as part of the FGVC6 workshop at CVPR 2019, and is sponsored by Microsoft AI for Earth.  There is a github page for the competition here. Please open an issue if you have questions or problems with the dataset. If you use this dataset in publication, please cite: @article{beery2019iwildcam,  title={The iWildCam 2019 Challenge Dataset},  author={Beery, Sara and Morris, Dan and Perona, Pietro},  journal={arXiv preprint arXiv:1907.07617},  year={2019} }   Kaggle is excited to partner with research groups to push forward the frontier of machine learning. Research competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team. Any questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "link": "https://www.kaggle.com/c/iwildcam-2019-fgvc6", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-06-08 01:59:00", "words": 322, "sentences": 12, "sum_nltk": "Categorize animals in the wildCamera Traps (or Wild Cams) enable the automatic collection of large quantities of image data.\nWe have recently been making strides towards automating the species classification challenge in camera traps, but as we try to expand the scope of these models from specific regions where we have collected training data to nearby areas we are faced with an interesting probem: how do you classify a species in a new region that you may not have seen in previous training data?\nIn order to tackle this problem, we have prepared a challenge where the training data and test data are from different regions, namely The American Southwest and the American Northwest.\nThe species seen in each region overlap, but are not identical, and the challenge is to classify the test species correctly.\nIf you use this dataset in publication, please cite: @article{beery2019iwildcam,  title={The iWildCam 2019 Challenge Dataset},  author={Beery, Sara and Morris, Dan and Perona, Pietro},  journal={arXiv preprint arXiv:1907.07617},  year={2019} }   Kaggle is excited to partner with research groups to push forward the frontier of machine learning.\nResearch competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team.\nAny questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "sum_nltk_words": 215, "sum_nltk_runtime": 0.003, "sum_t5": "a competition is being held to classify animals in camera traps. the competition will allow training on the american southwest and the american northwest. the species seen in each region overlap, but are not identical. the competition is sponsored by Microsoft AI for Earth. a github page is available for the competition. a github page is available here. a github page is available for the competition. a github page is available for the competition.", "sum_t5_words": 74, "sum_t5_runtime": 6.451, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.37908104062080383, "nltk_category_runtime": 20.367, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.5198675394058228, "nltk_subcategory_runtime": 34.729, "category": "Education & Research", "category_score": 0.37908104062080383, "subcategory": "Machine Learning", "subcategory_score": 0.5198675394058228, "runtime_cat": 55.096, "engagement_score": "0.582", "language_code": "en", "language": "english", "language_score": "0.9999957711475758", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "categorize animal wildcamera trap wild cam enable automatic collection large quantity image data biologist world use camera trap monitor biodiversity population density animal specie recently making stride towards automating specie classification challenge camera trap try expand scope model specific region collected training data nearby area faced interesting probem classify specie new region may seen previous training data order tackle problem prepared challenge training data test data different region namely american southwest american northwest specie seen region overlap identical challenge classify test specie correctly end allow training american southwest data caltechcameratraps inaturalist 20172018 data simulated data generated microsoft airsim provided taxonomy file mapping class inat taxonomy fgvcx competition part fgvc6 workshop cvpr 2019 sponsored microsoft ai earth github page competition please open issue question problem dataset use dataset publication please cite articlebeery2019iwildcam titlethe iwildcam 2019 challenge dataset authorbeery sara morris dan perona pietro journalarxiv preprint arxiv190707617 year2019 kaggle excited partner research group push forward frontier machine learning research competition make use kaggles platform experience largely organized research group data science team question concern regarding competition data quality topic addressed", "tags_descriptive": ["Exploratory Data Analysis"]}