{"title": "Give Me Some Credit", "description": "Improve on the state of the art in credit scoring by predicting the probability that somebody will experience financial distress in the next two years.Banks play a crucial role in market economies. They decide who can get finance and on what terms and can make or break investment decisions. For markets and society to function, individuals and companies need access to credit.  Credit scoring algorithms, which make a guess at the probability of default, are the method banks use to determine whether or not a loan should be granted. This competition requires participants to improve on the state of the art in credit scoring, by predicting the probability that somebody will experience financial distress in the next two years. The goal of this competition is to build a model that borrowers can use to help make the best financial decisions. Historical data are provided on 250,000 borrowers and the prize pool is $5,000 ($3,000 for first, $1,500 for second and $500 for third).", "link": "https://www.kaggle.com/c/GiveMeSomeCredit", "tags": ["Classification", "Feature Engineering", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2011-12-16 00:59:59", "words": 163, "sentences": 6, "runtime": 0.002, "description_category": "Finance", "description_category_score": 0.7949385643005371, "description_category_runtime": 13.411, "description_subcategory": "Quality", "description_subcategory_score": 0.5845511555671692, "description_subcategory_runtime": 21.238, "category": "Finance", "category_score": 0.7949385643005371, "subcategory": "Quality", "subcategory_score": 0.5845511555671692, "runtime_cat": 34.649, "engagement_score": "0.641", "language_code": "en", "language": "english", "language_score": "0.9999988809657172", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "improve state art credit scoring predicting probability somebody experience financial distress next two yearsbanks play crucial role market economy decide get finance term make break investment decision market society function individual company need access credit credit scoring algorithm make guess probability default method bank use determine whether loan granted competition requires participant improve state art credit scoring predicting probability somebody experience financial distress next two year goal competition build model borrower use help make best financial decision historical data provided 250000 borrower prize pool 5000 3000 first 1500 second 500 third", "tags_descriptive": ["Classification", "Feature Engineering", "Exploratory Data Analysis"]}