{"title": "Quora Question Pairs", "description": "Can you identify question pairs that have the same intent?Where else but Quora can a physicist help a chef with a math problem and get cooking tips in return? Quora is a place to gain and share knowledge—about anything. It’s a platform to ask questions and connect with people who contribute unique insights and quality answers. This empowers people to learn from each other and to better understand the world. Over 100 million people visit Quora every month, so it's no surprise that many people ask similarly worded questions. Multiple questions with the same intent can cause seekers to spend more time finding the best answer to their question, and make writers feel they need to answer multiple versions of the same question. Quora values canonical questions because they provide a better experience to active seekers and writers, and offer more value to both of these groups in the long term. Currently, Quora uses a Random Forest model to identify duplicate questions. In this competition, Kagglers are challenged to tackle this natural language processing problem by applying advanced techniques to classify whether question pairs are duplicates or not. Doing so will make it easier to find high quality answers to questions resulting in an improved experience for Quora writers, seekers, and readers.", "link": "https://www.kaggle.com/c/quora-question-pairs", "tags": ["NLP", "DL", "Feature Engineering", "Xgboost", "Exploratory Data Analysis", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-06-07 01:59:00", "words": 211, "sentences": 9, "sum_nltk": "Can you identify question pairs that have the same intent?Where else but Quora can a physicist help a chef with a math problem and get cooking tips in return?\nIt’s a platform to ask questions and connect with people who contribute unique insights and quality answers.\nThis empowers people to learn from each other and to better understand the world.\nOver 100 million people visit Quora every month, so it's no surprise that many people ask similarly worded questions.\nMultiple questions with the same intent can cause seekers to spend more time finding the best answer to their question, and make writers feel they need to answer multiple versions of the same question.\nQuora values canonical questions because they provide a better experience to active seekers and writers, and offer more value to both of these groups in the long term.\nCurrently, Quora uses a Random Forest model to identify duplicate questions.\nIn this competition, Kagglers are challenged to tackle this natural language processing problem by applying advanced techniques to classify whether question pairs are duplicates or not.\nDoing so will make it easier to find high quality answers to questions resulting in an improved experience for Quora writers, seekers, and readers.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.003, "sum_t5": "over 100 million people visit Quora every month. multiple questions with the same intent can cause seekers to spend more time finding the best answer. can you identify question pairs that have the same intent?. can you help a chef with a math problem and get cooking tips in return?. a competition is being held to determine if question pairs are duplicates. a winner will be announced on november 15. a winner will be announced on november 15.", "sum_t5_words": 78, "sum_t5_runtime": 4.884, "runtime": 0.002, "nltk_category": "Physics", "nltk_category_score": 0.6647024154663086, "nltk_category_runtime": 17.429, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.6196995377540588, "nltk_subcategory_runtime": 27.067, "category": "Physics", "category_score": 0.6647024154663086, "subcategory": "Quality", "subcategory_score": 0.6196995377540588, "runtime_cat": 44.496, "engagement_score": "0.703", "language_code": "en", "language": "english", "language_score": "0.9999973433056624", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identify question pair intentwhere else quora physicist help chef math problem get cooking tip return quora place gain share knowledgeabout anything platform ask question connect people contribute unique insight quality answer empowers people learn better understand world 100 million people visit quora every month surprise many people ask similarly worded question multiple question intent cause seeker spend time finding best answer question make writer feel need answer multiple version question quora value canonical question provide better experience active seeker writer offer value group long term currently quora us random forest model identify duplicate question competition kagglers challenged tackle natural language processing problem applying advanced technique classify whether question pair duplicate make easier find high quality answer question resulting improved experience quora writer seeker reader", "tags_descriptive": ["Natural Language Processing (NLP)", "Deep Learning (DL)", "Feature Engineering", "Xgboost", "Exploratory Data Analysis", "Convolutional Neural Network (CNN)"]}