{"title": "Categorical Feature Encoding Challenge II", "description": "Binary classification, with every feature a categorical (and interactions!)Can you find more cat in your dat? We loved the participation and engagement with the first Cat in the Dat competition. Because this is such a common task and important skill to master, we've put together a dataset that contains only categorical features, and includes:  binary features low- and high-cardinality nominal features low- and high-cardinality  ordinal features (potentially) cyclical features  This follow-up competition offers an even more challenging dataset so that you can continue to build your skills with the common machine learning task of encoding categorical variables.  This challenge adds the additional complexity of feature interactions, as well as missing data. This Playground competition will give you the opportunity to try different encoding schemes for different algorithms to compare how they perform. We encourage you to share what you find with the community. If you're not sure how to get started, you can check out the Categorical Variables  section of Kaggle's Intermediate Machine Learning course.  Have Fun!", "link": "https://www.kaggle.com/c/cat-in-the-dat-ii", "tags": ["Classification", "Ensembling", "Feature Engineering", "Exploratory Data Analysis", "Logistic Regression", "Naive Bayes"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-04-01 01:59:00", "words": 173, "sentences": 7, "runtime": 0.005, "description_category": "Finance", "description_category_score": 0.13964340090751648, "description_category_runtime": 15.273, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9708305597305298, "description_subcategory_runtime": 24.17, "category": "Finance", "category_score": 0.13964340090751648, "subcategory": "Machine Learning", "subcategory_score": 0.9708305597305298, "runtime_cat": 39.443, "engagement_score": "0.653", "language_code": "en", "language": "english", "language_score": "0.999996677527443", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "binary classification every feature categorical interactionscan find cat dat loved participation engagement first cat dat competition common task important skill master weve put together dataset contains categorical feature includes binary feature low highcardinality nominal feature low highcardinality ordinal feature potentially cyclical feature followup competition offer even challenging dataset continue build skill common machine learning task encoding categorical variable challenge add additional complexity feature interaction well missing data playground competition give opportunity try different encoding scheme different algorithm compare perform encourage share find community youre sure get started check categorical variable section kaggles intermediate machine learning course fun", "tags_descriptive": ["Classification", "Ensembling", "Feature Engineering", "Exploratory Data Analysis", "Logistic Regression", "Naive Bayes"]}