{"title": "Hash Code Archive - Photo Slideshow Optimization", "description": "Optimizing a photo album from Hash Code 2019Note: Put your heads together to solve programming challenges. Google's coding competition, Hash Code, has just finished for 2020. Use this online qualifier from 2019 to keep your skills sharp for future competitions! As the saying goes, \"a picture is worth a thousand words.\"  We agree – photos are an important part of contemporary digital and cultural life. How we experience photos largely depends on the story they’re arranged to tell. The same shots could be a monotonous series of snaps or form a narrative masterpiece. Approximately 2.5 billion people around the world carry a camera – in the form of a smartphone – in their pocket every day. We tend to make good use of it, too, taking more photos than ever (back in 2017, Google Photos announced it was backing up more than 1.2 billion photos and videos per day)! The rise of digital photography creates an interesting challenge: what should we do with all of these photos? In this competition, you will compose a slideshow out of a photo collection. Given a list of photos and the tags associated with each photo, you are challenged to arrange the photos into a slideshow that is as interesting as possible (the evaluation section explains what we mean by “interesting”) Will your slideshow tell a good story or be a major snoozefest?", "link": "https://www.kaggle.com/c/hashcode-photo-slideshow", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-07-28 01:59:00", "words": 230, "sentences": 8, "sum_nltk": "Optimizing a photo album from Hash Code 2019Note: Put your heads together to solve programming challenges.\nGoogle's coding competition, Hash Code, has just finished for 2020.\nUse this online qualifier from 2019 to keep your skills sharp for future competitions!\nHow we experience photos largely depends on the story they’re arranged to tell.\nApproximately 2.5 billion people around the world carry a camera – in the form of a smartphone – in their pocket every day.\nWe tend to make good use of it, too, taking more photos than ever (back in 2017, Google Photos announced it was backing up more than 1.2 billion photos and videos per day)!\nThe rise of digital photography creates an interesting challenge: what should we do with all of these photos?\nIn this competition, you will compose a slideshow out of a photo collection.\nGiven a list of photos and the tags associated with each photo, you are challenged to arrange the photos into a slideshow that is as interesting as possible (the evaluation section explains what we mean by “interesting”) Will your slideshow tell a good story or be a major snoozefest?", "sum_nltk_words": 181, "sum_nltk_runtime": 0.002, "sum_t5": "use this online qualifier from 2019 to keep your skills sharp for future competitions. Approximately 2.5 billion people around the world carry a camera in their pocket every day. we tend to make good use of it, too, taking more photos than ever. in this competition, you will compose a slideshow out of a photo collection. you will be challenged to arrange the photos into a slideshow that is as interesting as possible. will your slideshow tell a good story or be a major snooze", "sum_t5_words": 85, "sum_t5_runtime": 5.291, "runtime": 0.003, "nltk_category": "Media & Publishing", "nltk_category_score": 0.4621078670024872, "nltk_category_runtime": 16.53, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.6454854607582092, "nltk_subcategory_runtime": 26.01, "category": "Media & Publishing", "category_score": 0.4621078670024872, "subcategory": "Student", "subcategory_score": 0.6454854607582092, "runtime_cat": 42.539, "engagement_score": "0.491", "language_code": "en", "language": "english", "language_score": "0.999995456866309", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "optimizing photo album hash code 2019note put head together solve programming challenge google coding competition hash code finished 2020 use online qualifier 2019 keep skill sharp future competition saying go picture worth thousand word agree photo important part contemporary digital cultural life experience photo largely depends story theyre arranged tell shot could monotonous series snap form narrative masterpiece approximately 25 billion people around world carry camera form smartphone pocket every day tend make good use taking photo ever back 2017 google photo announced backing 12 billion photo video per day rise digital photography creates interesting challenge photo competition compose slideshow photo collection given list photo tag associated photo challenged arrange photo slideshow interesting possible evaluation section explains mean interesting slideshow tell good story major snoozefest", "tags_descriptive": []}