{"title": "Airbnb New User Bookings", "description": "Where will a new guest book their first travel experience?Instead of waking to overlooked \"Do not disturb\" signs, Airbnb travelers find themselves rising with the birds in a whimsical treehouse, having their morning coffee on the deck of a houseboat, or cooking a shared regional breakfast with their hosts. New users on Airbnb can book a place to stay in 34,000+ cities across 190+ countries. By accurately predicting where a new user will book their first travel experience, Airbnb can share more personalized content with their community, decrease the average time to first booking, and better forecast demand. In this recruiting competition, Airbnb challenges you to predict in which country a new user will make his or her first booking. Kagglers who impress with their answer (and an explanation of how they got there) will be considered for an interview for the opportunity to join Airbnb's Data Science and Analytics team.  Wondering if you're a good fit? Check out this article on how Airbnb scaled data science to all sides of their organization, and visit their careers page for more on Airbnb's mission to create a world that inspires human connection.", "link": "https://www.kaggle.com/c/airbnb-recruiting-new-user-bookings", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2016-02-12 00:59:00", "words": 179, "sentences": 6, "runtime": 0.002, "description_category": "Accommodation & Food", "description_category_score": 0.224585622549057, "description_category_runtime": 16.667, "description_subcategory": "Quality", "description_subcategory_score": 0.46018218994140625, "description_subcategory_runtime": 26.433, "category": "Accommodation & Food", "category_score": 0.224585622549057, "subcategory": "Quality", "subcategory_score": 0.46018218994140625, "runtime_cat": 43.1, "engagement_score": "0.665", "language_code": "en", "language": "english", "language_score": "0.9999971537442371", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "new guest book first travel experienceinstead waking overlooked disturb sign airbnb traveler find rising bird whimsical treehouse morning coffee deck houseboat cooking shared regional breakfast host new user airbnb book place stay 34000 city across 190 country accurately predicting new user book first travel experience airbnb share personalized content community decrease average time first booking better forecast demand recruiting competition airbnb challenge predict country new user make first booking kagglers impress answer explanation got considered interview opportunity join airbnbs data science analytics team wondering youre good fit check article airbnb scaled data science side organization visit career page airbnbs mission create world inspires human connection", "tags_descriptive": []}