{"title": "Planet: Understanding the Amazon from Space", "description": "Use satellite data to track the human footprint in the Amazon rainforestEvery minute, the world loses an area of forest the size of 48 football fields. And deforestation in the Amazon Basin accounts for the largest share, contributing to reduced biodiversity, habitat loss, climate change, and other devastating effects. But better data about the location of deforestation and human encroachment on forests can help governments and local stakeholders respond more quickly and effectively. Planet, designer and builder of the world’s largest constellation of Earth-imaging satellites, will soon be collecting daily imagery of the entire land surface of the earth at 3-5 meter resolution. While considerable research has been devoted to tracking changes in forests, it typically depends on coarse-resolution imagery from Landsat (30 meter pixels) or MODIS (250 meter pixels). This limits its effectiveness in areas where small-scale deforestation or forest degradation dominate. Furthermore, these existing methods generally cannot differentiate between human causes of forest loss and natural causes. Higher resolution imagery has already been shown to be exceptionally good at this, but robust methods have not yet been developed for Planet imagery.  In this competition, Planet and its Brazilian partner SCCON are challenging Kagglers to label satellite image chips with atmospheric conditions and various classes of land cover/land use. Resulting algorithms will help the global community better understand where, how, and why deforestation happens all over the world - and ultimately how to respond. To dig into/explore more Planet data, sign up for a free account. And if you're interested in building applications on Planet data, check out our Application Developer Program. Getting Started   Review the data page, which includes detailed information about the labels and the labeling process. Download a subsample of the data to get familiar with how it looks. Explore the subsample on Kernels. We’ve created a notebook for you to get started.", "link": "https://www.kaggle.com/c/planet-understanding-the-amazon-from-space", "tags": ["Exploratory Data Analysis", "Geospatial Analysis", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-07-21 01:59:00", "words": 310, "sentences": 16, "sum_nltk": "Use satellite data to track the human footprint in the Amazon rainforestEvery minute, the world loses an area of forest the size of 48 football fields.\nAnd deforestation in the Amazon Basin accounts for the largest share, contributing to reduced biodiversity, habitat loss, climate change, and other devastating effects.\nBut better data about the location of deforestation and human encroachment on forests can help governments and local stakeholders respond more quickly and effectively.\nPlanet, designer and builder of the world’s largest constellation of Earth-imaging satellites, will soon be collecting daily imagery of the entire land surface of the earth at 3-5 meter resolution.\nWhile considerable research has been devoted to tracking changes in forests, it typically depends on coarse-resolution imagery from Landsat (30 meter pixels) or MODIS (250 meter pixels).\nThis limits its effectiveness in areas where small-scale deforestation or forest degradation dominate.\nFurthermore, these existing methods generally cannot differentiate between human causes of forest loss and natural causes.\nHigher resolution imagery has already been shown to be exceptionally good at this, but robust methods have not yet been developed for Planet imagery.\nTo dig into/explore more Planet data, sign up for a free account.", "sum_nltk_words": 187, "sum_nltk_runtime": 0.004, "sum_t5": "planet is the creator of the world's largest constellation of earth-imaging satellites. it will soon be collecting daily imagery of the entire land surface of the earth at 3-5 meter resolution. this will help governments and local stakeholders respond more quickly and effectively. if you're interested in building applications on Planet data, check out our application developer program. resulting algorithms will help the global community better understand where, how, and why deforestation happens all over the world.", "sum_t5_words": 77, "sum_t5_runtime": 6.209, "runtime": 0.008, "nltk_category": "Government and Public Works", "nltk_category_score": 0.681770384311676, "nltk_category_runtime": 16.938, "nltk_subcategory": "Preventative and Reactive", "nltk_subcategory_score": 0.844160795211792, "nltk_subcategory_runtime": 27.058, "category": "Government and Public Works", "category_score": 0.681770384311676, "subcategory": "Preventative and Reactive", "subcategory_score": 0.844160795211792, "runtime_cat": 43.998, "engagement_score": "0.642", "language_code": "en", "language": "english", "language_score": "0.9999971249434223", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "use satellite data track human footprint amazon rainforestevery minute world loses area forest size 48 football field deforestation amazon basin account largest share contributing reduced biodiversity habitat loss climate change devastating effect better data location deforestation human encroachment forest help government local stakeholder respond quickly effectively planet designer builder world largest constellation earthimaging satellite soon collecting daily imagery entire land surface earth 35 meter resolution considerable research devoted tracking change forest typically depends coarseresolution imagery landsat 30 meter pixel modis 250 meter pixel limit effectiveness area smallscale deforestation forest degradation dominate furthermore existing method generally cannot differentiate human cause forest loss natural cause higher resolution imagery already shown exceptionally good robust method yet developed planet imagery competition planet brazilian partner sccon challenging kagglers label satellite image chip atmospheric condition various class land coverland use resulting algorithm help global community better understand deforestation happens world ultimately respond dig intoexplore planet data sign free account youre interested building application planet data check application developer program getting started review data page includes detailed information label labeling process download subsample data get familiar look explore subsample kernel weve created notebook get started", "tags_descriptive": ["Exploratory Data Analysis", "Geospatial Analysis", "Classification"]}