{"title": "Influencers in Social Networks", "description": "Predict which people are influential in a social networkData Science London and the UK Windows Azure Users Group in partnership with Microsoft and Peerindex, announce the Influencers in Social Networks competition as part of  The Big Data Hackathon.   The dataset, provided by Peerindex, comprises a standard, pair-wise preference learning task. Each datapoint describes two individuals, A and B. For each person, 11 p The binary label represents a human judgement about which one of the two individuals is more influential. A label '1' means A is more influential than B. 0 means B is more influential than A. The goal of the challenge is to train a machine learning model which, for pairs of individuals, predicts the human judgement on who is more influential with high accuracy. Labels for the dataset have been collected by PeerIndex using an application similar to the one described in this post. A python script computing a sample benchmark solution is available here:  Competition begins: Saturday, Apr 13, 1pm BST (12 noon UTC)  This competition awards 25% the  ranking points of a standard competition, but does not count towards tiers.", "link": "https://www.kaggle.com/c/predict-who-is-more-influential-in-a-social-network", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2013-04-14 14:00:00", "words": 181, "sentences": 8, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.11515268683433533, "description_category_runtime": 16.542, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8012233376502991, "description_subcategory_runtime": 25.95, "category": "Utilities", "category_score": 0.11515268683433533, "subcategory": "Machine Learning", "subcategory_score": 0.8012233376502991, "runtime_cat": 42.493, "engagement_score": "0.52", "language_code": "en", "language": "english", "language_score": "0.9999963309234575", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict people influential social networkdata science london uk window azure user group partnership microsoft peerindex announce influencers social network competition part big data hackathon dataset provided peerindex comprises standard pairwise preference learning task datapoint describes two individual b person 11 p binary label represents human judgement one two individual influential label 1 mean influential b 0 mean b influential goal challenge train machine learning model pair individual predicts human judgement influential high accuracy label dataset collected peerindex using application similar one described post python script computing sample benchmark solution available competition begin saturday apr 13 1pm bst 12 noon utc competition award 25 ranking point standard competition count towards tier", "tags_descriptive": []}