{"title": "How Much Did It Rain? II", "description": "Predict hourly rainfall using data from polarimetric radarsAfter incorporating feedback from the Kaggle community, as well as scientific and educational partners, the Artificial Intelligence Committee of the American Meteorological Society is excited to be running a second iteration of the How Much Did It Rain? competition. How Much Did It Rain? II is focused on solving the same core rain measurement prediction problem, but approaches it with a new and improved dataset and evaluation metric. This competition will go even further towards building a useful educational tool for universities, as well as making a meaningful contribution to continued meteorological research. Competition Description Rainfall is highly variable across space and time, making it notoriously tricky to measure. Rain gauges can be an effective measurement tool for a specific location, but it is impossible to have them everywhere. In order to have widespread coverage, data from weather radars is used to estimate rainfall nationwide. Unfortunately, these predictions never exactly match the measurements taken using rain gauges. Recently, in an effort to improve their rainfall predictors, the U.S. National Weather Service upgraded their radar network to be polarimetric. These polarimetric radars are able to provide higher quality data than conventional Doppler radars because they transmit radio wave pulses with both horizontal and vertical orientations.   Dual pulses make it easier to infer the size and type of precipitation because rain drops become flatter as they increase in size, whereas ice crystals tend to be elongated vertically. In this competition, you are given snapshots of polarimetric radar values and asked to predict the hourly rain gauge total. A word of caution: many of the gauge values in the training dataset are implausible (gauges may get clogged, for example). More details are on the data page. Acknowledgements This competition is sponsored by the Artificial Intelligence Committee of the American Meteorological Society. Climate Corporation is providing the prize pool.", "link": "https://www.kaggle.com/c/how-much-did-it-rain-ii", "tags": ["LSTM"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-12-08 00:59:00", "words": 291, "sentences": 13, "sum_nltk": "Predict hourly rainfall using data from polarimetric radarsAfter incorporating feedback from the Kaggle community, as well as scientific and educational partners, the Artificial Intelligence Committee of the American Meteorological Society is excited to be running a second iteration of the How Much Did It Rain?\nII is focused on solving the same core rain measurement prediction problem, but approaches it with a new and improved dataset and evaluation metric.\nCompetition Description Rainfall is highly variable across space and time, making it notoriously tricky to measure.\nIn order to have widespread coverage, data from weather radars is used to estimate rainfall nationwide.\nUnfortunately, these predictions never exactly match the measurements taken using rain gauges.\nRecently, in an effort to improve their rainfall predictors, the U.S. National Weather Service upgraded their radar network to be polarimetric.\nThese polarimetric radars are able to provide higher quality data than conventional Doppler radars because they transmit radio wave pulses with both horizontal and vertical orientations.\nIn this competition, you are given snapshots of polarimetric radar values and asked to predict the hourly rain gauge total.\nAcknowledgements This competition is sponsored by the Artificial Intelligence Committee of the American Meteorological Society.", "sum_nltk_words": 175, "sum_nltk_runtime": 0.004, "sum_t5": "a competition to predict hourly rainfall is running. the competition uses polarimetric radars to improve rainfall prediction. the u.s. national weather service upgraded their radar network to be polarimetric. the polarimetric radars transmit radio wave pulses with both horizontal and vertical orientations. the competition is open to all ages and is open to all ages. a winner will be announced on november 15.", "sum_t5_words": 63, "sum_t5_runtime": 5.875, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.3352271020412445, "nltk_category_runtime": 18.666, "nltk_subcategory": "General", "nltk_subcategory_score": 0.5991486310958862, "nltk_subcategory_runtime": 29.158, "category": "Education & Research", "category_score": 0.3352271020412445, "subcategory": "General", "subcategory_score": 0.5991486310958862, "runtime_cat": 47.824, "engagement_score": "0.616", "language_code": "en", "language": "english", "language_score": "0.9999978604082401", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict hourly rainfall using data polarimetric radarsafter incorporating feedback kaggle community well scientific educational partner artificial intelligence committee american meteorological society excited running second iteration much rain competition much rain ii focused solving core rain measurement prediction problem approach new improved dataset evaluation metric competition go even towards building useful educational tool university well making meaningful contribution continued meteorological research competition description rainfall highly variable across space time making notoriously tricky measure rain gauge effective measurement tool specific location impossible everywhere order widespread coverage data weather radar used estimate rainfall nationwide unfortunately prediction never exactly match measurement taken using rain gauge recently effort improve rainfall predictor u national weather service upgraded radar network polarimetric polarimetric radar able provide higher quality data conventional doppler radar transmit radio wave pulse horizontal vertical orientation dual pulse make easier infer size type precipitation rain drop become flatter increase size whereas ice crystal tend elongated vertically competition given snapshot polarimetric radar value asked predict hourly rain gauge total word caution many gauge value training dataset implausible gauge may get clogged example detail data page acknowledgement competition sponsored artificial intelligence committee american meteorological society climate corporation providing prize pool", "tags_descriptive": ["Long short-term memory (LSTM)"]}