{"title": "Carvana Image Masking Challenge", "description": "Automatically identify the boundaries of the car in an imageAs with any big purchase, full information and transparency are key. While most everyone describes buying a used car as frustrating, it’s just as annoying to sell one, especially online. Shoppers want to know everything about the car but they must rely on often blurry pictures and little information, keeping used car sales a largely inefficient, local industry. Carvana, a successful online used car startup, has seen opportunity to build long term trust with consumers and streamline the online buying process. An interesting part of their innovation is a custom rotating photo studio that automatically captures and processes 16 standard images of each vehicle in their inventory. While Carvana takes high quality photos,  bright reflections and cars with similar colors as the background cause automation errors, which requires a skilled photo editor to change.  In this competition, you’re challenged to develop an algorithm that automatically removes the photo studio background. This will allow Carvana to superimpose cars on a variety of backgrounds. You’ll be analyzing a dataset of photos, covering different vehicles with a wide variety of year, make, and model combinations.", "link": "https://www.kaggle.com/c/carvana-image-masking-challenge", "tags": ["CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-09-28 01:59:00", "words": 193, "sentences": 9, "runtime": 0.005, "description_category": "Finance", "description_category_score": 0.31236234307289124, "description_category_runtime": 15.889, "description_subcategory": "Transportation", "description_subcategory_score": 0.4729211926460266, "description_subcategory_runtime": 25.572, "category": "Finance", "category_score": 0.31236234307289124, "subcategory": "Transportation", "subcategory_score": 0.4729211926460266, "runtime_cat": 41.462, "engagement_score": "0.628", "language_code": "en", "language": "english", "language_score": "0.9999966482615918", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "automatically identify boundary car imageas big purchase full information transparency key everyone describes buying used car frustrating annoying sell one especially online shopper want know everything car must rely often blurry picture little information keeping used car sale largely inefficient local industry carvana successful online used car startup seen opportunity build long term trust consumer streamline online buying process interesting part innovation custom rotating photo studio automatically capture process 16 standard image vehicle inventory carvana take high quality photo bright reflection car similar color background cause automation error requires skilled photo editor change competition youre challenged develop algorithm automatically remove photo studio background allow carvana superimpose car variety background youll analyzing dataset photo covering different vehicle wide variety year make model combination", "tags_descriptive": ["Computer Vision (CV)"]}