{"title": "Ciphertext Challenge II", "description": "553398 418126 467884 411 374106 551004 356535 539549 487091 290502 121468 556912 469347 515719 201909 101Ciphertext Challenge II: The Challengening! It's baaaaaaack! In our first ciphertext competition, we hunted the wilds of the '90s-era internet. This time around, we're exploring the dark slow-broadband-y wastelands of 2011, with the Movie Review Dataset. In 2011 most of the internet hadn't even been invented yet*, so wow, you're in for a treat. Again, simple classic ciphers have been used to encrypt this dataset. Your mission this time: to correctly match each piece of ciphertext with its corresponding piece of plaintext. Daunting! Also, there are some new ciphers in play this time, which will involve some meta-puzzling. Enjoy! Swag prizes go to the first three teams to crack all four ciphers OR to the top three teams on the LB (in case the ciphers are not all cracked). Additionally, swag prizes will be awarded to the best competition-related kernels, in both visualization and cryptanalysis, based on upvotes. Go ahead. Get cracking! * - This is not true. Acknowledgements Maas, A., Daly, R., Pham, P., Huang, D., Ng, A. and Potts, C. (2011). Learning Word Vectors for Sentiment Analysis: Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies. [online] Portland, Oregon, USA: Association for Computational Linguistics, pp. 142–150. Available here.", "link": "https://www.kaggle.com/c/ciphertext-challenge-ii", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-04-26 01:59:00", "words": 221, "sentences": 17, "sum_nltk": "553398 418126 467884 411 374106 551004 356535 539549 487091 290502 121468 556912 469347 515719 201909 101Ciphertext Challenge II: The Challengening!\nIt's baaaaaaack!\nIn our first ciphertext competition, we hunted the wilds of the '90s-era internet.\nThis time around, we're exploring the dark slow-broadband-y wastelands of 2011, with the Movie Review Dataset.\nIn 2011 most of the internet hadn't even been invented yet*, so wow, you're in for a treat.\nAgain, simple classic ciphers have been used to encrypt this dataset.\nYour mission this time: to correctly match each piece of ciphertext with its corresponding piece of plaintext.\nDaunting!\nAlso, there are some new ciphers in play this time, which will involve some meta-puzzling.\nEnjoy!\nSwag prizes go to the first three teams to crack all four ciphers OR to the top three teams on the LB (in case the ciphers are not all cracked).\nAdditionally, swag prizes will be awarded to the best competition-related kernels, in both visualization and cryptanalysis, based on upvotes.\nGo ahead.\nGet cracking!\n* - This is not true.\nLearning Word Vectors for Sentiment Analysis: Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies.\n[online] Portland, Oregon, USA: Association for Computational Linguistics, pp.", "sum_nltk_words": 187, "sum_nltk_runtime": 0.002, "sum_t5": "ciphertext challenge 2: the challengening! ciphertext challenge 2: the challengening! ciphertext challenge 2: the challengening! ciphertext challenge 2: the challengening! ciphertext challenge 2: the challengening! ciphertext challenge 2: the challengening! ciphertext challenge 2: the challengening! ciphertext challenge 2: the challengening! ciphertext challenge 2: the challengening!", "sum_t5_words": 45, "sum_t5_runtime": 6.36, "runtime": 0.005, "nltk_category": "Media & Publishing", "nltk_category_score": 0.09872658550739288, "nltk_category_runtime": 23.054, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.24501335620880127, "nltk_subcategory_runtime": 37.77, "category": "Media & Publishing", "category_score": 0.09872658550739288, "subcategory": "Student", "subcategory_score": 0.24501335620880127, "runtime_cat": 60.825, "engagement_score": "0.477", "language_code": "en", "language": "english", "language_score": "0.9999964060415018", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "553398 418126 467884 411 374106 551004 356535 539549 487091 290502 121468 556912 469347 515719 201909 101ciphertext challenge ii challengening baaaaaaack first ciphertext competition hunted wild 90sera internet time around exploring dark slowbroadbandy wasteland 2011 movie review dataset 2011 internet hadnt even invented yet wow youre treat simple classic cipher used encrypt dataset mission time correctly match piece ciphertext corresponding piece plaintext daunting also new cipher play time involve metapuzzling enjoy swag prize go first three team crack four cipher top three team lb case cipher cracked additionally swag prize awarded best competitionrelated kernel visualization cryptanalysis based upvotes go ahead get cracking true acknowledgement maas daly r pham p huang ng potts c 2011 learning word vector sentiment analysis proceeding 49th annual meeting association computational linguistics human language technology online portland oregon usa association computational linguistics pp 142150 available", "tags_descriptive": []}