{"title": "Conway's Reverse Game of Life 2020", "description": "Reverse the arrow of time in the Game of LifeThis is a relaunch of a previous competition, Conway's Reverse Game of Life, with the following changes:  The grid size is larger (25 vs. 25) and the grid wraps around from top to bottom and left to right Submissions are solved forward by the appropriate number of steps, so that any correct starting solution will achieve a maximum score. This article contains the stepping function that is used for this competition.  Obligatory Disclaimer: A lot has changed since the original competition was launched 6 years ago. With the change from \"exact starting point\" to  \"any correct starting point\", it is possible to get a perfect score. We just don't know how difficult that will be. Use it as a fun learning experience, and don't spoil it for others by posting perfect solutions! ~~~~~~~~~ The Game of Life is a cellular automaton created by mathematician John Conway in 1970. The game consists of a board of cells that are either on or off. One creates an initial configuration of these on/off states and observes how it evolves. There are four simple rules to determine the next state of the game board, given the current state:  Overpopulation: if a living cell is surrounded by more than three living cells, it dies. Stasis: if a living cell is surrounded by two or three living cells, it survives. Underpopulation: if a living cell is surrounded by fewer than two living cells, it dies. Reproduction: if a dead cell is surrounded by exactly three cells, it becomes a live cell.  These simple rules result in many interesting behaviors and have been the focus of a large body of mathematics. As Wikipedia states Ever since its publication, Conway's Game of Life has attracted much interest, because of the surprising ways in which the patterns can evolve. Life provides an example of emergence and self-organization. It is interesting for computer scientists, physicists, biologists, biochemists, economists, mathematicians, philosophers, generative scientists and others to observe the way that complex patterns can emerge from the implementation of very simple rules. The game can also serve as a didactic analogy, used to convey the somewhat counter-intuitive notion that \"design\" and \"organization\" can spontaneously emerge in the absence of a designer. For example, philosopher and cognitive scientist Daniel Dennett has used the analogue of Conway's Life \"universe\" extensively to illustrate the possible evolution of complex philosophical constructs, such as consciousness and free will, from the relatively simple set of deterministic physical laws governing our own universe.  The emergence of order from simple rules begs an interesting question—what happens if we set time backwards? This competition is an experiment to see if machine learning (or optimization, or any method) can predict the game of life in reverse. Is the chaotic start of Life predictable from its orderly ends? We have created many games, evolved them, and provided only the end boards. You are asked to predict the starting board that resulted in each end board.  This is a Code Competition. Refer to Code Requirements for details.", "link": "https://www.kaggle.com/c/conways-reverse-game-of-life-2020", "tags": ["DL", "Feature Engineering", "Exploratory Data Analysis", "Keras", "Games", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-12-01 00:59:00", "words": 519, "sentences": 24, "sum_nltk": "Reverse the arrow of time in the Game of LifeThis is a relaunch of a previous competition, Conway's Reverse Game of Life, with the following changes:  The grid size is larger (25 vs.\n~~~~~~~~~ The Game of Life is a cellular automaton created by mathematician John Conway in 1970.\nThere are four simple rules to determine the next state of the game board, given the current state:  Overpopulation: if a living cell is surrounded by more than three living cells, it dies.\nAs Wikipedia states Ever since its publication, Conway's Game of Life has attracted much interest, because of the surprising ways in which the patterns can evolve.\nIt is interesting for computer scientists, physicists, biologists, biochemists, economists, mathematicians, philosophers, generative scientists and others to observe the way that complex patterns can emerge from the implementation of very simple rules.\nThe emergence of order from simple rules begs an interesting question—what happens if we set time backwards?\nThis competition is an experiment to see if machine learning (or optimization, or any method) can predict the game of life in reverse.\nIs the chaotic start of Life predictable from its orderly ends?\nWe have created many games, evolved them, and provided only the end boards.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.006, "sum_t5": "the game of life is a cellular automaton created by mathematician John Conway in 1970. it is a cellular automaton that consists of a board of cells that are either on or off. the game has attracted much interest because of the surprising ways in which patterns can evolve. the game is a fun learning experience, and don't spoil it for others by posting perfect solutions. if you're a winner, you can submit your answer to the competition by completing the", "sum_t5_words": 81, "sum_t5_runtime": 6.991, "runtime": 0.01, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.09181217104196548, "nltk_category_runtime": 17.751, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.22947506606578827, "nltk_subcategory_runtime": 28.492, "category": "Biotechnological & Life Sciences", "category_score": 0.09181217104196548, "subcategory": "Machine Learning", "subcategory_score": 0.22947506606578827, "runtime_cat": 46.243, "engagement_score": "0.544", "language_code": "en", "language": "english", "language_score": "0.9999961168194462", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "reverse arrow time game lifethis relaunch previous competition conways reverse game life following change grid size larger 25 v 25 grid wrap around top bottom left right submission solved forward appropriate number step correct starting solution achieve maximum score article contains stepping function used competition obligatory disclaimer lot changed since original competition launched 6 year ago change exact starting point correct starting point possible get perfect score dont know difficult use fun learning experience dont spoil others posting perfect solution game life cellular automaton created mathematician john conway 1970 game consists board cell either one creates initial configuration onoff state observes evolves four simple rule determine next state game board given current state overpopulation living cell surrounded three living cell dy stasis living cell surrounded two three living cell survives underpopulation living cell surrounded fewer two living cell dy reproduction dead cell surrounded exactly three cell becomes live cell simple rule result many interesting behavior focus large body mathematics wikipedia state ever since publication conways game life attracted much interest surprising way pattern evolve life provides example emergence selforganization interesting computer scientist physicist biologist biochemist economist mathematician philosopher generative scientist others observe way complex pattern emerge implementation simple rule game also serve didactic analogy used convey somewhat counterintuitive notion design organization spontaneously emerge absence designer example philosopher cognitive scientist daniel dennett used analogue conways life universe extensively illustrate possible evolution complex philosophical construct consciousness free relatively simple set deterministic physical law governing universe emergence order simple rule begs interesting questionwhat happens set time backwards competition experiment see machine learning optimization method predict game life reverse chaotic start life predictable orderly end created many game evolved provided end board asked predict starting board resulted end board code competition refer code requirement detail", "tags_descriptive": ["Deep Learning (DL)", "Feature Engineering", "Exploratory Data Analysis", "Keras", "Games", "Convolutional Neural Network (CNN)"]}