{"title": "M5 Forecasting - Uncertainty", "description": "Estimate the uncertainty distribution of Walmart unit sales.Note: This is one of the two complementary competitions that together comprise the M5 forecasting challenge. Can you estimate, as precisely as possible, the uncertainty distribution of the unit sales of various products sold in the USA by Walmart? This specific competition is the first of its kind, opening up new directions for both academic research and how uncertainty could be assessed and used in organizations. If you are interested in providing point (accuracy) forecasts for the same series, be sure to check out its companion competition. How much camping gear will one store sell each month in a year? To the uninitiated, calculating sales at this level may seem as difficult as predicting the weather. Both types of forecasting rely on science and historical data. While a wrong weather forecast may result in you carrying around an umbrella on a sunny day, inaccurate business forecasts could result in actual or opportunity losses.  In this competition, in addition to traditional forecasting methods you’re also challenged to use machine learning to improve forecast accuracy. The Makridakis Open Forecasting Center (MOFC) at the University of Nicosia conducts cutting-edge forecasting research and provides business forecast training. It helps companies achieve accurate predictions, estimate the levels of uncertainty, avoiding costly mistakes, and apply best forecasting practices. The MOFC is well known for its Makridakis Competitions, the first of which ran in the 1980s. In this competition, the fifth iteration, you will use hierarchical sales data from Walmart, the world’s largest company by revenue, to forecast daily sales for the next 28 days and to make uncertainty estimates for these forecasts. The data, covers stores in three US States (California, Texas, and Wisconsin) and includes item level, department, product categories, and store details. In addition, it has explanatory variables such as price, promotions, day of the week, and special events. Together, this robust dataset can be used to improve forecasting accuracy. If successful, your work will continue to advance the theory and practice of forecasting. The methods used can be applied in various business areas, such as setting up appropriate inventory or service levels. Through its business support and training, the MOFC will help distribute the tools and knowledge so others can achieve more accurate and better calibrated forecasts, reduce waste and be able to appreciate uncertainty and its risk implications. Acknowledgements Additional thanks go to other partner organizations and prize sponsors, National Technical University of Athens (NTUA), INSEAD, Google, Uber and IIF.", "link": "https://www.kaggle.com/c/m5-forecasting-uncertainty", "tags": ["Exploratory Data Analysis", "CLustering"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-07-01 01:59:00", "words": 416, "sentences": 18, "sum_nltk": "Estimate the uncertainty distribution of Walmart unit sales.Note: This is one of the two complementary competitions that together comprise the M5 forecasting challenge.\nCan you estimate, as precisely as possible, the uncertainty distribution of the unit sales of various products sold in the USA by Walmart?\nIf you are interested in providing point (accuracy) forecasts for the same series, be sure to check out its companion competition.\nIn this competition, in addition to traditional forecasting methods you’re also challenged to use machine learning to improve forecast accuracy.\nThe Makridakis Open Forecasting Center (MOFC) at the University of Nicosia conducts cutting-edge forecasting research and provides business forecast training.\nIt helps companies achieve accurate predictions, estimate the levels of uncertainty, avoiding costly mistakes, and apply best forecasting practices.\nIn this competition, the fifth iteration, you will use hierarchical sales data from Walmart, the world’s largest company by revenue, to forecast daily sales for the next 28 days and to make uncertainty estimates for these forecasts.\nThrough its business support and training, the MOFC will help distribute the tools and knowledge so others can achieve more accurate and better calibrated forecasts, reduce waste and be able to appreciate uncertainty and its risk implications.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.005, "sum_t5": "the competition is the first of its kind and opens up new directions for research. it challenges you to estimate the uncertainty distribution of unit sales. the competition is run by the Makridakis Open Forecasting Center. it helps companies achieve accurate predictions, estimate the levels of uncertainty, avoiding costly mistakes, and apply best forecasting practices. the competition is open to all university students and is open to all university students. if successful, your work will continue to advance the theory and practice of forecasting.", "sum_t5_words": 84, "sum_t5_runtime": 6.697, "runtime": 0.01, "nltk_category": "Finance", "nltk_category_score": 0.6275355815887451, "nltk_category_runtime": 17.557, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.6512532830238342, "nltk_subcategory_runtime": 28.006, "category": "Finance", "category_score": 0.6275355815887451, "subcategory": "Judicial Applied", "subcategory_score": 0.6512532830238342, "runtime_cat": 45.563, "engagement_score": "0.64", "language_code": "en", "language": "english", "language_score": "0.9999964875303227", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "estimate uncertainty distribution walmart unit salesnote one two complementary competition together comprise m5 forecasting challenge estimate precisely possible uncertainty distribution unit sale various product sold usa walmart specific competition first kind opening new direction academic research uncertainty could assessed used organization interested providing point accuracy forecast series sure check companion competition much camping gear one store sell month year uninitiated calculating sale level may seem difficult predicting weather type forecasting rely science historical data wrong weather forecast may result carrying around umbrella sunny day inaccurate business forecast could result actual opportunity loss competition addition traditional forecasting method youre also challenged use machine learning improve forecast accuracy makridakis open forecasting center mofc university nicosia conduct cuttingedge forecasting research provides business forecast training help company achieve accurate prediction estimate level uncertainty avoiding costly mistake apply best forecasting practice mofc well known makridakis competition first ran 1980s competition fifth iteration use hierarchical sale data walmart world largest company revenue forecast daily sale next 28 day make uncertainty estimate forecast data cover store three u state california texas wisconsin includes item level department product category store detail addition explanatory variable price promotion day week special event together robust dataset used improve forecasting accuracy successful work continue advance theory practice forecasting method used applied various business area setting appropriate inventory service level business support training mofc help distribute tool knowledge others achieve accurate better calibrated forecast reduce waste able appreciate uncertainty risk implication acknowledgement additional thanks go partner organization prize sponsor national technical university athens ntua insead google uber iif", "tags_descriptive": ["Exploratory Data Analysis", "CLustering"]}