{"title": "Mercari Price Suggestion Challenge", "description": "Can you automatically suggest product prices to online sellers?It can be hard to know how much something’s really worth. Small details can mean big differences in pricing. For example, one of these sweaters cost $335 and the other cost $9.99. Can you guess which one’s which?   Product pricing gets even harder at scale, considering just how many products are sold online. Clothing has strong seasonal pricing trends and is heavily influenced by brand names, while electronics have fluctuating prices based on product specs.  Mercari, Japan’s biggest community-powered shopping app, knows this problem deeply. They’d like to offer pricing suggestions to sellers, but this is tough because their sellers are enabled to put just about anything, or any bundle of things, on Mercari's marketplace. In this competition, Mercari’s challenging you to build an algorithm that automatically suggests the right product prices. You’ll be provided user-inputted text descriptions of their products, including details like product category name, brand name, and item condition. Note that, because of the public nature of this data, this competition is a “Kernels Only” competition. In the second stage of the challenge, files will only be available through Kernels and you will not be able to modify your approach in response to new data. Read more details in the data tab and Kernels FAQ page.", "link": "https://www.kaggle.com/c/mercari-price-suggestion-challenge", "tags": ["DL", "NLP", "RNN", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-02-21 21:03:00", "words": 220, "sentences": 12, "sum_nltk": "Can you automatically suggest product prices to online sellers?It can be hard to know how much something’s really worth.\nSmall details can mean big differences in pricing.\nProduct pricing gets even harder at scale, considering just how many products are sold online.\nClothing has strong seasonal pricing trends and is heavily influenced by brand names, while electronics have fluctuating prices based on product specs.\nMercari, Japan’s biggest community-powered shopping app, knows this problem deeply.\nThey’d like to offer pricing suggestions to sellers, but this is tough because their sellers are enabled to put just about anything, or any bundle of things, on Mercari's marketplace.\nIn this competition, Mercari’s challenging you to build an algorithm that automatically suggests the right product prices.\nYou’ll be provided user-inputted text descriptions of their products, including details like product category name, brand name, and item condition.\nNote that, because of the public nature of this data, this competition is a “Kernels Only” competition.\nIn the second stage of the challenge, files will only be available through Kernels and you will not be able to modify your approach in response to new data.\nRead more details in the data tab and Kernels FAQ page.", "sum_nltk_words": 188, "sum_nltk_runtime": 0.003, "sum_t5": "clothing has strong seasonal pricing trends and is heavily influenced by brand names. electronics have fluctuating prices based on product specs. Mercari, Japan’s biggest community-powered shopping app, knows this problem deeply. in this competition, Mercari’s challenging you to build an algorithm that automatically suggests the right product prices. you’ll be provided user-inputted text descriptions of their products, including details like product category name, brand name, and item condition.", "sum_t5_words": 68, "sum_t5_runtime": 4.805, "runtime": 0.005, "nltk_category": "Utilities", "nltk_category_score": 0.45539724826812744, "nltk_category_runtime": 18.757, "nltk_subcategory": "Restaurant", "nltk_subcategory_score": 0.538433313369751, "nltk_subcategory_runtime": 29.005, "category": "Utilities", "category_score": 0.45539724826812744, "subcategory": "Restaurant", "subcategory_score": 0.538433313369751, "runtime_cat": 47.761, "engagement_score": "0.689", "language_code": "en", "language": "english", "language_score": "0.9999975885107886", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "automatically suggest product price online sellersit hard know much somethings really worth small detail mean big difference pricing example one sweater cost 335 cost 999 guess one product pricing get even harder scale considering many product sold online clothing strong seasonal pricing trend heavily influenced brand name electronics fluctuating price based product spec mercari japan biggest communitypowered shopping app know problem deeply theyd like offer pricing suggestion seller tough seller enabled put anything bundle thing mercaris marketplace competition mercaris challenging build algorithm automatically suggests right product price youll provided userinputted text description product including detail like product category name brand name item condition note public nature data competition kernel competition second stage challenge file available kernel able modify approach response new data read detail data tab kernel faq page", "tags_descriptive": ["Deep Learning (DL)", "Natural Language Processing (NLP)", "Recurrent Neural Network (RNN)", "Exploratory Data Analysis"]}