{"title": "The 2nd YouTube-8M Video Understanding Challenge", "description": "Can you create a constrained-size model to predict video labels?The world is generating and consuming an enormous amount of video content. Currently on YouTube, people watch over 1 billion hours of video every single day. To spur advances in analyzing and understanding video,  Google AI has publicly released a large-scale video dataset that consists of millions of YouTube video features and associated labels from a diverse vocabulary of 3,700+ visual entities called the YouTube-8M Dataset. Last year, we successfully hosted Google Cloud & YouTube-8M Video Understanding Challenge, with 742 participating teams with 946 individual competitors from 60 countries. This competition is the second Kaggle competition based on YouTube 8M dataset, and is focused on learning video representation under budget constraints.  For a lot of video tasks where there are a large number of classes, like recommending new videos or automatic video classification, compact models need to meet memory and computational requirements. This is true even if working in cloud computational environments. Also, compact models make it possible to have limited-memory or catalog indexes on devices in order to do personalized and privacy-preserving computation on user’s personal mobile phones. In this competition, you’re challenged to produce a compact video classification model. Your model size must not exceed 1 GB (this is strictly enforced, through model upload). We encourage participants to train a model that most efficiently uses this budget, rather than ensembles of lots of models.  This competition is being hosted by Google AI (previously known as Google Research) as a part of the European Conference on Computer Vision (ECCV) 2018 selected workshop session. Please refer to the YouTube 8M Large-Scale Video Understanding Workshop Page for details about the workshop.", "link": "https://www.kaggle.com/c/youtube8m-2018", "tags": ["DL", "LSTM"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-08-07 01:59:00", "words": 282, "sentences": 13, "sum_nltk": "To spur advances in analyzing and understanding video,  Google AI has publicly released a large-scale video dataset that consists of millions of YouTube video features and associated labels from a diverse vocabulary of 3,700+ visual entities called the YouTube-8M Dataset.\nLast year, we successfully hosted Google Cloud & YouTube-8M Video Understanding Challenge, with 742 participating teams with 946 individual competitors from 60 countries.\nThis competition is the second Kaggle competition based on YouTube 8M dataset, and is focused on learning video representation under budget constraints.\nFor a lot of video tasks where there are a large number of classes, like recommending new videos or automatic video classification, compact models need to meet memory and computational requirements.\nAlso, compact models make it possible to have limited-memory or catalog indexes on devices in order to do personalized and privacy-preserving computation on user’s personal mobile phones.\nIn this competition, you’re challenged to produce a compact video classification model.\nWe encourage participants to train a model that most efficiently uses this budget, rather than ensembles of lots of models.\nPlease refer to the YouTube 8M Large-Scale Video Understanding Workshop Page for details about the workshop.", "sum_nltk_words": 185, "sum_nltk_runtime": 0.004, "sum_t5": "last year, we successfully hosted Google Cloud & YouTube-8M Video Understanding Challenge. this competition is the second Kaggle competition based on YouTube 8M dataset. you're challenged to produce a compact video classification model. your model size must not exceed 1 GB (this is strictly enforced, through model upload). the competition is being hosted by Google AI as a part of the European Conference on Computer Vision (ECCV) 2018 selected workshop session.", "sum_t5_words": 71, "sum_t5_runtime": 5.772, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.45672687888145447, "nltk_category_runtime": 16.902, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8469686508178711, "nltk_subcategory_runtime": 27.446, "category": "Education & Research", "category_score": 0.45672687888145447, "subcategory": "Machine Learning", "subcategory_score": 0.8469686508178711, "runtime_cat": 44.349, "engagement_score": "0.578", "language_code": "en", "language": "english", "language_score": "0.9999990892912036", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "create constrainedsize model predict video labelsthe world generating consuming enormous amount video content currently youtube people watch 1 billion hour video every single day spur advance analyzing understanding video google ai publicly released largescale video dataset consists million youtube video feature associated label diverse vocabulary 3700 visual entity called youtube8m dataset last year successfully hosted google cloud youtube8m video understanding challenge 742 participating team 946 individual competitor 60 country competition second kaggle competition based youtube 8m dataset focused learning video representation budget constraint lot video task large number class like recommending new video automatic video classification compact model need meet memory computational requirement true even working cloud computational environment also compact model make possible limitedmemory catalog index device order personalized privacypreserving computation user personal mobile phone competition youre challenged produce compact video classification model model size must exceed 1 gb strictly enforced model upload encourage participant train model efficiently us budget rather ensemble lot model competition hosted google ai previously known google research part european conference computer vision eccv 2018 selected workshop session please refer youtube 8m largescale video understanding workshop page detail workshop", "tags_descriptive": ["Deep Learning (DL)", "Long short-term memory (LSTM)"]}