{"title": "Cornell Birdcall Identification", "description": "Build tools for bird population monitoringDo you hear the birds chirping outside your window? Over 10,000 bird species occur in the world, and they can be found in nearly every environment, from untouched rainforests to suburbs and even cities. Birds play an essential role in nature. They are high up in the food chain and integrate changes occurring at lower levels. As such, birds are excellent indicators of deteriorating habitat quality and environmental pollution. However, it is often easier to hear birds than see them. With proper sound detection and classification, researchers could automatically intuit factors about an area’s quality of life based on a changing bird population.  There are already many projects underway to extensively monitor birds by continuously recording natural soundscapes over long periods. However, as many living and nonliving things make noise, the analysis of these datasets is often done manually by domain experts. These analyses are painstakingly slow, and results are often incomplete. Data science may be able to assist, so researchers have turned to large crowdsourced databases of focal recordings of birds to train AI models. Unfortunately, there is a domain mismatch between the training data (short recording of individual birds) and the soundscape recordings (long recordings with often multiple species calling at the same time) used in monitoring applications. This is one of the reasons why the performance of the currently used AI models has been subpar.  To unlock the full potential of these extensive and information-rich sound archives, researchers need good machine listeners to reliably extract as much information as possible to aid data-driven conservation. The Cornell Lab of Ornithology’s Center for Conservation Bioacoustics (CCB)’s mission is to collect and interpret sounds in nature. The CCB develops innovative conservation technologies to inspire and inform the conservation of wildlife and habitats globally. By partnering with the data science community, the CCB hopes to further its mission and improve the accuracy of soundscape analyses. In this competition, you will identify a wide variety of bird vocalizations in soundscape recordings. Due to the complexity of the recordings, they contain weak labels. There might be anthropogenic sounds (e.g., airplane overflights) or other bird and non-bird (e.g., chipmunk) calls in the background, with a particular labeled bird species in the foreground. Bring your new ideas to build effective detectors and classifiers for analyzing complex soundscape recordings! If successful, your work will help researchers better understand changes in habitat quality, levels of pollution, and the effectiveness of restoration efforts. Reliable machine listeners would also allow conservationists to deploy more recording units worldwide and would enable data-driven conservation at a scale not yet possible. The eventual conservation outcomes could greatly improve the quality of life for many living organisms—birds and human beings included.", "link": "https://www.kaggle.com/c/birdsong-recognition", "tags": ["Feature Engineering", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-09-16 01:59:00", "words": 455, "sentences": 22, "sum_nltk": "With proper sound detection and classification, researchers could automatically intuit factors about an area’s quality of life based on a changing bird population.\nThere are already many projects underway to extensively monitor birds by continuously recording natural soundscapes over long periods.\nData science may be able to assist, so researchers have turned to large crowdsourced databases of focal recordings of birds to train AI models.\nUnfortunately, there is a domain mismatch between the training data (short recording of individual birds) and the soundscape recordings (long recordings with often multiple species calling at the same time) used in monitoring applications.\nTo unlock the full potential of these extensive and information-rich sound archives, researchers need good machine listeners to reliably extract as much information as possible to aid data-driven conservation.\nBy partnering with the data science community, the CCB hopes to further its mission and improve the accuracy of soundscape analyses.\nIf successful, your work will help researchers better understand changes in habitat quality, levels of pollution, and the effectiveness of restoration efforts.\nReliable machine listeners would also allow conservationists to deploy more recording units worldwide and would enable data-driven conservation at a scale not yet possible.", "sum_nltk_words": 188, "sum_nltk_runtime": 0.006, "sum_t5": "over 10,000 bird species occur in the world, and they can be found in nearly every environment, from untouched rainforests to suburbs and even cities. with proper sound detection and classification, researchers could automatically intuit factors about an area’s quality of life based on a changing bird population. there are already many projects underway to extensively monitor birds by continuously recording natural soundscapes over long periods. however, as many living and nonliving things make noise, the analysis of these datasets is often done manually by domain experts.", "sum_t5_words": 87, "sum_t5_runtime": 6.987, "runtime": 0.005, "nltk_category": "Utilities", "nltk_category_score": 0.4342113137245178, "nltk_category_runtime": 16.428, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.7501490712165833, "nltk_subcategory_runtime": 25.868, "category": "Utilities", "category_score": 0.4342113137245178, "subcategory": "Quality", "subcategory_score": 0.7501490712165833, "runtime_cat": 42.297, "engagement_score": "0.662", "language_code": "en", "language": "english", "language_score": "0.9999962810132974", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "build tool bird population monitoringdo hear bird chirping outside window 10000 bird specie occur world found nearly every environment untouched rainforest suburb even city bird play essential role nature high food chain integrate change occurring lower level bird excellent indicator deteriorating habitat quality environmental pollution however often easier hear bird see proper sound detection classification researcher could automatically intuit factor area quality life based changing bird population already many project underway extensively monitor bird continuously recording natural soundscapes long period however many living nonliving thing make noise analysis datasets often done manually domain expert analysis painstakingly slow result often incomplete data science may able assist researcher turned large crowdsourced database focal recording bird train ai model unfortunately domain mismatch training data short recording individual bird soundscape recording long recording often multiple specie calling time used monitoring application one reason performance currently used ai model subpar unlock full potential extensive informationrich sound archive researcher need good machine listener reliably extract much information possible aid datadriven conservation cornell lab ornithology center conservation bioacoustics ccbs mission collect interpret sound nature ccb develops innovative conservation technology inspire inform conservation wildlife habitat globally partnering data science community ccb hope mission improve accuracy soundscape analysis competition identify wide variety bird vocalization soundscape recording due complexity recording contain weak label might anthropogenic sound eg airplane overflight bird nonbird eg chipmunk call background particular labeled bird specie foreground bring new idea build effective detector classifier analyzing complex soundscape recording successful work help researcher better understand change habitat quality level pollution effectiveness restoration effort reliable machine listener would also allow conservationist deploy recording unit worldwide would enable datadriven conservation scale yet possible eventual conservation outcome could greatly improve quality life many living organismsbirds human being included", "tags_descriptive": ["Feature Engineering", "Exploratory Data Analysis"]}