{"title": "2019 Data Science Bowl", "description": "Uncover the factors to help measure how young children learnIlluminate Learning. Ignite Possibilities. Uncover new insights in early childhood education and how media can support learning outcomes. Participate in our fifth annual Data Science Bowl, presented by Booz Allen Hamilton and Kaggle. PBS KIDS, a trusted name in early childhood education for decades, aims to gain insights into how media can help children learn important skills for success in school and life.  In this challenge, you’ll use anonymous gameplay data, including knowledge of videos watched and games played, from the PBS KIDS Measure Up! app, a game-based learning tool developed as a part of the CPB-PBS Ready To Learn Initiative with funding from the U.S. Department of Education. Competitors will be challenged to predict scores on in-game assessments and create an algorithm that will lead to better-designed games and improved learning outcomes. Your solutions will aid in discovering important relationships between engagement with high-quality educational media and learning processes. Data Science Bowl is the world’s largest data science competition focused on social good. Each year, this competition gives Kagglers a chance to use their passion to change the world. Over the last four years, more than 50,000+ Kagglers have submitted over 114,000+ submissions, to improve everything from lung cancer and heart disease detection to ocean health.  For more information on the Data Science Bowl, please visit DataScienceBowl.com Where does the data for the competition come from? The data used in this competition is anonymous, tabular data of interactions with the PBS KIDS Measure Up! app. Select data, such as a user’s in-app assessment score or their path through the game, is collected by the PBS KIDS Measure Up! app, a game-based learning tool.  PBS KIDS is committed to creating a safe and secure environment that family members of all ages can enjoy. The PBS KIDS Measure Up! app does not collect any personally identifying information, such as name or location. All of the data used in the competition is anonymous. To view the full PBS KIDS privacy policy, please visit: pbskids.org/privacy. No one will be able to download the entire data set and the participants do not have access to any personally identifiable information about individual users. The Data Science Bowl and the use of data for this year’s competition has been reviewed to ensure that it meets requirements of applicable child privacy regulations by PRIVO, a leading global industry expert in children’s online privacy. What is the PBS KIDS Measure Up! app? In the PBS KIDS Measure Up! app, children ages 3 to 5 learn early STEM concepts focused on length, width, capacity, and weight while going on an adventure through Treetop City, Magma Peak, and Crystal Caves. Joined by their favorite PBS KIDS characters, children can also collect rewards and unlock digital toys as they play. To learn more about PBS KIDS Measure Up!, please click here. PBS KIDS and the PBS KIDS Logo are registered trademarks of PBS. Used with permission. The contents of PBS KIDS Measure Up! were developed under a grant from the Department of Education. However, those contents do not necessarily represent the policy of the Department of Education, and you should not assume endorsement by the Federal Government. The app is funded by a Ready To Learn grant (PR/AWARD No. U295A150003, CFDA No. 84.295A) provided by the Department of Education to the Corporation for Public Broadcasting.", "link": "https://www.kaggle.com/c/data-science-bowl-2019", "tags": ["Classification", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-01-23 00:59:00", "words": 566, "sentences": 30, "sum_nltk": "Uncover new insights in early childhood education and how media can support learning outcomes.\nPBS KIDS, a trusted name in early childhood education for decades, aims to gain insights into how media can help children learn important skills for success in school and life.\nIn this challenge, you’ll use anonymous gameplay data, including knowledge of videos watched and games played, from the PBS KIDS Measure Up!\napp, a game-based learning tool developed as a part of the CPB-PBS Ready To Learn Initiative with funding from the U.S. Department of Education.\nFor more information on the Data Science Bowl, please visit DataScienceBowl.com Where does the data for the competition come from?\nThe data used in this competition is anonymous, tabular data of interactions with the PBS KIDS Measure Up!\nSelect data, such as a user’s in-app assessment score or their path through the game, is collected by the PBS KIDS Measure Up!\napp, a game-based learning tool.\nTo learn more about PBS KIDS Measure Up!, please click here.\nThe contents of PBS KIDS Measure Up!\nThe app is funded by a Ready To Learn grant (PR/AWARD No. U295A150003, CFDA No. 84.295A) provided by the Department of Education to the Corporation for Public Broadcasting.", "sum_nltk_words": 192, "sum_nltk_runtime": 0.007, "sum_t5": "participants will use anonymous gameplay data from the PBS KIDS Measure Up! app. the data used in this competition is anonymous, tabular data of interactions with the game-based learning tool. participants will be challenged to predict scores on in-game assessments and create an algorithm that will lead to better-designed games and improved learning outcomes. the data used in this competition is anonymous and will not be able to be downloaded. the data is collected by the PBS KIDS Measure Up! app.", "sum_t5_words": 81, "sum_t5_runtime": 6.666, "runtime": 0.004, "nltk_category": "Education & Research", "nltk_category_score": 0.7891719937324524, "nltk_category_runtime": 19.331, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.7884122133255005, "nltk_subcategory_runtime": 30.804, "category": "Education & Research", "category_score": 0.7891719937324524, "subcategory": "Student", "subcategory_score": 0.7884122133255005, "runtime_cat": 50.138, "engagement_score": "0.706", "language_code": "en", "language": "english", "language_score": "0.9999972812802675", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "uncover factor help measure young child learnilluminate learning ignite possibility uncover new insight early childhood education medium support learning outcome participate fifth annual data science bowl presented booz allen hamilton kaggle pb kid trusted name early childhood education decade aim gain insight medium help child learn important skill success school life challenge youll use anonymous gameplay data including knowledge video watched game played pb kid measure app gamebased learning tool developed part cpbpbs ready learn initiative funding u department education competitor challenged predict score ingame assessment create algorithm lead betterdesigned game improved learning outcome solution aid discovering important relationship engagement highquality educational medium learning process data science bowl world largest data science competition focused social good year competition give kagglers chance use passion change world last four year 50000 kagglers submitted 114000 submission improve everything lung cancer heart disease detection ocean health information data science bowl please visit datasciencebowlcom data competition come data used competition anonymous tabular data interaction pb kid measure app select data user inapp assessment score path game collected pb kid measure app gamebased learning tool pb kid committed creating safe secure environment family member age enjoy pb kid measure app collect personally identifying information name location data used competition anonymous view full pb kid privacy policy please visit pbskidsorgprivacy one able download entire data set participant access personally identifiable information individual user data science bowl use data year competition reviewed ensure meet requirement applicable child privacy regulation privo leading global industry expert childrens online privacy pb kid measure app pb kid measure app child age 3 5 learn early stem concept focused length width capacity weight going adventure treetop city magma peak crystal cave joined favorite pb kid character child also collect reward unlock digital toy play learn pb kid measure please click pb kid pb kid logo registered trademark pb used permission content pb kid measure developed grant department education however content necessarily represent policy department education assume endorsement federal government app funded ready learn grant praward u295a150003 cfda 84295a provided department education corporation public broadcasting", "tags_descriptive": ["Classification", "Feature Engineering", "Exploratory Data Analysis", "Gradient Boosting"]}