{"title": "Bag of Words Meets Bags of Popcorn", "description": "Use Google's Word2Vec for movie reviewsIn this tutorial competition, we dig a little \"deeper\" into sentiment analysis. Google's Word2Vec is a deep-learning inspired method that focuses on the meaning of words. Word2Vec attempts to understand meaning and semantic relationships among words. It works in a way that is similar to deep approaches, such as recurrent neural nets or deep neural nets, but is computationally more efficient. This tutorial focuses on Word2Vec for sentiment analysis. Sentiment analysis is a challenging subject in machine learning. People express their emotions in language that is often obscured by sarcasm, ambiguity, and plays on words, all of which could be very misleading for both humans and computers. There's another Kaggle competition for movie review sentiment analysis. In this tutorial we explore how Word2Vec can be applied to a similar problem. Deep learning has been in the news a lot over the past few years, even making it to the front page of the New York Times. These machine learning techniques, inspired by the architecture of the human brain and made possible by recent advances in computing power, have been making waves via breakthrough results in image recognition, speech processing, and natural language tasks. Recently, deep learning approaches won several Kaggle competitions, including a drug discovery task, and cat and dog image recognition. Tutorial Overview This tutorial will help you get started with Word2Vec for natural language processing. It has two goals:  Basic Natural Language Processing: Part 1 of this tutorial is intended for beginners and covers basic natural language processing techniques, which are needed for later parts of the tutorial. Deep Learning for Text Understanding: In Parts 2 and 3, we delve into how to train a model using Word2Vec and how to use the resulting word vectors for sentiment analysis. Since deep learning is a rapidly evolving field, large amounts of the work has not yet been published, or exists only as academic papers. Part 3 of the tutorial is more exploratory than prescriptive -- we experiment with several ways of using Word2Vec rather than giving you a recipe for using the output. To achieve these goals, we rely on an IMDB sentiment analysis data set, which has 100,000 multi-paragraph movie reviews, both positive and negative.  Acknowledgements This dataset was collected in association with the following publication: Andrew L. Maas, Raymond E. Daly, Peter T. Pham, Dan Huang, Andrew Y. Ng, and Christopher Potts. (2011). \"Learning Word Vectors for Sentiment Analysis.\" The 49th Annual Meeting of the Association for Computational Linguistics (ACL 2011). (link) Please email the author of that paper if you use the data for any research applications. The tutorial was developed by Angela Chapman during her summer 2014 internship at Kaggle.", "link": "https://www.kaggle.com/c/word2vec-nlp-tutorial", "tags": ["NLP", "DL", "Classification"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2015-07-01 01:59:00", "words": 430, "sentences": 26, "sum_nltk": "Use Google's Word2Vec for movie reviewsIn this tutorial competition, we dig a little \"deeper\" into sentiment analysis.\nGoogle's Word2Vec is a deep-learning inspired method that focuses on the meaning of words.\nThis tutorial focuses on Word2Vec for sentiment analysis.\nSentiment analysis is a challenging subject in machine learning.\nThere's another Kaggle competition for movie review sentiment analysis.\nThese machine learning techniques, inspired by the architecture of the human brain and made possible by recent advances in computing power, have been making waves via breakthrough results in image recognition, speech processing, and natural language tasks.\nRecently, deep learning approaches won several Kaggle competitions, including a drug discovery task, and cat and dog image recognition.\nTutorial Overview This tutorial will help you get started with Word2Vec for natural language processing.\nDeep Learning for Text Understanding: In Parts 2 and 3, we delve into how to train a model using Word2Vec and how to use the resulting word vectors for sentiment analysis.\nTo achieve these goals, we rely on an IMDB sentiment analysis data set, which has 100,000 multi-paragraph movie reviews, both positive and negative.\n\"Learning Word Vectors for Sentiment Analysis.\" The 49th Annual Meeting of the Association for Computational Linguistics (ACL 2011).", "sum_nltk_words": 178, "sum_nltk_runtime": 0.006, "sum_t5": "this tutorial focuses on Word2Vec for sentiment analysis. it's a deep-learning inspired method that focuses on the meaning of words. it's also used in a Kaggle competition for movie review sentiment analysis. the tutorial is intended for beginners and covers basic natural language processing techniques. a san francisco-based company is developing a software to analyze movie reviews. a san francisco-based company is developing a software to analyze movie reviews.", "sum_t5_words": 69, "sum_t5_runtime": 7.008, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.1809944212436676, "nltk_category_runtime": 19.82, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.7035300731658936, "nltk_subcategory_runtime": 32.34, "category": "Education & Research", "category_score": 0.1809944212436676, "subcategory": "Machine Learning", "subcategory_score": 0.7035300731658936, "runtime_cat": 52.161, "engagement_score": "0.615", "language_code": "en", "language": "english", "language_score": "0.9999959019456872", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "use google word2vec movie reviewsin tutorial competition dig little deeper sentiment analysis google word2vec deeplearning inspired method focus meaning word word2vec attempt understand meaning semantic relationship among word work way similar deep approach recurrent neural net deep neural net computationally efficient tutorial focus word2vec sentiment analysis sentiment analysis challenging subject machine learning people express emotion language often obscured sarcasm ambiguity play word could misleading human computer there another kaggle competition movie review sentiment analysis tutorial explore word2vec applied similar problem deep learning news lot past year even making front page new york time machine learning technique inspired architecture human brain made possible recent advance computing power making wave via breakthrough result image recognition speech processing natural language task recently deep learning approach several kaggle competition including drug discovery task cat dog image recognition tutorial overview tutorial help get started word2vec natural language processing two goal basic natural language processing part 1 tutorial intended beginner cover basic natural language processing technique needed later part tutorial deep learning text understanding part 2 3 delve train model using word2vec use resulting word vector sentiment analysis since deep learning rapidly evolving field large amount work yet published exists academic paper part 3 tutorial exploratory prescriptive experiment several way using word2vec rather giving recipe using output achieve goal rely imdb sentiment analysis data set 100000 multiparagraph movie review positive negative acknowledgement dataset collected association following publication andrew l maas raymond e daly peter pham dan huang andrew ng christopher potts 2011 learning word vector sentiment analysis 49th annual meeting association computational linguistics acl 2011 link please email author paper use data research application tutorial developed angela chapman summer 2014 internship kaggle", "tags_descriptive": ["Natural Language Processing (NLP)", "Deep Learning (DL)", "Classification"]}