{"title": "Traveling Santa 2018 - Prime Paths", "description": "But does your code recall, the most efficient route of all?Rudolph the red-nosed reindeer Had some very tired hooves But he had a job to finish Could he do it with the shortest moves? All of the other reindeer Used to laugh and mock his code They always said poor Rudolph Couldn't handle the workload Then one foggy Christmas Eve Santa came to say I see you've taken number theory Please make this night a bit less dreary? Then how the reindeer loved him and each enrolled in an AI degree Rudolph the red-nosed reindeer We get to go to bed early! Rudolph has always believed in working smarter, not harder. And what better way to earn the respect of Comet and Blitzen than showing the initiative to improve Santa's annual route for delivering toys on Christmas Eve? This year,  Rudolph believes he can motivate the overworked Reindeer team by wisely choosing the order in which they visit the houses on Santa's list. The houses in prime cities always leave carrots for the Reindeers alongside the usual cookies and milk. These carrots are just the sustenance the Reindeers need to keep pace. In fact, Rudolph has found that if the Reindeer team doesn't originate from a prime city exactly every 10th step, it takes the 10% longer than it normally would to make their next destination! Can you help Rudolph solve the Traveling Santa problem subject to his carrot constraint? His team--and Santa--are counting on you! Attributions: Reindeer Photo: Norman Tsui Stocking Photo:  Wesley Tingey", "link": "https://www.kaggle.com/c/traveling-santa-2018-prime-paths", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-01-11 00:59:00", "words": 256, "sentences": 5, "sum_nltk": "But does your code recall, the most efficient route of all?Rudolph the red-nosed reindeer Had some very tired hooves But he had a job to finish Could he do it with the shortest moves?\nAll of the other reindeer Used to laugh and mock his code They always said poor Rudolph Couldn't handle the workload Then one foggy Christmas Eve Santa came to say I see you've taken number theory Please make this night a bit less dreary?\nThen how the reindeer loved him and each enrolled in an AI degree Rudolph the red-nosed reindeer We get to go to bed early!\nThis year,  Rudolph believes he can motivate the overworked Reindeer team by wisely choosing the order in which they visit the houses on Santa's list.\nThe houses in prime cities always leave carrots for the Reindeers alongside the usual cookies and milk.\nThese carrots are just the sustenance the Reindeers need to keep pace.\nIn fact, Rudolph has found that if the Reindeer team doesn't originate from a prime city exactly every 10th step, it takes the 10% longer than it normally would to make their next destination!\nCan you help Rudolph solve the Traveling Santa problem subject to his carrot constraint?", "sum_nltk_words": 198, "sum_nltk_runtime": 0.003, "sum_t5": "a red-nosed reindeer can motivate his team by choosing the order in which they visit the houses on Santa's list. the houses in prime cities always leave carrots for the reindeers alongside the usual cookies and milk. can you help Rudolph solve the Traveling Santa problem subject to his carrot constraint? he's counting on you!. if you can help him solve the Traveling Santa problem, he'll be rewarded with a 'no-no'", "sum_t5_words": 71, "sum_t5_runtime": 6.289, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.5314736366271973, "nltk_category_runtime": 17.908, "nltk_subcategory": "Transportation", "nltk_subcategory_score": 0.9237403869628906, "nltk_subcategory_runtime": 28.433, "category": "Education & Research", "category_score": 0.5314736366271973, "subcategory": "Transportation", "subcategory_score": 0.9237403869628906, "runtime_cat": 46.341, "engagement_score": "0.677", "language_code": "en", "language": "english", "language_score": "0.9999969467200848", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "code recall efficient route allrudolph rednosed reindeer tired hoof job finish could shortest move reindeer used laugh mock code always said poor rudolph couldnt handle workload one foggy christmas eve santa came say see youve taken number theory please make night bit le dreary reindeer loved enrolled ai degree rudolph rednosed reindeer get go bed early rudolph always believed working smarter harder better way earn respect comet blitzen showing initiative improve santa annual route delivering toy christmas eve year rudolph belief motivate overworked reindeer team wisely choosing order visit house santa list house prime city always leave carrot reindeer alongside usual cooky milk carrot sustenance reindeer need keep pace fact rudolph found reindeer team doesnt originate prime city exactly every 10th step take 10 longer normally would make next destination help rudolph solve traveling santa problem subject carrot constraint teamand santaare counting attribution reindeer photo norman tsui stocking photo wesley tingey", "tags_descriptive": []}