{"title": "March Machine Learning Mania 2017", "description": "Predict the 2017 NCAA Basketball TournamentAnother year, another chance to predict the upsets, call the probabilities, and put your bracketology skills to the leaderboard test. In our fourth annual March Machine Learning Mania competition, Kagglers will once again join the millions of fans who attempt to predict the outcomes of this year's US men's college basketball tournament. But unlike most fans, you will pick the winners and losers using a combination of rich historical data and computing power, while the ground truth unfolds on national television.  In the first stage of the competition, Kagglers will rely on results of past tournaments to build and test models. We encourage you to post any useful external data as a dataset. In the second stage, competitors will forecast outcomes of all possible match-ups in the 2017 tournament. You don't need to participate in the first stage to enter the second. The first stage exists to incentivize model building and provide a means to score predictions. The real competition is forecasting the 2017 results.", "link": "https://www.kaggle.com/c/march-machine-learning-mania-2017", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-04-04 17:00:00", "words": 171, "sentences": 9, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.4059716761112213, "description_category_runtime": 14.039, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9679073691368103, "description_subcategory_runtime": 22.692, "category": "Utilities", "category_score": 0.4059716761112213, "subcategory": "Machine Learning", "subcategory_score": 0.9679073691368103, "runtime_cat": 36.731, "engagement_score": "0.599", "language_code": "en", "language": "english", "language_score": "0.9999970127816062", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict 2017 ncaa basketball tournamentanother year another chance predict upset call probability put bracketology skill leaderboard test fourth annual march machine learning mania competition kagglers join million fan attempt predict outcome year u men college basketball tournament unlike fan pick winner loser using combination rich historical data computing power ground truth unfolds national television first stage competition kagglers rely result past tournament build test model encourage post useful external data dataset second stage competitor forecast outcome possible matchup 2017 tournament dont need participate first stage enter second first stage exists incentivize model building provide mean score prediction real competition forecasting 2017 result", "tags_descriptive": []}