{"title": "Outbrain Click Prediction", "description": "Can you predict which recommended content each user will click?The internet is a stimulating treasure trove of possibility. Every day we stumble on news stories relevant to our communities or experience the serendipity of finding an article covering our next travel destination. Outbrain, the web’s leading content discovery platform, delivers these moments while we surf our favorite sites.  Currently, Outbrain pairs relevant content with curious readers in about 250 billion personalized recommendations every month across many thousands of sites. In this competition, Kagglers are challenged to predict which pieces of content its global base of users are likely to click on. Improving Outbrain’s recommendation algorithm will mean more users uncover stories that satisfy their individual tastes.", "link": "https://www.kaggle.com/c/outbrain-click-prediction", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-01-19 00:59:00", "words": 117, "sentences": 6, "runtime": 0.0, "description_category": "Accommodation & Food", "description_category_score": 0.46976107358932495, "description_category_runtime": 10.512, "description_subcategory": "Tourism", "description_subcategory_score": 0.5991644859313965, "description_subcategory_runtime": 15.952, "category": "Accommodation & Food", "category_score": 0.46976107358932495, "subcategory": "Tourism", "subcategory_score": 0.5991644859313965, "runtime_cat": 26.464, "engagement_score": "0.644", "language_code": "en", "language": "english", "language_score": "0.9999980777116071", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict recommended content user clickthe internet stimulating treasure trove possibility every day stumble news story relevant community experience serendipity finding article covering next travel destination outbrain web leading content discovery platform delivers moment surf favorite site currently outbrain pair relevant content curious reader 250 billion personalized recommendation every month across many thousand site competition kagglers challenged predict piece content global base user likely click improving outbrains recommendation algorithm mean user uncover story satisfy individual taste", "tags_descriptive": ["Exploratory Data Analysis"]}