{"title": "Prostate cANcer graDe Assessment (PANDA) Challenge", "description": "Prostate cancer diagnosis using the Gleason grading systemWith more than 1 million new diagnoses reported every year, prostate cancer (PCa) is the second most common cancer among males worldwide that results in more than 350,000 deaths annually. The key to decreasing mortality is developing more precise diagnostics. Diagnosis of PCa is based on the grading of prostate tissue biopsies. These tissue samples are examined by a pathologist and scored according to the Gleason grading system. In this challenge, you will develop models for detecting PCa on images of prostate tissue samples, and estimate severity of the disease using the most extensive multi-center dataset on Gleason grading yet available. The grading process consists of finding and classifying cancer tissue into so-called Gleason patterns (3, 4, or 5) based on the architectural growth patterns of the tumor (Fig. 1). After the biopsy is assigned a Gleason score, it is converted into an ISUP grade on a 1-5 scale. The Gleason grading system is the most important prognostic marker for PCa, and the ISUP grade has a crucial role when deciding how a patient should be treated. There is both a risk of missing cancers and a large risk of overgrading resulting in unnecessary treatment. However, the system suffers from significant inter-observer variability between pathologists, limiting its usefulness for individual patients. This variability in ratings could lead to unnecessary treatment, or worse, missing a severe diagnosis.  Automated deep learning systems have shown some promise in accurately grading PCa. Recent research, including two studies independently conducted by the groups hosting this challenge, have shown that these systems can achieve pathologist-level performance. However, these systems/results were not tested with multi-center datasets at scale.     Your work here will improve on these efforts using the most extensive multi-center dataset on Gleason grading yet. The training set consists of around 11,000 whole-slide images of digitized H&E-stained biopsies originating from two centers. This is the largest public whole-slide image dataset available, roughly 8 times the size of the CAMELYON17 challenge, one of the largest digital pathology datasets and best known challenges in the field. Furthermore, in contrast to previous challenges, we are making full diagnostic biopsy images available. Using a sizable multi-center test set, graded by expert uro-pathologists, we will evaluate challenge submissions on their applicability to improve this critical diagnostic function.   Figure 1: An illustration of the Gleason grading process for an example biopsy containing prostate cancer. The most common (blue outline, Gleason pattern 3) and second most common (red outline, Gleason pattern 4) cancer growth patterns present in the biopsy dictate the Gleason score (3+4 for this biopsy), which in turn is converted into an ISUP grade (2 for this biopsy) following guidelines of the International Society of Urological Pathology. Biopsies not containing cancer are represented by an ISUP grade of 0 in this challenge. Radboud University Medical Center and Karolinska Institute have teamed up to organize this competition in collaboration with colleagues from Tampere University. The Computational Pathology Group (CPG) of the Radboud University Medical Center is a research group that develops computer algorithms to aid clinicians. Karolinska Institute’s Department of Medical Epidemiology and Biostatistics (MEB) includes an interdisciplinary research group to improve the diagnostics and treatment of prostate cancer. Together, they hope to further their existing research to make a significant impact on the healthcare of prostate cancer patients. Challenge organizer team: Wouter Bulten, Geert Litjens, Hans Pinckaers, Peter Ström, Martin Eklund, Lars Egevad, Henrik Grönberg, Kimmo Kartasalo, Pekka Ruusuvuori, Tomi Häkkinen, Sohier Dane, Maggie Demkin.  Sponsors The PANDA workshop at MICCAI 2020 is sponsored by ContextVision, Ibex and Google.     Using the data outside of the competition Interested in using the PANDA dataset outside of the competition? Please read this forum post for the latest information on the embargo and the challenge paper.", "link": "https://www.kaggle.com/c/prostate-cancer-grade-assessment", "tags": ["Exploratory Data Analysis", "CV"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-07-23 01:59:00", "words": 640, "sentences": 30, "sum_nltk": "Diagnosis of PCa is based on the grading of prostate tissue biopsies.\nIn this challenge, you will develop models for detecting PCa on images of prostate tissue samples, and estimate severity of the disease using the most extensive multi-center dataset on Gleason grading yet available.\nThe grading process consists of finding and classifying cancer tissue into so-called Gleason patterns (3, 4, or 5) based on the architectural growth patterns of the tumor (Fig. 1).\nAfter the biopsy is assigned a Gleason score, it is converted into an ISUP grade on a 1-5 scale.\nHowever, these systems/results were not tested with multi-center datasets at scale.\nYour work here will improve on these efforts using the most extensive multi-center dataset on Gleason grading yet.\nFurthermore, in contrast to previous challenges, we are making full diagnostic biopsy images available.\nUsing a sizable multi-center test set, graded by expert uro-pathologists, we will evaluate challenge submissions on their applicability to improve this critical diagnostic function.\nFigure 1: An illustration of the Gleason grading process for an example biopsy containing prostate cancer.\nBiopsies not containing cancer are represented by an ISUP grade of 0 in this challenge.\nKarolinska Institute’s Department of Medical Epidemiology and Biostatistics (MEB) includes an interdisciplinary research group to improve the diagnostics and treatment of prostate cancer.", "sum_nltk_words": 204, "sum_nltk_runtime": 0.008, "sum_t5": "a challenge will help you develop models for detecting prostate cancer on images of prostate tissue. the grading system is the most important prognostic marker for PCa. the training set consists of around 11,000 whole-slide images of digitized biopsies. the training set consists of around 11,000 whole-slide images. the training set consists of around 11,000 whole-slide images. a total of 67,016 whole-slide images", "sum_t5_words": 63, "sum_t5_runtime": 7.019, "runtime": 0.008, "nltk_category": "Healthcare", "nltk_category_score": 0.48970460891723633, "nltk_category_runtime": 20.645, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.6085337400436401, "nltk_subcategory_runtime": 33.091, "category": "Healthcare", "category_score": 0.48970460891723633, "subcategory": "Physical", "subcategory_score": 0.6085337400436401, "runtime_cat": 53.735, "engagement_score": "0.646", "language_code": "en", "language": "english", "language_score": "0.9999946961654156", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "prostate cancer diagnosis using gleason grading systemwith 1 million new diagnosis reported every year prostate cancer pca second common cancer among male worldwide result 350000 death annually key decreasing mortality developing precise diagnostics diagnosis pca based grading prostate tissue biopsy tissue sample examined pathologist scored according gleason grading system challenge develop model detecting pca image prostate tissue sample estimate severity disease using extensive multicenter dataset gleason grading yet available grading process consists finding classifying cancer tissue socalled gleason pattern 3 4 5 based architectural growth pattern tumor fig 1 biopsy assigned gleason score converted isup grade 15 scale gleason grading system important prognostic marker pca isup grade crucial role deciding patient treated risk missing cancer large risk overgrading resulting unnecessary treatment however system suffers significant interobserver variability pathologist limiting usefulness individual patient variability rating could lead unnecessary treatment worse missing severe diagnosis automated deep learning system shown promise accurately grading pca recent research including two study independently conducted group hosting challenge shown system achieve pathologistlevel performance however systemsresults tested multicenter datasets scale work improve effort using extensive multicenter dataset gleason grading yet training set consists around 11000 wholeslide image digitized hestained biopsy originating two center largest public wholeslide image dataset available roughly 8 time size camelyon17 challenge one largest digital pathology datasets best known challenge field furthermore contrast previous challenge making full diagnostic biopsy image available using sizable multicenter test set graded expert uropathologists evaluate challenge submission applicability improve critical diagnostic function figure 1 illustration gleason grading process example biopsy containing prostate cancer common blue outline gleason pattern 3 second common red outline gleason pattern 4 cancer growth pattern present biopsy dictate gleason score 34 biopsy turn converted isup grade 2 biopsy following guideline international society urological pathology biopsy containing cancer represented isup grade 0 challenge radboud university medical center karolinska institute teamed organize competition collaboration colleague tampere university computational pathology group cpg radboud university medical center research group develops computer algorithm aid clinician karolinska institute department medical epidemiology biostatistics meb includes interdisciplinary research group improve diagnostics treatment prostate cancer together hope existing research make significant impact healthcare prostate cancer patient challenge organizer team wouter bulten geert litjens han pinckaers peter strom martin eklund lars egevad henrik gronberg kimmo kartasalo pekka ruusuvuori tomi hakkinen sohier dane maggie demkin sponsor panda workshop miccai 2020 sponsored contextvision ibex google using data outside competition interested using panda dataset outside competition please read forum post latest information embargo challenge paper", "tags_descriptive": ["Exploratory Data Analysis", "Computer Vision (CV)"]}