{"title": "Peking University/Baidu - Autonomous Driving", "description": "Can you predict vehicle angle in different settings?Who do you think hates traffic more - humans or self-driving cars? The position of nearby automobiles is a key question for autonomous vehicles ― and it's at the heart of our newest challenge.  Self-driving cars have come a long way in recent years, but they're still not flawless. Consumers and lawmakers remain wary of adoption, in part because of doubts about vehicles’ ability to accurately perceive objects in traffic. Baidu's Robotics and Autonomous Driving Lab (RAL), along with Peking University, hopes to close the gap once and for all with this challenge. They’re providing Kagglers with more than 60,000 labeled 3D car instances from 5,277 real-world images, based on industry-grade CAD car models. Your challenge: develop an algorithm to estimate the absolute pose of vehicles (6 degrees of freedom) from a single image in a real-world traffic environment. Succeed and you'll help improve computer vision. That, in turn, will bring autonomous vehicles a big step closer to widespread adoption, so they can help reduce the environmental impact of our growing societies.  Please cite the following paper when using the dataset: ApolloCar3D: A Large 3D Car Instance Understanding Benchmark for Autonomous Driving @inproceedings{song2019apollocar3d,   title={Apollocar3d: A large 3d car instance understanding benchmark for autonomous driving},   author={Song, Xibin and Wang, Peng and Zhou, Dingfu and Zhu, Rui and Guan, Chenye and Dai, Yuchao and Su, Hao and Li, Hongdong and Yang, Ruigang},   booktitle={Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition},   pages={5452--5462},   year={2019} }", "link": "https://www.kaggle.com/c/pku-autonomous-driving", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-01-22 00:59:00", "words": 263, "sentences": 9, "sum_nltk": "Can you predict vehicle angle in different settings?Who do you think hates traffic more - humans or self-driving cars?\nThe position of nearby automobiles is a key question for autonomous vehicles ― and it's at the heart of our newest challenge.\nSelf-driving cars have come a long way in recent years, but they're still not flawless.\nConsumers and lawmakers remain wary of adoption, in part because of doubts about vehicles’ ability to accurately perceive objects in traffic.\nBaidu's Robotics and Autonomous Driving Lab (RAL), along with Peking University, hopes to close the gap once and for all with this challenge.\nThey’re providing Kagglers with more than 60,000 labeled 3D car instances from 5,277 real-world images, based on industry-grade CAD car models.\nYour challenge: develop an algorithm to estimate the absolute pose of vehicles (6 degrees of freedom) from a single image in a real-world traffic environment.\nThat, in turn, will bring autonomous vehicles a big step closer to widespread adoption, so they can help reduce the environmental impact of our growing societies.", "sum_nltk_words": 165, "sum_nltk_runtime": 0.003, "sum_t5": "a new challenge challenges self-driving cars to predict the position of nearby vehicles. the challenge is to develop an algorithm to estimate the absolute pose of vehicles. the challenge is based on 5,277 real-world images. the results will help improve computer vision. the challenge is set to be presented at the upcoming. san francisco olympics in october.. april.", "sum_t5_words": 58, "sum_t5_runtime": 6.048, "runtime": 0.002, "nltk_category": "Finance", "nltk_category_score": 0.43227651715278625, "nltk_category_runtime": 15.854, "nltk_subcategory": "Transportation", "nltk_subcategory_score": 0.7292628288269043, "nltk_subcategory_runtime": 25.223, "category": "Finance", "category_score": 0.43227651715278625, "subcategory": "Transportation", "subcategory_score": 0.7292628288269043, "runtime_cat": 41.077, "engagement_score": "0.637", "language_code": "en", "language": "english", "language_score": "0.9999982792757585", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict vehicle angle different settingswho think hate traffic human selfdriving car position nearby automobile key question autonomous vehicle heart newest challenge selfdriving car come long way recent year theyre still flawless consumer lawmaker remain wary adoption part doubt vehicle ability accurately perceive object traffic baidus robotics autonomous driving lab ral along peking university hope close gap challenge theyre providing kagglers 60000 labeled 3d car instance 5277 realworld image based industrygrade cad car model challenge develop algorithm estimate absolute pose vehicle 6 degree freedom single image realworld traffic environment succeed youll help improve computer vision turn bring autonomous vehicle big step closer widespread adoption help reduce environmental impact growing society please cite following paper using dataset apollocar3d large 3d car instance understanding benchmark autonomous driving inproceedingssong2019apollocar3d titleapollocar3d large 3d car instance understanding benchmark autonomous driving authorsong xibin wang peng zhou dingfu zhu rui guan chenye dai yuchao su hao li hongdong yang ruigang booktitleproceedings ieee conference computer vision pattern recognition pages54525462 year2019", "tags_descriptive": ["Exploratory Data Analysis"]}