{"title": "Inclusive Images Challenge", "description": "Stress test image classifiers across new geographic distributionsMaking products that work for people all over the globe is an important value at Google AI. In the field of classification, this means developing models that work well for regions all over the world.  Today, the dataset a model is trained on greatly dictates the performance of that model. A system trained on a dataset that doesn’t represent a broad range of localities could perform worse on images drawn from geographic regions underrepresented in the training data. Google and the industry at large are working to create more diverse & representative datasets. But it is also important for the field to make progress in understanding how to build models when the data available may not cover all audiences a model is meant to reach. Google AI is challenging Kagglers to develop models that are robust to blind spots that might exist in a data set, and to create image recognition systems that can perform well on test images drawn from different geographic distributions than the ones they were trained on. By finding ways to teach image classifiers to generalize to new geographic and cultural contexts, we hope the community will make even more progress in inclusive machine learning that benefits everyone, everywhere. Note: This competition is run in two stages. Refer to the FAQ for an explanation of how this works & the Timeline for specific dates.  This competition is a part of the NIPS 2018 competition track. Winners will be invited to attend and present their solutions at the workshop.     Shankar et al. \"No Classification without Representation: Assessing Geodiversity Issues in Open Data Sets for the Developing World\" NIPS 2017 Workshop on Machine Learning for the Developing World", "link": "https://www.kaggle.com/c/inclusive-images-challenge", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2018-11-13 00:59:00", "words": 293, "sentences": 14, "sum_nltk": "Stress test image classifiers across new geographic distributionsMaking products that work for people all over the globe is an important value at Google AI.\nIn the field of classification, this means developing models that work well for regions all over the world.\nA system trained on a dataset that doesn’t represent a broad range of localities could perform worse on images drawn from geographic regions underrepresented in the training data.\nGoogle and the industry at large are working to create more diverse & representative datasets.\nGoogle AI is challenging Kagglers to develop models that are robust to blind spots that might exist in a data set, and to create image recognition systems that can perform well on test images drawn from different geographic distributions than the ones they were trained on.\nBy finding ways to teach image classifiers to generalize to new geographic and cultural contexts, we hope the community will make even more progress in inclusive machine learning that benefits everyone, everywhere.\n\"No Classification without Representation: Assessing Geodiversity Issues in Open Data Sets for the Developing World\" NIPS 2017 Workshop on Machine Learning for the Developing World", "sum_nltk_words": 182, "sum_nltk_runtime": 0.003, "sum_t5": "google is challenging Kagglers to develop models that are robust to blind spots. a system trained on a dataset that doesn’t represent a broad range of localities could perform worse. a winner will be invited to attend and present their solutions at the workshop. a sankar et al. (2017): \"no classification without representation: Assessing geodiversity issues in open data sets for the Developing World\"", "sum_t5_words": 64, "sum_t5_runtime": 5.582, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.4370465576648712, "nltk_category_runtime": 15.533, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9332239031791687, "nltk_subcategory_runtime": 24.473, "category": "Utilities", "category_score": 0.4370465576648712, "subcategory": "Machine Learning", "subcategory_score": 0.9332239031791687, "runtime_cat": 40.005, "engagement_score": "0.603", "language_code": "en", "language": "english", "language_score": "0.9999985885485897", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "stress test image classifier across new geographic distributionsmaking product work people globe important value google ai field classification mean developing model work well region world today dataset model trained greatly dictate performance model system trained dataset doesnt represent broad range locality could perform worse image drawn geographic region underrepresented training data google industry large working create diverse representative datasets also important field make progress understanding build model data available may cover audience model meant reach google ai challenging kagglers develop model robust blind spot might exist data set create image recognition system perform well test image drawn different geographic distribution one trained finding way teach image classifier generalize new geographic cultural context hope community make even progress inclusive machine learning benefit everyone everywhere note competition run two stage refer faq explanation work timeline specific date competition part nip 2018 competition track winner invited attend present solution workshop shankar et al classification without representation assessing geodiversity issue open data set developing world nip 2017 workshop machine learning developing world", "tags_descriptive": []}