{"title": "Google Cloud & NCAA® ML Competition 2020-NCAAW", "description": "Apply Machine Learning to NCAA® March Madness®Update: this competition has been cancelled on account of the COVID-19 pandemic.  As a result of the continued collaboration between Google Cloud and the NCAA®, the seventh annual Kaggle-backed March Madness® competition is underway! Another year, another chance to anticipate the upsets, call the probabilities, and put your bracketology skills to the leaderboard test. Kagglers will join the millions of fans who attempt to forecast the outcomes of March Madness during this year's NCAA Division I Men’s and Women’s Basketball Championships. But unlike most fans, you will pick your bracket using a combination of NCAA’s historical data and your computing power, while the ground truth unfolds on national television.  In the first stage of the competition, Kagglers will rely on results of past tournaments to build and test models. We encourage you to post any useful external data as a dataset. In the second stage, competitors will forecast outcomes of all possible matchups in the 2020 NCAA Division I Men’s and Women’s Basketball Championships. You don't need to participate in the first stage to enter the second. The first stage exists to incentivize model building and provide a means to score predictions. The real competition is forecasting the 2020 results. As the official public cloud provider of the NCAA, Google Cloud is proud to provide a competition to help participants strengthen their knowledge of basketball, statistics, data modeling, and cloud technology. As part of its journey to the cloud, the NCAA has migrated 80+ years of historical and play-by-play data, from 90 championships and 24 sports, to Google Cloud Platform (GCP). The NCAA has tapped into decades of historical basketball data using BigQuery, Cloud Spanner, Datalab, Cloud Machine Learning and Cloud Dataflow, to power the analysis of team and player performance. The mission of the NCAA has long been about serving the needs of schools, their teams and students. Google Cloud is proud to support that mission by helping the NCAA use data and machine learning to better engage with its millions of fans, 500,000 student-athletes and more than 19,000 teams. Game on!  This page is for the NCAA Division I Women's tournament. Check out the NCAA Division I Men's tournament here. If you want to extend your analysis then try out our Analytics Competition here", "link": "https://www.kaggle.com/c/google-cloud-ncaa-march-madness-2020-division-1-womens-tournament", "tags": ["Classification", "Feature Engineering"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-03-20 16:00:00", "words": 385, "sentences": 18, "sum_nltk": "As a result of the continued collaboration between Google Cloud and the NCAA®, the seventh annual Kaggle-backed March Madness® competition is underway!\nKagglers will join the millions of fans who attempt to forecast the outcomes of March Madness during this year's NCAA Division I Men’s and Women’s Basketball Championships.\nIn the first stage of the competition, Kagglers will rely on results of past tournaments to build and test models.\nIn the second stage, competitors will forecast outcomes of all possible matchups in the 2020 NCAA Division I Men’s and Women’s Basketball Championships.\nAs the official public cloud provider of the NCAA, Google Cloud is proud to provide a competition to help participants strengthen their knowledge of basketball, statistics, data modeling, and cloud technology.\nAs part of its journey to the cloud, the NCAA has migrated 80+ years of historical and play-by-play data, from 90 championships and 24 sports, to Google Cloud Platform (GCP).\nThe NCAA has tapped into decades of historical basketball data using BigQuery, Cloud Spanner, Datalab, Cloud Machine Learning and Cloud Dataflow, to power the analysis of team and player performance.\nGoogle Cloud is proud to support that mission by helping the NCAA use data and machine learning to better engage with its millions of fans, 500,000 student-athletes and more than 19,000 teams.", "sum_nltk_words": 208, "sum_nltk_runtime": 0.005, "sum_t5": "Google Cloud is proud to support the NCAA's mission by helping it use data and machine learning to better engage with its millions of fans, 500,000 student-athletes and more than 19,000 teams. the first stage of the competition will rely on results of past tournaments to build and test models. the second stage will forecast outcomes of all possible matchups in the 2020 NCAA Division I Men's and Women's basketball championships. the competition has been cancelled due to the COVID-19 pandemic.", "sum_t5_words": 81, "sum_t5_runtime": 6.941, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.5461454391479492, "nltk_category_runtime": 19.556, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8787705898284912, "nltk_subcategory_runtime": 31.22, "category": "Utilities", "category_score": 0.5461454391479492, "subcategory": "Machine Learning", "subcategory_score": 0.8787705898284912, "runtime_cat": 50.776, "engagement_score": "0.0", "language_code": "en", "language": "english", "language_score": "0.9999962681000146", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "apply machine learning ncaa march madnessupdate competition cancelled account covid19 pandemic result continued collaboration google cloud ncaa seventh annual kagglebacked march madness competition underway another year another chance anticipate upset call probability put bracketology skill leaderboard test kagglers join million fan attempt forecast outcome march madness year ncaa division men woman basketball championship unlike fan pick bracket using combination ncaas historical data computing power ground truth unfolds national television first stage competition kagglers rely result past tournament build test model encourage post useful external data dataset second stage competitor forecast outcome possible matchup 2020 ncaa division men woman basketball championship dont need participate first stage enter second first stage exists incentivize model building provide mean score prediction real competition forecasting 2020 result official public cloud provider ncaa google cloud proud provide competition help participant strengthen knowledge basketball statistic data modeling cloud technology part journey cloud ncaa migrated 80 year historical playbyplay data 90 championship 24 sport google cloud platform gcp ncaa tapped decade historical basketball data using bigquery cloud spanner datalab cloud machine learning cloud dataflow power analysis team player performance mission ncaa long serving need school team student google cloud proud support mission helping ncaa use data machine learning better engage million fan 500000 studentathletes 19000 team game page ncaa division woman tournament check ncaa division men tournament want extend analysis try analytics competition", "tags_descriptive": ["Classification", "Feature Engineering"]}