{"title": "Don't Get Kicked!", "description": "Predict if a car purchased at auction is a lemonOne of the biggest challenges of an auto dealership purchasing a used car at an auto auction is the risk of that the vehicle might have serious issues that prevent it from being sold to customers. The auto community calls these unfortunate purchases \"kicks\". Kicked cars often result when there are tampered odometers, mechanical issues the dealer is not able to address, issues with getting the vehicle title from the seller, or some other unforeseen problem. Kick cars can be very costly to dealers after transportation cost, throw-away repair work, and market losses in reselling the vehicle. Modelers who can figure out which cars have a higher risk of being kick can provide real value to dealerships trying to provide the best inventory selection possible to their customers. The challenge of this competition is to predict if the car purchased at the Auction is a Kick (bad buy).", "link": "https://www.kaggle.com/c/DontGetKicked", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2012-01-06 00:59:59", "words": 157, "sentences": 6, "runtime": 0.002, "description_category": "Manufacturing", "description_category_score": 0.7902214527130127, "description_category_runtime": 12.864, "description_subcategory": "Preventative and Reactive", "description_subcategory_score": 0.6048036813735962, "description_subcategory_runtime": 19.663, "category": "Manufacturing", "category_score": 0.7902214527130127, "subcategory": "Preventative and Reactive", "subcategory_score": 0.6048036813735962, "runtime_cat": 32.527, "engagement_score": "0.614", "language_code": "en", "language": "english", "language_score": "0.9999958121783462", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict car purchased auction lemonone biggest challenge auto dealership purchasing used car auto auction risk vehicle might serious issue prevent sold customer auto community call unfortunate purchase kick kicked car often result tampered odometer mechanical issue dealer able address issue getting vehicle title seller unforeseen problem kick car costly dealer transportation cost throwaway repair work market loss reselling vehicle modeler figure car higher risk kick provide real value dealership trying provide best inventory selection possible customer challenge competition predict car purchased auction kick bad buy", "tags_descriptive": []}