{"title": "VSB Power Line Fault Detection", "description": "Can you detect faults in above-ground electrical lines?Medium voltage overhead power lines run for hundreds of miles to supply power to cities. These great distances make it expensive to manually inspect the lines for damage that doesn't immediately lead to a power outage, such as a tree branch hitting the line or a flaw in the insulator. These modes of damage lead to a phenomenon known as partial discharge — an electrical discharge which does not bridge the electrodes between an insulation system completely. Partial discharges slowly damage the power line, so left unrepaired they will eventually lead to a power outage or start a fire.  Your challenge is to detect partial discharge patterns in signals acquired from these power lines with a new meter designed at the ENET Centre at VŠB. Effective classifiers using this data will make it possible to continuously monitor power lines for faults. ENET Centre researches and develops renewable energy resources with the goal of reducing or eliminating harmful environmental impacts. Their efforts focus on developing technology solutions around transportation and processing of energy raw materials. By developing a solution to detect partial discharge you’ll help reduce  maintenance costs, and prevent power outages.", "link": "https://www.kaggle.com/c/vsb-power-line-fault-detection", "tags": ["DL", "Classification", "RNN", "Feature Engineering", "Exploratory Data Analysis", "CNN"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-03-22 00:59:00", "words": 200, "sentences": 9, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.6290242075920105, "description_category_runtime": 16.009, "description_subcategory": "Physical", "description_subcategory_score": 0.7310611605644226, "description_subcategory_runtime": 25.469, "category": "Utilities", "category_score": 0.6290242075920105, "subcategory": "Physical", "subcategory_score": 0.7310611605644226, "runtime_cat": 41.478, "engagement_score": "0.664", "language_code": "en", "language": "english", "language_score": "0.9999987256032321", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "detect fault aboveground electrical linesmedium voltage overhead power line run hundred mile supply power city great distance make expensive manually inspect line damage doesnt immediately lead power outage tree branch hitting line flaw insulator mode damage lead phenomenon known partial discharge electrical discharge bridge electrode insulation system completely partial discharge slowly damage power line left unrepaired eventually lead power outage start fire challenge detect partial discharge pattern signal acquired power line new meter designed enet centre vsb effective classifier using data make possible continuously monitor power line fault enet centre research develops renewable energy resource goal reducing eliminating harmful environmental impact effort focus developing technology solution around transportation processing energy raw material developing solution detect partial discharge youll help reduce maintenance cost prevent power outage", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Recurrent Neural Network (RNN)", "Feature Engineering", "Exploratory Data Analysis", "Convolutional Neural Network (CNN)"]}