{"title": "Abstraction and Reasoning Challenge", "description": "Create an AI capable of solving reasoning tasks it has never seen beforeCan a computer learn complex, abstract tasks from just a few examples? Current machine learning techniques are data-hungry and brittle—they can only make sense of patterns they've seen before. Using current methods, an algorithm can gain new skills by exposure to large amounts of data, but cognitive abilities that could broadly generalize to many tasks remain elusive. This makes it very challenging to create systems that can handle the variability and unpredictability of the real world, such as domestic robots or self-driving cars. However, alternative approaches, like inductive programming, offer the potential for more human-like abstraction and reasoning. The Abstraction and Reasoning Corpus (ARC) provides a benchmark to measure AI skill-acquisition on unknown tasks, with the constraint that only a handful of demonstrations are shown to learn a complex task. It provides a glimpse of a future where AI could quickly learn to solve new problems on its own. The Kaggle Abstraction and Reasoning Challenge invites you to try your hand at bringing this future into the present! This competition is hosted by François Chollet, creator of the Keras neural networks library. Chollet’s paper on measuring intelligence provides the context and motivation behind the ARC benchmark. In this competition, you’ll create an AI that can solve reasoning tasks it has never seen before. Each ARC task contains 3-5 pairs of train inputs and outputs, and a test input for which you need to predict the corresponding output with the pattern learned from the train examples. If successful, you’ll help bring computers closer to human cognition and you'll open the door to completely new AI applications!", "link": "https://www.kaggle.com/c/abstraction-and-reasoning-challenge", "tags": ["Feature Engineering", "Exploratory Data Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-05-28 01:59:00", "words": 277, "sentences": 11, "sum_nltk": "Create an AI capable of solving reasoning tasks it has never seen beforeCan a computer learn complex, abstract tasks from just a few examples?\nCurrent machine learning techniques are data-hungry and brittle—they can only make sense of patterns they've seen before.\nUsing current methods, an algorithm can gain new skills by exposure to large amounts of data, but cognitive abilities that could broadly generalize to many tasks remain elusive.\nThe Abstraction and Reasoning Corpus (ARC) provides a benchmark to measure AI skill-acquisition on unknown tasks, with the constraint that only a handful of demonstrations are shown to learn a complex task.\nIt provides a glimpse of a future where AI could quickly learn to solve new problems on its own.\nThe Kaggle Abstraction and Reasoning Challenge invites you to try your hand at bringing this future into the present!\nIn this competition, you’ll create an AI that can solve reasoning tasks it has never seen before.\nEach ARC task contains 3-5 pairs of train inputs and outputs, and a test input for which you need to predict the corresponding output with the pattern learned from the train examples.\nIf successful, you’ll help bring computers closer to human cognition and you'll open the door to completely new AI applications!", "sum_nltk_words": 200, "sum_nltk_runtime": 0.003, "sum_t5": "the Abstraction and Reasoning Corpus (ARC) provides a benchmark to measure AI skill-acquisition on unknown tasks. only a handful of demonstrations are shown to learn a complex task. the competition invites you to create an AI that can solve reasoning tasks it has never seen before. if successful, you'll help bring computers closer to human cognition. the competition is hosted by François Chollet, creator of the Keras neural networks library.", "sum_t5_words": 70, "sum_t5_runtime": 5.96, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.539558470249176, "nltk_category_runtime": 17.937, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6669201850891113, "nltk_subcategory_runtime": 28.386, "category": "Utilities", "category_score": 0.539558470249176, "subcategory": "Machine Learning", "subcategory_score": 0.6669201850891113, "runtime_cat": 46.323, "engagement_score": "0.64", "language_code": "en", "language": "english", "language_score": "0.9999974930044622", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "create ai capable solving reasoning task never seen beforecan computer learn complex abstract task example current machine learning technique datahungry brittlethey make sense pattern theyve seen using current method algorithm gain new skill exposure large amount data cognitive ability could broadly generalize many task remain elusive make challenging create system handle variability unpredictability real world domestic robot selfdriving car however alternative approach like inductive programming offer potential humanlike abstraction reasoning abstraction reasoning corpus arc provides benchmark measure ai skillacquisition unknown task constraint handful demonstration shown learn complex task provides glimpse future ai could quickly learn solve new problem kaggle abstraction reasoning challenge invite try hand bringing future present competition hosted francois chollet creator kera neural network library chollets paper measuring intelligence provides context motivation behind arc benchmark competition youll create ai solve reasoning task never seen arc task contains 35 pair train input output test input need predict corresponding output pattern learned train example successful youll help bring computer closer human cognition youll open door completely new ai application", "tags_descriptive": ["Feature Engineering", "Exploratory Data Analysis"]}