{"title": "Reducing Commercial Aviation Fatalities", "description": "Can you tell when a pilot is heading for trouble?Most flight-related fatalities stem from a loss of “airplane state awareness.” That is, ineffective attention management on the part of pilots who may be distracted, sleepy or in other dangerous cognitive states. Your challenge is to build a model to detect troubling events from aircrew’s physiological data. You'll use data acquired from actual pilots in test situations, and your models should be able to run calculations in real time to monitor the cognitive states of pilots. With your help, pilots could then be alerted when they enter a troubling state, preventing accidents and saving lives. Reducing aircraft fatalities is just one of the complex problems that  Booz Allen Hamilton has been solving for business, government, and military leaders for over 100 years. Through devotion, candor, courage, and character, they produce original solutions where there are no roadmaps. Now you can help them find answers, save lives, and change the world.", "link": "https://www.kaggle.com/c/reducing-commercial-aviation-fatalities", "tags": ["Feature Engineering", "Healthcare", "Exploratory Data Analysis", "Gradient Boosting"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-02-13 00:59:00", "words": 160, "sentences": 7, "runtime": 0.003, "description_category": "Emergency & Relief", "description_category_score": 0.2557480037212372, "description_category_runtime": 13.857, "description_subcategory": "General", "description_subcategory_score": 0.5479977130889893, "description_subcategory_runtime": 22.15, "category": "Emergency & Relief", "category_score": 0.2557480037212372, "subcategory": "General", "subcategory_score": 0.5479977130889893, "runtime_cat": 36.007, "engagement_score": "0.541", "language_code": "en", "language": "english", "language_score": "0.9999945114594104", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "tell pilot heading troublemost flightrelated fatality stem loss airplane state awareness ineffective attention management part pilot may distracted sleepy dangerous cognitive state challenge build model detect troubling event aircrew physiological data youll use data acquired actual pilot test situation model able run calculation real time monitor cognitive state pilot help pilot could alerted enter troubling state preventing accident saving life reducing aircraft fatality one complex problem booz allen hamilton solving business government military leader 100 year devotion candor courage character produce original solution roadmaps help find answer save life change world", "tags_descriptive": ["Feature Engineering", "Healthcare", "Exploratory Data Analysis", "Gradient Boosting"]}