{"title": "PUBG Finish Placement Prediction (Kernels Only)", "description": "Can you predict the battle royale finish of PUBG Players?So, where we droppin' boys and girls? Battle Royale-style video games have taken the world by storm. 100 players are dropped onto an island empty-handed and must explore, scavenge, and eliminate other players until only one is left standing, all while the play zone continues to shrink.  PlayerUnknown's BattleGrounds (PUBG) has enjoyed massive popularity. With over 50 million copies sold, it's the fifth best selling game of all time, and has millions of active monthly players.   The team at PUBG has made official game data available for the public to explore and scavenge outside of \"The Blue Circle.\" This competition is not an official or affiliated PUBG site - Kaggle collected data made possible through the PUBG Developer API. You are given over 65,000 games' worth of anonymized player data, split into training and testing sets, and asked to predict final placement from final in-game stats and initial player ratings.  What's the best strategy to win in PUBG? Should you sit in one spot and hide your way into victory, or do you need to be the top shot? Let's let the data do the talking!", "link": "https://www.kaggle.com/c/pubg-finish-placement-prediction", "tags": ["Games", "Ensembling", "Feature Engineering", "Xgboost", "Exploratory Data Analysis", "Gradient Boosting", "Regression", "Outlier Analysis"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2019-01-31 00:59:00", "words": 199, "sentences": 7, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.29582643508911133, "description_category_runtime": 17.627, "description_subcategory": "Quality", "description_subcategory_score": 0.49471423029899597, "description_subcategory_runtime": 28.693, "category": "Education & Research", "category_score": 0.29582643508911133, "subcategory": "Quality", "subcategory_score": 0.49471423029899597, "runtime_cat": 46.319, "engagement_score": "0.667", "language_code": "en", "language": "english", "language_score": "0.9999964430548955", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict battle royale finish pubg playersso droppin boy girl battle royalestyle video game taken world storm 100 player dropped onto island emptyhanded must explore scavenge eliminate player one left standing play zone continues shrink playerunknowns battleground pubg enjoyed massive popularity 50 million copy sold fifth best selling game time million active monthly player team pubg made official game data available public explore scavenge outside blue circle competition official affiliated pubg site kaggle collected data made possible pubg developer api given 65000 game worth anonymized player data split training testing set asked predict final placement final ingame stats initial player rating whats best strategy win pubg sit one spot hide way victory need top shot let let data talking", "tags_descriptive": ["Games", "Ensembling", "Feature Engineering", "Xgboost", "Exploratory Data Analysis", "Gradient Boosting", "Regression", "Outlier Analysis"]}