{"title": "Halite by Two Sigma", "description": "Collect the most halite during your match in spaceAhoy there! There's halite to be had and ships to be deployed! Are you ready to navigate the skies and secure your territory? Halite by Two Sigma (\"Halite\") is a resource management game where you build and control a small armada of ships. Your algorithms determine their movements to collect halite, a luminous energy source. The most halite at the end of the match wins, but it's up to you to figure out how to make effective and efficient moves. You control your fleet, build new ships, create shipyards, and mine the regenerating halite on the game board.  Created by Two Sigma in 2016, more than 15,000 people around the world have participated in a Halite challenge. Players apply advanced algorithms in a dynamic, open source game setting. The strategic depth and immersive, interactive nature of Halite games make each challenge a unique learning environment. Halite IV builds on the core game design of Halite III with a number of key changes that shift the focus of the game towards tighter competition on a smaller board. New game features include regenerating halite, shipyard creation, no more ship movement costs, and stealing halite from other players! So dust off your halite meters and fasten your seatbelts. The fourth season of Halite is about to begin!", "link": "https://www.kaggle.com/c/halite", "tags": ["DL", "Games", "RL"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2020-09-23 01:59:00", "words": 223, "sentences": 10, "sum_nltk": "Collect the most halite during your match in spaceAhoy there!\nThere's halite to be had and ships to be deployed!\nHalite by Two Sigma (\"Halite\") is a resource management game where you build and control a small armada of ships.\nYour algorithms determine their movements to collect halite, a luminous energy source.\nThe most halite at the end of the match wins, but it's up to you to figure out how to make effective and efficient moves.\nYou control your fleet, build new ships, create shipyards, and mine the regenerating halite on the game board.\nCreated by Two Sigma in 2016, more than 15,000 people around the world have participated in a Halite challenge.\nPlayers apply advanced algorithms in a dynamic, open source game setting.\nThe strategic depth and immersive, interactive nature of Halite games make each challenge a unique learning environment.\nHalite IV builds on the core game design of Halite III with a number of key changes that shift the focus of the game towards tighter competition on a smaller board.\nNew game features include regenerating halite, shipyard creation, no more ship movement costs, and stealing halite from other players!\nSo dust off your halite meters and fasten your seatbelts.\nThe fourth season of Halite is about to begin!", "sum_nltk_words": 199, "sum_nltk_runtime": 0.003, "sum_t5": "the fourth season of space game \"halite\" is about to begin. more than 15,000 people have participated in the game since 2016. players apply advanced algorithms in a dynamic, open source game setting. the game features regenerating halite, shipyard creation, and stealing halite from other players. a new game feature is a new version of the classic game. a new season will be released in january. a new season will be released in january.", "sum_t5_words": 74, "sum_t5_runtime": 5.208, "runtime": 0.003, "nltk_category": "Media & Publishing", "nltk_category_score": 0.6502704620361328, "nltk_category_runtime": 18.976, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.7732561826705933, "nltk_subcategory_runtime": 30.241, "category": "Media & Publishing", "category_score": 0.6502704620361328, "subcategory": "Quality", "subcategory_score": 0.7732561826705933, "runtime_cat": 49.219, "engagement_score": "0.652", "language_code": "en", "language": "english", "language_score": "0.999996064751338", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "collect halite match spaceahoy there halite ship deployed ready navigate sky secure territory halite two sigma halite resource management game build control small armada ship algorithm determine movement collect halite luminous energy source halite end match win figure make effective efficient move control fleet build new ship create shipyard mine regenerating halite game board created two sigma 2016 15000 people around world participated halite challenge player apply advanced algorithm dynamic open source game setting strategic depth immersive interactive nature halite game make challenge unique learning environment halite iv build core game design halite iii number key change shift focus game towards tighter competition smaller board new game feature include regenerating halite shipyard creation ship movement cost stealing halite player dust halite meter fasten seatbelt fourth season halite begin", "tags_descriptive": ["Deep Learning (DL)", "Games", "Reinforcement Learning (RL)"]}