{"title": "WSDM - KKBox's Music Recommendation Challenge", "description": "Can you build the best music recommendation system?The 11th ACM International Conference on Web Search and Data Mining (WSDM 2018) is challenging you to build a better music recommendation system using a donated dataset from KKBOX. WSDM (pronounced \"wisdom\") is one of the the premier conferences on web inspired research involving search and data mining. They're committed to publishing original, high quality papers and presentations, with an emphasis on practical but principled novel models. Not many years ago, it was inconceivable that the same person would listen to the Beatles, Vivaldi, and Lady Gaga on their morning commute. But, the glory days of Radio DJs have passed, and musical gatekeepers have been replaced with personalizing algorithms and unlimited streaming services. While the public’s now listening to all kinds of music, algorithms still struggle in key areas. Without enough historical data, how would an algorithm know if listeners will like a new song or a new artist? And, how would it know what songs to recommend brand new users? WSDM has challenged the Kaggle ML community to help solve these problems and build a better music recommendation system. The dataset is from KKBOX, Asia’s leading music streaming service, holding the world’s most comprehensive Asia-Pop music library with over 30 million tracks. They currently use a collaborative filtering based algorithm with matrix factorization and word embedding in their recommendation system but believe new techniques could lead to better results. Winners will present their findings at the conference February 6-8, 2018 in Los Angeles, CA.  For more information on the conference, click here, and don't forget to check out the other KKBox/WSDM competition: KKBox Music Churn Prediction Challenge", "link": "https://www.kaggle.com/c/kkbox-music-recommendation-challenge", "tags": ["Classification", "Feature Engineering", "Gradient Boosting"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-12-18 00:59:00", "words": 276, "sentences": 11, "sum_nltk": "Can you build the best music recommendation system?The 11th ACM International Conference on Web Search and Data Mining (WSDM 2018) is challenging you to build a better music recommendation system using a donated dataset from KKBOX.\nWSDM (pronounced \"wisdom\") is one of the the premier conferences on web inspired research involving search and data mining.\nBut, the glory days of Radio DJs have passed, and musical gatekeepers have been replaced with personalizing algorithms and unlimited streaming services.\nWhile the public’s now listening to all kinds of music, algorithms still struggle in key areas.\nWithout enough historical data, how would an algorithm know if listeners will like a new song or a new artist?\nWSDM has challenged the Kaggle ML community to help solve these problems and build a better music recommendation system.\nThe dataset is from KKBOX, Asia’s leading music streaming service, holding the world’s most comprehensive Asia-Pop music library with over 30 million tracks.\nThey currently use a collaborative filtering based algorithm with matrix factorization and word embedding in their recommendation system but believe new techniques could lead to better results.\nFor more information on the conference, click here, and don't forget to check out the other KKBox/WSDM competition: KKBox Music Churn Prediction Challenge", "sum_nltk_words": 197, "sum_nltk_runtime": 0.004, "sum_t5": "the dataset is from KKBOX, Asia’s leading music streaming service. winners will present their findings at the conference in los angeles, CA. WSDM is one of the premier conferences on web inspired research involving search and data mining. the dataset is from KKBOX, holding the world’s most comprehensive Asia-Pop music library with over 30 million tracks. WSDM has challenged the Kaggle ML community to help solve these problems.", "sum_t5_words": 68, "sum_t5_runtime": 5.922, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.4678047001361847, "nltk_category_runtime": 18.89, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.7353109121322632, "nltk_subcategory_runtime": 30.534, "category": "Education & Research", "category_score": 0.4678047001361847, "subcategory": "Machine Learning", "subcategory_score": 0.7353109121322632, "runtime_cat": 49.425, "engagement_score": "0.649", "language_code": "en", "language": "english", "language_score": "0.9999955318778231", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "build best music recommendation systemthe 11th acm international conference web search data mining wsdm 2018 challenging build better music recommendation system using donated dataset kkbox wsdm pronounced wisdom one premier conference web inspired research involving search data mining theyre committed publishing original high quality paper presentation emphasis practical principled novel model many year ago inconceivable person would listen beatles vivaldi lady gaga morning commute glory day radio dj passed musical gatekeeper replaced personalizing algorithm unlimited streaming service public listening kind music algorithm still struggle key area without enough historical data would algorithm know listener like new song new artist would know song recommend brand new user wsdm challenged kaggle ml community help solve problem build better music recommendation system dataset kkbox asia leading music streaming service holding world comprehensive asiapop music library 30 million track currently use collaborative filtering based algorithm matrix factorization word embedding recommendation system believe new technique could lead better result winner present finding conference february 68 2018 los angeles ca information conference click dont forget check kkboxwsdm competition kkbox music churn prediction challenge", "tags_descriptive": ["Classification", "Feature Engineering", "Gradient Boosting"]}