{"title": "Two Sigma Connect: Rental Listing Inquiries", "description": "How much interest will a new rental listing on RentHop receive?Finding the perfect place to call your new home should be more than browsing through endless listings. RentHop makes apartment search smarter by using data to sort rental listings by quality. But while looking for the perfect apartment is difficult enough, structuring and making sense of all available real estate data programmatically is even harder. Two Sigma and RentHop, a portfolio company of Two Sigma Ventures, invite Kagglers to unleash their creative engines to uncover business value in this unique recruiting competition.   Two Sigma invites you to apply your talents in this recruiting competition featuring rental listing data from RentHop. Kagglers will predict the number of inquiries a new listing receives based on the listing’s creation date and other features. Doing so will help RentHop better handle fraud control, identify potential listing quality issues, and allow owners and agents to better understand renters’ needs and preferences. Two Sigma has been at the forefront of applying technology and data science to financial forecasts. While their pioneering advances in big data, AI, and machine learning in the financial world have been pushing the industry forward, as with all other scientific progress, they are driven to make continual progress. This challenge is an opportunity for competitors to gain a sneak peek into Two Sigma's data science work outside of finance. Acknowledgments This competition is co-hosted by Two Sigma and RentHop (a portfolio company of Two Sigma Ventures, which is a division of Two Sigma Investments) to encourage creativity in using real world data to solve everyday problems.", "link": "https://www.kaggle.com/c/two-sigma-connect-rental-listing-inquiries", "tags": [], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-04-26 01:59:00", "words": 266, "sentences": 11, "sum_nltk": "How much interest will a new rental listing on RentHop receive?Finding the perfect place to call your new home should be more than browsing through endless listings.\nRentHop makes apartment search smarter by using data to sort rental listings by quality.\nBut while looking for the perfect apartment is difficult enough, structuring and making sense of all available real estate data programmatically is even harder.\nTwo Sigma and RentHop, a portfolio company of Two Sigma Ventures, invite Kagglers to unleash their creative engines to uncover business value in this unique recruiting competition.\nTwo Sigma invites you to apply your talents in this recruiting competition featuring rental listing data from RentHop. Kagglers will predict the number of inquiries a new listing receives based on the listing’s creation date and other features.\nTwo Sigma has been at the forefront of applying technology and data science to financial forecasts.\nThis challenge is an opportunity for competitors to gain a sneak peek into Two Sigma's data science work outside of finance.\nAcknowledgments This competition is co-hosted by Two Sigma and RentHop (a portfolio company of Two Sigma Ventures, which is a division of Two Sigma Investments) to encourage creativity in using real world data to solve everyday problems.", "sum_nltk_words": 197, "sum_nltk_runtime": 0.003, "sum_t5": "two Sigma and RentHop invite Kagglers to unleash their creative engines to uncover business value. Kagglers will predict the number of inquiries a new listing receives based on the listing’s creation date and other features. doing so will help RentHop better handle fraud control, identify potential listing quality issues, and allow owners and agents to better understand renters’ needs and preferences. two Sigma has been at the forefront of applying technology and data science to financial forecasts.", "sum_t5_words": 77, "sum_t5_runtime": 5.913, "runtime": 0.002, "nltk_category": "Real Estate, Rental & Leasing", "nltk_category_score": 0.7832562923431396, "nltk_category_runtime": 16.877, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.9381737112998962, "nltk_subcategory_runtime": 26.882, "category": "Real Estate, Rental & Leasing", "category_score": 0.7832562923431396, "subcategory": "Quality", "subcategory_score": 0.9381737112998962, "runtime_cat": 43.759, "engagement_score": "0.69", "language_code": "en", "language": "english", "language_score": "0.9999976355115849", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "much interest new rental listing renthop receivefinding perfect place call new home browsing endless listing renthop make apartment search smarter using data sort rental listing quality looking perfect apartment difficult enough structuring making sense available real estate data programmatically even harder two sigma renthop portfolio company two sigma venture invite kagglers unleash creative engine uncover business value unique recruiting competition two sigma invite apply talent recruiting competition featuring rental listing data renthop kagglers predict number inquiry new listing receives based listing creation date feature help renthop better handle fraud control identify potential listing quality issue allow owner agent better understand renter need preference two sigma forefront applying technology data science financial forecast pioneering advance big data ai machine learning financial world pushing industry forward scientific progress driven make continual progress challenge opportunity competitor gain sneak peek two sigma data science work outside finance acknowledgment competition cohosted two sigma renthop portfolio company two sigma venture division two sigma investment encourage creativity using real world data solve everyday problem", "tags_descriptive": []}