{"title": "Personalized Medicine: Redefining Cancer Treatment", "description": "Predict the effect of Genetic Variants to enable Personalized MedicineA lot has been said during the past several years about how precision medicine and, more concretely, how genetic testing is going to disrupt the way diseases like cancer are treated. But this is only partially happening due to the huge amount of manual work still required. Memorial Sloan Kettering Cancer Center (MSKCC) launched this competition, accepted by the NIPS 2017 Competition Track,  because we need your help to take personalized medicine to its full potential.  Once sequenced, a cancer tumor can have thousands of genetic mutations. But the challenge is distinguishing the mutations that contribute to tumor growth (drivers) from the neutral mutations (passengers).  Currently this interpretation of genetic mutations is being done manually. This is a very time-consuming task where a clinical pathologist has to manually review and classify every single genetic mutation based on evidence from text-based clinical literature. For this competition MSKCC is making available an expert-annotated knowledge base where world-class researchers and oncologists have manually annotated thousands of mutations. We need your help to develop a Machine Learning algorithm that, using this knowledge base as a baseline, automatically classifies genetic variations. Kaggle is excited to partner with research groups to push forward the frontier of machine learning. Research competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team. Any questions or concerns regarding the competition data, quality, or topic will be addressed by them.", "link": "https://www.kaggle.com/c/msk-redefining-cancer-treatment", "tags": ["NLP", "Classification", "SVM", "Feature Engineering"], "kind": ["Project", "(Competition)", "(Dataset)"], "host": "kaggle.com", "date_project": "2017-10-03 01:59:00", "words": 248, "sentences": 11, "sum_nltk": "Predict the effect of Genetic Variants to enable Personalized MedicineA lot has been said during the past several years about how precision medicine and, more concretely, how genetic testing is going to disrupt the way diseases like cancer are treated.\nMemorial Sloan Kettering Cancer Center (MSKCC) launched this competition, accepted by the NIPS 2017 Competition Track,  because we need your help to take personalized medicine to its full potential.\nOnce sequenced, a cancer tumor can have thousands of genetic mutations.\nCurrently this interpretation of genetic mutations is being done manually.\nThis is a very time-consuming task where a clinical pathologist has to manually review and classify every single genetic mutation based on evidence from text-based clinical literature.\nFor this competition MSKCC is making available an expert-annotated knowledge base where world-class researchers and oncologists have manually annotated thousands of mutations.\nWe need your help to develop a Machine Learning algorithm that, using this knowledge base as a baseline, automatically classifies genetic variations.\nKaggle is excited to partner with research groups to push forward the frontier of machine learning.\nResearch competitions make use of Kaggle's platform and experience, but are largely organized by the research group's data science team.", "sum_nltk_words": 189, "sum_nltk_runtime": 0.004, "sum_t5": "a cancer tumor can have thousands of genetic mutations. the challenge is distinguishing the mutations that contribute to tumor growth. the competition is accepting entries from the 2017 NIPS competition track. the competition is open to all researchers and oncologists. click here to enter the competition... to enter the competition, click here... to donate to the competition, click here... to donate to the competition, click here.", "sum_t5_words": 66, "sum_t5_runtime": 4.831, "runtime": 0.0, "nltk_category": "Healthcare", "nltk_category_score": 0.6814441680908203, "nltk_category_runtime": 18.019, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9349908232688904, "nltk_subcategory_runtime": 28.141, "category": "Healthcare", "category_score": 0.6814441680908203, "subcategory": "Machine Learning", "subcategory_score": 0.9349908232688904, "runtime_cat": 46.16, "engagement_score": "0.662", "language_code": "en", "language": "english", "language_score": "0.9999975958306473", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predict effect genetic variant enable personalized medicinea lot said past several year precision medicine concretely genetic testing going disrupt way disease like cancer treated partially happening due huge amount manual work still required memorial sloan kettering cancer center mskcc launched competition accepted nip 2017 competition track need help take personalized medicine full potential sequenced cancer tumor thousand genetic mutation challenge distinguishing mutation contribute tumor growth driver neutral mutation passenger currently interpretation genetic mutation done manually timeconsuming task clinical pathologist manually review classify every single genetic mutation based evidence textbased clinical literature competition mskcc making available expertannotated knowledge base worldclass researcher oncologist manually annotated thousand mutation need help develop machine learning algorithm using knowledge base baseline automatically classifies genetic variation kaggle excited partner research group push forward frontier machine learning research competition make use kaggles platform experience largely organized research group data science team question concern regarding competition data quality topic addressed", "tags_descriptive": ["Natural Language Processing (NLP)", "Classification", "Support Vector Machines (SVM)", "Feature Engineering"]}