{"title": "Eigendecompositions of Transfer Operators in Reproducing Kernel Hilbert Spaces", "link": "https://link.springer.com/article/10.1007/s00332-019-09574-z", "tags": ["Fashion"], "description": "Transfer operators such as the Perron–Frobenius or Koopman operator play an important role in the global analysis of complex dynamical systems. The eigenfunctions of these operators can be used to detect metastable sets, to project the dynamics onto the dominant slow processes, or to separate superimposed signals. We propose kernel transfer operators, which extend transfer operator theory to reproducing kernel Hilbert spaces and show that these operators are related to Hilbert space representations of conditional distributions, known as conditional mean embeddings. The proposed numerical methods to compute empirical estimates of these kernel transfer operators subsume existing data-driven methods for the approximation of transfer operators such as extended dynamic mode decomposition and its variants. One main benefit of the presented kernel-based approaches is that they can be applied to any domain where a similarity measure given by a kernel is available. Furthermore, we provide elementary results on eigendecompositions of finite-rank RKHS operators. We illustrate the results with the aid of guiding examples and highlight potential applications in molecular dynamics as well as video and text data analysis.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "0", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 176, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999960730978711", "runtime": 0.002, "description_lemmatized": "transfer operator perronfrobenius koopman operator play important role global analysis complex dynamical system eigenfunctions operator used detect metastable set project dynamic onto dominant slow process separate superimposed signal propose kernel transfer operator extend transfer operator theory reproducing kernel hilbert space show operator related hilbert space representation conditional distribution known conditional mean embeddings proposed numerical method compute empirical estimate kernel transfer operator subsume existing datadriven method approximation transfer operator extended dynamic mode decomposition variant one main benefit presented kernelbased approach applied domain similarity measure given kernel available furthermore provide elementary result eigendecompositions finiterank rkhs operator illustrate result aid guiding example highlight potential application molecular dynamic well video text data analysis", "tags_descriptive": ["Fashion"]}