{"title": "First Order Generative Adversarial Networks", "link": "https://arxiv.org/abs/1802.04591", "tags": ["GAN", "Fashion"], "description": "GANs excel at learning high dimensional distributions, but they can update generator parameters in directions that do not correspond to the steepest descent direction of the objective. Prominent examples of problematic update directions include those used in both Goodfellow's original GAN and the WGAN-GP. To formally describe an optimal update direction, we introduce a theoretical framework which allows the derivation of requirements on both the divergence and corresponding method for determining an update direction, with these requirements guaranteeing unbiased mini-batch updates in the direction of steepest descent. We propose a novel divergence which approximates the Wasserstein distance while regularizing the critic's first order information. Together with an accompanying update direction, this divergence fulfills the requirements for unbiased steepest descent updates. We verify our method, the First Order GAN, with image generation on CelebA, LSUN and CIFAR-10 and set a new state of the art on the One Billion Word language generation task. Code to reproduce experiments is available.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 158, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999976877758949", "runtime": 0.003, "description_lemmatized": "gans excel learning high dimensional distribution update generator parameter direction correspond steepest descent direction objective prominent example problematic update direction include used goodfellows original gan wgangp formally describe optimal update direction introduce theoretical framework allows derivation requirement divergence corresponding method determining update direction requirement guaranteeing unbiased minibatch update direction steepest descent propose novel divergence approximates wasserstein distance regularizing critic first order information together accompanying update direction divergence fulfills requirement unbiased steepest descent update verify method first order gan image generation celeba lsun cifar10 set new state art one billion word language generation task code reproduce experiment available", "tags_descriptive": ["Generative Adversarial Networks (GAN)", "Fashion"]}