{"title": "A Deep Learning System for Predicting Size and Fit in Fashion E-Commerce", "link": "https://arxiv.org/abs/1907.09844", "tags": ["DL", "Recommender", "Fashion"], "description": "Personalized size and fit recommendations bear crucial significance for any fashion e-commerce platform. Predicting the correct fit drives customer satisfaction and benefits the business by reducing costs incurred due to size-related returns. Traditional collaborative filtering algorithms seek to model customer preferences based on their previous orders. A typical challenge for such methods stems from extreme sparsity of customer-article orders. To alleviate this problem, we propose a deep learning based content-collaborative methodology for personalized size and fit recommendation. Our proposed method can ingest arbitrary customer and article data and can model multiple individuals or intents behind a single account. The method optimizes a global set of parameters to learn population-level abstractions of size and fit relevant information from observed customer-article interactions. It further employs customer and article specific embedding variables to learn their properties. Together with learned entity embeddings, the method maps additional customer and article attributes into a latent space to derive personalized recommendations. Application of our method to two publicly available datasets demonstrate an improvement over the state-of-the-art published results. On two proprietary datasets, one containing fit feedback from fashion experts and the other involving customer purchases, we further outperform comparable methodologies, including a recent Bayesian approach for size recommendation.", "category": "Wholesale & Retail", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 201, "sentences": 11, "sum_nltk": "Personalized size and fit recommendations bear crucial significance for any fashion e-commerce platform.\nPredicting the correct fit drives customer satisfaction and benefits the business by reducing costs incurred due to size-related returns.\nTraditional collaborative filtering algorithms seek to model customer preferences based on their previous orders.\nA typical challenge for such methods stems from extreme sparsity of customer-article orders.\nTo alleviate this problem, we propose a deep learning based content-collaborative methodology for personalized size and fit recommendation.\nOur proposed method can ingest arbitrary customer and article data and can model multiple individuals or intents behind a single account.\nThe method optimizes a global set of parameters to learn population-level abstractions of size and fit relevant information from observed customer-article interactions.\nIt further employs customer and article specific embedding variables to learn their properties.\nTogether with learned entity embeddings, the method maps additional customer and article attributes into a latent space to derive personalized recommendations.\nApplication of our method to two publicly available datasets demonstrate an improvement over the state-of-the-art published results.\nOn two proprietary datasets, one containing fit feedback from fashion experts and the other involving customer purchases, we further outperform comparable methodologies, including a recent Bayesian approach for size recommendation.", "sum_nltk_words": 191, "sum_nltk_runtime": 0.085, "sum_t5": "a method is proposed to help fashion e-commerce users make personalized recommendations. the method can model multiple individuals or intents behind a single account. it can be applied to two publicly available datasets. the method is more efficient than other methods. a similar method was developed for size recommendation. a similar method was developed for size recommendation. a similar method was developed for size recommendation. a similar method was developed for size recommendation.", "sum_t5_words": 73, "sum_t5_runtime": 9.463, "language_code": "en", "language": "english", "language_score": "0.9999966433742321", "runtime": 0.002, "description_lemmatized": "personalized size fit recommendation bear crucial significance fashion ecommerce platform predicting correct fit drive customer satisfaction benefit business reducing cost incurred due sizerelated return traditional collaborative filtering algorithm seek model customer preference based previous order typical challenge method stem extreme sparsity customerarticle order alleviate problem propose deep learning based contentcollaborative methodology personalized size fit recommendation proposed method ingest arbitrary customer article data model multiple individual intent behind single account method optimizes global set parameter learn populationlevel abstraction size fit relevant information observed customerarticle interaction employ customer article specific embedding variable learn property together learned entity embeddings method map additional customer article attribute latent space derive personalized recommendation application method two publicly available datasets demonstrate improvement stateoftheart published result two proprietary datasets one containing fit feedback fashion expert involving customer purchase outperform comparable methodology including recent bayesian approach size recommendation", "tags_descriptive": ["Deep Learning (DL)", "Recommender", "Fashion"]}