{"title": "Meta-learning for Size and Fit Recommendation in Fashion", "link": "https://epubs.siam.org/doi/pdf/10.1137/1.9781611976236.7", "tags": ["DL", "Recommender", "Fashion"], "description": "Fashion e-commerce has enjoyed an exponential growth inthe last few years. A key challenge of the market players is tooffer customers a personalized experience and to suggest rel-evant articles.  In that respect, although product recommen-dation is a well-studied field, size and fit recommendation isstill in its infancy.  The size and fit topic is a very challeng-ing problem as data is extremely sparse and noisy.  Most ap-proaches so far have exploited traditional machine learningtechniques.  In this work, we bring forward a meta-learningapproach  using  an  underlying  deep  neural  network.   Theadvantage of such an approach lies in its ability to exploitlarge scale data, learn across fashion categories, and absorbnew data efficiently without re-training.  We benchmark ourmethod  against  3  recent  methods  proven  successful  in  thedomain, and demonstrate various strengths of the proposedapproach.   To  that  end,  we  use  a  large-scale  anonymizeddataset of about 9.4 million customer-size interactions, col-lected over 5 years from around 384k custome", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 180, "sentences": 9, "language_code": "en", "language": "english", "language_score": "0.9999963744046783", "runtime": 0.002, "description_lemmatized": "fashion ecommerce enjoyed exponential growth inthe last year key challenge market player tooffer customer personalized experience suggest relevant article respect although product recommendation wellstudied field size fit recommendation isstill infancy size fit topic challenging problem data extremely sparse noisy approach far exploited traditional machine learningtechniques work bring forward metalearningapproach using underlying deep neural network theadvantage approach lie ability exploitlarge scale data learn across fashion category absorbnew data efficiently without retraining benchmark ourmethod 3 recent method proven successful thedomain demonstrate various strength proposedapproach end use largescale anonymizeddataset 94 million customersize interaction collected 5 year around 384k custome", "tags_descriptive": ["Deep Learning (DL)", "Recommender", "Fashion"]}