{"title": "A Hierarchical Bayesian Model for Size Recommendation in Fashion", "link": "https://rguigoures.github.io/pdf/hierarchical-bayesian-model_final.pdf", "tags": ["Bayesian", "Fashion"], "description": "We introduce a hierarchical Bayesian approach to tackle the chal-lenging problem of size recommendation in e-commerce fashion.Our approach jointly models a size purchased by a customer, andits possible return event: 1. no return, 2. returned too small 3. re-turned too big. Those events are drawn following a multinomialdistribution parameterized on the joint probability of each event,built following a hierarchy combining priors. Such a model allowsus to incorporate extended domain expertise and article charac-teristics as prior knowledge, which in turn makes it possible forthe underlying parameters to emerge thanks to sufficient data. Ex-periments are presented on real (anonymized) data from millionsof customers along with a detailed discussion on the efficiency ofsuch an approach within a large scale production system.", "category": "Wholesale & Retail", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 118, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999970731844401", "runtime": 0.003, "description_lemmatized": "introduce hierarchical bayesian approach tackle challenging problem size recommendation ecommerce fashionour approach jointly model size purchased customer andits possible return event 1 return 2 returned small 3 returned big event drawn following multinomialdistribution parameterized joint probability eventbuilt following hierarchy combining prior model allowsus incorporate extended domain expertise article characteristic prior knowledge turn make possible forthe underlying parameter emerge thanks sufficient data experiment presented real anonymized data millionsof customer along detailed discussion efficiency ofsuch approach within large scale production system", "tags_descriptive": ["Bayesian", "Fashion"]}