{"title": "Learning Texture Manifolds with the Periodic Spatial GAN", "link": "http://proceedings.mlr.press/v70/bergmann17a.html", "tags": ["GAN", "Fashion"], "description": "This paper introduces a novel approach to texture synthesis based on generative adversarial networks (GAN) (Goodfellow et al., 2014), and call this technique Periodic Spatial GAN (PSGAN). The PSGAN has several novel abilities which surpass the current state of the art in texture synthesis. First, we can learn multiple textures, periodic or non-periodic, from datasets of one or more complex large images. Second, we show that the image generation with PSGANs has properties of a texture manifold: we can smoothly interpolate between samples in the structured noise space and generate novel samples, which lie perceptually between the textures of the original dataset. We make multiple experiments which show that PSGANs can flexibly handle diverse texture and image data sources, and the method is highly scalable and can generate output images of arbitrary large size.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 134, "sentences": 5, "language_code": "en", "language": "english", "language_score": "0.9999967925744186", "runtime": 0.002, "description_lemmatized": "paper introduces novel approach texture synthesis based generative adversarial network gan goodfellow et al 2014 call technique periodic spatial gan psgan psgan several novel ability surpass current state art texture synthesis first learn multiple texture periodic nonperiodic datasets one complex large image second show image generation psgans property texture manifold smoothly interpolate sample structured noise space generate novel sample lie perceptually texture original dataset make multiple experiment show psgans flexibly handle diverse texture image data source method highly scalable generate output image arbitrary large size", "tags_descriptive": ["Generative Adversarial Networks (GAN)", "Fashion"]}