{"title": "GANosaic: Mosaic Creation with Generative Texture Manifolds", "link": "https://arxiv.org/abs/1712.00269", "tags": ["GAN", "CV", "Pattern Recognition", "Fashion"], "description": "This paper presents a novel framework for generating texture mosaics with convolutional neural networks. Our method is called GANosaic and performs optimization in the latent noise space of a generative texture model, which allows the transformation of a content image into a mosaic exhibiting the visual properties of the underlying texture manifold. To represent that manifold, we use a state-of-the-art generative adversarial method for texture synthesis, which can learn expressive texture representations from data and produce mosaic images with very high resolution. This fully convolutional model generates smooth (without any visible borders) mosaic images which morph and blend different textures locally. In addition, we develop a new type of differentiable statistical regularization appropriate for optimization over the prior noise space of the PSGAN model.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 124, "sentences": 5, "language_code": "en", "language": "english", "language_score": "0.9999978714321887", "runtime": 0.0, "description_lemmatized": "paper present novel framework generating texture mosaic convolutional neural network method called ganosaic performs optimization latent noise space generative texture model allows transformation content image mosaic exhibiting visual property underlying texture manifold represent manifold use stateoftheart generative adversarial method texture synthesis learn expressive texture representation data produce mosaic image high resolution fully convolutional model generates smooth without visible border mosaic image morph blend different texture locally addition develop new type differentiable statistical regularization appropriate optimization prior noise space psgan model", "tags_descriptive": ["Generative Adversarial Networks (GAN)", "Computer Vision (CV)", "Pattern Recognition", "Fashion"]}