{"title": "Street2Fashion2Shop: Enabling Visual Search in Fashion e-Commerce Using Studio Images", "link": "https://link.springer.com/chapter/10.1007/978-3-030-05499-1_1", "tags": ["Visual search", "Computer vision", "Deep learning", "Product matching", "Fashion", "Fashion"], "description": "Visual search, in particular the street-to-shop task of matching fashion items displayed in everyday images with similar articles, is a challenging and commercially important task in computer vision. Building on our successful Studio2Shop model [20], we report results on Street2Fashion2Shop, a pipeline architecture that stacks Studio2Fashion, a segmentation model responsible for eliminating the background in a street image, with Fashion2Shop, an improved model matching the remaining foreground image with “title images”, front views of fashion articles on a white background. Both segmentation and product matching rely on deep convolutional neural networks. The pipeline allows us to circumvent the lack of quality annotated wild data by leveraging specific data sets at all steps. We show that the use of fashion-specific training data leads to superior performance of the segmentation model. Studio2Shop built its performance on FashionDNA, an in-house product representation trained on the rich, professionally curated Zalando catalogue. Our study presents a substantially improved version of FashionDNA that boosts the accuracy of the matching model. Results on external datasets confirm the viability of our approach.", "category": "Wholesale & Retail", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 174, "sentences": 8, "language_code": "en", "language": "english", "language_score": "0.9999965336525807", "runtime": 0.003, "description_lemmatized": "visual search particular streettoshop task matching fashion item displayed everyday image similar article challenging commercially important task computer vision building successful studio2shop model 20 report result street2fashion2shop pipeline architecture stack studio2fashion segmentation model responsible eliminating background street image fashion2shop improved model matching remaining foreground image title image front view fashion article white background segmentation product matching rely deep convolutional neural network pipeline allows u circumvent lack quality annotated wild data leveraging specific data set step show use fashionspecific training data lead superior performance segmentation model studio2shop built performance fashiondna inhouse product representation trained rich professionally curated zalando catalogue study present substantially improved version fashiondna boost accuracy matching model result external datasets confirm viability approach", "tags_descriptive": ["Visual search", "Computer vision", "Deep learning", "Product matching", "Fashion", "Fashion"]}