{"title": "VP Profile and Personalization, Digital Experience", "link": "https://jobs.zalando.com/en/jobs/2450295-vp-profile-and-personalization-digital-experience/?gh_src=gk03hq", "tags": ["Fashion"], "description": "The team are responsible for understanding our customers, and working to translate deep customer understanding into inspiring fashion shopping experiences. The Profile and Personalization pillar will solve customer problems including: Paradox of Choice: unlimited fashion can leave customers feeling overwhelmed and dissatisfied with the choices they make Searchable Warehouse: discovering the perfect product feels like hard work - clicking through categories, subcategories and applying filters to get a grid of products that are popular but not quite their style Impersonal Shopper: Zalando does not listen, learn or remember how I shopped in the past given that each time I return to the site I have to start over again. These problems can leave our customers feeling frustrated by their shopping experience.", "source": "", "category": "Education & Research", "category_score": 1, "subcategory": "Retail", "subcategory_score": 1, "host": "zalando.com", "kind": "Article", "learn_score": 0, "explore_score": 0, "compete_score": 1, "words": 121, "sentences": 3, "language_code": "en", "language": "english", "language_score": "0.9999981519860122", "runtime": 0.002, "description_lemmatized": "team responsible understanding customer working translate deep customer understanding inspiring fashion shopping experience profile personalization pillar solve customer problem including paradox choice unlimited fashion leave customer feeling overwhelmed dissatisfied choice make searchable warehouse discovering perfect product feel like hard work clicking category subcategories applying filter get grid product popular quite style impersonal shopper zalando listen learn remember shopped past given time return site start problem leave customer feeling frustrated shopping experience", "tags_descriptive": ["Fashion"]}