{"title": "Studio2Shop: from photo shoots to fashion articles", "link": "http://www.scitepress.org/PublicationsDetail.aspx?ID=hT0FJ9RWeJs=&t=1", "tags": ["Computer Vision", "Deep Learning", "Fashion", "Item Recognition", "Street-to-shop", "Pattern Recognition", "Fashion"], "description": "Fashion is an increasingly important topic in computer vision, in particular the so-called street-to-shop task of matching street images with shop images containing similar fashion items. Solving this problem promises new means of making fashion searchable and helping shoppers find the articles they are looking for. This paper focuses on finding pieces of clothing worn by a person in full-body or half-body images with neutral backgrounds. Such images are ubiquitous on the web and in fashion blogs, and are typically studio photos, we refer to this setting as studio-to-shop. Recent advances in computational fashion include the development of domain-specific numerical representations. Our model Studio2Shop builds on top of such representations and uses a deep convolutional network trained to match a query image to the numerical feature vectors of all the articles annotated in this image. Top-k retrieval evaluation on test query images shows that the correct items are most often found within a range that is sufficiently small for building realistic visual search engines for the studio-to-shop setting.", "category": "Wholesale & Retail", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 168, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999975854401569", "runtime": 0.002, "description_lemmatized": "fashion increasingly important topic computer vision particular socalled streettoshop task matching street image shop image containing similar fashion item solving problem promise new mean making fashion searchable helping shopper find article looking paper focus finding piece clothing worn person fullbody halfbody image neutral background image ubiquitous web fashion blog typically studio photo refer setting studiotoshop recent advance computational fashion include development domainspecific numerical representation model studio2shop build top representation us deep convolutional network trained match query image numerical feature vector article annotated image topk retrieval evaluation test query image show correct item often found within range sufficiently small building realistic visual search engine studiotoshop setting", "tags_descriptive": ["Computer Vision", "Deep Learning", "Fashion", "Item Recognition", "Street-to-shop", "Pattern Recognition", "Fashion"]}