{"title": "Transform the Set: Memory Attentive Generation of Guided and Unguided Image Collages", "link": "https://arxiv.org/abs/1910.07236", "tags": ["GAN", "CV", "Pattern Recognition", "Fashion"], "description": "Cutting and pasting image segments feels intuitive: the choice of source templates gives artists flexibility in recombining existing source material. Formally, this process takes an image set as input and outputs a collage of the set elements. Such selection from sets of source templates does not fit easily in classical convolutional neural models requiring inputs of fixed size. Inspired by advances in attention and set-input machine learning, we present a novel architecture that can generate in one forward pass image collages of source templates using set-structured representations. This paper has the following contributions: (i) a novel framework for image generation called Memory Attentive Generation of Image Collages (MAGIC) which gives artists new ways to create digital collages; (ii) from the machine-learning perspective, we show a novel Generative Adversarial Networks (GAN) architecture that uses Set-Transformer layers and set-pooling to blend sets of random image samples - a hybrid non-parametric approach.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 149, "sentences": 5, "language_code": "en", "language": "english", "language_score": "0.9999962074840719", "runtime": 0.002, "description_lemmatized": "cutting pasting image segment feel intuitive choice source template give artist flexibility recombining existing source material formally process take image set input output collage set element selection set source template fit easily classical convolutional neural model requiring input fixed size inspired advance attention setinput machine learning present novel architecture generate one forward pas image collage source template using setstructured representation paper following contribution novel framework image generation called memory attentive generation image collage magic give artist new way create digital collage ii machinelearning perspective show novel generative adversarial network gan architecture us settransformer layer setpooling blend set random image sample hybrid nonparametric approach", "tags_descriptive": ["Generative Adversarial Networks (GAN)", "Computer Vision (CV)", "Pattern Recognition", "Fashion"]}