{"title": "Fashion DNA: Merging content and sales data for recommendation and article mapping", "link": "https://arxiv.org/abs/1609.02489", "tags": ["DL", "Forecasting", "Recommender", "Fashion"], "description": "We present a method to determine Fashion DNA, coordinate vectors locating fashion items in an abstract space. Our approach is based on a deep neural network architecture that ingests curated article information such as tags and images, and is trained to predict sales for a large set of frequent customers. In the process, a dual space of customer style preferences naturally arises. Interpretation of the metric of these spaces is straightforward: The product of Fashion DNA and customer style vectors yields the forecast purchase likelihood for the customer-item pair, while the angle between Fashion DNA vectors is a measure of item similarity. Importantly, our models are able to generate unbiased purchase probabilities for fashion items based solely on article information, even in absence of sales data, thus circumventing the \"cold-start problem\" of collaborative recommendation approaches. Likewise, it generalizes easily and reliably to customers outside the training set. We experiment with Fashion DNA models based on visual and/or tag item data, evaluate their recommendation power, and discuss the resulting article similarities.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 170, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999955580578535", "runtime": 0.004, "description_lemmatized": "present method determine fashion dna coordinate vector locating fashion item abstract space approach based deep neural network architecture ingests curated article information tag image trained predict sale large set frequent customer process dual space customer style preference naturally arises interpretation metric space straightforward product fashion dna customer style vector yield forecast purchase likelihood customeritem pair angle fashion dna vector measure item similarity importantly model able generate unbiased purchase probability fashion item based solely article information even absence sale data thus circumventing coldstart problem collaborative recommendation approach likewise generalizes easily reliably customer outside training set experiment fashion dna model based visual andor tag item data evaluate recommendation power discus resulting article similarity", "tags_descriptive": ["Deep Learning (DL)", "Forecasting", "Recommender", "Fashion"]}