{"title": "SizeNet: Weakly Supervised Learning of Visual Size and Fit in Fashion Images", "link": "https://arxiv.org/abs/1905.11784", "tags": ["Supervised Learning", "CV", "Pattern Recognition", "Fashion"], "description": "Finding clothes that fit is a hot topic in the e-commerce fashion industry. Most approaches addressing this problem are based on statistical methods relying on historical data of articles purchased and returned to the store. Such approaches suffer from the cold start problem for the thousands of articles appearing on the shopping platforms every day, for which no prior purchase history is available. We propose to employ visual data to infer size and fit characteristics of fashion articles. We introduce SizeNet, a weakly-supervised teacher-student training framework that leverages the power of statistical models combined with the rich visual information from article images to learn visual cues for size and fit characteristics, capable of tackling the challenging cold start problem. Detailed experiments are performed on thousands of textile garments, including dresses, trousers, knitwear, tops, etc. from hundreds of different brands.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 139, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999975970546969", "runtime": 0.002, "description_lemmatized": "finding clothes fit hot topic ecommerce fashion industry approach addressing problem based statistical method relying historical data article purchased returned store approach suffer cold start problem thousand article appearing shopping platform every day prior purchase history available propose employ visual data infer size fit characteristic fashion article introduce sizenet weaklysupervised teacherstudent training framework leverage power statistical model combined rich visual information article image learn visual cue size fit characteristic capable tackling challenging cold start problem detailed experiment performed thousand textile garment including dress trouser knitwear top etc hundred different brand", "tags_descriptive": ["Supervised Learning", "Computer Vision (CV)", "Pattern Recognition", "Fashion"]}