{"title": "CROWD-IN-THE-LOOP: A Hybrid Approach for Annotating Semantic Roles", "link": "http://www.aclweb.org/anthology/D17-1205", "tags": ["NLP", "SVM", "Classification", "Fashion"], "description": "Crowdsourcing has proven to be an effective method for generating labeled data for a range of NLP tasks. However, multiple recent attempts of using crowdsourcing to generate gold-labeled training data for semantic role labeling (SRL) reported only modest results, indicating that SRL is perhaps too difficult a task to be effectively crowdsourced. In this paper, we postulate that while producing SRL annotation does require expert involvement in general, a large subset of SRL labeling tasks is in fact appropriate for the crowd. We present a novel workflow in which we employ a classifier to identify difficult annotation tasks and route each task either to experts or crowd workers according to their difficulties. Our experimental evaluation shows that the proposed approach reduces the workload for experts by over two-thirds, and thus significantly reduces the cost of producing SRL annotation at little loss in quality.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 143, "sentences": 5, "language_code": "en", "language": "english", "language_score": "0.9999984577599531", "runtime": 0.003, "description_lemmatized": "crowdsourcing proven effective method generating labeled data range nlp task however multiple recent attempt using crowdsourcing generate goldlabeled training data semantic role labeling srl reported modest result indicating srl perhaps difficult task effectively crowdsourced paper postulate producing srl annotation require expert involvement general large subset srl labeling task fact appropriate crowd present novel workflow employ classifier identify difficult annotation task route task either expert crowd worker according difficulty experimental evaluation show proposed approach reduces workload expert twothirds thus significantly reduces cost producing srl annotation little loss quality", "tags_descriptive": ["Natural Language Processing (NLP)", "Support Vector Machines (SVM)", "Classification", "Fashion"]}