{"title": "Texture synthesis with spatial generative adversarial networks", "link": "https://arxiv.org/abs/1611.08207", "tags": ["GAN", "CV", "Pattern Recognition", "Fashion"], "description": "Generative adversarial networks (GANs) are a recent approach to train generative models of data, which have been shown to work particularly well on image data. In the current paper we introduce a new model for texture synthesis based on GAN learning. By extending the input noise distribution space from a single vector to a whole spatial tensor, we create an architecture with properties well suited to the task of texture synthesis, which we call spatial GAN (SGAN). To our knowledge, this is the first successful completely data-driven texture synthesis method based on GANs. Our method has the following features which make it a state of the art algorithm for texture synthesis: high image quality of the generated textures, very high scalability w.r.t. the output texture size, fast real-time forward generation, the ability to fuse multiple diverse source images in complex textures. To illustrate these capabilities we present multiple experiments with different classes of texture images and use cases. We also discuss some limitations of our method with respect to the types of texture images it can synthesize, and compare it to other neural techniques for texture generation.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 187, "sentences": 8, "language_code": "en", "language": "english", "language_score": "0.9999959333571891", "runtime": 0.002, "description_lemmatized": "generative adversarial network gans recent approach train generative model data shown work particularly well image data current paper introduce new model texture synthesis based gan learning extending input noise distribution space single vector whole spatial tensor create architecture property well suited task texture synthesis call spatial gan sgan knowledge first successful completely datadriven texture synthesis method based gans method following feature make state art algorithm texture synthesis high image quality generated texture high scalability wrt output texture size fast realtime forward generation ability fuse multiple diverse source image complex texture illustrate capability present multiple experiment different class texture image use case also discus limitation method respect type texture image synthesize compare neural technique texture generation", "tags_descriptive": ["Generative Adversarial Networks (GAN)", "Computer Vision (CV)", "Pattern Recognition", "Fashion"]}