{"title": "Copy the Old or Paint Anew? An Adversarial Framework for (non-) Parametric Image Stylization", "link": "https://arxiv.org/abs/1811.09236", "tags": ["GAN", "CV", "Pattern Recognition", "Fashion"], "description": "Parametric generative deep models are state-of-the-art for photo and non-photo realistic image stylization. However, learning complicated image representations requires compute-intense models parametrized by a huge number of weights, which in turn requires large datasets to make learning successful. Non-parametric exemplar-based generation is a technique that works well to reproduce style from small datasets, but is also compute-intensive. These aspects are a drawback for the practice of digital AI artists: typically one wants to use a small set of stylization images, and needs a fast flexible model in order to experiment with it. With this motivation, our work has these contributions: (i) a novel stylization method called Fully Adversarial Mosaics (FAMOS) that combines the strengths of both parametric and non-parametric approaches; (ii) multiple ablations and image examples that analyze the method and show its capabilities; (iii) source code that will empower artists and machine learning researchers to use and modify FAMOS.", "category": "Education & Research", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 150, "sentences": 5, "language_code": "en", "language": "english", "language_score": "0.9999968925159319", "runtime": 0.002, "description_lemmatized": "parametric generative deep model stateoftheart photo nonphoto realistic image stylization however learning complicated image representation requires computeintense model parametrized huge number weight turn requires large datasets make learning successful nonparametric exemplarbased generation technique work well reproduce style small datasets also computeintensive aspect drawback practice digital ai artist typically one want use small set stylization image need fast flexible model order experiment motivation work contribution novel stylization method called fully adversarial mosaic famos combine strength parametric nonparametric approach ii multiple ablation image example analyze method show capability iii source code empower artist machine learning researcher use modify famos", "tags_descriptive": ["Generative Adversarial Networks (GAN)", "Computer Vision (CV)", "Pattern Recognition", "Fashion"]}