{"title": "The Conditional Analogy GAN: Swapping Fashion Articles on People Images", "link": "https://arxiv.org/abs/1709.04695", "tags": ["GAN", "CV", "Pattern Recognition", "Fashion"], "description": "We present a novel method to solve image analogy problems : it allows to learn the relation between paired images present in training data, and then generalize and generate images that correspond to the relation, but were never seen in the training set. Therefore, we call the method Conditional Analogy Generative Adversarial Network (CAGAN), as it is based on adversarial training and employs deep convolutional neural networks. An especially interesting application of that technique is automatic swapping of clothing on fashion model photos. Our work has the following contributions. First, the definition of the end-to-end trainable CAGAN architecture, which implicitly learns segmentation masks without expensive supervised labeling data. Second, experimental results show plausible segmentation masks and often convincing swapped images, given the target article. Finally, we discuss the next steps for that technique: neural network architecture improvements and more advanced applications.", "category": "Wholesale & Retail", "category_score": 1, "subcategory": "Machine Learning", "subcategory_score": 1, "ml_score": "1", "host": "zalando.com", "kind": "Article", "date_scraped": "2021-01-17 00:00:00", "learn_score": 0.5, "explore_score": 0, "compete_score": 0.75, "words": 141, "sentences": 7, "language_code": "en", "language": "english", "language_score": "0.9999965735546946", "runtime": 0.0, "description_lemmatized": "present novel method solve image analogy problem allows learn relation paired image present training data generalize generate image correspond relation never seen training set therefore call method conditional analogy generative adversarial network cagan based adversarial training employ deep convolutional neural network especially interesting application technique automatic swapping clothing fashion model photo work following contribution first definition endtoend trainable cagan architecture implicitly learns segmentation mask without expensive supervised labeling data second experimental result show plausible segmentation mask often convincing swapped image given target article finally discus next step technique neural network architecture improvement advanced application", "tags_descriptive": ["Generative Adversarial Networks (GAN)", "Computer Vision (CV)", "Pattern Recognition", "Fashion"]}