{"title": "Team power rankings", "description": "Data-driven power rankingsRanking the teams by their strength is a very important piece of information your model should use. Some of the rankings are using expert opinion (i.e. majority vote of fan opinion). However, this may be not the best approach, as human opinions tend to be biased towards their favorites. Moreover, it may be easy to determine a top few strong teams, but it is a much harder to rank teams in the mid-lower range ranks. In NCAA tournament teams are assigned with tournament starting seeds, which also has expert bias - it is not uncommon, that a team with higher win ratio % would get lower seed compared to a team with lower win ratio %, based on the regular season schedule (which is not the same for every team!). Therefore, the judgment of team strength of assigned seed sometimes get controversial opinion among fans and media! The idea of this kernel is to try to calculate the team strength rankings only based on the  data we have in our disposal. This way we will eliminate all possible human biases and get a robust estimate of team's strength.", "link": "https://www.kaggle.com/raddar/team-power-rankings", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-02-16 10:59:55", "date_scraped": "2020-12-13 13:59:30", "words": 191, "sentences": 8, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.4054598808288574, "description_category_runtime": 15.299, "description_subcategory": "Student", "description_subcategory_score": 0.5766303539276123, "description_subcategory_runtime": 24.136, "category": "Utilities", "category_score": 0.4054598808288574, "subcategory": "Student", "subcategory_score": 0.5766303539276123, "runtime_cat": 39.435, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.728", "language_code": "en", "language_score": "0.9999970014785851", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "datadriven power rankingsranking team strength important piece information model use ranking using expert opinion ie majority vote fan opinion however may best approach human opinion tend biased towards favorite moreover may easy determine top strong team much harder rank team midlower range rank ncaa tournament team assigned tournament starting seed also expert bias uncommon team higher win ratio would get lower seed compared team lower win ratio based regular season schedule every team therefore judgment team strength assigned seed sometimes get controversial opinion among fan medium idea kernel try calculate team strength ranking based data disposal way eliminate possible human bias get robust estimate team strength", "tags_descriptive": []}