{"title": "MaskRCNN for cloud classification (Keras)", "description": "Understanding cloud organization with MaskRCNN using Keras/TensorflowThis kernel is a first attempt to use a MaskRCNN to solve the cloud organization classification problem. It also helps to evaluate how promising the results are within the allowed processing time on kernels as it is likely such model will take much longer to train properly. It is using the Matterplot implementation of MaskRCNN and is inspired from this kernel from the iMaterialist competition. If you are particularly interested in data cleaning for a MaskRCNN, I have also created another kernel for the Kuzushiji recognition competition which may be of help. If you find this kernel useful, please give an upvote! :)", "link": "https://www.kaggle.com/frlemarchand/maskrcnn-for-cloud-classification-keras", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-08-28 01:30:15", "date_scraped": "2020-12-13 18:07:53", "words": 109, "sentences": 5, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.03803304210305214, "description_category_runtime": 10.219, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.983218789100647, "description_subcategory_runtime": 15.765, "category": "Wholesale & Retail", "category_score": 0.03803304210305214, "subcategory": "Machine Learning", "subcategory_score": 0.983218789100647, "runtime_cat": 25.984, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.726", "language_code": "en", "language_score": "0.9999945298562852", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "understanding cloud organization maskrcnn using kerastensorflowthis kernel first attempt use maskrcnn solve cloud organization classification problem also help evaluate promising result within allowed processing time kernel likely model take much longer train properly using matterplot implementation maskrcnn inspired kernel imaterialist competition particularly interested data cleaning maskrcnn also created another kernel kuzushiji recognition competition may help find kernel useful please give upvote", "tags_descriptive": []}