{"title": "A Walkthrough and a Challenge", "description": "Introduction: Taxi Fare PredictionWelcome to another Kaggle challenge. In this contest, the aim is to predict the fare of a taxi ride given the starting time, the starting and ending latitude / longitude, and the number of passengers. This is a supervised regression machine learning task. In this notebook, I'll provide you with a solid foundation and leave you with the challenge to better the score. Although the dataset is large, this is an approachable problem and as usual with Kaggle competitions, provides realistic practice for building a machine learning solution. The best way to learn is by doing, so let's work through a complete machine learning problem! Great resources for Kaggle competitions are the discussion forums and the kernels completed by other data scientists. I recommend using, adapting, and building on others' code, especially when you are getting started.", "link": "https://www.kaggle.com/willkoehrsen/a-walkthrough-and-a-challenge", "tags": ["Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-09-10 04:03:30", "date_scraped": "2020-12-13 14:20:01", "words": 140, "sentences": 7, "runtime": 0.005, "description_category": "Finance", "description_category_score": 0.047055914998054504, "description_category_runtime": 12.335, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9855958819389343, "description_subcategory_runtime": 18.859, "category": "Finance", "category_score": 0.047055914998054504, "subcategory": "Machine Learning", "subcategory_score": 0.9855958819389343, "runtime_cat": 31.194, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.757", "language_code": "en", "language_score": "0.9999982747131069", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introduction taxi fare predictionwelcome another kaggle challenge contest aim predict fare taxi ride given starting time starting ending latitude longitude number passenger supervised regression machine learning task notebook ill provide solid foundation leave challenge better score although dataset large approachable problem usual kaggle competition provides realistic practice building machine learning solution best way learn let work complete machine learning problem great resource kaggle competition discussion forum kernel completed data scientist recommend using adapting building others code especially getting started", "tags_descriptive": ["Feature Engineering"]}