{"title": "Cancer detection with kekas", "description": "General informationThere are many frameworks for Deep Learning. Recently I started using Pytorch and liked it, but sometimes it requires too much coding, so I started looking for wrappers over Pytorch. Recently a new library emerged: Kekas https://github.com/belskikh/kekas It provides a simple API for training neural nets for images and good visualizations of training process. There are also nice tricks from fast.ai - learning rate finder, one cycle policy and others. In this kernel I'll show what this library can do. At first I'll take a small subset of data and demonstrate the general functionality, after this we'll try training model on the full data.  Sadly, kaggle kernels have some problems currently, so I won't be able to show everything.", "link": "https://www.kaggle.com/artgor/cancer-detection-with-kekas", "tags": ["DL", "Classification"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch", "albumentations"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-03-24 17:16:43", "date_scraped": "2020-12-12 20:43:30", "words": 121, "sentences": 7, "runtime": 0.002, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.17249973118305206, "description_category_runtime": 11.867, "description_subcategory": "General", "description_subcategory_score": 0.9404637217521667, "description_subcategory_runtime": 18.792, "category": "Real Estate, Rental & Leasing", "category_score": 0.17249973118305206, "subcategory": "General", "subcategory_score": 0.9404637217521667, "runtime_cat": 30.659, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.734", "language_code": "en", "language_score": "0.9999970601871058", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "general informationthere many framework deep learning recently started using pytorch liked sometimes requires much coding started looking wrapper pytorch recently new library emerged kekas httpsgithubcombelskikhkekas provides simple api training neural net image good visualization training process also nice trick fastai learning rate finder one cycle policy others kernel ill show library first ill take small subset data demonstrate general functionality well try training model full data sadly kaggle kernel problem currently wont able show everything", "tags_descriptive": ["Deep Learning (DL)", "Classification"]}