{"title": "Keras+ResNet+TTA ", "description": "APTOS 2019 Blindness Detection In this Kernel, we will design a Machine learning model,which will help in identifing the eyes disease.  As this is a imaged based problem, we will use Deep Learning for model design. Diabetic retinopathy affects blood vessels in the light-sensitive tissue called the retina that lines the back of the eye. It is the most common cause of vision loss among people with diabetes and the leading cause of vision impairment and blindness among working-age adults. It don't have any earaly symtoms. As of now, Retena photography is a way to detect the stage of Blindness. Automating it with ml, will help a lot in health domain.   Import Required Libraries Loading Data  Data Visualization Train and Test dataset Data Pre-Processing Image Data Generator Model Architecture Design Keras Callback Funcations Transfer Learning Validation Accuracy & Loss Validation Accuracy Test-Time Augmentation Visualization Test Result    Design CNN from Scratch Use pre-train model for Blindness Detection Stages Of Diabetic Retinopathy  NO DR Mild Moderate  Servere Proliferative DR", "link": "https://www.kaggle.com/bharatsingh213/keras-resnet-tta", "tags": ["DL", "Exploratory Data Analysis", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-06 20:40:47", "date_scraped": "2020-12-12 16:39:24", "words": 176, "sentences": 8, "runtime": 0.002, "description_category": "Healthcare", "description_category_score": 0.183380126953125, "description_category_runtime": 16.189, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9804644584655762, "description_subcategory_runtime": 25.509, "category": "Healthcare", "category_score": 0.183380126953125, "subcategory": "Machine Learning", "subcategory_score": 0.9804644584655762, "runtime_cat": 41.697, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.757", "language_code": "en", "language_score": "0.9999961709717642", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "aptos 2019 blindness detection kernel design machine learning modelwhich help identifing eye disease imaged based problem use deep learning model design diabetic retinopathy affect blood vessel lightsensitive tissue called retina line back eye common cause vision loss among people diabetes leading cause vision impairment blindness among workingage adult dont earaly symtoms retena photography way detect stage blindness automating ml help lot health domain import required library loading data data visualization train test dataset data preprocessing image data generator model architecture design kera callback funcations transfer learning validation accuracy loss validation accuracy testtime augmentation visualization test result design cnn scratch use pretrain model blindness detection stage diabetic retinopathy dr mild moderate servere proliferative dr", "tags_descriptive": ["Deep Learning (DL)", "Exploratory Data Analysis", "Feature Engineering"]}