{"title": "CNN Segmentation + connected components 320x320", "description": "Approach Firstly a convolutional neural network is used to segment the image, using the bounding boxes directly as a mask.  Secondly connected components is used to separate multiple areas of predicted pneumonia. Finally a bounding box is simply drawn around every connected component.  Network The network consists of a number of residual blocks with convolutions and downsampling blocks with max pooling. At the end of the network a single upsampling layer converts the output to the same shape as the input.  As the input to the network is 256 by 256 (instead of the original 1024 by 1024) and the network downsamples a number of times without any meaningful upsampling (the final upsampling is just to match in 256 by 256 mask) the final prediction is very crude. If the network downsamples 4 times the final bounding boxes can only change with at least 16 pixels. Edit by EAS :  Change input image size to 320x320. Added transpose convolutions to allow greater flexibility in final predictions as per note above.", "link": "https://www.kaggle.com/skooch/cnn-segmentation-connected-components-320x320", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "skimage", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-28 09:23:09", "date_scraped": "2020-12-13 16:48:20", "words": 174, "sentences": 9, "runtime": 0.002, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.20361703634262085, "description_category_runtime": 14.605, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8732200264930725, "description_subcategory_runtime": 23.567, "category": "Biotechnological & Life Sciences", "category_score": 0.20361703634262085, "subcategory": "Machine Learning", "subcategory_score": 0.8732200264930725, "runtime_cat": 38.173, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.721", "language_code": "en", "language_score": "0.9999978092574262", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "approach firstly convolutional neural network used segment image using bounding box directly mask secondly connected component used separate multiple area predicted pneumonia finally bounding box simply drawn around every connected component network network consists number residual block convolution downsampling block max pooling end network single upsampling layer convert output shape input input network 256 256 instead original 1024 1024 network downsamples number time without meaningful upsampling final upsampling match 256 256 mask final prediction crude network downsamples 4 time final bounding box change least 16 pixel edit ea change input image size 320x320 added transpose convolution allow greater flexibility final prediction per note", "tags_descriptive": []}