{"title": "Search for a useful home-court advantage estimator", "description": "I'm trying to find a statistically meaningful (if I squint and cross my fingers) way determining home court advantage and factoring it out when predicting tourney games, which have no home court (in theory). I found this paper, it's old, but it looks interesting: The Home-Court Advantage: How Large Is It, and Does It Vary From Team to Team? David A. Harville and Michael H. Smith http://www.jstor.org/stable/2685080 It contains 3 models. The first is a basic least squares estimation of team ratings, similar (but predating) Massey's '97 paper. The second model adds a universal home court coefficient. The third estimates home court and away court coefficients for each team. My stats and python skills aren't the best, so take it as a given that there's error(s), caveat lector..... (Updated: I realized I got some of the models wrong and have updated them)", "link": "https://www.kaggle.com/baeng72/search-for-a-useful-home-court-advantage-estimator", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-03-02 12:18:20", "date_scraped": "2020-12-13 18:26:55", "words": 142, "sentences": 9, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.21429160237312317, "description_category_runtime": 14.091, "description_subcategory": "Student", "description_subcategory_score": 0.4445820748806, "description_subcategory_runtime": 22.043, "category": "Education & Research", "category_score": 0.21429160237312317, "subcategory": "Student", "subcategory_score": 0.4445820748806, "runtime_cat": 36.134, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.614", "language_code": "en", "language_score": "0.9999973828190509", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "im trying find statistically meaningful squint cross finger way determining home court advantage factoring predicting tourney game home court theory found paper old look interesting homecourt advantage large vary team team david harville michael h smith httpwwwjstororgstable2685080 contains 3 model first basic least square estimation team rating similar predating masseys 97 paper second model add universal home court coefficient third estimate home court away court coefficient team stats python skill arent best take given there error caveat lector updated realized got model wrong updated", "tags_descriptive": []}