{"title": "Simple EDA - Lightgbm autotuning w/Hyperopt ", "description": "Predicting Molecular PropertiesVisit my script of this kernel on: https://www.kaggle.com/kabure/lightgbm-full-pipeline-model and if you like it, please upvote the kernel =) DescriptionIn this competition, you will be predicting the scalar_coupling_constant between atom pairs in molecules, given the two atom types (e.g., C and H), the coupling type (e.g., 2JHC), and any features you are able to create from the molecule structure (xyz) files. For this competition, you will not be predicting all the atom pairs in each molecule rather, you will only need to predict the pairs that are explicitly listed in the train and test files. For example, some molecules contain Fluorine (F), but you will not be predicting the scalar coupling constant for any pair that includes F. The training and test splits are by molecule, so that no molecule in the training data is found in the test data.", "link": "https://www.kaggle.com/kabure/simple-eda-lightgbm-autotuning-w-hyperopt", "tags": ["Exploratory Data Analysis", "Model Comparison"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern", "h2o", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-22 16:10:17", "date_scraped": "2020-12-12 17:53:35", "words": 141, "sentences": 4, "runtime": 0.001, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.3010655641555786, "description_category_runtime": 14.548, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.5624964833259583, "description_subcategory_runtime": 23.015, "category": "Biotechnological & Life Sciences", "category_score": 0.3010655641555786, "subcategory": "Machine Learning", "subcategory_score": 0.5624964833259583, "runtime_cat": 37.563, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.745", "language_code": "en", "language_score": "0.9999948805008232", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predicting molecular propertiesvisit script kernel httpswwwkagglecomkaburelightgbmfullpipelinemodel like please upvote kernel descriptionin competition predicting scalar_coupling_constant atom pair molecule given two atom type eg c h coupling type eg 2jhc feature able create molecule structure xyz file competition predicting atom pair molecule rather need predict pair explicitly listed train test file example molecule contain fluorine f predicting scalar coupling constant pair includes f training test split molecule molecule training data found test data", "tags_descriptive": ["Exploratory Data Analysis", "Model Comparison"]}