{"title": "RAPIDS - Genetic Algorithm KNN - [CV 0.01840]", "description": "RAPIDS - Genetic Algorithm KNN - [CV 0.01840]The RAPIDS library is now available in all Kaggle notebooks. Hooray! Simply type import cuml or import cudf to load the two most popular packages. RAPIDS is described here. RAPIDS cuDF accelerates dataframe operations using GPU and has a similar api as Pandas. RAPIDS cuML accelerates machine learning algorithms using GPU and has a similar api as Scikit-Learn. Since RAPIDS ML algorithms are so fast, we can do things that were never possible like applying genetic algorithms to ML hyperparameter searchs! The ML algorithm kNN is very sensitive to the scaling of the feature columns. In this notebook, we find the weights for feature columns (0 <= w <= 1) using a genetic algorithm. This is similar to a feature selection algorithm like ridge regression which shrinks the importance of features. Alternatively we could mimic lasso regression if we choose only weights w = 0 and w = 1.", "link": "https://www.kaggle.com/cdeotte/rapids-genetic-algorithm-knn-cv-0-01840", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-11-18 23:48:56", "date_scraped": "2020-12-13 13:16:12", "words": 156, "sentences": 9, "runtime": 0.005, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.36934298276901245, "description_category_runtime": 14.858, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9820057153701782, "description_subcategory_runtime": 23.242, "category": "Real Estate, Rental & Leasing", "category_score": 0.36934298276901245, "subcategory": "Machine Learning", "subcategory_score": 0.9820057153701782, "runtime_cat": 38.1, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.716", "language_code": "en", "language_score": "0.9999970849723777", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "rapid genetic algorithm knn cv 001840the rapid library available kaggle notebook hooray simply type import cuml import cudf load two popular package rapid described rapid cudf accelerates dataframe operation using gpu similar api panda rapid cuml accelerates machine learning algorithm using gpu similar api scikitlearn since rapid ml algorithm fast thing never possible like applying genetic algorithm ml hyperparameter search ml algorithm knn sensitive scaling feature column notebook find weight feature column 0 w 1 using genetic algorithm similar feature selection algorithm like ridge regression shrink importance feature alternatively could mimic lasso regression choose weight w 0 w 1", "tags_descriptive": []}