{"title": "Testing MacroPCA Predictive Power - Winton", "description": "MotivationIn Progress In this previous kernel I ran MacroPCA on the 25 unknown given features.  Since what the features and specific rows represent are unknown, interpreting and evaluating the PCA is a little more tricky than normal.  I showed that there were a number of potentially problematic high-leverage rows though they were outnumbered by \"good\" highleverage points.  At this point it's unclear if this PCA will provide any value in making predictions. In order to try to answer this question I will run a regression on one of the total return target columns using only the PCA data and compare that to doing the same with the original data.  These checks will be done using a Random Forest Regressor and Suport Vector Regressor; these were chosen as I plan to use either extensions or similar methods for the full multi-output problem.  They also benefit from being easy and quick to run and train.", "link": "https://www.kaggle.com/rlagrois/testing-macropca-predictive-power-winton", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-25 15:27:38", "date_scraped": "2020-12-13 17:38:52", "words": 158, "sentences": 7, "runtime": 0.005, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.1494883894920349, "description_category_runtime": 13.327, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8915183544158936, "description_subcategory_runtime": 20.657, "category": "Real Estate, Rental & Leasing", "category_score": 0.1494883894920349, "subcategory": "Machine Learning", "subcategory_score": 0.8915183544158936, "runtime_cat": 33.985, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.675", "language_code": "en", "language_score": "0.9999959284479397", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "motivationin progress previous kernel ran macropca 25 unknown given feature since feature specific row represent unknown interpreting evaluating pca little tricky normal showed number potentially problematic highleverage row though outnumbered good highleverage point point unclear pca provide value making prediction order try answer question run regression one total return target column using pca data compare original data check done using random forest regressor suport vector regressor chosen plan use either extension similar method full multioutput problem also benefit easy quick run train", "tags_descriptive": []}