{"title": "Dog Breed ACGAN - [LB 52]", "description": "Conditional Dog Breed GANThis kernel is a A-C-Ra-LS-DC-GAN. Whoa that's a lot of letters! The A if for Auxiliary Classifier. The C is for Conditional GAN. The Ra is for Relativistic Average GAN. The LS is for Least Squares GAN. The DC is for Deep Convolutional GAN!  Conditional GANs are fun! When we train our GAN, we can associate each image (and seed) with one or more labels (classes). Afterwards, we can request our Generator to draw a dog with certain labels. For example, we can label every training image as either \"facing left\", \"facing center\", or \"facing right\". This is categorical feature one. Next we label every training image as either \"short hair\", \"long hair\", or \"no hair\". This is categorical feature two. Then we can ask our Generator to draw a dog that is \"facing left\" and has \"long hair\". Fun, right?! In this kernel, we will use one categorial feature, namely breed. After training our GAN, we can ask our Generator to draw a specific breed of dog! Keep in mind that this kernel is a work in progress. The GAN architecture and/or hyperparameters are not neccessarily optimal. Similar to most of you, I'm learning this stuff too. I encourage everyone to fork this kernel and improve it. UPDATE v17Kernel version 16 scores LB 100. This version scores LB 52. In addition to small changes, the following big changes were made:  Crop original images with square inside bounding box plus padding (80x80) Use data augmentation, random crops (64x64) Use dense layer of 121 sigmoid units before output unit Compute classification error on dense layer and add to discriminator's loss Compile training loop as tf.function for 2x speedup  Load and Crop Images", "link": "https://www.kaggle.com/cdeotte/dog-breed-acgan-lb-52", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-08-16 19:09:08", "date_scraped": "2020-12-12 20:11:09", "words": 287, "sentences": 20, "sum_nltk": "Conditional Dog Breed GANThis kernel is a A-C-Ra-LS-DC-GAN.\nThe C is for Conditional GAN.\nThe Ra is for Relativistic Average GAN.\nThe LS is for Least Squares GAN.\nThe DC is for Deep Convolutional GAN!\nConditional GANs are fun!\nWhen we train our GAN, we can associate each image (and seed) with one or more labels (classes).\nAfterwards, we can request our Generator to draw a dog with certain labels.\nFor example, we can label every training image as either \"facing left\", \"facing center\", or \"facing right\".\nNext we label every training image as either \"short hair\", \"long hair\", or \"no hair\".\nThis is categorical feature two.\nThis is categorical feature two.\nThen we can ask our Generator to draw a dog that is \"facing left\" and has \"long hair\".\nFun, right?!\nIn this kernel, we will use one categorial feature, namely breed.\nAfter training our GAN, we can ask our Generator to draw a specific breed of dog!\nKeep in mind that this kernel is a work in progress.\nThe GAN architecture and/or hyperparameters are not neccessarily optimal.\nI encourage everyone to fork this kernel and improve it.\nUPDATE v17Kernel version 16 scores LB 100.\nThis version scores LB 52.", "sum_nltk_words": 181, "sum_nltk_runtime": 0.004, "sum_t5": "a kernel called conditional dog breed can be used to train a dog. the kernel uses a category, namely breed, to train a dog. the kernel has been updated to score LB 100. it's still a work in progress. a san francisco-based kernel is available for download.. click here to download the kernel.. kernel.... /dev/gnu/gnu/gnu/gnu", "sum_t5_words": 55, "sum_t5_runtime": 6.715, "runtime": 0.0, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.041454873979091644, "nltk_category_runtime": 21.072, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8301934003829956, "nltk_subcategory_runtime": 34.104, "category": "Biotechnological & Life Sciences", "category_score": 0.041454873979091644, "subcategory": "Machine Learning", "subcategory_score": 0.8301934003829956, "runtime_cat": 55.178, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.716", "language_code": "en", "language_score": "0.9999971243703142", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "conditional dog breed ganthis kernel acralsdcgan whoa thats lot letter auxiliary classifier c conditional gan ra relativistic average gan l least square gan dc deep convolutional gan conditional gans fun train gan associate image seed one label class afterwards request generator draw dog certain label example label every training image either facing left facing center facing right categorical feature one next label every training image either short hair long hair hair categorical feature two ask generator draw dog facing left long hair fun right kernel use one categorial feature namely breed training gan ask generator draw specific breed dog keep mind kernel work progress gan architecture andor hyperparameters neccessarily optimal similar im learning stuff encourage everyone fork kernel improve update v17kernel version 16 score lb 100 version score lb 52 addition small change following big change made crop original image square inside bounding box plus padding 80x80 use data augmentation random crop 64x64 use dense layer 121 sigmoid unit output unit compute classification error dense layer add discriminator loss compile training loop tffunction 2x speedup load crop image", "tags_descriptive": []}