{"title": "Binary Image Classifier Training Demo", "description": "Training a binary image classifier for deepfakesEarlier I published this kernel that shows how to do inference on the Deepfakes competition. It includes a ResNeXt50 checkpoint that I trained on my own machine and that gets 0.46788 on the leaderboard. I did not include code for training that ResNeXt50 model because my process involves running a bunch of different scripts to create and clean up a training set, amongst other things. It's not feasible to do all of this in a Kaggle kernel. However, Kaggler dagnelies has made this dataset of face crops available. Using this dataset, we can actually train our model using a Kaggle kernel! Tip: Enable GPU for this. It's really slow using CPU.", "link": "https://www.kaggle.com/humananalog/binary-image-classifier-training-demo", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-01-26 14:36:45", "date_scraped": "2020-12-12 18:44:56", "words": 117, "sentences": 7, "runtime": 0.001, "description_category": "Utilities", "description_category_score": 0.02546975016593933, "description_category_runtime": 11.571, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9800361394882202, "description_subcategory_runtime": 17.426, "category": "Utilities", "category_score": 0.02546975016593933, "subcategory": "Machine Learning", "subcategory_score": 0.9800361394882202, "runtime_cat": 28.998, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.752", "language_code": "en", "language_score": "0.9999959679795816", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "training binary image classifier deepfakesearlier published kernel show inference deepfakes competition includes resnext50 checkpoint trained machine get 046788 leaderboard include code training resnext50 model process involves running bunch different script create clean training set amongst thing feasible kaggle kernel however kaggler dagnelies made dataset face crop available using dataset actually train model using kaggle kernel tip enable gpu really slow using cpu", "tags_descriptive": []}