{"title": "Injury Analysis", "description": "Injury Record: The injury record file in .csv format contains information on 105 lower-limb injuries that occurred during regular season games over the two seasons. Injuries can be linked to specific records in a player history using the PlayerKey, GameID, and PlayKey fields. ['PlayerKey', 'GameID', 'PlayKey', 'BodyPart', 'Surface', 'DM_M1',      'DM_M7', 'DM_M28', 'DM_M42'] Play List: – The play list file contains the details for the 267,005 player-plays that make up the dataset. Each play is indexed by PlayerKey, GameID, and PlayKey fields. Details about the game and play include the player’s assigned roster position, stadium type, field type, weather, play type, position for the play, and position group. ['PlayerKey', 'GameID', 'PlayKey', 'RosterPosition', 'PlayerDay',      'PlayerGame', 'StadiumType', 'FieldType', 'Temperature', 'Weather',      'PlayType', 'PlayerGamePlay', 'Position', 'PositionGroup'] Player Track Data: player level data that describes the location, orientation, speed, and direction of each player during a play recorded at 10 Hz (i.e. 10 observations recorded per second). ['PlayKey', 'time', 'event', 'x', 'y', 'dir', 'dis', 'o', 's']", "link": "https://www.kaggle.com/ravijoe/injury-analysis", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-01-01 18:02:01", "date_scraped": "2020-12-13 14:23:02", "words": 175, "sentences": 8, "runtime": 0.004, "description_category": "Utilities", "description_category_score": 0.5499881505966187, "description_category_runtime": 21.689, "description_subcategory": "Quality", "description_subcategory_score": 0.6735302805900574, "description_subcategory_runtime": 34.591, "category": "Utilities", "category_score": 0.5499881505966187, "subcategory": "Quality", "subcategory_score": 0.6735302805900574, "runtime_cat": 56.28, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.667", "language_code": "en", "language_score": "0.9999958070808881", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "injury record injury record file csv format contains information 105 lowerlimb injury occurred regular season game two season injury linked specific record player history using playerkey gameid playkey field playerkey gameid playkey bodypart surface dm_m1 dm_m7 dm_m28 dm_m42 play list play list file contains detail 267005 playerplays make dataset play indexed playerkey gameid playkey field detail game play include player assigned roster position stadium type field type weather play type position play position group playerkey gameid playkey rosterposition playerday playergame stadiumtype fieldtype temperature weather playtype playergameplay position positiongroup player track data player level data describes location orientation speed direction player play recorded 10 hz ie 10 observation recorded per second playkey time event x dir dis", "tags_descriptive": ["Exploratory Data Analysis"]}