{"title": "Madness at Home and on the Court - Part 2", "description": "Madness at Home and on the Court - Part 2Authors: Emilien Etchevers, Kieran Janin, Michael Karpe, Remi Le Thai, Haley Wohlever ContentsIn the first notebook  Introduction  NCAA March Madness Data Analysis Seeding and Entertainment Madness through Unpredictability Entertainment due to Closeness of Games    In this notebook  Tweets on NCAA Data Analysis Temporal Evolution of Engagement Team Mentions Count in Tweets Sentiment Analysis for Tweets on NCAA   Conclusion  3. Tweets on NCAA DataAfter thoroughly exploring the NCAA data, we decided to extend our analysis by studying relevant tweets published during the 2015 to 2019 NCAA March Madness tournaments. We built a database of 1.6 million tweets containing the word NCAA, using the GetOldTweets3 library. The dataset we built with this library is available here (as well as a processed version here to avoid memory issues). The purpose of this second part of our analysis is to identify trends in tweets published during and related to the competition. As discussed in Part 1, we want to distinguish an objective madness, explainable by match and player data, from a subjective madness that can be observed in the public sentiment surrounding the games. 3.1. Temporal Evolution of EngagementWe first study engagement on Twitter. Engagement on Twitter is defined by three types of actions: retweets, replies, and favorites (or likes). We plot the evolution of the number of each of these actions over the 21 days of the competition for each season, as well as the evolution of the number of tweets. While we can see that the number of tweets including the word NCAA tends to slightly decrease over the years (or at least remains constant), we can observe an increase in the number of retweets and replies over the years. We also note an even higher increase in the number of favorites, this latest observation showing that people tend to express themselves more and more using the favorites feature on Twitter.", "link": "https://www.kaggle.com/mika30/madness-at-home-and-on-the-court-part-2", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "nltk", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-01 01:43:02", "date_scraped": "2020-12-12 20:19:12", "words": 327, "sentences": 12, "sum_nltk": "Madness at Home and on the Court - Part 2Authors: Emilien Etchevers, Kieran Janin, Michael Karpe, Remi Le Thai, Haley Wohlever ContentsIn the first notebook  Introduction  NCAA March Madness Data Analysis Seeding and Entertainment Madness through Unpredictability Entertainment due to Closeness of Games    In this notebook  Tweets on NCAA Data Analysis Temporal Evolution of Engagement Team Mentions Count in Tweets Sentiment Analysis for Tweets on NCAA   Conclusion  3.\nTweets on NCAA DataAfter thoroughly exploring the NCAA data, we decided to extend our analysis by studying relevant tweets published during the 2015 to 2019 NCAA March Madness tournaments.\nWe built a database of 1.6 million tweets containing the word NCAA, using the GetOldTweets3 library.\nThe purpose of this second part of our analysis is to identify trends in tweets published during and related to the competition.\nTemporal Evolution of EngagementWe first study engagement on Twitter.\nEngagement on Twitter is defined by three types of actions: retweets, replies, and favorites (or likes).\nWhile we can see that the number of tweets including the word NCAA tends to slightly decrease over the years (or at least remains constant), we can observe an increase in the number of retweets and replies over the years.", "sum_nltk_words": 203, "sum_nltk_runtime": 0.003, "sum_t5": "the purpose of this second part of our analysis is to identify trends in tweets published during and related to the tournament. we built a database of 1.6 million tweets containing the word NCAA, using the GetOldTweets3 library. the number of tweets including the word NCAA tends to decrease over the years. we also note an even higher increase in the number of favorites. the number of tweets including the word NCAA is also increasing.", "sum_t5_words": 75, "sum_t5_runtime": 6.098, "runtime": 0.004, "nltk_category": "Utilities", "nltk_category_score": 0.44095948338508606, "nltk_category_runtime": 19.417, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.6336991190910339, "nltk_subcategory_runtime": 30.426, "category": "Utilities", "category_score": 0.44095948338508606, "subcategory": "Tools", "subcategory_score": 0.6336991190910339, "runtime_cat": 49.843, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.618", "language_code": "en", "language_score": "0.9999953540952348", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "madness home court part 2authors emilien etchevers kieran janin michael karpe remi le thai haley wohlever contentsin first notebook introduction ncaa march madness data analysis seeding entertainment madness unpredictability entertainment due closeness game notebook tweet ncaa data analysis temporal evolution engagement team mention count tweet sentiment analysis tweet ncaa conclusion 3 tweet ncaa dataafter thoroughly exploring ncaa data decided extend analysis studying relevant tweet published 2015 2019 ncaa march madness tournament built database 16 million tweet containing word ncaa using getoldtweets3 library dataset built library available well processed version avoid memory issue purpose second part analysis identify trend tweet published related competition discussed part 1 want distinguish objective madness explainable match player data subjective madness observed public sentiment surrounding game 31 temporal evolution engagementwe first study engagement twitter engagement twitter defined three type action retweets reply favorite like plot evolution number action 21 day competition season well evolution number tweet see number tweet including word ncaa tends slightly decrease year least remains constant observe increase number retweets reply year also note even higher increase number favorite latest observation showing people tend express using favorite feature twitter", "tags_descriptive": []}