{"title": "NFL: Punt Rule Changes (Interactive Plots)", "description": "NFL EDA Due to a large number of animations, this notebook may take a minute or two to display fully!  So this is the first data analytics style competition that Kaggle has run, and what a way to start it! I think there will be numerous benefits to running competitions like these mainly the fact that your avoiding data leaks, your opening the competitive aspect of kaggle to people who may not have a large amount of knowledge or interest in the machine learning side of things and finally I think the noticebly short timeframe is also a positive in my opinon. I often monitor the competitions running on Kaggle and the process is quite long. Shorter competitions like this one could be a game changer (pun intended!). Now that I have finished my brief rant, I must confess that I know almost nothing about American football. I have watched two or three superbowl finals and found them to be quite a spectacle but never really understood anything about the game itself. Hopefully partaking in this competition will change that. Table of Contents1. Basic NFL Rules  2. What Causes Concussion  3. The Punt  4. EDA  4.1 Concussion EDA  4.2 Punt Returner Analysis  4.2.1 First Rule Change  4.2.2 Second Rule Change  4.3 PRG & PLG Analysis  4.3 Third Rule Change", "link": "https://www.kaggle.com/garlsham/nfl-punt-rule-changes-interactive-plots", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-01-11 01:13:42", "date_scraped": "2020-12-13 14:25:09", "words": 229, "sentences": 11, "sum_nltk": "NFL EDA Due to a large number of animations, this notebook may take a minute or two to display fully!\nSo this is the first data analytics style competition that Kaggle has run, and what a way to start it!\nI think there will be numerous benefits to running competitions like these mainly the fact that your avoiding data leaks, your opening the competitive aspect of kaggle to people who may not have a large amount of knowledge or interest in the machine learning side of things and finally I think the noticebly short timeframe is also a positive in my opinon.\nI often monitor the competitions running on Kaggle and the process is quite long.\nShorter competitions like this one could be a game changer (pun intended!).\nI have watched two or three superbowl finals and found them to be quite a spectacle but never really understood anything about the game itself.\nHopefully partaking in this competition will change that.\nBasic NFL Rules  2.\nWhat Causes Concussion  3.\nThe Punt  4.\nEDA  4.1 Concussion EDA  4.2 Punt Returner Analysis  4.2.1 First Rule Change  4.2.2 Second Rule Change  4.3 PRG & PLG Analysis  4.3 Third Rule Change", "sum_nltk_words": 196, "sum_nltk_runtime": 0.003, "sum_t5": "NFL EDA This is the first data analytics style competition that Kaggle has run. john sutter: this is a great way to start a competition. he says he knows almost nothing about american football. sutter: i'm excited to see how this competition goes. sutter: i'm a big fan of the nfl and this competition is a great start. sutter:", "sum_t5_words": 59, "sum_t5_runtime": 4.576, "runtime": 0.002, "nltk_category": "Emergency & Relief", "nltk_category_score": 0.006178792100399733, "nltk_category_runtime": 18.731, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.2431272268295288, "nltk_subcategory_runtime": 29.919, "category": "Emergency & Relief", "category_score": 0.006178792100399733, "subcategory": "Student", "subcategory_score": 0.2431272268295288, "runtime_cat": 48.65, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.687", "language_code": "en", "language_score": "0.9999974764739679", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "nfl eda due large number animation notebook may take minute two display fully first data analytics style competition kaggle run way start think numerous benefit running competition like mainly fact avoiding data leak opening competitive aspect kaggle people may large amount knowledge interest machine learning side thing finally think noticebly short timeframe also positive opinon often monitor competition running kaggle process quite long shorter competition like one could game changer pun intended finished brief rant must confess know almost nothing american football watched two three superbowl final found quite spectacle never really understood anything game hopefully partaking competition change table contents1 basic nfl rule 2 cause concussion 3 punt 4 eda 41 concussion eda 42 punt returner analysis 421 first rule change 422 second rule change 43 prg plg analysis 43 third rule change", "tags_descriptive": ["Exploratory Data Analysis"]}