{"title": "Bounding Box Model", "description": "Bounding Box ModelThis notebook explains how to generage a bounding box model. While many of the whale pictures in the dataset are already cropped tight around the whale fluke, in some images the whale fluke occupies only a small area of the picture. Zooming in the relevant part of the picture provides greater accuracy to a classification model. To automate the process, this notebook explains how to construct a convolutional neural network (CNN) capable of estimating the whale bounding box. Using this model, whale pictures can be cropped automatically to a more uniform appearance. This facilitates training of classification models, and improves the test accuracy. Training of the bounding box model is performed over a dataset of 1200 bounding boxes for pictures selected from the Humpback Whale Identification Challenge training set. 1000 pictures are used for training, while 200 are reserved for validation.", "link": "https://www.kaggle.com/martinpiotte/bounding-box-model", "tags": ["CV"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-06-30 01:52:42", "date_scraped": "2020-12-13 18:17:20", "words": 143, "sentences": 8, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.15825507044792175, "description_category_runtime": 12.503, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9426389336585999, "description_subcategory_runtime": 19.056, "category": "Utilities", "category_score": 0.15825507044792175, "subcategory": "Machine Learning", "subcategory_score": 0.9426389336585999, "runtime_cat": 31.559, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.781", "language_code": "en", "language_score": "0.9999962877444528", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "bounding box modelthis notebook explains generage bounding box model many whale picture dataset already cropped tight around whale fluke image whale fluke occupies small area picture zooming relevant part picture provides greater accuracy classification model automate process notebook explains construct convolutional neural network cnn capable estimating whale bounding box using model whale picture cropped automatically uniform appearance facilitates training classification model improves test accuracy training bounding box model performed dataset 1200 bounding box picture selected humpback whale identification challenge training set 1000 picture used training 200 reserved validation", "tags_descriptive": ["Computer Vision (CV)"]}