{"title": "Trajectory Animation + EDA", "description": "Simple  Events EDA  - TrackML Particle TrackingIn this notebook, I have explored the dataset provied in the TrackML Particle Tracking Challenge. The dataset comprises of multiple independent events, where each event contains simulated measurements (essentially 3D points) of particles generated in a collision between proton bunches at the Large Hadron Collider at CERN. The goal of this challenge is to group the recorded measurements or hits for each event into tracks, sets of hits that belong to the same initial particle. A solution must uniquely associate each hit to one track. The training dataset contains the recorded hits, their ground truth counterpart and their association to particles, and the initial parameters of those particles. Contents   Read Event Files  Read - Cells, Particles, Truth, Hits Files   Exploring Cells Dataset 3.1 Distribution of cells.ch0 3.2 Distribution of cells.ch1 3.3 Distribution of cells.value 3.4 mean of \"cells.value\" by ch0 and ch1   Exploring Hits Data 4.1 X, Y, Z global coordinates of particles 4.2 Layer Id for every hit 4.3 Module Id for every hit 4.4 Volume Id for every hit 4.5 Distance of particles from Origin 4.6 Initial Position of particles in 3d space   Exploring Particles Data 5.1 Animated trajectory of a positively charged particle 5.2 Animated trajectory of a negatively charged particle 5.3 Plotting the initial x, y, and z coordinates of particles 5.4 Distribution of positively and negatively charged particles 5.5 Distribution of number of hits for different particles   Exploring Truths Data 6.1 Truth Data weight per id", "link": "https://www.kaggle.com/shivamb/trajectory-animation-eda", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-05-03 13:03:13", "date_scraped": "2020-12-13 17:43:28", "words": 260, "sentences": 6, "sum_nltk": "Simple  Events EDA  - TrackML Particle TrackingIn this notebook, I have explored the dataset provied in the TrackML Particle Tracking Challenge.\nThe dataset comprises of multiple independent events, where each event contains simulated measurements (essentially 3D points) of particles generated in a collision between proton bunches at the Large Hadron Collider at CERN.\nThe goal of this challenge is to group the recorded measurements or hits for each event into tracks, sets of hits that belong to the same initial particle.\nA solution must uniquely associate each hit to one track.\nThe training dataset contains the recorded hits, their ground truth counterpart and their association to particles, and the initial parameters of those particles.\nContents   Read Event Files  Read - Cells, Particles, Truth, Hits Files   Exploring Cells Dataset 3.1 Distribution of cells.ch0 3.2 Distribution of cells.ch1 3.3 Distribution of cells.value 3.4 mean of \"cells.value\" by ch0 and ch1   Exploring Hits Data 4.1 X, Y, Z global coordinates of particles 4.2 Layer Id for every hit 4.3 Module Id for every hit 4.4 Volume Id for every hit 4.5 Distance of particles from Origin 4.6 Initial Position of particles in 3d space   Exploring Particles Data 5.1 Animated trajectory of a positively charged particle 5.2 Animated trajectory of a negatively charged particle 5.3 Plotting the initial x, y, and z coordinates of particles 5.4 Distribution of positively and negatively charged particles 5.5 Distribution of number of hits for different particles   Exploring Truths Data 6.1 Truth Data weight per id", "sum_nltk_words": 255, "sum_nltk_runtime": 0.003, "sum_t5": "the goal of this challenge is to group the recorded measurements or hits for each event into tracks. a solution must uniquely associate each hit to one track. the training dataset contains the recorded hits, their ground truth counterpart and their association to particles. the dataset comprises of multiple independent events. each event contains simulated measurements (essentially 3D points) of particles generated in a collision between proton bunches at the Large Hadron Collider at CERN.", "sum_t5_words": 75, "sum_t5_runtime": 5.57, "runtime": 0.0, "nltk_category": "Physics", "nltk_category_score": 0.4949151575565338, "nltk_category_runtime": 24.263, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.5999987721443176, "nltk_subcategory_runtime": 38.926, "category": "Physics", "category_score": 0.4949151575565338, "subcategory": "Tools", "subcategory_score": 0.5999987721443176, "runtime_cat": 63.189, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.7", "language_code": "en", "language_score": "0.9999971546343369", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "simple event eda trackml particle trackingin notebook explored dataset provied trackml particle tracking challenge dataset comprises multiple independent event event contains simulated measurement essentially 3d point particle generated collision proton bunch large hadron collider cern goal challenge group recorded measurement hit event track set hit belong initial particle solution must uniquely associate hit one track training dataset contains recorded hit ground truth counterpart association particle initial parameter particle content read event file read cell particle truth hit file exploring cell dataset 31 distribution cellsch0 32 distribution cellsch1 33 distribution cellsvalue 34 mean cellsvalue ch0 ch1 exploring hit data 41 x z global coordinate particle 42 layer id every hit 43 module id every hit 44 volume id every hit 45 distance particle origin 46 initial position particle 3d space exploring particle data 51 animated trajectory positively charged particle 52 animated trajectory negatively charged particle 53 plotting initial x z coordinate particle 54 distribution positively negatively charged particle 55 distribution number hit different particle exploring truth data 61 truth data weight per id", "tags_descriptive": ["Exploratory Data Analysis"]}