{"title": "Epidemic Model COVID-19 India + Visualizations", "description": "Live COVID -19 Tracking World and India  FIRST   THEN  The 2019–20 coronavirus pandemic is an ongoing pandemic of coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). The outbreak was identified in Wuhan, China, in December 2019, declared to be a Public Health Emergency of International Concern on 30 January 2020, and recognized as a pandemic by the World Health Organization on 11 March 2020. As of 16 April 2020, more than 2.1 million cases of COVID-19 have been reported in 210 countries and territories, resulting in more than 140,000 deaths. More than 532,000 people have recovered, although there may be a possibility of relapse or reinfection. The deaths per diagnosed cases varies significantly between countries. The virus is primarily spread between people during close contact, often via small droplets produced by coughing, sneezing, or talking. While these droplets are produced when breathing out, they usually fall to the ground or onto surfaces rather than being infectious over long distances. People may also become infected by touching a contaminated surface and then touching their eyes, nose or mouth. The virus can survive on surfaces, up to 72 hours on some It is most contagious during the first three days after the onset of symptoms, although spread may be possible before symptoms appear and in later stages of the disease Common symptoms include fever, cough and shortness of breath. Complications may include pneumonia and acute respiratory distress syndrome.The time from exposure to onset of symptoms is typically around five days, but may range from two to fourteen days There is no known vaccine or specific antiviral treatment. Primary treatment is symptomatic and supportive therapy. Recommended preventive measures include hand washing, covering one's mouth when coughing, maintaining distance from other people, and monitoring and self-isolation for people who suspect they are infected. Authorities worldwide have responded by implementing travel restrictions, quarantines, curfews and stay-at-home orders, workplace hazard controls, and facility closures.", "link": "https://www.kaggle.com/chekoduadarsh/epidemic-model-covid-19-india-visualizations", "tags": ["DL", "Healthcare"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-10-22 07:34:46", "date_scraped": "2020-12-12 18:17:36", "words": 327, "sentences": 13, "sum_nltk": "Live COVID -19 Tracking World and India  FIRST   THEN  The 2019–20 coronavirus pandemic is an ongoing pandemic of coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2).\nThe virus is primarily spread between people during close contact, often via small droplets produced by coughing, sneezing, or talking.\nWhile these droplets are produced when breathing out, they usually fall to the ground or onto surfaces rather than being infectious over long distances.\nPeople may also become infected by touching a contaminated surface and then touching their eyes, nose or mouth.\nThe virus can survive on surfaces, up to 72 hours on some It is most contagious during the first three days after the onset of symptoms, although spread may be possible before symptoms appear and in later stages of the disease Common symptoms include fever, cough and shortness of breath.\nComplications may include pneumonia and acute respiratory distress syndrome.The time from exposure to onset of symptoms is typically around five days, but may range from two to fourteen days There is no known vaccine or specific antiviral treatment.\nRecommended preventive measures include hand washing, covering one's mouth when coughing, maintaining distance from other people, and monitoring and self-isolation for people who suspect they are infected.", "sum_nltk_words": 206, "sum_nltk_runtime": 0.003, "sum_t5": "more than 140,000 people have died from the coronavirus disease 2019 pandemic. the virus is primarily spread between people during close contact. authorities worldwide have responded by implementing travel restrictions, curfews and stay-at-home orders. the virus can survive on surfaces, up to 72 hours on some. a spokesman for the fda says there is no vaccine or antiviral treatment. a spokesman for the fda says the virus is not a", "sum_t5_words": 70, "sum_t5_runtime": 6.778, "runtime": 0.01, "nltk_category": "Healthcare", "nltk_category_score": 0.6166113615036011, "nltk_category_runtime": 18.564, "nltk_subcategory": "Life-sciences", "nltk_subcategory_score": 0.8207085728645325, "nltk_subcategory_runtime": 30.12, "category": "Healthcare", "category_score": 0.6166113615036011, "subcategory": "Life-sciences", "subcategory_score": 0.8207085728645325, "runtime_cat": 48.685, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.745", "language_code": "en", "language_score": "0.9999980357074126", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "live covid 19 tracking world india first 201920 coronavirus pandemic ongoing pandemic coronavirus disease 2019 covid19 caused severe acute respiratory syndrome coronavirus 2 sarscov2 outbreak identified wuhan china december 2019 declared public health emergency international concern 30 january 2020 recognized pandemic world health organization 11 march 2020 16 april 2020 21 million case covid19 reported 210 country territory resulting 140000 death 532000 people recovered although may possibility relapse reinfection death per diagnosed case varies significantly country virus primarily spread people close contact often via small droplet produced coughing sneezing talking droplet produced breathing usually fall ground onto surface rather infectious long distance people may also become infected touching contaminated surface touching eye nose mouth virus survive surface 72 hour contagious first three day onset symptom although spread may possible symptom appear later stage disease common symptom include fever cough shortness breath complication may include pneumonia acute respiratory distress syndromethe time exposure onset symptom typically around five day may range two fourteen day known vaccine specific antiviral treatment primary treatment symptomatic supportive therapy recommended preventive measure include hand washing covering one mouth coughing maintaining distance people monitoring selfisolation people suspect infected authority worldwide responded implementing travel restriction quarantine curfew stayathome order workplace hazard control facility closure", "tags_descriptive": ["Deep Learning (DL)", "Healthcare"]}