{"title": "Private LB Simulation I", "description": "Private LB SimulationPART I: Private Dataset [5 min read]  I'm back! no more discussions about memorizers or rules, it's boring. I think this can help everyone, no matter what kind of GAN you use: memorizer, GAN, CGAN, RaLSGAN etc In this kernel I simulate the private dataset! And we'll see if the dataset we use to generate matters when it comes to getting a good result. This took me some time, so I hope you'll appreciate it if it works for you. Remember, the upvote button is near the fork button. And as you see, the title says part I, the part II is about the mysterious pretrained NN ;)  Datasets PetFinder.my Adoption Prediction Dogs vs. Cats Dog Breed Identification  CIFAR-10  Why this datasets could be the private dataset aka \"mysterious private dog images\" ? We are using Stanford Dogs Dataset, it's public, like these others datasets. For example, CIFAR-10 is also a well known dataset and has dogs images (among others). But keep reading, you'll see the best part soon ;) My test Train using these datasets and generate User Generate N Dogs Images Use as Mysterious NN the inception model (risky hypothesis) Use as Mysterious Dog Dataset (private) the Generative Dogs Dataset  In other words, I do the opposite of what kaggle does. Let's see if the dog dataset we use to generate images is important when it comes to getting a great LB score! If the results do not vary much, then perhaps the dataset is not important   NOTE  I can't import all these datasets (the kernel doesn't start properly) so I only import 2 of them (my winning horses) You'll see this kernel has many versions, probably I'll try one different dataset in each version.", "link": "https://www.kaggle.com/jesucristo/private-lb-simulation-i", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-18 04:19:27", "date_scraped": "2020-12-12 18:55:48", "words": 297, "sentences": 9, "sum_nltk": "Private LB SimulationPART I: Private Dataset [5 min read]  I'm back!\nI think this can help everyone, no matter what kind of GAN you use: memorizer, GAN, CGAN, RaLSGAN etc In this kernel I simulate the private dataset!\nAnd we'll see if the dataset we use to generate matters when it comes to getting a good result.\nAnd as you see, the title says part I, the part II is about the mysterious pretrained NN ;)  Datasets PetFinder.my Adoption Prediction Dogs vs.\nCats Dog Breed Identification  CIFAR-10  Why this datasets could be the private dataset aka \"mysterious private dog images\" ?\nWe are using Stanford Dogs Dataset, it's public, like these others datasets.\nFor example, CIFAR-10 is also a well known dataset and has dogs images (among others).\nBut keep reading, you'll see the best part soon ;) My test Train using these datasets and generate User Generate N Dogs Images Use as Mysterious NN the inception model (risky hypothesis) Use as Mysterious Dog Dataset (private) the Generative Dogs Dataset  In other words, I do the opposite of what kaggle does.\nLet's see if the dog dataset we use to generate images is important when it comes to getting a great LB score!", "sum_nltk_words": 200, "sum_nltk_runtime": 0.003, "sum_t5": "this kernel simulates the private dataset. the results will be compared to the public dataset. the kernel has many versions. it's not easy to test this kernel.. if you want to see the results, please share your thoughts.......................", "sum_t5_words": 38, "sum_t5_runtime": 5.954, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.26302576065063477, "nltk_category_runtime": 19.872, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9430752396583557, "nltk_subcategory_runtime": 32.24, "category": "Education & Research", "category_score": 0.26302576065063477, "subcategory": "Machine Learning", "subcategory_score": 0.9430752396583557, "runtime_cat": 52.114, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.661", "language_code": "en", "language_score": "0.9999978035106235", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "private lb simulationpart private dataset 5 min read im back discussion memorizer rule boring think help everyone matter kind gan use memorizer gan cgan ralsgan etc kernel simulate private dataset well see dataset use generate matter come getting good result took time hope youll appreciate work remember upvote button near fork button see title say part part ii mysterious pretrained nn datasets petfindermy adoption prediction dog v cat dog breed identification cifar10 datasets could private dataset aka mysterious private dog image using stanford dog dataset public like others datasets example cifar10 also well known dataset dog image among others keep reading youll see best part soon test train using datasets generate user generate n dog image use mysterious nn inception model risky hypothesis use mysterious dog dataset private generative dog dataset word opposite kaggle let see dog dataset use generate image important come getting great lb score result vary much perhaps dataset important note cant import datasets kernel doesnt start properly import 2 winning horse youll see kernel many version probably ill try one different dataset version", "tags_descriptive": []}