{"title": "Predicting Tags For the Questions in SatckOverflow", "description": "What is StackOverflowDescriptionStack Overflow is the largest, most trusted online community for developers to learn, share their programming knowledge, and build their careers. It is something which every programmer use one way or another. Each month, over 50 million developers come to Stack Overflow to learn, share their knowledge, and build their careers. It features questions and answers on a wide range of topics in computer programming. The website serves as a platform for users to ask and answer questions, and, through membership and active participation, to vote questions and answers up or down and edit questions and answers in a fashion similar to a wiki or Digg. As of April 2014 Stack Overflow has over 4,000,000 registered users, and it exceeded 10,000,000 questions in late August 2015. Based on the type of tags assigned to questions, the top eight most discussed topics on the site are: Java, JavaScript, C#, PHP, Android, jQuery, Python and HTML. https://stackoverflow.com/.Business ProblemThe problem says that we will be provided a bunch of questions. A question in Stack Overflow contains three segments Title, Description and Tags. By using the text in the title and description we should suggest the tags related to the subject of the question automatically. These tags are extremely important for the proper working of Stack Overflow.", "link": "https://www.kaggle.com/koredla25/predicting-tags-for-the-questions-in-satckoverflow", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "nltk"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-08-04 09:08:42", "date_scraped": "2020-12-12 19:26:25", "words": 215, "sentences": 11, "sum_nltk": "What is StackOverflowDescriptionStack Overflow is the largest, most trusted online community for developers to learn, share their programming knowledge, and build their careers.\nEach month, over 50 million developers come to Stack Overflow to learn, share their knowledge, and build their careers.\nIt features questions and answers on a wide range of topics in computer programming.\nThe website serves as a platform for users to ask and answer questions, and, through membership and active participation, to vote questions and answers up or down and edit questions and answers in a fashion similar to a wiki or Digg.\nAs of April 2014 Stack Overflow has over 4,000,000 registered users, and it exceeded 10,000,000 questions in late August 2015.\nBased on the type of tags assigned to questions, the top eight most discussed topics on the site are: Java, JavaScript, C#, PHP, Android, jQuery, Python and HTML.\nhttps://stackoverflow.com/.Business ProblemThe problem says that we will be provided a bunch of questions.\nA question in Stack Overflow contains three segments Title, Description and Tags.\nBy using the text in the title and description we should suggest the tags related to the subject of the question automatically.\nThese tags are extremely important for the proper working of Stack Overflow.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.003, "sum_t5": "Stack Overflow is the largest, most trusted online community for developers. it features questions and answers on a wide range of topics in computer programming. the top eight most discussed topics on the site are: Java, JavaScript, C#, PHP, Android. Stack Overflow has over 4,000,000 registered users, and it exceeded 10,000,000 questions in late august 2015. a question in Stack Overflow contains three segments Title, Description and Tags.", "sum_t5_words": 68, "sum_t5_runtime": 4.559, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.4389062523841858, "nltk_category_runtime": 18.551, "nltk_subcategory": "Textual Analysis", "nltk_subcategory_score": 0.5007570385932922, "nltk_subcategory_runtime": 29.536, "category": "Utilities", "category_score": 0.4389062523841858, "subcategory": "Textual Analysis", "subcategory_score": 0.5007570385932922, "runtime_cat": 48.087, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.581", "language_code": "en", "language_score": "0.9999949568085792", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "stackoverflowdescriptionstack overflow largest trusted online community developer learn share programming knowledge build career something every programmer use one way another month 50 million developer come stack overflow learn share knowledge build career feature question answer wide range topic computer programming website serf platform user ask answer question membership active participation vote question answer edit question answer fashion similar wiki digg april 2014 stack overflow 4000000 registered user exceeded 10000000 question late august 2015 based type tag assigned question top eight discussed topic site java javascript c php android jquery python html httpsstackoverflowcombusiness problemthe problem say provided bunch question question stack overflow contains three segment title description tag using text title description suggest tag related subject question automatically tag extremely important proper working stack overflow", "tags_descriptive": []}