{"title": "iMaterialist (Fashion) 2019 at FGVC6 - EDA", "description": "Fine-grained segmentation task for fashion and appareliMaterialist (Fashion) 2019 at FGVC6 with dataset Designers know what they are creating, but what, and how, do people really wear their products? What combinations of products are people using? In this competition, we challenge you to develop algorithms that will help with an important step towards automatic product detection – to accurately assign segmentations and attribute labels for fashion images. Visual analysis of clothing is a topic that has received increasing attention in recent years. Being able to recognize apparel products and associated attributes from pictures could enhance the shopping experience for consumers, and increase work efficiency for fashion professionals. We present a new clothing dataset with the goal of introducing a novel fine-grained segmentation task by joining forces between the fashion and computer vision communities. The proposed task unifies both categorization and segmentation of rich and complete apparel attributes, an important step toward real-world applications.", "link": "https://www.kaggle.com/hyeonho/imaterialist-fashion-2019-at-fgvc6-eda", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-30 11:49:30", "date_scraped": "2020-12-13 11:35:56", "words": 153, "sentences": 5, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.21991729736328125, "description_category_runtime": 13.163, "description_subcategory": "Student", "description_subcategory_score": 0.49126800894737244, "description_subcategory_runtime": 21.017, "category": "Wholesale & Retail", "category_score": 0.21991729736328125, "subcategory": "Student", "subcategory_score": 0.49126800894737244, "runtime_cat": 34.18, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.674", "language_code": "en", "language_score": "0.9999959336887017", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "finegrained segmentation task fashion apparelimaterialist fashion 2019 fgvc6 dataset designer know creating people really wear product combination product people using competition challenge develop algorithm help important step towards automatic product detection accurately assign segmentation attribute label fashion image visual analysis clothing topic received increasing attention recent year able recognize apparel product associated attribute picture could enhance shopping experience consumer increase work efficiency fashion professional present new clothing dataset goal introducing novel finegrained segmentation task joining force fashion computer vision community proposed task unifies categorization segmentation rich complete apparel attribute important step toward realworld application", "tags_descriptive": []}