{"title": "NeuroImaging: In Depth Understanding,EDA,Model", "description": "About this notebook...A/c to me, this is one of the best competition on kaggle. It give you a chance to learn some cool new things on kaggle and broad you knowledge in Datascience. As already written in Introduction, Human brain research is among the most complex areas of study for scientists. We know that age and other factors can affect its function and structure, but more research is needed into what specifically occurs within the brain. With much of the research using MRI scans, data scientists are well positioned to support future insights. In particular, neuroimaging specialists look for measurable markers of behavior, health, or disorder to help identify relevant brain regions and their contribution to typical or symptomatic effects. I try my level best to give all things as simple as possible.", "link": "https://www.kaggle.com/saife245/neuroimaging-in-depth-understanding-eda-model", "tags": ["DL", "Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-17 18:36:27", "date_scraped": "2020-12-13 17:52:38", "words": 133, "sentences": 7, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.05366113409399986, "description_category_runtime": 11.567, "description_subcategory": "Student", "description_subcategory_score": 0.13067509233951569, "description_subcategory_runtime": 17.837, "category": "Education & Research", "category_score": 0.05366113409399986, "subcategory": "Student", "subcategory_score": 0.13067509233951569, "runtime_cat": 29.404, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.694", "language_code": "en", "language_score": "0.9999978791863774", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notebookac one best competition kaggle give chance learn cool new thing kaggle broad knowledge datascience already written introduction human brain research among complex area study scientist know age factor affect function structure research needed specifically occurs within brain much research using mri scan data scientist well positioned support future insight particular neuroimaging specialist look measurable marker behavior health disorder help identify relevant brain region contribution typical symptomatic effect try level best give thing simple possible", "tags_descriptive": ["Deep Learning (DL)", "Exploratory Data Analysis"]}