{"title": "Geek Girls Rising : Myth or Reality!", "description": "An analysis of the 2019 Kaggle ML and DS Survey for Women's Representation in Machine Learning and Data Science Pic Credits:rawpixel.com / Freepik Women in tech didn't matter to people until tech started mattering to people: Rachel Sklar  In the last few years, a lot of effort has being made in society to increase women's representation in the tech world. The idea behind these efforts is that attracting and retaining more women in science, technology, engineering, and mathematics (STEM) will ultimately enhance innovation and creativity. When women are not involved in these fields, experiences, needs, and desires that are unique to women may be overlooked. It is not that there aren't any female role models out there to inspire us. Do you remember the iconic photograph of Katie Bouman in 2019, watching the black hole's first photograph as it was being reconstructed? Not only was it a breakthrough moment for the scientific community, but an equally proud one for all the women scientists all over the world. A historic moment not just for science, but for women in science, too.  Similarly, women have also been making significant contributions to the fields of Machine Learning and Data Science. Be it Margaret Hamilton or Grace Hopper in the past or Corinna Cortes and Fei Fei Li today; women have made their presence felt with their work. More and more girls are being motivated to take up science and research in school and colleges. A lot of companies today are coming forward to change the world of work. This year, even the United Nations celebrated International Women's Day under the official theme #BalanceforBetter, advocating a more gender-balanced world. However, as it may seem, not everything is still so \"gung-ho\" when it comes to women's representation is the Data Science field. The ratios are still skewed, and women still occupy far fewer leadership roles than men. But let's not just assume things but rather use data to verify our assumptions, and the 2019 Kaggle ML & DS survey is an excellent place to start. Let the numbers speak for themselves. ObjectiveThe objective of this notebook to analyze the survey data to answer an important question: is the women participation in STEM really improving, or is it just a hype? Let's use our analysis skills to investigate whether things seem to be actually improving or is still much left to be done. The Annual Kaggle surveyKaggle's annual Machine Learning and Data Science Survey is in its third year now. This year, as in 2017 and 2018, Kaggle has conducted an industry-wide survey that presents a comprehensive view of the state of data science and machine learning. The Survey Challenges from 2017 and 2018 were very informative, and so is expected out of the 2019 survey too. MethodologyThis notebook will only focus on the women in ML and DS, thereby analyzing the answers of the female respondents solely. The analysis will be two-fold:  Analysis of the 2019 Kaggle DS & ML survey for Female respondents. Comparisons of the results in the 2019 study with the previous two surveys. This will present a better picture and show whether are things are improving for real or not.  In this notebook, we shall analyze the female participation in the survey under six different categories, namely:  Analyzing data under these different categories should give us a fair idea of the nature of women's representation is the ML and DS realm.", "link": "https://www.kaggle.com/parulpandey/geek-girls-rising-myth-or-reality", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-12-02 07:35:50", "date_scraped": "2020-12-13 12:25:09", "words": 573, "sentences": 24, "sum_nltk": "An analysis of the 2019 Kaggle ML and DS Survey for Women's Representation in Machine Learning and Data Science Pic Credits:rawpixel.com / Freepik Women in tech didn't matter to people until tech started mattering to people: Rachel Sklar  In the last few years, a lot of effort has being made in society to increase women's representation in the tech world.\nSimilarly, women have also been making significant contributions to the fields of Machine Learning and Data Science.\nHowever, as it may seem, not everything is still so \"gung-ho\" when it comes to women's representation is the Data Science field.\nBut let's not just assume things but rather use data to verify our assumptions, and the 2019 Kaggle ML & DS survey is an excellent place to start.\nObjectiveThe objective of this notebook to analyze the survey data to answer an important question: is the women participation in STEM really improving, or is it just a hype?\nThe Annual Kaggle surveyKaggle's annual Machine Learning and Data Science Survey is in its third year now.\nThis year, as in 2017 and 2018, Kaggle has conducted an industry-wide survey that presents a comprehensive view of the state of data science and machine learning.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.006, "sum_t5": "a lot of effort has been made to increase women's representation in the tech world. a new survey shows that women are more likely to be involved in the fields of machine learning and data science. a lot of companies are coming forward to change the world of work. but the data is still skewed and women still occupy far fewer leadership roles than men. a skewed ratio of women to men in the field is a good starting point.", "sum_t5_words": 80, "sum_t5_runtime": 6.514, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.33785757422447205, "nltk_category_runtime": 18.264, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9615877866744995, "nltk_subcategory_runtime": 28.906, "category": "Utilities", "category_score": 0.33785757422447205, "subcategory": "Machine Learning", "subcategory_score": 0.9615877866744995, "runtime_cat": 47.17, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.774", "language_code": "en", "language_score": "0.9999956031382391", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "analysis 2019 kaggle ml d survey woman representation machine learning data science pic creditsrawpixelcom freepik woman tech didnt matter people tech started mattering people rachel sklar last year lot effort made society increase woman representation tech world idea behind effort attracting retaining woman science technology engineering mathematics stem ultimately enhance innovation creativity woman involved field experience need desire unique woman may overlooked arent female role model inspire u remember iconic photograph katie bouman 2019 watching black hole first photograph reconstructed breakthrough moment scientific community equally proud one woman scientist world historic moment science woman science similarly woman also making significant contribution field machine learning data science margaret hamilton grace hopper past corinna cortes fei fei li today woman made presence felt work girl motivated take science research school college lot company today coming forward change world work year even united nation celebrated international woman day official theme balanceforbetter advocating genderbalanced world however may seem everything still gungho come woman representation data science field ratio still skewed woman still occupy far fewer leadership role men let assume thing rather use data verify assumption 2019 kaggle ml d survey excellent place start let number speak objectivethe objective notebook analyze survey data answer important question woman participation stem really improving hype let use analysis skill investigate whether thing seem actually improving still much left done annual kaggle surveykaggles annual machine learning data science survey third year year 2017 2018 kaggle conducted industrywide survey present comprehensive view state data science machine learning survey challenge 2017 2018 informative expected 2019 survey methodologythis notebook focus woman ml d thereby analyzing answer female respondent solely analysis twofold analysis 2019 kaggle d ml survey female respondent comparison result 2019 study previous two survey present better picture show whether thing improving real notebook shall analyze female participation survey six different category namely analyzing data different category give u fair idea nature woman representation ml d realm", "tags_descriptive": ["Exploratory Data Analysis"]}