{"title": "EDA - EF with N2O Time Series - Earth Engine", "description": "GoalDevelop a methodology to calculate an average historical emissions factor of electricity generated for a sub-national region, using remote sensing data and techniques. (from competition overview) Emission factorAn emissions factor is a representative value that attempts to relate the quantity of a pollutant released to the atmosphere with an activity associated with the release of that pollutant. These factors are usually expressed as the weight of pollutant divided by a unit weight, volume, distance, or duration of the activity emitting the pollutant (e.g., kilograms of particulate emitted per megagram of coal burned). Such factors facilitate estimation of emissions from various sources of air pollution. In most cases, these factors are simply averages of all available data of acceptable quality and are generally assumed to be representative of long-term averages for all facilities in the source category (i.e., a population average). The general equation for emissions estimation is as follows: E = A × EF × (1–ER)/100 where E = emissions; A = activity rate; EF = emission factor, and ER = overall emission reduction efficiency, %. Source", "link": "https://www.kaggle.com/gpoulain/eda-ef-with-n2o-time-series-earth-engine", "tags": ["Exploratory Data Analysis", "Geospatial Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-02-23 13:57:42", "date_scraped": "2020-12-12 19:11:13", "words": 177, "sentences": 7, "runtime": 0.01, "description_category": "Utilities", "description_category_score": 0.12435285747051239, "description_category_runtime": 15.119, "description_subcategory": "General", "description_subcategory_score": 0.720710813999176, "description_subcategory_runtime": 24.412, "category": "Utilities", "category_score": 0.12435285747051239, "subcategory": "General", "subcategory_score": 0.720710813999176, "runtime_cat": 39.531, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.654", "language_code": "en", "language_score": "0.9999975186516779", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "goaldevelop methodology calculate average historical emission factor electricity generated subnational region using remote sensing data technique competition overview emission factoran emission factor representative value attempt relate quantity pollutant released atmosphere activity associated release pollutant factor usually expressed weight pollutant divided unit weight volume distance duration activity emitting pollutant eg kilogram particulate emitted per megagram coal burned factor facilitate estimation emission various source air pollution case factor simply average available data acceptable quality generally assumed representative longterm average facility source category ie population average general equation emission estimation follows e ef 1er100 e emission activity rate ef emission factor er overall emission reduction efficiency source", "tags_descriptive": ["Exploratory Data Analysis", "Geospatial Analysis"]}