{"title": "Uncover target correlations with Bernoulli Mixture", "description": "Which proteins come together?Take a look at this wonderful image of an animal cell provided by LadyofHats (Mariana Ruiz) in the public domain via Wikimedia Commons. We can see some of our target proteins and may conclude that some of them are likely to occur together. In our images all of them should be present but only one of them are stained in the green channel. Now let's assume that staining is sometimes not that easy and it happens that multible organelles are likely to be stained together. If this is true we could expect groupings - some targets may be likely to be one-hot at the same time over a broader range of image samples in our data set. As the target distribution and dependencies are an entry point to setup an objective or loss function, it could be worth it to dive into dive with me into target group analysis using a latent variable model. If you like my kernel you can make be very happy with an upvote and/or comment ;-)! The motivation I gain out of your feedback pushes me to share my ideas instead of hiding them. Thank you!", "link": "https://www.kaggle.com/allunia/uncover-target-correlations-with-bernoulli-mixture", "tags": ["CLustering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "tensorflow", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-12-24 14:19:57", "date_scraped": "2020-12-12 21:26:50", "words": 194, "sentences": 8, "runtime": 0.005, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.38385456800460815, "description_category_runtime": 15.668, "description_subcategory": "Quality", "description_subcategory_score": 0.4813966751098633, "description_subcategory_runtime": 25.058, "category": "Biotechnological & Life Sciences", "category_score": 0.38385456800460815, "subcategory": "Quality", "subcategory_score": 0.4813966751098633, "runtime_cat": 40.726, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.736", "language_code": "en", "language_score": "0.9999955898664405", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "protein come togethertake look wonderful image animal cell provided ladyofhats mariana ruiz public domain via wikimedia common see target protein may conclude likely occur together image present one stained green channel let assume staining sometimes easy happens multible organelle likely stained together true could expect grouping target may likely onehot time broader range image sample data set target distribution dependency entry point setup objective loss function could worth dive dive target group analysis using latent variable model like kernel make happy upvote andor comment motivation gain feedback push share idea instead hiding thank", "tags_descriptive": ["CLustering"]}