{"title": "PANDA - Inference (ENSEMBLE) trying various models", "description": "About this Notebook This kernel is for kagglers like me who believe in trying a lot of things and don't fear of failing as failing is the part of learning.  Starting today, i am going to log my progress in this kernel, this kernel will be work in progress and will contain hint about a lot of things which i tried or will try in upcoming days.  This is an inference kernel where CV and LB score of various models and various image related tricks will be tracked, so that it will be easier to keep track of things which worked and which didn't work for this competition. By default i will not share any training code and keep models private, if you want the training kernel or models to be public feel free to mention in the comments section.   Please upvote this kernel if you like it . It motivates me to produce more quality content :)", "link": "https://www.kaggle.com/rohitsingh9990/panda-inference-ensemble-trying-various-models", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch", "skimage", "albumentations"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-24 20:17:12", "date_scraped": "2020-12-13 16:03:25", "words": 162, "sentences": 6, "runtime": 0.005, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.2274964600801468, "description_category_runtime": 12.711, "description_subcategory": "Quality", "description_subcategory_score": 0.5892239212989807, "description_subcategory_runtime": 19.602, "category": "Biotechnological & Life Sciences", "category_score": 0.2274964600801468, "subcategory": "Quality", "subcategory_score": 0.5892239212989807, "runtime_cat": 32.314, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.731", "language_code": "en", "language_score": "0.9999980382351246", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notebook kernel kagglers like believe trying lot thing dont fear failing failing part learning starting today going log progress kernel kernel work progress contain hint lot thing tried try upcoming day inference kernel cv lb score various model various image related trick tracked easier keep track thing worked didnt work competition default share training code keep model private want training kernel model public feel free mention comment section please upvote kernel like motivates produce quality content", "tags_descriptive": []}