{"title": "Fix All The Errors", "description": "Fix All The ErrorsThis notebook has two goals... =) First, to get everyone on the same page with regards to the annotated data via crowd sourcing so that the communal kernels can move towards the fun stuff (deep learning!). The second is alert the contest authorities of potential discrepancies in the provided counts.csv file. Any such issues will need to be cleared both in the training data, but especially in the private data. I guess once the contest if over, we could simply spot-check if our algorithms correctly identified sea lions or not... but it would ruin the competition because there would have to be a recount at that point. In fact, its negative effect will be experienced prior to the contest close, as people will be training on noisy data. So let's begin!", "link": "https://www.kaggle.com/authman/fix-all-the-errors", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-04-15 04:00:17", "date_scraped": "2020-12-13 14:32:38", "words": 134, "sentences": 8, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.17642401158809662, "description_category_runtime": 11.379, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7403463125228882, "description_subcategory_runtime": 17.522, "category": "Utilities", "category_score": 0.17642401158809662, "subcategory": "Machine Learning", "subcategory_score": 0.7403463125228882, "runtime_cat": 28.902, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.659", "language_code": "en", "language_score": "0.9999967147779358", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "fix errorsthis notebook two goal first get everyone page regard annotated data via crowd sourcing communal kernel move towards fun stuff deep learning second alert contest authority potential discrepancy provided countscsv file issue need cleared training data especially private data guess contest could simply spotcheck algorithm correctly identified sea lion would ruin competition would recount point fact negative effect experienced prior contest close people training noisy data let begin", "tags_descriptive": []}