{"title": "Jigsaw TPU: XLM-Roberta", "description": "About this notebookJigsaw Multilingual Toxic Comment Classification is the 3rd annual competition organized by the Jigsaw team. It follows Toxic Comment Classification Challenge, the original 2018 competition, and Jigsaw Unintended Bias in Toxicity Classification, which required the competitors to consider biased ML predictions in their new models. This year, the goal is to use english only training data to run toxicity predictions on many different languages, which can be done using multilingual models, and speed up using TPUs. Many awesome notebooks has already been made so far. Many of them used really cool technologies like Pytorch XLA. This notebook instead aims at constructing a fast, concise, reusable, and beginner-friendly model scaffold. THIS DOES NOT USE ANY TRANSLATED DATA, BUT IT DOES TRAIN ON THE VALIDATION SET. References Original Author: @xhlulu Original notebook: Link", "link": "https://www.kaggle.com/xhlulu/jigsaw-tpu-xlm-roberta", "tags": ["NLP"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-01 02:46:43", "date_scraped": "2020-12-13 12:15:35", "words": 133, "sentences": 8, "runtime": 0.0, "description_category": "Healthcare", "description_category_score": 0.01710273139178753, "description_category_runtime": 12.7, "description_subcategory": "Valuation", "description_subcategory_score": 0.29552051424980164, "description_subcategory_runtime": 19.758, "category": "Healthcare", "category_score": 0.01710273139178753, "subcategory": "Valuation", "subcategory_score": 0.29552051424980164, "runtime_cat": 32.459, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.785", "language_code": "en", "language_score": "0.9999967553766275", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notebookjigsaw multilingual toxic comment classification 3rd annual competition organized jigsaw team follows toxic comment classification challenge original 2018 competition jigsaw unintended bias toxicity classification required competitor consider biased ml prediction new model year goal use english training data run toxicity prediction many different language done using multilingual model speed using tpus many awesome notebook already made far many used really cool technology like pytorch xla notebook instead aim constructing fast concise reusable beginnerfriendly model scaffold use translated data train validation set reference original author xhlulu original notebook link", "tags_descriptive": ["Natural Language Processing (NLP)"]}