{"title": "Trends in 2020 with Advice from Top Kagglers", "description": "Kaggle: A Community About Learning and Sharing KnowledgeIn this notebook I want to explore what the current trends in Data Science are and what we can learn from experienced Machine Learning practitioners. For this, I will also incorporate the Meta-Kaggle dataset and the Chai Time Data Science dataset. This year has been eventful to say the least. Let's explore the Kaggle survey data and find out what the current trends in Data Science are:  Did PyTorch exceed TensorFlow/Keras in popularity? Do students have to invest in expensive GPUs for their projects or are there any affordable alternatives available?  TPUs are now available in Kaggle kernels but how popular are they? GPT-3 received a lot of media attention this year. How familiar are Kagglers with NLP? Did you notice the Julia option for Kaggle kernels? What is Julia and is it going to replace Python and R?", "link": "https://www.kaggle.com/iamleonie/trends-in-2020-with-advice-from-top-kagglers", "tags": ["DL", "Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow", "sklearn", "spacy", "pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-12-07 20:38:52", "date_scraped": "2020-12-13 12:25:10", "words": 148, "sentences": 5, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.18335752189159393, "description_category_runtime": 13.359, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.981220543384552, "description_subcategory_runtime": 21.126, "category": "Education & Research", "category_score": 0.18335752189159393, "subcategory": "Machine Learning", "subcategory_score": 0.981220543384552, "runtime_cat": 34.486, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.663", "language_code": "en", "language_score": "0.9999962474843667", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "kaggle community learning sharing knowledgein notebook want explore current trend data science learn experienced machine learning practitioner also incorporate metakaggle dataset chai time data science dataset year eventful say least let explore kaggle survey data find current trend data science pytorch exceed tensorflowkeras popularity student invest expensive gpus project affordable alternative available tpus available kaggle kernel popular gpt3 received lot medium attention year familiar kagglers nlp notice julia option kaggle kernel julia going replace python r", "tags_descriptive": ["Deep Learning (DL)", "Exploratory Data Analysis"]}