{"title": "Candidate Generation and LUNA16 preprocessing", "description": "In this kernel, I will be talking about the methods that will help in better understanding of the problem statement and visualisation of the data. I will also provide links of useful resources and information. The script is written in Python. I recommend people to install anaconda on their desktop because of its advantages mentioned here. The libraries that will be used in this tutorial for reading, processing and visualisation of data are matplotlib, numpy, skimage and pydicom. The images are of size (z, 512, 512) where z is the number of slices in the CT Scan and varies depending on the resolution of the scanner. Such large images cant be fed directly into a Convolution Network architectures because of the limit on the computation power. Thus we will have to find the regions that are more probable of having cancer. We will be reducing our search space by first segmenting the lungs and then removing the low intensity regions. In this tutorial, we will first start with reading the dataset and visualising it. After that, we will be segmenting the lung structures and then find the region of interest(possible cancer regions) in the CT Scans using Image processing methods. Then I will talk about how to preprocess LUNA16 dataset for training architectures like UNet for segmentation and candidate classification. The segmentation of lung structures is very challenging problem because homogeneity is not present in the lung region, similar densities in the pulmonary structures, different scanners and scanning protocols. The segmented lungs can be further used to find the lung nodule candidates and regions of interest which may help in better classification of the CT Scans. Finding the lung nodule regions is a very hard problem because there are nodules that are attached to the blood vessels or are present at the boundary of the lung region. The lung nodule candidates can be further used for classification by cutting 3D voxels around them and passing it through a 3D CNNs which can be trained on LUNA16 dataset. The LUNA 16 dataset has the location of the nodules in each CT Scan thus will be useful for training the classifier.", "link": "https://www.kaggle.com/arnavkj95/candidate-generation-and-luna16-preprocessing", "tags": ["DL", "CV"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "SimpleITK", "xgboost", "sklearn", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-04-11 17:58:39", "date_scraped": "2020-12-12 18:38:03", "words": 359, "sentences": 17, "sum_nltk": "In this kernel, I will be talking about the methods that will help in better understanding of the problem statement and visualisation of the data.\nIn this tutorial, we will first start with reading the dataset and visualising it.\nAfter that, we will be segmenting the lung structures and then find the region of interest(possible cancer regions) in the CT Scans using Image processing methods.\nThen I will talk about how to preprocess LUNA16 dataset for training architectures like UNet for segmentation and candidate classification.\nThe segmentation of lung structures is very challenging problem because homogeneity is not present in the lung region, similar densities in the pulmonary structures, different scanners and scanning protocols.\nThe segmented lungs can be further used to find the lung nodule candidates and regions of interest which may help in better classification of the CT Scans.\nThe lung nodule candidates can be further used for classification by cutting 3D voxels around them and passing it through a 3D CNNs which can be trained on LUNA16 dataset.\nThe LUNA 16 dataset has the location of the nodules in each CT Scan thus will be useful for training the classifier.", "sum_nltk_words": 186, "sum_nltk_runtime": 0.004, "sum_t5": "the script is written in Python. it will help in better understanding the problem statement and visualisation of the data. the script will be written in a python environment. it will also provide links of useful resources and information. a python script will be used to preprocess a LUNA16 dataset. a python script will be used to create a python kernel.", "sum_t5_words": 61, "sum_t5_runtime": 6.032, "runtime": 0.005, "nltk_category": "Healthcare", "nltk_category_score": 0.6938731074333191, "nltk_category_runtime": 16.473, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9358838200569153, "nltk_subcategory_runtime": 26.408, "category": "Healthcare", "category_score": 0.6938731074333191, "subcategory": "Machine Learning", "subcategory_score": 0.9358838200569153, "runtime_cat": 42.882, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.816", "language_code": "en", "language_score": "0.9999984577752943", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "kernel talking method help better understanding problem statement visualisation data also provide link useful resource information script written python recommend people install anaconda desktop advantage mentioned library used tutorial reading processing visualisation data matplotlib numpy skimage pydicom image size z 512 512 z number slice ct scan varies depending resolution scanner large image cant fed directly convolution network architecture limit computation power thus find region probable cancer reducing search space first segmenting lung removing low intensity region tutorial first start reading dataset visualising segmenting lung structure find region interestpossible cancer region ct scan using image processing method talk preprocess luna16 dataset training architecture like unet segmentation candidate classification segmentation lung structure challenging problem homogeneity present lung region similar density pulmonary structure different scanner scanning protocol segmented lung used find lung nodule candidate region interest may help better classification ct scan finding lung nodule region hard problem nodule attached blood vessel present boundary lung region lung nodule candidate used classification cutting 3d voxels around passing 3d cnns trained luna16 dataset luna 16 dataset location nodule ct scan thus useful training classifier", "tags_descriptive": ["Deep Learning (DL)", "Computer Vision (CV)"]}