{"title": "High Correlation Feature Image Classification Conf", "description": "[Update] Image Classification Confidence and Deal ProbabilityMost publicly shared models show that the image_top_1 feature has one of the strongest signals in predicting deal probability.  Take a look at SRK, kxx and Bojan Tunguz among many others.  However, this is a black box feature to us.  We don't know how it was built to use it as a guide for building similar features.  I took a stab at trying image based features and found one that might work as well. If you viewed this kernel before, skip to the last section below for analysis of correlation between image classification confidence and deal probability. Image QualityIn this competition, the quality of the advertisement image significantly affects the demand volume on an item.  Let's extract the dataset image features and see if we can use it to help predict demand.  I found out that the image classification confidence highly correlates with the deal probability.  However, we have to keep in mind that:  Not all advertisements have images. Advertisements with images tend to have a higher deal probability.  Some code and sections of this notebook were adapted from:  https://www.kaggle.com/classtag/lightgbm-with-mean-encode-feature-0-233 https://keras.io/applications/#classify-imagenet-classes-with-resnet50  Image Classification with Deep LearningKeras provides pre-trained deep learning models that will save us days annotating, and training our models.  We will just load one that suits our needs and use it to classify our images.  The assumption here is that the image classification accuracy score will reflect how clear it is for a human to identify it, and affect the chance of buying it. Different exploratory data analyses [1, 2, 3] in this competition show high correlation between the image_top_1 feature and our target deal_probability.  So, we are proceeding in the right direction. We will start by preparing our workspace and copying the large pretrained model files to where Keras can find them.", "link": "https://www.kaggle.com/wesamelshamy/high-correlation-feature-image-classification-conf", "tags": ["Classification", "CV"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-06-09 22:43:36", "date_scraped": "2020-12-12 16:57:27", "words": 315, "sentences": 17, "sum_nltk": "[Update] Image Classification Confidence and Deal ProbabilityMost publicly shared models show that the image_top_1 feature has one of the strongest signals in predicting deal probability.\nIf you viewed this kernel before, skip to the last section below for analysis of correlation between image classification confidence and deal probability.\nImage QualityIn this competition, the quality of the advertisement image significantly affects the demand volume on an item.\nLet's extract the dataset image features and see if we can use it to help predict demand.\nI found out that the image classification confidence highly correlates with the deal probability.\nHowever, we have to keep in mind that:  Not all advertisements have images.\nAdvertisements with images tend to have a higher deal probability.\nSome code and sections of this notebook were adapted from:  https://www.kaggle.com/classtag/lightgbm-with-mean-encode-feature-0-233 https://keras.io/applications/#classify-imagenet-classes-with-resnet50  Image Classification with Deep LearningKeras provides pre-trained deep learning models that will save us days annotating, and training our models.\nWe will just load one that suits our needs and use it to classify our images.\nDifferent exploratory data analyses [1, 2, 3] in this competition show high correlation between the image_top_1 feature and our target deal_probability.", "sum_nltk_words": 183, "sum_nltk_runtime": 0.004, "sum_t5": "image_top_1 feature has one of the strongest signals in predicting deal probability. image quality significantly affects the demand volume on an item. not all advertisements have images. ads with images tend to have a higher deal probability. a similar feature is available for kxx and bojan tunguz. a similar feature is available for kxx and kxx. a similar feature is available for kxx and kxx.", "sum_t5_words": 65, "sum_t5_runtime": 6.158, "runtime": 0.0, "nltk_category": "Accommodation & Food", "nltk_category_score": 0.6217861771583557, "nltk_category_runtime": 20.833, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.9589861631393433, "nltk_subcategory_runtime": 33.204, "category": "Accommodation & Food", "category_score": 0.6217861771583557, "subcategory": "Quality", "subcategory_score": 0.9589861631393433, "runtime_cat": 54.038, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.754", "language_code": "en", "language_score": "0.9999937716817199", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "update image classification confidence deal probabilitymost publicly shared model show image_top_1 feature one strongest signal predicting deal probability take look srk kxx bojan tunguz among many others however black box feature u dont know built use guide building similar feature took stab trying image based feature found one might work well viewed kernel skip last section analysis correlation image classification confidence deal probability image qualityin competition quality advertisement image significantly affect demand volume item let extract dataset image feature see use help predict demand found image classification confidence highly correlate deal probability however keep mind advertisement image advertisement image tend higher deal probability code section notebook adapted httpswwwkagglecomclasstaglightgbmwithmeanencodefeature0233 httpskerasioapplicationsclassifyimagenetclasseswithresnet50 image classification deep learningkeras provides pretrained deep learning model save u day annotating training model load one suit need use classify image assumption image classification accuracy score reflect clear human identify affect chance buying different exploratory data analysis 1 2 3 competition show high correlation image_top_1 feature target deal_probability proceeding right direction start preparing workspace copying large pretrained model file kera find", "tags_descriptive": ["Classification", "Computer Vision (CV)"]}