{"title": "Interesting KKBox Insights && New Features", "description": "What I intend to do?In this kernel, my sole intention is to create a highly feature engineered dataframe after merging existing files, which can be fed directly as input for modeling. By this I mean dataframes for both the train set and test set which would contain same number of columns with encoded features. At a glance I will be looking into the following issues:  Merging Dataframes          -> (completed) Handling Missing Values   -> (completed) Came across something interesting where number of unique values in column 'source_screen_name' were different for both test and train set. Columns like 'genre_ids' have a combination of more than one genre which must be handled appropriately.   Feature Engineering          -> (in progress) number of genres per song number of lyricists per song number of composers per song whether song has features artists number of artists per song whether artist and composer are the same whether artist, composer and lyricist are all the same    (thinking of more features)", "link": "https://www.kaggle.com/jeru666/interesting-kkbox-insights-new-features", "tags": ["Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-11-15 18:10:41", "date_scraped": "2020-12-13 12:31:41", "words": 186, "sentences": 5, "runtime": 0.003, "description_category": "Media & Publishing", "description_category_score": 0.3571942448616028, "description_category_runtime": 15.221, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.5903750061988831, "description_subcategory_runtime": 24.374, "category": "Media & Publishing", "category_score": 0.3571942448616028, "subcategory": "Machine Learning", "subcategory_score": 0.5903750061988831, "runtime_cat": 39.595, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.701", "language_code": "en", "language_score": "0.9999977969198586", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "intend doin kernel sole intention create highly feature engineered dataframe merging existing file fed directly input modeling mean dataframes train set test set would contain number column encoded feature glance looking following issue merging dataframes completed handling missing value completed came across something interesting number unique value column source_screen_name different test train set column like genre_ids combination one genre must handled appropriately feature engineering progress number genre per song number lyricist per song number composer per song whether song feature artist number artist per song whether artist composer whether artist composer lyricist thinking feature", "tags_descriptive": ["Feature Engineering"]}