{"title": "Grouping Items by Stockout Pattern", "description": "For some competitions it can be helful to find patterns of NA values or outliers, and cluster observations by similar patterns. Here I'm wondering what value there is in looking at stockouts and grouping items by those patterns. In our data we have typical department store groupings - family and department. This makes sense for the most part although for this exercise, the groupings aren't always helpful. If you're planning a Sunday summer picnic for instance, you might go over to Household for a tablecloth, Hobbies for a frisbee, and Foods for a big pack of ground beef (don't judge..:). A lot of other people are doing the same thing and so maybe the store runs out of those items. Demand is event-driven in this case and crosses department lines. We don't really know if an item is out of stock or just no one bought it. I'll start with items having higher median sales and assume that a drop to 0 is due to a stockout. This is sure to be wrong in some cases.", "link": "https://www.kaggle.com/jpmiller/grouping-items-by-stockout-pattern", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-07 23:07:54", "date_scraped": "2020-12-12 17:27:17", "words": 176, "sentences": 10, "runtime": 0.0, "description_category": "Accommodation & Food", "description_category_score": 0.5172854661941528, "description_category_runtime": 14.65, "description_subcategory": "Food", "description_subcategory_score": 0.7095597386360168, "description_subcategory_runtime": 23.188, "category": "Accommodation & Food", "category_score": 0.5172854661941528, "subcategory": "Food", "subcategory_score": 0.7095597386360168, "runtime_cat": 37.838, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.759", "language_code": "en", "language_score": "0.9999967335764584", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "competition helful find pattern na value outlier cluster observation similar pattern im wondering value looking stockouts grouping item pattern data typical department store grouping family department make sense part although exercise grouping arent always helpful youre planning sunday summer picnic instance might go household tablecloth hobby frisbee food big pack ground beef dont judge lot people thing maybe store run item demand eventdriven case cross department line dont really know item stock one bought ill start item higher median sale assume drop 0 due stockout sure wrong case", "tags_descriptive": []}