{"title": "CIFAR-10 object classification CNN-Keras", "description": "Introduction Data preparation Load data Normalization, Reshape and Label encoding Visualize test and train sample   Model Building Split training and valdiation set Define the model architechture Set the optimizer and annealer Data augmentation Train model   Evaluate the model Training and validation curves Visualize Prediction   Prediction and submition Predict and Submit results     1. IntroductionThis kernel is basic start in deep learning. CIFAR-10 (Canadian Institute For Advanced Research) is the type “hello world” dataset of computer vision. This dataset is a collection of images that are commonly used to train machine learning and computer vision algorithms. It is one of the most widely used datasets for machine learning research. The CIFAR-10 dataset contains 60,000 32x32 color images in 10 different classes. The 10 different classes represent airplanes, cars, birds, cats, deer, dogs, frogs, horses, ships, and trucks. There are 6,000 images of each class. In this competition, your goal is to correctly identify different object from a dataset of tens of thousands of color images.", "link": "https://www.kaggle.com/faizanurrahmann/cifar-10-object-classification-cnn-keras", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-01-15 12:00:16", "date_scraped": "2020-12-12 17:54:35", "words": 173, "sentences": 9, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.28557437658309937, "description_category_runtime": 16.023, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8697666525840759, "description_subcategory_runtime": 25.263, "category": "Education & Research", "category_score": 0.28557437658309937, "subcategory": "Machine Learning", "subcategory_score": 0.8697666525840759, "runtime_cat": 41.287, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.744", "language_code": "en", "language_score": "0.9999960736276567", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introduction data preparation load data normalization reshape label encoding visualize test train sample model building split training valdiation set define model architechture set optimizer annealer data augmentation train model evaluate model training validation curve visualize prediction prediction submition predict submit result 1 introductionthis kernel basic start deep learning cifar10 canadian institute advanced research type hello world dataset computer vision dataset collection image commonly used train machine learning computer vision algorithm one widely used datasets machine learning research cifar10 dataset contains 60000 32x32 color image 10 different class 10 different class represent airplane car bird cat deer dog frog horse ship truck 6000 image class competition goal correctly identify different object dataset ten thousand color image", "tags_descriptive": []}