{"title": "Covid-19 & ACE", "description": "What is the ACE2 receptor, how is it connected to coronavirus and why might it be key to treating COVID-19?Authors: Krishna Sriram: Postdoctoral Fellow, University of California San Diego Paul Insel: Professor of Pharmacology and Medicine, University of California San Diego Rohit Loomba: Professor of Medicine, University of California San Diego In the search for treatments for COVID-19, many researchers are focusing their attention on a specific protein that allows the virus to infect human cells. Called the angiotensin-converting enzyme 2, or ACE2 “receptor,” the protein provides the entry point for the coronavirus to hook into and infect a wide range of human cells. ACE2 is a protein on the surface of many cell types. It is an enzyme that generates small proteins – by cutting up the larger protein angiotensinogen – that then go on to regulate functions in the cell. Using the spike-like protein on its surface, the SARS-CoV-2 virus binds to ACE2 – like a key being inserted into a lock – prior to entry and infection of cells. Hence, ACE2 acts as a cellular doorway – a receptor – for the virus that causes COVID-19. https://theconversation.com/what-is-the-ace2-receptor-how-is-it-connected-to-coronavirus-and-why-might-it-be-key-to-treating-covid-19-the-experts-explain-136928", "link": "https://www.kaggle.com/mpwolke/covid-19-ace", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "caffe", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-27 21:05:23", "date_scraped": "2020-12-13 17:51:06", "words": 190, "sentences": 7, "runtime": 0.002, "description_category": "Healthcare", "description_category_score": 0.8134393095970154, "description_category_runtime": 22.802, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.7602272033691406, "description_subcategory_runtime": 36.215, "category": "Healthcare", "category_score": 0.8134393095970154, "subcategory": "Judicial Applied", "subcategory_score": 0.7602272033691406, "runtime_cat": 59.017, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.688", "language_code": "en", "language_score": "0.9999990697388588", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "ace2 receptor connected coronavirus might key treating covid19authors krishna sriram postdoctoral fellow university california san diego paul insel professor pharmacology medicine university california san diego rohit loomba professor medicine university california san diego search treatment covid19 many researcher focusing attention specific protein allows virus infect human cell called angiotensinconverting enzyme 2 ace2 receptor protein provides entry point coronavirus hook infect wide range human cell ace2 protein surface many cell type enzyme generates small protein cutting larger protein angiotensinogen go regulate function cell using spikelike protein surface sarscov2 virus bind ace2 like key inserted lock prior entry infection cell hence ace2 act cellular doorway receptor virus cause covid19 httpstheconversationcomwhatistheace2receptorhowisitconnectedtocoronavirusandwhymightitbekeytotreatingcovid19theexpertsexplain136928", "tags_descriptive": []}