{"title": "Covid-19 Biomarkers", "description": "An interpretable mortality prediction model for COVID-19 patientsYan, L., Zhang, H., Goncalves, J. et al. An interpretable mortality prediction model for COVID-19 patients. Nat Mach Intell 2, 283–288 (2020). https://doi.org/10.1038/s42256-020-0180-7 This study leverages a database of blood samples from 485 infected patients in the region of Wuhan, China, to identify crucial predictive biomarkers of disease mortality. For this purpose, machine learning tools selected three biomarkers that predict the mortality of individual patients more than 10 days in advance with more than 90% accuracy: lactic dehydrogenase (LDH), lymphocyte and high-sensitivity C-reactive protein (hs-CRP). In particular, relatively high levels of LDH alone seem to play a crucial role in distinguishing the vast majority of cases that require immediate medical attention. This finding is consistent with current medical knowledge that high LDH levels are associated with tissue breakdown occurring in various diseases, including pulmonary disorders such as pneumonia. Overall, this Article suggests a simple and operable decision rule to quickly predict patients at the highest risk, allowing them to be prioritized and potentially reducing the mortality rate.https://www.nature.com/articles/s42256-020-0180-7", "link": "https://www.kaggle.com/mpwolke/covid-19-biomarkers", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["caffe", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-31 00:03:29", "date_scraped": "2020-12-13 17:51:06", "words": 174, "sentences": 9, "runtime": 0.003, "description_category": "Healthcare", "description_category_score": 0.5987733602523804, "description_category_runtime": 18.844, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.967228889465332, "description_subcategory_runtime": 30.541, "category": "Healthcare", "category_score": 0.5987733602523804, "subcategory": "Machine Learning", "subcategory_score": 0.967228889465332, "runtime_cat": 49.387, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.548", "language_code": "en", "language_score": "0.9999968194640669", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "interpretable mortality prediction model covid19 patientsyan l zhang h goncalves j et al interpretable mortality prediction model covid19 patient nat mach intell 2 283288 2020 httpsdoiorg101038s4225602001807 study leverage database blood sample 485 infected patient region wuhan china identify crucial predictive biomarkers disease mortality purpose machine learning tool selected three biomarkers predict mortality individual patient 10 day advance 90 accuracy lactic dehydrogenase ldh lymphocyte highsensitivity creactive protein hscrp particular relatively high level ldh alone seem play crucial role distinguishing vast majority case require immediate medical attention finding consistent current medical knowledge high ldh level associated tissue breakdown occurring various disease including pulmonary disorder pneumonia overall article suggests simple operable decision rule quickly predict patient highest risk allowing prioritized potentially reducing mortality ratehttpswwwnaturecomarticless4225602001807", "tags_descriptive": []}