{"title": "End to End Object Detection with Transformers:DETR", "description": "About this NotebookObject Detection is a problem which is not only a bit complex but also computationally expensive, due to the number of components to it. I always wanted to learn it and I got really excited when I saw a Kaggle competition on it , although I was not able to fully concentrate on it due to other competitions up untill now. While I was learning all the different concepts in Object Detection , I came across Facebook's Detection tranformer DETR , launched in April 2020 . It's still quite new but the resuts are astonishing and the model itself is very fast . In this notebook, I explore this new architecture,its working and fine tune it for Wheat Detection competition Dataset. Note that for now this is just a baseline to demonstrate the architecture and its working ,it does not aim at getting very good results on lb,this will be a work in progress,and I will soon update with full training and a separate", "link": "https://www.kaggle.com/tanulsingh077/end-to-end-object-detection-with-transformers-detr", "tags": ["DL"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch", "albumentations"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-07-01 15:09:13", "date_scraped": "2020-12-12 20:14:55", "words": 166, "sentences": 6, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.08789972215890884, "description_category_runtime": 13.309, "description_subcategory": "Student", "description_subcategory_score": 0.22415503859519958, "description_subcategory_runtime": 21.27, "category": "Wholesale & Retail", "category_score": 0.08789972215890884, "subcategory": "Student", "subcategory_score": 0.22415503859519958, "runtime_cat": 34.579, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.759", "language_code": "en", "language_score": "0.9999952618826139", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notebookobject detection problem bit complex also computationally expensive due number component always wanted learn got really excited saw kaggle competition although able fully concentrate due competition untill learning different concept object detection came across facebooks detection tranformer detr launched april 2020 still quite new resuts astonishing model fast notebook explore new architectureits working fine tune wheat detection competition dataset note baseline demonstrate architecture working aim getting good result lbthis work progressand soon update full training separate", "tags_descriptive": ["Deep Learning (DL)"]}