{"title": "Image-Based CNN", "description": "I wrote this kernel to mess around with the sketch data and share my experience so far.  After exploring the website and the data, I'll use a very basic CNN to classify sketches. This model gets 0.60 on the Public LB when run with 6000 recognized images per class. Quick, DrawOk - I have to say this is kind of a fun thing. You go to the Quick Draw  website and agree to sketch several common objects. The host then gives you the object labels one by one, and you have 20 seconds to draw each one. If the AI guesses your sketch (that is, associates it with training set items of the same label) you get a check mark and move on. At the end you get something like this:   Notice that it didn't like my bird. Apparently it looked more like a dragon or a diving board(??) or a mosquito.  They're nice enough to show you how other people draw birds so you maybe learn how to draw better.", "link": "https://www.kaggle.com/jpmiller/image-based-cnn", "tags": ["Classification"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-18 00:48:48", "date_scraped": "2020-12-13 16:18:48", "words": 176, "sentences": 10, "runtime": 0.005, "description_category": "Miscellaneous", "description_category_score": 0.16376101970672607, "description_category_runtime": 14.071, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.6101119518280029, "description_subcategory_runtime": 22.3, "category": "Miscellaneous", "category_score": 0.16376101970672607, "subcategory": "Machine Learning", "subcategory_score": 0.6101119518280029, "runtime_cat": 36.371, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.776", "language_code": "en", "language_score": "0.9999973394441877", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "wrote kernel mess around sketch data share experience far exploring website data ill use basic cnn classify sketch model get 060 public lb run 6000 recognized image per class quick drawok say kind fun thing go quick draw website agree sketch several common object host give object label one one 20 second draw one ai guess sketch associate training set item label get check mark move end get something like notice didnt like bird apparently looked like dragon diving board mosquito theyre nice enough show people draw bird maybe learn draw better", "tags_descriptive": ["Classification"]}