{"title": "Twitter sentiment Extaction-Analysis,EDA and Model", "description": "About this CompetitionYou are someone who is recently starting on NLP or has become a master ,irrespective of where you lie in the learning chain , I can bet you have worked on sentiment analysis and if not you will be going to, you just can't bypass it. Can You?. Sentiment analysis is for NLP 'what Happy Birthday to You' is for Guitar players Right? You start here   In case you are not aware about sentiment analysis here is a very good article : https://towardsdatascience.com/sentiment-analysis-concept-analysis-and-applications-6c94d6f58c17  Recently Kaggle Lauched a new competition admist the COVID-19 Scare , named Twitter Sentiment Extraction ,I know right its a twitter sentiment analysis competition,But kaggle never disappoints you,it could not have been this straightforward, afterall it has go on for two months.So what this competition asks for is not the sentiment scores but the part of the tweet (word or phrase) that reflects the sentiment., Interesting it isn't it? This competition is special,so if you want to level up your NLP skills , this competition is for you Acknowledgements https://www.kaggle.com/aashita/word-clouds-of-various-shapes --> WORDCLOUDS FUNCTION https://www.kaggle.com/rohitsingh9990/ner-training-using-spacy-0-628-lb --> For understanding how to train spacy NER on custom inputs  About this NotebookIn this kernel, I will briefly explain the structure of dataset.I will generate and analyze metafeatures. Then, I will visualize the dataset using Matplotlib, seaborn and Plotly to gain as much insight as I can . Also I will approach this problem as an NER problem to build a model  In case you are just starting with NLP here is a guide to Approach almost any NLP Problem by Grandmaster @Abhishek Thakur https://www.slideshare.net/abhishekkrthakur/approaching-almost-any-nlp-problem  This kernel is a work in Progress,and I will keep on updating it as the competition progresses and I learn more and more things about the data If you find this kernel useful, Please Upvote it , it motivates me to write more Quality content", "link": "https://www.kaggle.com/tanulsingh077/twitter-sentiment-extaction-analysis-eda-and-model", "tags": ["NLP", "Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["nltk", "spacy"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-14 12:09:08", "date_scraped": "2020-12-13 17:53:52", "words": 316, "sentences": 5, "sum_nltk": "About this CompetitionYou are someone who is recently starting on NLP or has become a master ,irrespective of where you lie in the learning chain , I can bet you have worked on sentiment analysis and if not you will be going to, you just can't bypass it.\nSentiment analysis is for NLP 'what Happy Birthday to You' is for Guitar players Right?\nYou start here   In case you are not aware about sentiment analysis here is a very good article : https://towardsdatascience.com/sentiment-analysis-concept-analysis-and-applications-6c94d6f58c17  Recently Kaggle Lauched a new competition admist the COVID-19 Scare , named Twitter Sentiment Extraction ,I know right its a twitter sentiment analysis competition,But kaggle never disappoints you,it could not have been this straightforward, afterall it has go on for two months.So what this competition asks for is not the sentiment scores but the part of the tweet (word or phrase) that reflects the sentiment., Interesting it isn't it?\nThis competition is special,so if you want to level up your NLP skills , this competition is for you Acknowledgements https://www.kaggle.com/aashita/word-clouds-of-various-shapes --> WORDCLOUDS FUNCTION https://www.kaggle.com/rohitsingh9990/ner-training-using-spacy-0-628-lb --> For understanding how to train spacy NER on custom inputs  About this NotebookIn this kernel, I will briefly explain the structure of dataset.I will generate and analyze metafeatures.", "sum_nltk_words": 207, "sum_nltk_runtime": 0.002, "sum_t5": "recently Kaggle Lauched a new competition admist the COVID-19 Scare. the competition asks for the part of the tweet (word or phrase) that reflects the sentiment. if you want to level up your NLP skills, this competition is for you. if you are just starting with NLP here is a guide to Approach almost any NLP problem by Grandmaster @Abhishek Thakur.. if you are just starting with NLP, here is a guide", "sum_t5_words": 72, "sum_t5_runtime": 6.991, "runtime": 0.0, "nltk_category": "Education & Research", "nltk_category_score": 0.14421381056308746, "nltk_category_runtime": 24.874, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.29952773451805115, "nltk_subcategory_runtime": 40.426, "category": "Education & Research", "category_score": 0.14421381056308746, "subcategory": "Student", "subcategory_score": 0.29952773451805115, "runtime_cat": 65.301, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.806", "language_code": "en", "language_score": "0.9999952243271628", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "competitionyou someone recently starting nlp become master irrespective lie learning chain bet worked sentiment analysis going cant bypass sentiment analysis nlp happy birthday guitar player right start case aware sentiment analysis good article httpstowardsdatasciencecomsentimentanalysisconceptanalysisandapplications6c94d6f58c17 recently kaggle lauched new competition admist covid19 scare named twitter sentiment extraction know right twitter sentiment analysis competitionbut kaggle never disappoints youit could straightforward afterall go two monthsso competition asks sentiment score part tweet word phrase reflects sentiment interesting isnt competition specialso want level nlp skill competition acknowledgement httpswwwkagglecomaashitawordcloudsofvariousshapes wordclouds function httpswwwkagglecomrohitsingh9990nertrainingusingspacy0628lb understanding train spacy ner custom input notebookin kernel briefly explain structure dataseti generate analyze metafeatures visualize dataset using matplotlib seaborn plotly gain much insight also approach problem ner problem build model case starting nlp guide approach almost nlp problem grandmaster abhishek thakur httpswwwslidesharenetabhishekkrthakurapproachingalmostanynlpproblem kernel work progressand keep updating competition progress learn thing data find kernel useful please upvote motivates write quality content", "tags_descriptive": ["Natural Language Processing (NLP)", "Exploratory Data Analysis"]}