{"title": "pretrained ResNet34 with RGBY (0.460 public LB)", "description": "OverviewThe goal of this competition is classification of mixed protein patterns. However, unlike most image labeling tasks, where binary or multiclass labeling is considered, in this competition each image can have multiple labels. Multiclass multilabel task has its own specific affecting the design of the model and the loss function. Moreover, the classified images are quite different from ImageNet; therefore, despite usage of a pretrained model is quite helpful, a substantial retraining of entire model is needed. An additional challenge is 4-chanel input to the model (RGBY), which is different from ones used in most of pretrained models (RGB input). In this kernel I will show how to handle the above challenges and get started with this competition. I will begin with using a light ResNet34 model and low-resolution images to have a baseline that can be used later to select higher end models and explore the effect of image resolution on the prediction accuracy. The validation F1 score of the model is ~0.65-0.7, and I was able to get 0.460 public LB score in V11 of the kernel (0.453 after reset of the LB). Though reuslts are slightly different from one run to another because F1 macro metric is unstable, and sevral items of rear classes contribute in the same way as as thousands items of common classes, 1/28. The problem of low public LB score of the model, which mentioned in the first versions of the kernel, is resulted by a bug in the evaluation metric (https://www.kaggle.com/c/human-protein-atlas-image-classification/discussion/69366#409041) that relies on the order of records in the submission file rather than IDs.", "link": "https://www.kaggle.com/iafoss/pretrained-resnet34-with-rgby-0-460-public-lb", "tags": ["DL", "Classification", "CNN", "Classification"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-12-23 16:49:18", "date_scraped": "2020-12-12 21:26:50", "words": 263, "sentences": 10, "sum_nltk": "OverviewThe goal of this competition is classification of mixed protein patterns.\nHowever, unlike most image labeling tasks, where binary or multiclass labeling is considered, in this competition each image can have multiple labels.\nMulticlass multilabel task has its own specific affecting the design of the model and the loss function.\nMoreover, the classified images are quite different from ImageNet; therefore, despite usage of a pretrained model is quite helpful, a substantial retraining of entire model is needed.\nAn additional challenge is 4-chanel input to the model (RGBY), which is different from ones used in most of pretrained models (RGB input).\nIn this kernel I will show how to handle the above challenges and get started with this competition.\nThe validation F1 score of the model is ~0.65-0.7, and I was able to get 0.460 public LB score in V11 of the kernel (0.453 after reset of the LB).\nThe problem of low public LB score of the model, which mentioned in the first versions of the kernel, is resulted by a bug in the evaluation metric (https://www.kaggle.com/c/human-protein-atlas-image-classification/discussion/69366#409041) that relies on the order of records in the submission file rather than IDs.", "sum_nltk_words": 184, "sum_nltk_runtime": 0.003, "sum_t5": "the goal of this competition is classification of mixed protein patterns. the model is based on low-resolution images to have a baseline. the public LB score of the model is resulted by a bug in the evaluation metric. the problem of low public LB score of the model is resulted by a bug in the evaluation metric. a retraining of entire model is needed. a retraining of entire model is needed.", "sum_t5_words": 71, "sum_t5_runtime": 5.962, "runtime": 0.0, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.36443790793418884, "nltk_category_runtime": 18.993, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.7903000712394714, "nltk_subcategory_runtime": 30.901, "category": "Biotechnological & Life Sciences", "category_score": 0.36443790793418884, "subcategory": "Machine Learning", "subcategory_score": 0.7903000712394714, "runtime_cat": 49.895, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.81", "language_code": "en", "language_score": "0.9999984856130486", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "overviewthe goal competition classification mixed protein pattern however unlike image labeling task binary multiclass labeling considered competition image multiple label multiclass multilabel task specific affecting design model loss function moreover classified image quite different imagenet therefore despite usage pretrained model quite helpful substantial retraining entire model needed additional challenge 4chanel input model rgby different one used pretrained model rgb input kernel show handle challenge get started competition begin using light resnet34 model lowresolution image baseline used later select higher end model explore effect image resolution prediction accuracy validation f1 score model 06507 able get 0460 public lb score v11 kernel 0453 reset lb though reuslts slightly different one run another f1 macro metric unstable sevral item rear class contribute way thousand item common class 128 problem low public lb score model mentioned first version kernel resulted bug evaluation metric httpswwwkagglecomchumanproteinatlasimageclassificationdiscussion69366409041 relies order record submission file rather id", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Convolutional Neural Network (CNN)", "Classification"]}