{"title": "CVRP 2018 Starter Kernel U-Net with ResNet50 ", "description": "This is my idea for using a U-Net like architecture for instance segmentation. I use ResNet50 for encoder and add my own decoder. The instance classification task is implicitly done by placing instances from each category into one of 7 categorical masks. I've seen others (in literature) using a separate fully connected classification layer on top of the final feature map for instance classification. However, I want to experiment with this implicit classification approach (and to remove dedicated classification layer all together). Instance segmentation is done by predicting boundaries of each masks, then separate the masks in the post. This is still work in progress, I only got the model to train properly and still need more training. I also need to work on the post processing. Please let me know if you have any suggestion to improve.", "link": "https://www.kaggle.com/ishootlaser/cvrp-2018-starter-kernel-u-net-with-resnet50", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-05-20 05:56:16", "date_scraped": "2020-12-12 18:34:37", "words": 138, "sentences": 9, "runtime": 0.0, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.2918638586997986, "description_category_runtime": 11.761, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9847153425216675, "description_subcategory_runtime": 18.353, "category": "Real Estate, Rental & Leasing", "category_score": 0.2918638586997986, "subcategory": "Machine Learning", "subcategory_score": 0.9847153425216675, "runtime_cat": 30.116, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.707", "language_code": "en", "language_score": "0.9999966981680303", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "idea using unet like architecture instance segmentation use resnet50 encoder add decoder instance classification task implicitly done placing instance category one 7 categorical mask ive seen others literature using separate fully connected classification layer top final feature map instance classification however want experiment implicit classification approach remove dedicated classification layer together instance segmentation done predicting boundary mask separate mask post still work progress got model train properly still need training also need work post processing please let know suggestion improve", "tags_descriptive": []}