{"title": "Naive Benchmark - Galactic vs Extragalactic", "description": "Galactic vs Extragalactic ObjectsThe astronomical transients that appear in this challenge can be separated into two distinct groups: ones that are in our Milky Way galaxy (galactic) and ones that are outside of our galaxy (extragalactic). As described in the data note, all of the galactic objects have been assigned a host galaxy photometric redshift of 0. We can use this information to immediately classify every object as either galactic or extragalactic and remove a lot of potential options from the classification. Doing so results in matching the naive benchmark. We find that all of the classes are either uniquely galactic or extragalactic except for class 99 which represents the unknown objects that aren't in the training set.", "link": "https://www.kaggle.com/kyleboone/naive-benchmark-galactic-vs-extragalactic", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-09-30 21:36:02", "date_scraped": "2020-12-13 15:38:22", "words": 118, "sentences": 5, "runtime": 0.0, "description_category": "Healthcare", "description_category_score": 0.13637040555477142, "description_category_runtime": 10.931, "description_subcategory": "Physical", "description_subcategory_score": 0.4343356192111969, "description_subcategory_runtime": 16.861, "category": "Healthcare", "category_score": 0.13637040555477142, "subcategory": "Physical", "subcategory_score": 0.4343356192111969, "runtime_cat": 27.792, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.738", "language_code": "en", "language_score": "0.9999949681701911", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "galactic v extragalactic objectsthe astronomical transient appear challenge separated two distinct group one milky way galaxy galactic one outside galaxy extragalactic described data note galactic object assigned host galaxy photometric redshift 0 use information immediately classify every object either galactic extragalactic remove lot potential option classification result matching naive benchmark find class either uniquely galactic extragalactic except class 99 represents unknown object arent training set", "tags_descriptive": []}