{"title": "EDA: Find Me In The Clouds ", "description": "Introduction & Loading The DataClimate change is one of the most important and pressing issues of our time. In this competition, we have the opportunity to use data to understand important climatic variables. The idea is if we can understand the cloud, we can better understand our environment and how it is changing. The idea of the competition is fairly simple. There are different types or patterns of clouds, and our task is to identify them and classify these types. If you like my work please upvote this Kernel. This encourages or motivates people like me, who contributes to Kaggle on their own time with the intention to share knowledge, to continue the effort. Furthermore, if I made a mistake or can do something more, please leave a comment in the comments section to help me out. Many thanks in advance!", "link": "https://www.kaggle.com/ekhtiar/eda-find-me-in-the-clouds", "tags": ["Classification", "Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-08-18 17:28:31", "date_scraped": "2020-12-13 18:07:53", "words": 141, "sentences": 9, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.196541428565979, "description_category_runtime": 11.645, "description_subcategory": "Quality", "description_subcategory_score": 0.6034404039382935, "description_subcategory_runtime": 18.299, "category": "Utilities", "category_score": 0.196541428565979, "subcategory": "Quality", "subcategory_score": 0.6034404039382935, "runtime_cat": 29.944, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.745", "language_code": "en", "language_score": "0.9999933560553667", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introduction loading dataclimate change one important pressing issue time competition opportunity use data understand important climatic variable idea understand cloud better understand environment changing idea competition fairly simple different type pattern cloud task identify classify type like work please upvote kernel encourages motivates people like contributes kaggle time intention share knowledge continue effort furthermore made mistake something please leave comment comment section help many thanks advance", "tags_descriptive": ["Classification", "Exploratory Data Analysis"]}