{"title": "bayesian optimization for robots", "description": "General informationIn this competition we have data about small mobile robot driving over different floor surfaces. We need to predict the floor type based on robot's sensor data. This kernel uses content of my previous kernel: https://www.kaggle.com/artgor/where-do-the-robots-drive Also I add bayesian optimization from this library: https://github.com/fmfn/BayesianOptimization Bayesian optimization works by constructing a posterior distribution of functions (gaussian process) that best describes the function you want to optimize. As the number of observations grows, the posterior distribution improves, and the algorithm becomes more certain of which regions in parameter space are worth exploring and which are not, as seen in the picture below.  work in progress", "link": "https://www.kaggle.com/artgor/bayesian-optimization-for-robots", "tags": ["Classification", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost", "lightgbm", "sklearn", "pattern", "catboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-10 21:28:48", "date_scraped": "2020-12-12 17:33:04", "words": 106, "sentences": 5, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.1370278000831604, "description_category_runtime": 11.333, "description_subcategory": "General", "description_subcategory_score": 0.9979634284973145, "description_subcategory_runtime": 17.425, "category": "Wholesale & Retail", "category_score": 0.1370278000831604, "subcategory": "General", "subcategory_score": 0.9979634284973145, "runtime_cat": 28.758, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.688", "language_code": "en", "language_score": "0.9999957927572838", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "general informationin competition data small mobile robot driving different floor surface need predict floor type based robot sensor data kernel us content previous kernel httpswwwkagglecomartgorwheredotherobotsdrive also add bayesian optimization library httpsgithubcomfmfnbayesianoptimization bayesian optimization work constructing posterior distribution function gaussian process best describes function want optimize number observation grows posterior distribution improves algorithm becomes certain region parameter space worth exploring seen picture work progress", "tags_descriptive": ["Classification", "Feature Engineering"]}