{"title": "Analysis YouTube8m 2019 ", "description": "The 3rd YouTube-8M Video Understanding ChallengeIn this competition, you will predict the Class labels of YouTube video segments. We provide you extracted frame-level features. The feature data and detailed feature information can be found on the YouTube-8M dataset webpage. The training dataset in this competition contains videos and labels that are publicly available on YouTube, while the test data is not publicly available. The test data also has anonymized video IDs to ensure the fairness of the competition. File descriptionsframe-level data  You may download to your local computer with instructions here Total size of 1.53TB (Large file warning!) Each video has a. id: unique id for the video, in train set it is a YouTube video id, and in test/validation they are anonymized. b. labels: list of labels of that video.   c. Each frame has rgb: float array of length 1024,   d. Each frame has audio: float array of length 128  A subset of the validation set videos are provided with segment-level labels. In addition to id, labels and the frame level features described above, they come with a. segment_start_times: list of segment start times.   b. segment_end_times: list of segment end times.   c. segment_labels: list of segment labels.   d. segment_scores: list of binary values indicating positive or negative corresponding to the segment labels.  Files are in TFRecords format, TensorFlow python readers are available in the github repo.   frame-sample.zip - a sample of frame-level data including train00 and train01 validate-sample.zip - a sample of validation set data including validate00 and validate01 vocabulary.csv - the full data dictionary for label names and their descriptions sample_submission.csv - a sample submission file in the correct format  For each Class, submit a space-delimited list of the segments your model predicts as having that class, ordered by confidence (highest first).  IMPORTANT: In order to minimize submission file sizes, for segment predictions, you should only include the video id and the segment start time, but not the segment end time. (These are not needed, since all segments are 5 seconds in duration.)", "link": "https://www.kaggle.com/jesucristo/analysis-youtube8m-2019", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["vocabulary", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-10 05:42:23", "date_scraped": "2020-12-13 18:45:07", "words": 352, "sentences": 24, "sum_nltk": "The 3rd YouTube-8M Video Understanding ChallengeIn this competition, you will predict the Class labels of YouTube video segments.\nThe training dataset in this competition contains videos and labels that are publicly available on YouTube, while the test data is not publicly available.\nThe test data also has anonymized video IDs to ensure the fairness of the competition.\nid: unique id for the video, in train set it is a YouTube video id, and in test/validation they are anonymized.\nEach frame has audio: float array of length 128  A subset of the validation set videos are provided with segment-level labels.\nframe-sample.zip - a sample of frame-level data including train00 and train01 validate-sample.zip - a sample of validation set data including validate00 and validate01 vocabulary.csv - the full data dictionary for label names and their descriptions sample_submission.csv - a sample submission file in the correct format  For each Class, submit a space-delimited list of the segments your model predicts as having that class, ordered by confidence (highest first).\nIMPORTANT: In order to minimize submission file sizes, for segment predictions, you should only include the video id and the segment start time, but not the segment end time.", "sum_nltk_words": 191, "sum_nltk_runtime": 0.005, "sum_t5": "the training dataset in this competition contains videos and labels that are publicly available on YouTube. the test data also has anonymized video IDs to ensure the fairness of the competition. a subset of the validation set videos are provided with segment-level labels. in addition to id, labels and the frame level features described above, they come with a. segment_start_times: list of segment start times. b. segment_end_times: list of segment end times. c. segment", "sum_t5_words": 74, "sum_t5_runtime": 6.954, "runtime": 0.007, "nltk_category": "Utilities", "nltk_category_score": 0.38348671793937683, "nltk_category_runtime": 18.061, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.7184593081474304, "nltk_subcategory_runtime": 29.081, "category": "Utilities", "category_score": 0.38348671793937683, "subcategory": "Machine Learning", "subcategory_score": 0.7184593081474304, "runtime_cat": 47.144, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.769", "language_code": "en", "language_score": "0.999995840950741", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "3rd youtube8m video understanding challengein competition predict class label youtube video segment provide extracted framelevel feature feature data detailed feature information found youtube8m dataset webpage training dataset competition contains video label publicly available youtube test data publicly available test data also anonymized video id ensure fairness competition file descriptionsframelevel data may download local computer instruction total size 153tb large file warning video id unique id video train set youtube video id testvalidation anonymized b label list label video c frame rgb float array length 1024 frame audio float array length 128 subset validation set video provided segmentlevel label addition id label frame level feature described come segment_start_times list segment start time b segment_end_times list segment end time c segment_labels list segment label segment_scores list binary value indicating positive negative corresponding segment label file tfrecords format tensorflow python reader available github repo framesamplezip sample framelevel data including train00 train01 validatesamplezip sample validation set data including validate00 validate01 vocabularycsv full data dictionary label name description sample_submissioncsv sample submission file correct format class submit spacedelimited list segment model predicts class ordered confidence highest first important order minimize submission file size segment prediction include video id segment start time segment end time needed since segment 5 second duration", "tags_descriptive": []}