{"title": "[Tutorial] Image Feature Extraction and Matching", "description": "www.codeproject.com/KB/recipes/619039/SIFT.JPG  Cathedral of St. John the Baptist in Trnava, Slovakia. Feature ExtractionFor this competition, we will be mostly matching images based on their local features, a.k.a. interest points. A local image feature is a tiny patch in the image that's invariant to image scaling, rotation and change in illumination.  It's like the tip of a tower, or the corner of a window in the image above.  Unlike a random point on the background (sky) in the image above, the tip of the tower can be precise detected in most images of the same scene.  It is geometricly (translation, rotation, ...) and photometricly (brightness, exposure, ...) invariant. A good local feature is like the piece you start with when solving a jigsaw puzzle, except on a much smaller scale.  It's the eye of the cat or the corner of the table, not a piece on a blank wall. The extracted local features must be:  Repeatable and precise so they can be extracted from different images showing the same object. Distinctive to the image, so images with different structure will not have them.  There could be hundreds or thousands of such features in an image.  An image matcher algorithm could still work if some of the features are blocked by an object or badly deformed due to change in brightness or exposure.  Many local feature algorithms are highly efficient and can be used in real-time applications. Due to these requirements, most local feature detectors extract corners and blobs. Local Feature Detection and DescriptionThere is a wealth of algorithms satisfying the above requirements for feature detection (finding interest points on an image) and description (generating a vector representation for them).  They include Harris Corner Detection, Scale Invariant Feature Transform (SIFT), Speeded-Up Robust Features (SURF), Features from Accelerated Segment Test (FAST), and Binary Robust Independent Elementary Features (BRIEF). In this tutorial, we will use Oriented FAST and Rotated BRIEF (ORB) for feature detection and description.  This algorithm was developed and implemented by OpenCV Labs, and it's part of their OpenCV library for computer vision. Let's start by extracting the local features of the image shown in the banner above.  It's the Cathedral of St. John the Baptist in Trnava, Slovakia.", "link": "https://www.kaggle.com/wesamelshamy/tutorial-image-feature-extraction-and-matching", "tags": ["CV", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-05-29 23:06:32", "date_scraped": "2020-12-13 12:58:59", "words": 378, "sentences": 23, "sum_nltk": "A local image feature is a tiny patch in the image that's invariant to image scaling, rotation and change in illumination.\nIt's like the tip of a tower, or the corner of a window in the image above.\nUnlike a random point on the background (sky) in the image above, the tip of the tower can be precise detected in most images of the same scene.\nA good local feature is like the piece you start with when solving a jigsaw puzzle, except on a much smaller scale.\nThe extracted local features must be:  Repeatable and precise so they can be extracted from different images showing the same object.\nAn image matcher algorithm could still work if some of the features are blocked by an object or badly deformed due to change in brightness or exposure.\nLocal Feature Detection and DescriptionThere is a wealth of algorithms satisfying the above requirements for feature detection (finding interest points on an image) and description (generating a vector representation for them).\nThey include Harris Corner Detection, Scale Invariant Feature Transform (SIFT), Speeded-Up Robust Features (SURF), Features from Accelerated Segment Test (FAST), and Binary Robust Independent Elementary Features (BRIEF).", "sum_nltk_words": 188, "sum_nltk_runtime": 0.005, "sum_t5": "a local image feature is a tiny patch in the image that's invariant to image scaling, rotation and change in illumination. many local feature algorithms are highly efficient and can be used in real-time applications. a good local feature is like the piece you start with when solving a jigsaw puzzle, except on a much smaller scale. the algorithm is based on a series of algorithms developed by openCV labs.", "sum_t5_words": 70, "sum_t5_runtime": 6.137, "runtime": 0.005, "nltk_category": "Construction & Engineering", "nltk_category_score": 0.4496992230415344, "nltk_category_runtime": 17.525, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.4580754339694977, "nltk_subcategory_runtime": 27.578, "category": "Construction & Engineering", "category_score": 0.4496992230415344, "subcategory": "Physical", "subcategory_score": 0.4580754339694977, "runtime_cat": 45.103, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.804", "language_code": "en", "language_score": "0.9999974229965591", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "wwwcodeprojectcomkbrecipes619039siftjpg cathedral st john baptist trnava slovakia feature extractionfor competition mostly matching image based local feature aka interest point local image feature tiny patch image thats invariant image scaling rotation change illumination like tip tower corner window image unlike random point background sky image tip tower precise detected image scene geometricly translation rotation photometricly brightness exposure invariant good local feature like piece start solving jigsaw puzzle except much smaller scale eye cat corner table piece blank wall extracted local feature must repeatable precise extracted different image showing object distinctive image image different structure could hundred thousand feature image image matcher algorithm could still work feature blocked object badly deformed due change brightness exposure many local feature algorithm highly efficient used realtime application due requirement local feature detector extract corner blob local feature detection descriptionthere wealth algorithm satisfying requirement feature detection finding interest point image description generating vector representation include harris corner detection scale invariant feature transform sift speededup robust feature surf feature accelerated segment test fast binary robust independent elementary feature brief tutorial use oriented fast rotated brief orb feature detection description algorithm developed implemented opencv lab part opencv library computer vision let start extracting local feature image shown banner cathedral st john baptist trnava slovakia", "tags_descriptive": ["Computer Vision (CV)", "Feature Engineering"]}