{"title": "Basic EDA Face Detection, split video and ROI", "description": "First Impression about Deepfake Detection Challenge </div>  Deepfake techniques, which present realistic AI-generated videos of people doing and saying fictional things, have the potential to have a significant impact on how people determine the legitimacy of information presented online. These content generation and modification technologies may affect the quality of public discourse and the safeguarding of human rights—especially given that deepfakes may be used maliciously as a source of misinformation, manipulation, harassment, and persuasion. Identifying manipulated media is a technically demanding and rapidly evolving challenge that requires collaborations across the entire tech industry and beyond.", "link": "https://www.kaggle.com/marcovasquez/basic-eda-face-detection-split-video-and-roi", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-12-24 23:56:58", "date_scraped": "2020-12-12 18:44:56", "words": 96, "sentences": 3, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.37042900919914246, "description_category_runtime": 8.918, "description_subcategory": "Student", "description_subcategory_score": 0.5362207293510437, "description_subcategory_runtime": 13.885, "category": "Education & Research", "category_score": 0.37042900919914246, "subcategory": "Student", "subcategory_score": 0.5362207293510437, "runtime_cat": 22.803, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.729", "language_code": "en", "language_score": "0.9999977129113764", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "first impression deepfake detection challenge div deepfake technique present realistic aigenerated video people saying fictional thing potential significant impact people determine legitimacy information presented online content generation modification technology may affect quality public discourse safeguarding human rightsespecially given deepfakes may used maliciously source misinformation manipulation harassment persuasion identifying manipulated medium technically demanding rapidly evolving challenge requires collaboration across entire tech industry beyond", "tags_descriptive": []}