{"title": "3. Impact of CTL (Content, Tone, Language) - CoLA", "description": "Data Science For Good : CoLA A Complete Pipeline for Structuring, Analysis and Recommendation Improve Hiring Process and Decisions  Key Objectives: Keeping these challenges in mind, an ideal solution for the City of Los Angeles has following key objectives: Develop an nlp framework to accurately structurize the job descriptions. Develop an analysis framework to identify the implict bias in the text and encourage diversity. Develop a system which can clearly identify the promotion pathways within the organization.My Submission: Following are parts of Kernels Submissions in order:  Part 1: Job Bulletin Structuring Engine - City of Los Angeles   Part 2: Encourage Diversity and Remove Unconsious Bias from Job Bulletins - A Deep Analysis  Part 3: Impact of Content, Tone, and Language : CTL Analysis for CoLA  Part 4: Increasing the Discoverability of Promotional Pathways (Explicit)  Part 5: Implicit Promotional Pathways DiscoverabilityPart 3: Impact of Content, Tone, and Language in Job Bulletins  Other Parts: Part 1 | Part 2 | Part 3 | Part 4 | Part 5 The aim of this kernel is to provide an analysis framework which performs various types of text analysis on the job bulletins of City of Los Angeles. The goal of all types of analysis is to measure how well the job descriptions are written. The hypothesis is if the text is well written and fully serves its purpose, then it is likely to attract a good quality and quantity of applicants. To validate the hypothesis, I have also created a benchmark index using an indirect method, which can be used to compare CoLA insights with the market insightsTable of Contents1. Why Content, Tone, Format and Language Matters? 2. Creating a Benchmark Index for Hypothesis Validation     2.1 Analogy of using a Market Benchmark     2.2 Analysis of Job Bulletins of Fortune 500 Companies 3. Content: Is the Content of CoLA Job Descriptions Optimal?     3.1 Are the Job Descriptions of City of LA too Lengthy?     3.2 Are the Job Descriptions of City of LA too Wordy?     3.3 Are the Job Bulletins difficult to read ?     3.4 What does the Readability analysis of Bulletins suggest?     3.5 Which Job Bulletins are too wordy?     3.6 What are the outlier Job Bulletins - least wordy     3.7 Outlier Job Bulletins - easier to read     3.8 Relatively, which Job Bulletins are difficult to read 4. Language: Is the Language of CoLA Job Descriptions Optimal?     4.1 How well the Job Bulletins describes Duties?     4.2 Does the Word Choice convey a lot of strictness? 5. Is the format optimal?  6. Tone: What does the Tone and Sentiment of CoLA Job Descriptions suggest? 7. Key Recommendations  1. Why Content, Tone, Language and Layout Matters ?A number of studies (LinkedIn, Forbes, and Glassdoor) have suggested that both the quality and the quantity of applicant's pool can be significantly influenced by how a job description is written. \"A well-written, complete, and insightful job description can result in attracting some of the top and diverse talents for the role\". On the other hand, a description which lacks key features (example - an optimal word limit, choice of the words, language used, overall tone) may result in attracting fewer candidates. It is important for City of Los Angeles to share the job descriptions with optimal and satisfactory content, language, tone, and the layout. The job descriptions are meant to effectively communicate about a particular job class, duties, responsibilities, requirements, and company to the audience. The point worth noting is that, the audience may have versatile backgrounds, demographics, different thought processes, intelligence, intellectuals, and different skills. With such diversity possible in applicants, it become important for the company to make sure that job descriptions are generic and not focussed to target a particular group.  Content: Content plays the most important role in describing the overall quality of a job description. Use of too many words, long paragraphs, and irrelevant verbose may not be perceived equally by all candidates, Especially women who according to Harvard Business Review, tend to get 100% clarity about the job before applying. Another example from Linkedin study was related to length of job descriptions, Shorter job posts garnered a higher application rate than longer ones. Thus, keeping the job description text concise and optimal helps candidates immediately get the info they need.  Tone: For any big company it is important to express a professional tone in the job descriptions. An ideal text should be written in a formal tone and should reflect company's actual culture. The overall tone can be formal, generic or casual tones. Moreover, Use of particular wordings or phrases can also communicate emotional tones, which can have a direct impact on the applicant pool. For instance, more use of words with negative sentiment may reflect a pessimistic tone and may give a bad impression. It may result in only a fraction of potential applicants will apply.  Language: Choice of words and phrases is another important factor that makes up a good job description. Langauge analysis is about evaluating if the text conveys the proper message it is meant to be. One key example is about job duties which are meant to convey what the person will be doing if they are hired. It is possible that langauge or text of job duties section may not properly convey all those actions.    2. Creating A Benchmark Index for Hypothesis Validation The problem statement of this challenge is very open ended and without actual applicant's response data, one cannot validate if all the intution and hypothesis are correct or not. Though I have used a number of other studies and researches conducted by many other companies as the reference to suggest key hypothesis but it is also important to develop a high level validation strategy.  2.1 Analogy of using a Market Benchmark Index  Analogy: In stock markets, investors refer to S&P 500 index which is an aggreagted stock index based on the market capitalizations of 500 large companies having common stock listed on the NYSE, NASDAQ, or the Cboe BZX Exchange. Investors use this index to understand how the overall market is performing and if their stock is also aligned (or below, or above) with it. Hence, it serve as a benchmark index.      In the similar manner, I created my own benchmark index by analysing the Job Descriptions of Fortune 500 Companies (Forbes: Fortune 500 companies). Use of this index, gives us a \"Industry\" benchmark (similar to \"market\" in S&P 500). Ofcourse, this index may not convey an exact reflection of metrics but this index definately gives the most ideal metrics which are used by some of the top and big companies having diverse sectors.    To state an example, it will be interesting to compare what is the average number of words used in City of Los Angeles job descriptions and that of Fortune 500 companies descriptions.      The following diagram explains how I developed this index   I obtained the list of 2019 fortune 500 companies from Forbes. I made different input queries (location=\"la\", role=\"CityofLA Job Roles\", company=\"One of the 500 companies\") and queried them in Free Public API of Indeed to obtain the job bulletins of these 500 companies. I obtained maximum three job descriptions per company, obtained the text data, and calculated all the relevant metrics to be used as a benchmark. The script of this process is shared in the next cell. The code is commented, it requires two arguments - API_KEY (which can be obtained from this link - https://opensource.indeedeng.io/api-documentation/) and a list of job roles to be searched. Adding this benchmark comparison gives a data-driven perspective to this problem along with our hypothesis.", "link": "https://www.kaggle.com/shivamb/3-impact-of-ctl-content-tone-language-cola", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["nltk", "spacy", "pattern", "textblob"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-06-21 08:53:07", "date_scraped": "2020-12-12 18:42:37", "words": 1293, "sentences": 50, "sum_nltk": "Data Science For Good : CoLA A Complete Pipeline for Structuring, Analysis and Recommendation Improve Hiring Process and Decisions  Key Objectives: Keeping these challenges in mind, an ideal solution for the City of Los Angeles has following key objectives: Develop an nlp framework to accurately structurize the job descriptions.\nTo validate the hypothesis, I have also created a benchmark index using an indirect method, which can be used to compare CoLA insights with the market insightsTable of Contents1.\n2. Creating a Benchmark Index for Hypothesis Validation     2.1 Analogy of using a Market Benchmark     2.2 Analysis of Job Bulletins of Fortune 500 Companies 3.\nWhy Content, Tone, Language and Layout Matters ?A number of studies (LinkedIn, Forbes, and Glassdoor) have suggested that both the quality and the quantity of applicant's pool can be significantly influenced by how a job description is written.\nOn the other hand, a description which lacks key features (example - an optimal word limit, choice of the words, language used, overall tone) may result in attracting fewer candidates.\nIt is important for City of Los Angeles to share the job descriptions with optimal and satisfactory content, language, tone, and the layout.", "sum_nltk_words": 190, "sum_nltk_runtime": 0.017, "sum_t5": "the aim of this kernel is to provide an analysis framework which performs various types of text analysis on the job bulletins of City of Los Angeles. the goal of all types of analysis is to measure how well the job descriptions are written. if the text is well written and fully serves its purpose, then it is likely to attract a good quality and quantity of applicants. if the text is well written and fully serves its purpose, then it is likely to attract a good quality and quantity of applicants.", "sum_t5_words": 92, "sum_t5_runtime": 6.78, "runtime": 0.005, "nltk_category": "Construction & Engineering", "nltk_category_score": 0.6420063376426697, "nltk_category_runtime": 17.868, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.7373908162117004, "nltk_subcategory_runtime": 28.526, "category": "Construction & Engineering", "category_score": 0.6420063376426697, "subcategory": "Quality", "subcategory_score": 0.7373908162117004, "runtime_cat": 46.396, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.657", "language_code": "en", "language_score": "0.9999966945789496", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data science good cola complete pipeline structuring analysis recommendation improve hiring process decision key objective keeping challenge mind ideal solution city los angeles following key objective develop nlp framework accurately structurize job description develop analysis framework identify implict bias text encourage diversity develop system clearly identify promotion pathway within organizationmy submission following part kernel submission order part 1 job bulletin structuring engine city los angeles part 2 encourage diversity remove unconsious bias job bulletin deep analysis part 3 impact content tone language ctl analysis cola part 4 increasing discoverability promotional pathway explicit part 5 implicit promotional pathway discoverabilitypart 3 impact content tone language job bulletin part part 1 part 2 part 3 part 4 part 5 aim kernel provide analysis framework performs various type text analysis job bulletin city los angeles goal type analysis measure well job description written hypothesis text well written fully serf purpose likely attract good quality quantity applicant validate hypothesis also created benchmark index using indirect method used compare cola insight market insightstable contents1 content tone format language matter 2 creating benchmark index hypothesis validation 21 analogy using market benchmark 22 analysis job bulletin fortune 500 company 3 content content cola job description optimal 31 job description city la lengthy 32 job description city la wordy 33 job bulletin difficult read 34 readability analysis bulletin suggest 35 job bulletin wordy 36 outlier job bulletin least wordy 37 outlier job bulletin easier read 38 relatively job bulletin difficult read 4 language language cola job description optimal 41 well job bulletin describes duty 42 word choice convey lot strictness 5 format optimal 6 tone tone sentiment cola job description suggest 7 key recommendation 1 content tone language layout matter number study linkedin forbes glassdoor suggested quality quantity applicant pool significantly influenced job description written wellwritten complete insightful job description result attracting top diverse talent role hand description lack key feature example optimal word limit choice word language used overall tone may result attracting fewer candidate important city los angeles share job description optimal satisfactory content language tone layout job description meant effectively communicate particular job class duty responsibility requirement company audience point worth noting audience may versatile background demographic different thought process intelligence intellectual different skill diversity possible applicant become important company make sure job description generic focussed target particular group content content play important role describing overall quality job description use many word long paragraph irrelevant verbose may perceived equally candidate especially woman according harvard business review tend get 100 clarity job applying another example linkedin study related length job description shorter job post garnered higher application rate longer one thus keeping job description text concise optimal help candidate immediately get info need tone big company important express professional tone job description ideal text written formal tone reflect company actual culture overall tone formal generic casual tone moreover use particular wording phrase also communicate emotional tone direct impact applicant pool instance use word negative sentiment may reflect pessimistic tone may give bad impression may result fraction potential applicant apply language choice word phrase another important factor make good job description langauge analysis evaluating text conveys proper message meant one key example job duty meant convey person hired possible langauge text job duty section may properly convey action 2 creating benchmark index hypothesis validation problem statement challenge open ended without actual applicant response data one cannot validate intution hypothesis correct though used number study research conducted many company reference suggest key hypothesis also important develop high level validation strategy 21 analogy using market benchmark index analogy stock market investor refer sp 500 index aggreagted stock index based market capitalization 500 large company common stock listed nyse nasdaq cboe bzx exchange investor use index understand overall market performing stock also aligned hence serve benchmark index similar manner created benchmark index analysing job description fortune 500 company forbes fortune 500 company use index give u industry benchmark similar market sp 500 ofcourse index may convey exact reflection metric index definately give ideal metric used top big company diverse sector state example interesting compare average number word used city los angeles job description fortune 500 company description following diagram explains developed index obtained list 2019 fortune 500 company forbes made different input query locationla rolecityofla job role companyone 500 company queried free public api indeed obtain job bulletin 500 company obtained maximum three job description per company obtained text data calculated relevant metric used benchmark script process shared next cell code commented requires two argument api_key obtained link httpsopensourceindeedengioapidocumentation list job role searched adding benchmark comparison give datadriven perspective problem along hypothesis", "tags_descriptive": []}