{"title": "Sentiment Analysis : CountVectorizer & TF-IDF", "description": "Intro to Movie Review Sentiment Analysis For the movie review sentiment analysis, we will be working on The Rotten Tomatoes movie review dataset from Kaggle.  Here, we'll have to label phrases on a scale of five values: negative, somewhat negative, neutral, somewhat positive, positive based on the sentiment of the movie reviews. The dataset is comprised of tab-separated files with phrases from the Rotten Tomatoes dataset. Each phrase has a PhraseId. Each sentence has a SentenceId. Phrases that are repeated (such as short/common words) are only included once in the data. The sentiment labels are:  0 - negative 1 - somewhat negative 2 - neutral 3 - somewhat positive 4 - positive  Any suggestions for improvement or comments are highly appreciated! Please upvote(like button) and share this kernel if you like it so that more people can learn from it.", "link": "https://www.kaggle.com/divsinha/sentiment-analysis-countvectorizer-tf-idf", "tags": ["Classification", "Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "vocabulary", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-08-02 15:41:24", "date_scraped": "2020-12-13 14:14:35", "words": 143, "sentences": 7, "runtime": 0.002, "description_category": "Justice, Law and Regulations", "description_category_score": 0.2471570372581482, "description_category_runtime": 13.064, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.44332200288772583, "description_subcategory_runtime": 20.355, "category": "Justice, Law and Regulations", "category_score": 0.2471570372581482, "subcategory": "Machine Learning", "subcategory_score": 0.44332200288772583, "runtime_cat": 33.419, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.779", "language_code": "en", "language_score": "0.9999962310937638", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "intro movie review sentiment analysis movie review sentiment analysis working rotten tomato movie review dataset kaggle well label phrase scale five value negative somewhat negative neutral somewhat positive positive based sentiment movie review dataset comprised tabseparated file phrase rotten tomato dataset phrase phraseid sentence sentenceid phrase repeated shortcommon word included data sentiment label 0 negative 1 somewhat negative 2 neutral 3 somewhat positive 4 positive suggestion improvement comment highly appreciated please upvotelike button share kernel like people learn", "tags_descriptive": ["Classification", "Exploratory Data Analysis"]}