{"title": "Pseudo Labeling - QDA - [0.969]", "description": "Pseudo Labeling with QDA scores LB 0.969Roman posted a kernel introducing pseudo labeling here. I would like to explain why it works, make a few improvements, and demonstrate the power of this technique! This kernel is the same as my support vector machine kernel here with QDA and pseudo labeling added. It achieves an impresive CV 0.970 and LB 0.969 In Santander's Customer Transaction competition, team Wizardry used pseudo labeling to increase their private LB by 0.0005 allowing them to beat second place by 0.0002 for the $25,000 prize! here In \"Instant Gratification\" competition, we are building 512 models where each model's train data has approximately 512 rows and 40 columns. With 40 variables, a quadratic model would like more rows. With pseudo labeling, we can get an additional 400 rows of training data and increase CV and LB by 0.005!", "link": "https://www.kaggle.com/cdeotte/pseudo-labeling-qda-0-969", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-06-06 01:15:30", "date_scraped": "2020-12-13 11:53:26", "words": 141, "sentences": 5, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.08402948826551437, "description_category_runtime": 13.645, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9018598198890686, "description_subcategory_runtime": 20.708, "category": "Utilities", "category_score": 0.08402948826551437, "subcategory": "Machine Learning", "subcategory_score": 0.9018598198890686, "runtime_cat": 34.353, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.784", "language_code": "en", "language_score": "0.9999966244389469", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "pseudo labeling qda score lb 0969roman posted kernel introducing pseudo labeling would like explain work make improvement demonstrate power technique kernel support vector machine kernel qda pseudo labeling added achieves impresive cv 0970 lb 0969 santanders customer transaction competition team wizardry used pseudo labeling increase private lb 00005 allowing beat second place 00002 25000 prize instant gratification competition building 512 model model train data approximately 512 row 40 column 40 variable quadratic model would like row pseudo labeling get additional 400 row training data increase cv lb 0005", "tags_descriptive": []}