{"title": "85.5% ROC_AUC Private Test", "description": "Credit Scoring  First of all, Thank you for your interest in my notebook. If you feel useful please upvote for me. Thank you for your consideration. Introduction\" A credit score is a numerical expression based on a level analysis of a person's credit files, to represent the creditworthiness of an individual. A credit score is primarily based on a credit report, information typically sourced from credit bureaus.Lenders, such as banks and credit card companies, use credit scores to evaluate the potential risk posed by lending money to consumers and to mitigate losses due to bad debt. Lenders use credit scores to determine who qualifies for a loan, at what interest rate, and what credit limits. Lenders also use credit scores to determine which customers are likely to bring in the most revenue. The use of credit or identity scoring prior to authorizing access or granting credit is an implementation of a trusted system.Credit scoring is not limited to banks. Other organizations, such as mobile phone companies, insurance companies, landlords, and government departments employ the same techniques. Digital finance companies such as online lenders also use alternative data sources to calculate the creditworthiness of borrowers. \" 1  Overview of my solution  OutlineI. Preprocess 1,1. Replace mising value 1.2. Split data 1.3. Robust transform  II. Visualization 2.1. Heat map  2.2. Boxplot  III. OUTLIER-DETECTION 3.1. Why do we use Tukey's method ? 3.2. TUKEY’S METHOD  IV. Algorithm 4.1. Classifiers (Knn, Logistic regression, Naive Bayes, Random Forest, Decision Tree) 4.2. Random Undersampling 4.3. Random Oversampling 4.4. Lightgbm", "link": "https://www.kaggle.com/sentrankim/85-5-roc-auc-private-test", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-14 05:22:30", "date_scraped": "2020-12-12 20:13:55", "words": 260, "sentences": 26, "sum_nltk": "Credit Scoring  First of all, Thank you for your interest in my notebook.\nIf you feel useful please upvote for me.\nThank you for your consideration.\nIntroduction\" A credit score is a numerical expression based on a level analysis of a person's credit files, to represent the creditworthiness of an individual.\nA credit score is primarily based on a credit report, information typically sourced from credit bureaus.Lenders, such as banks and credit card companies, use credit scores to evaluate the potential risk posed by lending money to consumers and to mitigate losses due to bad debt.\nLenders use credit scores to determine who qualifies for a loan, at what interest rate, and what credit limits.\nLenders also use credit scores to determine which customers are likely to bring in the most revenue.\nThe use of credit or identity scoring prior to authorizing access or granting credit is an implementation of a trusted system.Credit scoring is not limited to banks.\nDigital finance companies such as online lenders also use alternative data sources to calculate the creditworthiness of borrowers.\nWhy do we use Tukey's method ?\nClassifiers (Knn, Logistic regression, Naive Bayes, Random Forest, Decision Tree) 4.2.\nRandom Undersampling 4.3.\nRandom Oversampling 4.4.", "sum_nltk_words": 190, "sum_nltk_runtime": 0.004, "sum_t5": "credit scoring is not limited to banks; other organizations use the same techniques. digital finance companies such as online lenders also use alternative data sources. a credit score is a numerical expression based on a level analysis of a person's credit files. a credit score is primarily based on a credit report, information typically sourced from credit bureaus. a credit score is a numerical expression based on a level analysis of a person's credit files.", "sum_t5_words": 75, "sum_t5_runtime": 6.184, "runtime": 0.005, "nltk_category": "Finance", "nltk_category_score": 0.10412605106830597, "nltk_category_runtime": 18.62, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.0519244410097599, "nltk_subcategory_runtime": 29.929, "category": "Finance", "category_score": 0.10412605106830597, "subcategory": "Student", "subcategory_score": 0.0519244410097599, "runtime_cat": 48.55, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.6", "language_code": "en", "language_score": "0.9999967555289541", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "credit scoring first thank interest notebook feel useful please upvote thank consideration introduction credit score numerical expression based level analysis person credit file represent creditworthiness individual credit score primarily based credit report information typically sourced credit bureauslenders bank credit card company use credit score evaluate potential risk posed lending money consumer mitigate loss due bad debt lender use credit score determine qualifies loan interest rate credit limit lender also use credit score determine customer likely bring revenue use credit identity scoring prior authorizing access granting credit implementation trusted systemcredit scoring limited bank organization mobile phone company insurance company landlord government department employ technique digital finance company online lender also use alternative data source calculate creditworthiness borrower 1 overview solution outlinei preprocess 11 replace mising value 12 split data 13 robust transform ii visualization 21 heat map 22 boxplot iii outlierdetection 31 use tukeys method 32 tukeys method iv algorithm 41 classifier knn logistic regression naive bayes random forest decision tree 42 random undersampling 43 random oversampling 44 lightgbm", "tags_descriptive": []}