{"title": "Starter Devkit Lyft3D", "description": "Lyft 3D Object Detection for Autonomous Vehicles   Self-driving technology presents a rare opportunity to improve the quality of life in many of our communities. Avoidable collisions, single-occupant commuters, and vehicle emissions are choking cities, while infrastructure strains under rapid urban growth. Autonomous vehicles are expected to redefine transportation and unlock a myriad of societal, environmental, and economic benefits. You can apply your data analysis skills in this competition to advance the state of self-driving technology.  This dataset aims to democratize access to such data, and foster innovation in higher-level autonomy functions for everyone, everywhere. By conducting a competition, we hope to encourage the research community to focus on hard problems in this space—namely, 3D object detection over semantic maps. In this competition, you will build and optimize algorithms based on a large-scale dataset. This dataset features the raw sensor camera inputs as perceived by a fleet of multiple, high-end, autonomous vehicles in a restricted geographic area. References Lyft: Quick EDA and creating useful files by @xhlulu Official Devkit for the public 2019 Lyft Level 5 AV Dataset by @iglovikov", "link": "https://www.kaggle.com/jesucristo/starter-devkit-lyft3d", "tags": ["Exploratory Data Analysis", "Automotive"], "kind": ["Project", "(Notebook)"], "ml_libs": ["opencv-python", "Pillow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-13 10:43:37", "date_scraped": "2020-12-12 16:08:03", "words": 182, "sentences": 9, "runtime": 0.003, "description_category": "Education & Research", "description_category_score": 0.315375953912735, "description_category_runtime": 16.404, "description_subcategory": "Transportation", "description_subcategory_score": 0.9186391234397888, "description_subcategory_runtime": 26.012, "category": "Education & Research", "category_score": 0.315375953912735, "subcategory": "Transportation", "subcategory_score": 0.9186391234397888, "runtime_cat": 42.416, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.718", "language_code": "en", "language_score": "0.9999967448462832", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "lyft 3d object detection autonomous vehicle selfdriving technology present rare opportunity improve quality life many community avoidable collision singleoccupant commuter vehicle emission choking city infrastructure strain rapid urban growth autonomous vehicle expected redefine transportation unlock myriad societal environmental economic benefit apply data analysis skill competition advance state selfdriving technology dataset aim democratize access data foster innovation higherlevel autonomy function everyone everywhere conducting competition hope encourage research community focus hard problem spacenamely 3d object detection semantic map competition build optimize algorithm based largescale dataset dataset feature raw sensor camera input perceived fleet multiple highend autonomous vehicle restricted geographic area reference lyft quick eda creating useful file xhlulu official devkit public 2019 lyft level 5 av dataset iglovikov", "tags_descriptive": ["Exploratory Data Analysis", "Automotive"]}