{"title": "covid-19 forcasting", "description": "What is Novel Coronavirus?The novel coronavirus (provisionally named 2019-nCoV) is a contagious virus that causes respiratory infection. It has been identified as the causative agent of the ongoing 2019–20 Wuhan coronavirus outbreak. As many early cases were linked to a large seafood and animal market, the virus is thought to have a zoonotic origin, but this has not been confirmed. Comparisons of the genetic sequences of this virus and other virus samples have shown similarities to SARS-CoV (79.5%) and bat coronaviruses (96%), which makes an ultimate origin in bats likely. The first known human infection occurred in December 8, 2019. An outbreak of 2019-nCoV was first detected in Wuhan, China, in mid-December 2019.The virus subsequently spread to all other provinces of China and to more than twenty other countries in Asia, Europe, North America, and Oceania. Human-to-human spread of the virus has been confirmed in China, Germany, Thailand, Taiwan, Japan, and the United States. As of 1 February 2020, there were 12,024 confirmed cases of infection, of which 11,860 were within mainland China. Cases outside China, to date, were people who have either travelled from Wuhan, or were in direct contact with someone who travelled from the area. The number of deaths was 259 as of 1 February 2020. Source: https://en.wikipedia.org/wiki/Novel_coronavirus_(2019-nCoV)", "link": "https://www.kaggle.com/kdnishanth/covid-19-forcasting", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-17 12:11:06", "date_scraped": "2020-12-12 18:20:14", "words": 211, "sentences": 11, "sum_nltk": "What is Novel Coronavirus?The novel coronavirus (provisionally named 2019-nCoV) is a contagious virus that causes respiratory infection.\nIt has been identified as the causative agent of the ongoing 2019–20 Wuhan coronavirus outbreak.\nAs many early cases were linked to a large seafood and animal market, the virus is thought to have a zoonotic origin, but this has not been confirmed.\nComparisons of the genetic sequences of this virus and other virus samples have shown similarities to SARS-CoV (79.5%) and bat coronaviruses (96%), which makes an ultimate origin in bats likely.\nThe first known human infection occurred in December 8, 2019.\nAn outbreak of 2019-nCoV was first detected in Wuhan, China, in mid-December 2019.The virus subsequently spread to all other provinces of China and to more than twenty other countries in Asia, Europe, North America, and Oceania.\nHuman-to-human spread of the virus has been confirmed in China, Germany, Thailand, Taiwan, Japan, and the United States.\nAs of 1 February 2020, there were 12,024 confirmed cases of infection, of which 11,860 were within mainland China.\nCases outside China, to date, were people who have either travelled from Wuhan, or were in direct contact with someone who travelled from the area.\nThe number of deaths was 259 as of 1 February 2020.\nSource: https://en.wikipedia.org/wiki/Novel_coronavirus_(2019-nCoV)", "sum_nltk_words": 201, "sum_nltk_runtime": 0.003, "sum_t5": "the novel coronavirus (provisionally named 2019-nCoV) causes respiratory infection. the virus is thought to have a zoonotic origin, but this has not been confirmed. the first known human infection occurred in December 8, 2019. the virus has been confirmed in china, Germany, Thailand, Taiwan, Japan, and the u.s.. a total of 12,024 confirmed cases of infection were confirmed in mainland china.", "sum_t5_words": 61, "sum_t5_runtime": 4.704, "runtime": 0.0, "nltk_category": "Healthcare", "nltk_category_score": 0.6565357446670532, "nltk_category_runtime": 23.293, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.7159692645072937, "nltk_subcategory_runtime": 36.849, "category": "Healthcare", "category_score": 0.6565357446670532, "subcategory": "Quality", "subcategory_score": 0.7159692645072937, "runtime_cat": 60.142, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.662", "language_code": "en", "language_score": "0.9999980945888973", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "novel coronavirusthe novel coronavirus provisionally named 2019ncov contagious virus cause respiratory infection identified causative agent ongoing 201920 wuhan coronavirus outbreak many early case linked large seafood animal market virus thought zoonotic origin confirmed comparison genetic sequence virus virus sample shown similarity sarscov 795 bat coronaviruses 96 make ultimate origin bat likely first known human infection occurred december 8 2019 outbreak 2019ncov first detected wuhan china middecember 2019the virus subsequently spread province china twenty country asia europe north america oceania humantohuman spread virus confirmed china germany thailand taiwan japan united state 1 february 2020 12024 confirmed case infection 11860 within mainland china case outside china date people either travelled wuhan direct contact someone travelled area number death 259 1 february 2020 source httpsenwikipediaorgwikinovel_coronavirus_2019ncov", "tags_descriptive": []}