{"title": "EDA - Ion Switching", "description": "EDA - Ion SwitchingMany diseases, including cancer, are believed to have a contributing factor in common. Ion channels are pore-forming proteins present in animals and plants. They encode learning and memory, help fight infections, enable pain signals, and stimulate muscle contraction. If scientists could better study ion channels, which may be possible with the aid of machine learning, it could have a far-reaching impact. When ion channels open, they pass electric currents. Existing methods of detecting these state changes are slow and laborious. Humans must supervise the analysis, which imparts considerable bias, in addition to being tedious. These difficulties limit the volume of ion channel current analysis that can be used in research. Scientists hope that technology could enable rapid automatic detection of ion channel current events in raw data.   I'll update this EDA notebook in the following days/weeks. Stay tuned!", "link": "https://www.kaggle.com/pestipeti/eda-ion-switching", "tags": ["Exploratory Data Analysis", "Time Series Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-02-27 21:56:53", "date_scraped": "2020-12-13 13:17:30", "words": 143, "sentences": 11, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.4974486231803894, "description_category_runtime": 12.778, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8931373357772827, "description_subcategory_runtime": 19.954, "category": "Education & Research", "category_score": 0.4974486231803894, "subcategory": "Machine Learning", "subcategory_score": 0.8931373357772827, "runtime_cat": 32.732, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.729", "language_code": "en", "language_score": "0.9999956176520524", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "eda ion switchingmany disease including cancer believed contributing factor common ion channel poreforming protein present animal plant encode learning memory help fight infection enable pain signal stimulate muscle contraction scientist could better study ion channel may possible aid machine learning could farreaching impact ion channel open pas electric current existing method detecting state change slow laborious human must supervise analysis imparts considerable bias addition tedious difficulty limit volume ion channel current analysis used research scientist hope technology could enable rapid automatic detection ion channel current event raw data ill update eda notebook following daysweeks stay tuned", "tags_descriptive": ["Exploratory Data Analysis", "Time Series Analysis"]}