{"title": "Blue Book Bulldozer - Fast.ai Deep Learning", "description": "MotivationTree-based models like Random Forest and XGBoost has become very poplular to address tabular(structured) data problems and gained a lot of tractions in Kaggle competitions. It has its very deserving reasons. A lot of the notebooks for this competition is inspired by fast.ai ML course. This notebook will also try to use fast.ai, but another approach: Deep Learning.  This is a bit against industry consensous that Deep Learning is more for unstructured data like image, audio or NLP, and usually won't be very good at handling tabular data. Yet, the introduction of embedding for the categorical data changed this perspective and we'll try to use fast.ai's tabular model to tackle this competition and see how well a Deep Learning approach can do.", "link": "https://www.kaggle.com/lymenlee/blue-book-bulldozer-fast-ai-deep-learning", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-11-21 06:39:31", "date_scraped": "2020-12-12 17:19:45", "words": 123, "sentences": 6, "runtime": 0.002, "description_category": "Healthcare", "description_category_score": 0.2343241274356842, "description_category_runtime": 12.096, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.78033846616745, "description_subcategory_runtime": 18.949, "category": "Healthcare", "category_score": 0.2343241274356842, "subcategory": "Machine Learning", "subcategory_score": 0.78033846616745, "runtime_cat": 31.045, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.673", "language_code": "en", "language_score": "0.9999959740920034", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "motivationtreebased model like random forest xgboost become poplular address tabularstructured data problem gained lot traction kaggle competition deserving reason lot notebook competition inspired fastai ml course notebook also try use fastai another approach deep learning bit industry consensous deep learning unstructured data like image audio nlp usually wont good handling tabular data yet introduction embedding categorical data changed perspective well try use fastais tabular model tackle competition see well deep learning approach", "tags_descriptive": []}