{"title": "Rotation Augmentation GPU/TPU - [0.96+]", "description": "Data Augmentation using GPU/TPU for Maximum Speed!This notebook shows how perform rotation, shear, zoom, and shift data augmentation for the GPU/TPU with TensorFlow.data.Dataset. Data augmentation is a technique to increase model accuracy and using GPU/TPU achieves this goal quicker.  GPUs and TPUs can consume 200 or more images sized 512x512x3 in one second (while training DenseNet201)! That's incredible. If we perform data augmentation beforehand, we need to make sure we are preparing at least 200 images per second. Otherwise we will slow down our GPU/TPU training. This is the advantage of tensorflow.data.Dataset. After writing augmentation in TensorFlow language, your program will optimize these operations for GPU/TPU. Similarily, you can use libraries like Nvidia DALI here for GPU image preprocess and/or Nvidia RAPIDS here for GPU tabular preprocess.", "link": "https://www.kaggle.com/cdeotte/rotation-augmentation-gpu-tpu-0-96", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-19 03:13:16", "date_scraped": "2020-12-12 19:56:26", "words": 128, "sentences": 8, "runtime": 0.001, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.19123533368110657, "description_category_runtime": 14.062, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9265010952949524, "description_subcategory_runtime": 22.618, "category": "Real Estate, Rental & Leasing", "category_score": 0.19123533368110657, "subcategory": "Machine Learning", "subcategory_score": 0.9265010952949524, "runtime_cat": 36.679, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.768", "language_code": "en", "language_score": "0.9999978398562734", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data augmentation using gputpu maximum speedthis notebook show perform rotation shear zoom shift data augmentation gputpu tensorflowdatadataset data augmentation technique increase model accuracy using gputpu achieves goal quicker gpus tpus consume 200 image sized 512x512x3 one second training densenet201 thats incredible perform data augmentation beforehand need make sure preparing least 200 image per second otherwise slow gputpu training advantage tensorflowdatadataset writing augmentation tensorflow language program optimize operation gputpu similarily use library like nvidia dali gpu image preprocess andor nvidia rapid gpu tabular preprocess", "tags_descriptive": []}