{"title": "Exploratory Data Analysis and Example Generation", "description": "OverviewThe High Definition-Advanced Imaging Technology (HD-AIT) system files supplied in this contest range in size from 10MB to over 2GB per subject.  With just under 1200 examples, almost any approach will have to substantially reduce the size of the data to be fed into a machine learning model.  In the instructions, the organizers suggest that one may even be able to win the contest with one of the smaller image suites. So in this notebook, I take a whack at preprocessing the lowest res images we have and providing some basic building blocks for the preprocessing pipeline. A quick disclaimer, I'm not an expert on these systems or the related scans.  If you see something I've misunderstood or you think I've made an error, let me know and I'll correct it.  This contest is aimed at a critical problem.  I'm in this to help us get better at threat detection.  The community can definitely improve the predictive veracity of these scans.  Anyway, I'm excited to get going so let's jump in. To begin I collect all of the imports used in the notebook at the top.  It makes it easier when you're converting to a preprocessing script.", "link": "https://www.kaggle.com/virgodata/exploratory-data-analysis-and-example-generation", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-07-31 10:06:58", "date_scraped": "2020-12-13 15:06:52", "words": 205, "sentences": 12, "sum_nltk": "OverviewThe High Definition-Advanced Imaging Technology (HD-AIT) system files supplied in this contest range in size from 10MB to over 2GB per subject.\nWith just under 1200 examples, almost any approach will have to substantially reduce the size of the data to be fed into a machine learning model.\nIn the instructions, the organizers suggest that one may even be able to win the contest with one of the smaller image suites.\nSo in this notebook, I take a whack at preprocessing the lowest res images we have and providing some basic building blocks for the preprocessing pipeline.\nA quick disclaimer, I'm not an expert on these systems or the related scans.\nIf you see something I've misunderstood or you think I've made an error, let me know and I'll correct it.\nThis contest is aimed at a critical problem.\nI'm in this to help us get better at threat detection.\nThe community can definitely improve the predictive veracity of these scans.\nAnyway, I'm excited to get going so let's jump in.\nTo begin I collect all of the imports used in the notebook at the top.\nIt makes it easier when you're converting to a preprocessing script.", "sum_nltk_words": 186, "sum_nltk_runtime": 0.002, "sum_t5": "contest aims to help us get better at threat detection. system files supplied range in size from 10MB to over 2GB per subject. organizers suggest that one may even be able to win the contest with one of the smaller image suites. if you see something i've misunderstood or you think i've made an error, let me know and i'll correct it. cnn.com's john sutter is in this to help us get better", "sum_t5_words": 73, "sum_t5_runtime": 5.117, "runtime": 0.002, "nltk_category": "Utilities", "nltk_category_score": 0.5068178772926331, "nltk_category_runtime": 16.979, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.5079162120819092, "nltk_subcategory_runtime": 27.581, "category": "Utilities", "category_score": 0.5068178772926331, "subcategory": "Tools", "subcategory_score": 0.5079162120819092, "runtime_cat": 44.56, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.693", "language_code": "en", "language_score": "0.9999967856362264", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "overviewthe high definitionadvanced imaging technology hdait system file supplied contest range size 10mb 2gb per subject 1200 example almost approach substantially reduce size data fed machine learning model instruction organizer suggest one may even able win contest one smaller image suite notebook take whack preprocessing lowest re image providing basic building block preprocessing pipeline quick disclaimer im expert system related scan see something ive misunderstood think ive made error let know ill correct contest aimed critical problem im help u get better threat detection community definitely improve predictive veracity scan anyway im excited get going let jump begin collect import used notebook top make easier youre converting preprocessing script", "tags_descriptive": ["Exploratory Data Analysis"]}