{"title": "Cats vs Dogs:- Basic CNN tutorial", "description": "Hello All ! This is pretty basic tutorial to start off with Convolutional networks. Let's start with a bit of introduction Convolutional neural networks are primarily used to classify images or identify pattern similarities between them. So a convolutional network receives a normal color image as a rectangular box whose width and height are measured by the number of pixels along those dimensions, and whose depth is three layers deep, one for each letter in RGB. Those depth layers are referred to as channels. For simplification needs we will only consider gray scale image here. As images move through a convolutional network, different patterns are recognised just like a normal neural network. But here rather than focussing on one pixel at a time, a convolutional net takes in square patches of pixels and passes them through a filter. That filter is also a square matrix smaller than the image itself, and equal in size to the patch. It is also called a kernel.  Well that's it with the theory let's get started with the practical.", "link": "https://www.kaggle.com/ruchibahl18/cats-vs-dogs-basic-cnn-tutorial", "tags": ["DL"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-29 15:59:50", "date_scraped": "2020-12-12 18:56:57", "words": 176, "sentences": 10, "runtime": 0.005, "description_category": "Education & Research", "description_category_score": 0.21829605102539062, "description_category_runtime": 14.312, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.5110851526260376, "description_subcategory_runtime": 22.766, "category": "Education & Research", "category_score": 0.21829605102539062, "subcategory": "Machine Learning", "subcategory_score": 0.5110851526260376, "runtime_cat": 37.078, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.8", "language_code": "en", "language_score": "0.9999964760525328", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "hello pretty basic tutorial start convolutional network let start bit introduction convolutional neural network primarily used classify image identify pattern similarity convolutional network receives normal color image rectangular box whose width height measured number pixel along dimension whose depth three layer deep one letter rgb depth layer referred channel simplification need consider gray scale image image move convolutional network different pattern recognised like normal neural network rather focussing one pixel time convolutional net take square patch pixel pass filter filter also square matrix smaller image equal size patch also called kernel well thats theory let get started practical", "tags_descriptive": ["Deep Learning (DL)"]}