{"title": "CNN with Keras for Humpback Whale ID", "description": "Humpback Whale Identification - CNN with Keras This is a solution for the challenge \"Humpback Whale Identification\". It is based on a Convolutional Neural Network using Keras. During the challenge I have created multiple versions of this CNN to try and improve my results. Most of the code for those versions are still in this notebook in hidden sections of the code and commented. The version which is not commented or hidden is the one that produced my best results in the challenge. In this code I have chosen not to split the training set to create a test set, because of the characteristics of the data. Many of the classes have only one picture that corresponds to them, so randomly selecting a test set would be harmful for training. I did try data augmentation, as can be seen in previous versions of this code. However, because I was running in the Kaggle kernel, the increase in the amout of data increased the runtime and, due to kernel limitation, that resulted in a decrease in the number of iterations. The results I obtained using the augmented data were, then, worse than the ones simply using the given data.", "link": "https://www.kaggle.com/anezka/cnn-with-keras-for-humpback-whale-id", "tags": ["DL", "Classification", "CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-07-10 22:03:06", "date_scraped": "2020-12-13 18:17:20", "words": 198, "sentences": 10, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.007099923677742481, "description_category_runtime": 15.759, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9740369319915771, "description_subcategory_runtime": 25.815, "category": "Utilities", "category_score": 0.007099923677742481, "subcategory": "Machine Learning", "subcategory_score": 0.9740369319915771, "runtime_cat": 41.575, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.72", "language_code": "en", "language_score": "0.9999966631776892", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "humpback whale identification cnn kera solution challenge humpback whale identification based convolutional neural network using kera challenge created multiple version cnn try improve result code version still notebook hidden section code commented version commented hidden one produced best result challenge code chosen split training set create test set characteristic data many class one picture corresponds randomly selecting test set would harmful training try data augmentation seen previous version code however running kaggle kernel increase amout data increased runtime due kernel limitation resulted decrease number iteration result obtained using augmented data worse one simply using given data", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Convolutional Neural Network (CNN)"]}