{"title": "Crop, Save and View Nodules in 3D", "description": "Crop, Save and View Nodules in 3DFinal results:  This kernel shows you how to crop the nodule with given coordinates in patient's CT scan, how to save it in .npy and .mhd/.raw file, and how to view it in 3D. About half of the code is learned from other kernels. (Tutorial: U-Net Segmentation Approach to Cancer Diagnosis by Jonathan Mulholland and Aaron Sander, Booz Allen Hamilton, Full Preprocessing Tutorial by Guido Zuidhof, Candidate Generation and LUNA16 preprocessing by ArnavJain) The most fun part of this code is also learned from the Internet. I wanted a better way to visualize the region of interest my code generated. Then I searched online and found a method to save .mhd/.raw file posted by Price Jackson, with source code. The part I found useful was built on the MIT licensed work by Bing Jian and Baba C. Vemuri. I happened to know Fiji was a good tool to view volume stacks in 3D, with original intensity values. After integrating them together, I find visualize and check the results is not that much of pain. Actually, it comes with some fun and may give you some insights on the journey. This incites me to open a kernel here, though most of the code are from others. Running the code below, with given CT scan and given coordinates, will give you a cropped nodule in [19, 19, 19] dimensional numpy array, with spacing [1, 1, 1]mm. I will use LUNA16 as input data in the code. Because it comes with some annotated nodules. So I cannot run it here but I put the psedo-output in Markdown cells. The code has been tested in Python 3.5.", "link": "https://www.kaggle.com/rodenluo/crop-save-and-view-nodules-in-3d", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["SimpleITK"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-03-16 05:58:43", "date_scraped": "2020-12-12 18:38:03", "words": 280, "sentences": 16, "sum_nltk": "Crop, Save and View Nodules in 3DFinal results:  This kernel shows you how to crop the nodule with given coordinates in patient's CT scan, how to save it in .npy and .mhd/.raw file, and how to view it in 3D.\nAbout half of the code is learned from other kernels.\n(Tutorial: U-Net Segmentation Approach to Cancer Diagnosis by Jonathan Mulholland and Aaron Sander, Booz Allen Hamilton, Full Preprocessing Tutorial by Guido Zuidhof, Candidate Generation and LUNA16 preprocessing by ArnavJain) The most fun part of this code is also learned from the Internet.\nI wanted a better way to visualize the region of interest my code generated.\nThen I searched online and found a method to save .mhd/.raw file posted by Price Jackson, with source code.\nAfter integrating them together, I find visualize and check the results is not that much of pain.\nActually, it comes with some fun and may give you some insights on the journey.\nRunning the code below, with given CT scan and given coordinates, will give you a cropped nodule in [19, 19, 19] dimensional numpy array, with spacing [1, 1, 1]mm.\nI will use LUNA16 as input data in the code.\nBecause it comes with some annotated nodules.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.003, "sum_t5": "this kernel shows you how to crop, save and view nodules in 3DFinal results. about half of the code is learned from other kernels. the most fun part of this code is also learned from the Internet. the code has been tested in Python 3.5. a.mhd/.raw file is posted by Price Jackson, with source code. a.mhd/.raw file is also available for.mhd/.raw.", "sum_t5_words": 61, "sum_t5_runtime": 6.328, "runtime": 0.0, "nltk_category": "Healthcare", "nltk_category_score": 0.4315219521522522, "nltk_category_runtime": 20.197, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.48886144161224365, "nltk_subcategory_runtime": 32.423, "category": "Healthcare", "category_score": 0.4315219521522522, "subcategory": "Quality", "subcategory_score": 0.48886144161224365, "runtime_cat": 52.62, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.735", "language_code": "en", "language_score": "0.9999977049695656", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "crop save view nodule 3dfinal result kernel show crop nodule given coordinate patient ct scan save npy mhdraw file view 3d half code learned kernel tutorial unet segmentation approach cancer diagnosis jonathan mulholland aaron sander booz allen hamilton full preprocessing tutorial guido zuidhof candidate generation luna16 preprocessing arnavjain fun part code also learned internet wanted better way visualize region interest code generated searched online found method save mhdraw file posted price jackson source code part found useful built mit licensed work bing jian baba c vemuri happened know fiji good tool view volume stack 3d original intensity value integrating together find visualize check result much pain actually come fun may give insight journey incites open kernel though code others running code given ct scan given coordinate give cropped nodule 19 19 19 dimensional numpy array spacing 1 1 1mm use luna16 input data code come annotated nodule cannot run put psedooutput markdown cell code tested python 35", "tags_descriptive": []}