{"title": "Pulmonary Fibrosis Competition: EDA & DICOM Prep", "description": "OSIC Pulmonary Fibrosis Competition EDA and Preprocessing1. Introduction#1. Why do we do this?Pulmonary = lung | fibrosis = scar tissue => Scarring in the lungs. Over time, scarring can destroy the normal lung and make it hard for oxygen to get into your blood. Pulmonary fibrosis isn’t just one disease. It is a family of more than 200 different lung diseases that all look very much alike.   #2. EvaluationLaplace Log Likelihood (modified version): useful to evaluate a model's confidence in its decisions. The error is thresholded at 1000 ml to avoid large errors adversely penalizing results, while the confidence values are clipped at 70 ml to reflect the approximate measurement uncertainty in FVC. The final score is calculated by averaging the metric across all test set Patient_Weeks (three per patient). Note that metric values will be negative and higher is better. #3. Code CompetitionCode Competitions seem more fair to me. Keep in mind:  CPU runtime <= 9 hrs GPU runtime <= 4 hrs NO internet access (for inference, but can be used during training) Submission file name: submission.csv  #4. Competition aim:Predict how severe is going to decline the lung capacity in the lungs based on a CT (Computerised Tomography) scan + metadata of the patient. CTs can show soft tissues, blood vessels, and bones much more detailed than normal X-rays.  Lung Function: assessed based on a spirometer output which measures the FVC (forced vital capacity), meaning how much air is exhaled. Libraries ⬇", "link": "https://www.kaggle.com/andradaolteanu/pulmonary-fibrosis-competition-eda-dicom-prep", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-08-17 19:39:35", "date_scraped": "2020-12-13 14:44:51", "words": 248, "sentences": 18, "sum_nltk": "OSIC Pulmonary Fibrosis Competition EDA and Preprocessing1.\nWhy do we do this?Pulmonary = lung | fibrosis = scar tissue => Scarring in the lungs.\nOver time, scarring can destroy the normal lung and make it hard for oxygen to get into your blood.\nPulmonary fibrosis isn’t just one disease.\nIt is a family of more than 200 different lung diseases that all look very much alike.\nThe error is thresholded at 1000 ml to avoid large errors adversely penalizing results, while the confidence values are clipped at 70 ml to reflect the approximate measurement uncertainty in FVC.\nThe final score is calculated by averaging the metric across all test set Patient_Weeks (three per patient).\nNote that metric values will be negative and higher is better.\nCode CompetitionCode Competitions seem more fair to me.\nCompetition aim:Predict how severe is going to decline the lung capacity in the lungs based on a CT (Computerised Tomography) scan + metadata of the patient.\nCTs can show soft tissues, blood vessels, and bones much more detailed than normal X-rays.\nLung Function: assessed based on a spirometer output which measures the FVC (forced vital capacity), meaning how much air is exhaled.", "sum_nltk_words": 184, "sum_nltk_runtime": 0.003, "sum_t5": "Pulmonary fibrosis is a family of more than 200 different lung diseases. the competition aims to predict how severe is going to decline the lung capacity in the lungs. the final score is calculated by averaging the metric across all test set Patient_Weeks (three per patient) CPU runtime = 9 hrs GPU runtime = 4 hrs NO internet access (for inference, but can be used during training)", "sum_t5_words": 67, "sum_t5_runtime": 5.692, "runtime": 0.003, "nltk_category": "Healthcare", "nltk_category_score": 0.21724833548069, "nltk_category_runtime": 18.232, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.2551848292350769, "nltk_subcategory_runtime": 29.09, "category": "Healthcare", "category_score": 0.21724833548069, "subcategory": "Tools", "subcategory_score": 0.2551848292350769, "runtime_cat": 47.323, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.761", "language_code": "en", "language_score": "0.9999934973824727", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "osic pulmonary fibrosis competition eda preprocessing1 introduction1 thispulmonary lung fibrosis scar tissue scarring lung time scarring destroy normal lung make hard oxygen get blood pulmonary fibrosis isnt one disease family 200 different lung disease look much alike 2 evaluationlaplace log likelihood modified version useful evaluate model confidence decision error thresholded 1000 ml avoid large error adversely penalizing result confidence value clipped 70 ml reflect approximate measurement uncertainty fvc final score calculated averaging metric across test set patient_weeks three per patient note metric value negative higher better 3 code competitioncode competition seem fair keep mind cpu runtime 9 hr gpu runtime 4 hr internet access inference used training submission file name submissioncsv 4 competition aimpredict severe going decline lung capacity lung based ct computerised tomography scan metadata patient ct show soft tissue blood vessel bone much detailed normal xrays lung function assessed based spirometer output measure fvc forced vital capacity meaning much air exhaled library", "tags_descriptive": ["Exploratory Data Analysis"]}