{"title": "Data Analysis & XGBoost Starter (0.35460 LB)", "description": "Identifying Duplicate QuestionsWelcome to the Quora Question Pairs competition! Here, our goal is to identify which questions asked on Quora, a quasi-forum website with over 100 million visitors a month, are duplicates of questions that have already been asked. This could be useful, for example, to instantly provide answers to questions that have already been answered. We are tasked with predicting whether a pair of questions are duplicates or not, and submitting a binary prediction against the logloss metric. If you have any questions or want to discuss competitions/hardware/games/anything with other Kagglers, then join the KaggleNoobs Slack channel here. We also have regular AMAs with top Kagglers there. And as always, if this helped you, some upvotes would be very much appreciated - that's where I get my motivation! :D Let's dive right into the data!", "link": "https://www.kaggle.com/anokas/data-analysis-xgboost-starter-0-35460-lb", "tags": ["NLP", "Xgboost", "Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "nltk"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-04-12 16:22:19", "date_scraped": "2020-12-13 16:22:58", "words": 136, "sentences": 6, "runtime": 0.001, "description_category": "Education & Research", "description_category_score": 0.2244972437620163, "description_category_runtime": 12.938, "description_subcategory": "Student", "description_subcategory_score": 0.31628361344337463, "description_subcategory_runtime": 20.043, "category": "Education & Research", "category_score": 0.2244972437620163, "subcategory": "Student", "subcategory_score": 0.31628361344337463, "runtime_cat": 32.981, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.828", "language_code": "en", "language_score": "0.9999965836830295", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "identifying duplicate questionswelcome quora question pair competition goal identify question asked quora quasiforum website 100 million visitor month duplicate question already asked could useful example instantly provide answer question already answered tasked predicting whether pair question duplicate submitting binary prediction logloss metric question want discus competitionshardwaregamesanything kagglers join kagglenoobs slack channel also regular amas top kagglers always helped upvotes would much appreciated thats get motivation let dive right data", "tags_descriptive": ["Natural Language Processing (NLP)", "Xgboost", "Exploratory Data Analysis"]}