{"title": "Exploratory Analysis", "description": "Exploratory AnalysisDuring my undergraduate studies I had biology as one of my subjects and I enjoyed preparing the slides and looking at them using a microscope. So these images are interesting, and I get to learn a bit more about how Deep Learning impact the medical field. I liked the video overview given by Dr. Anne Carpenter and I am sure I will be able to learn quite a few things by participating in this. The images consist of different modalities and magnification as mentioned in this thread We want a single model that just works across all kinds of image modalities, no matter the size of the nuclei or the color scheme. Such a model could be built into software that biologists use with all kinds of microscopes and eliminate the need for them to train on their individual data or provide metadata about their cell type, microscope, resolution, etc. [Dr. Anne Carpenter](https://www.kaggle.com/drannecarpenter)  DisclaimerMy knowledge of Computer Vision, Microbiology & Deep Learning is very limited. I have been trying to follow courses and learn these interesting techniques, but I have realized that this is a vast field and there are too many things to learn.  My approach may not be the right one, but I am still going to try Most of the code here is borrowed from what others have been doing. I have just tweaked a few things here and there and expanded on the steps, so that I can see and understand what is happening behind the scenes. Any suggestions to improve the code here is welcome.", "link": "https://www.kaggle.com/jerrythomas/exploratory-analysis", "tags": ["Exploratory Data Analysis", "CV"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "opencv-python", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-03-12 09:19:52", "date_scraped": "2020-12-12 18:38:54", "words": 263, "sentences": 12, "sum_nltk": "So these images are interesting, and I get to learn a bit more about how Deep Learning impact the medical field.\nI liked the video overview given by Dr. Anne Carpenter and I am sure I will be able to learn quite a few things by participating in this.\nThe images consist of different modalities and magnification as mentioned in this thread We want a single model that just works across all kinds of image modalities, no matter the size of the nuclei or the color scheme.\nSuch a model could be built into software that biologists use with all kinds of microscopes and eliminate the need for them to train on their individual data or provide metadata about their cell type, microscope, resolution, etc.\n[Dr. Anne Carpenter](https://www.kaggle.com/drannecarpenter)  DisclaimerMy knowledge of Computer Vision, Microbiology & Deep Learning is very limited.\nI have been trying to follow courses and learn these interesting techniques, but I have realized that this is a vast field and there are too many things to learn.\nMy approach may not be the right one, but I am still going to try Most of the code here is borrowed from what others have been doing.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.002, "sum_t5": "a video overview of deep learning is given by dr. Anne Carpenter. the images consist of different modalities and magnification. the code here is borrowed from what others have been doing. any suggestions to improve the code here are welcome. a video overview of deep learning is available on kaggle.com. a video overview of deep learning is available here. a cnn user can submit a video to the kaggle community.", "sum_t5_words": 70, "sum_t5_runtime": 4.969, "runtime": 0.003, "nltk_category": "Healthcare", "nltk_category_score": 0.41542062163352966, "nltk_category_runtime": 16.835, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.5710927844047546, "nltk_subcategory_runtime": 27.216, "category": "Healthcare", "category_score": 0.41542062163352966, "subcategory": "Student", "subcategory_score": 0.5710927844047546, "runtime_cat": 44.052, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.721", "language_code": "en", "language_score": "0.999997596398895", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "exploratory analysisduring undergraduate study biology one subject enjoyed preparing slide looking using microscope image interesting get learn bit deep learning impact medical field liked video overview given dr anne carpenter sure able learn quite thing participating image consist different modality magnification mentioned thread want single model work across kind image modality matter size nucleus color scheme model could built software biologist use kind microscope eliminate need train individual data provide metadata cell type microscope resolution etc dr anne carpenterhttpswwwkagglecomdrannecarpenter disclaimermy knowledge computer vision microbiology deep learning limited trying follow course learn interesting technique realized vast field many thing learn approach may right one still going try code borrowed others tweaked thing expanded step see understand happening behind scene suggestion improve code welcome", "tags_descriptive": ["Exploratory Data Analysis", "Computer Vision (CV)"]}