{"title": "GridMask data augmentation with tensorflow", "description": "GridMask data augmentationType of image data augmentation can be rougly divided in to 3 categories :  Spatial transformation (random-crop, flip, rotation...) Color distortion (random gamma, brightness, hue, contrast....) Information dropping (random cutout, random erasing, hide-and-seek..)  GridMask is belong to Information dropping method. Information dropping might help improving model generalization through enforcing model to learn on remain information. But keeping the deletion and reservation region in a balance relation is needed. Too much information dropping might result in under-fitting, but too few might result in over-fitting.  There are also some concerns in old information dropping methods. Since the region they dropped will be randomly. So the information might be totally gone after dropping, which make the data into noise. GridMask deletes the structured regions which are uniformly distributed squares. Since the deleting regions are continuous distributed, so the information missing problem can be improve.  Image rotation is refer to Chris's great kernel and add some of mine code in it. Which can rotate image with different aspect ratio. I also implemented some data augmentation methods(gaussian blur, random cutout..) in this kernel. My Github repo : GridMask_tensorflow(not official)  Official GridMask implementation in pytorch : GridMask  Paper : GridMask Data Augmentation", "link": "https://www.kaggle.com/xiejialun/gridmask-data-augmentation-with-tensorflow", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-02-29 06:30:32", "date_scraped": "2020-12-12 19:56:26", "words": 204, "sentences": 13, "sum_nltk": "GridMask data augmentationType of image data augmentation can be rougly divided in to 3 categories :  Spatial transformation (random-crop, flip, rotation...) Color distortion (random gamma, brightness, hue, contrast....) Information dropping (random cutout, random erasing, hide-and-seek..)  GridMask is belong to Information dropping method.\nInformation dropping might help improving model generalization through enforcing model to learn on remain information.\nBut keeping the deletion and reservation region in a balance relation is needed.\nToo much information dropping might result in under-fitting, but too few might result in over-fitting.\nThere are also some concerns in old information dropping methods.\nSince the region they dropped will be randomly.\nSo the information might be totally gone after dropping, which make the data into noise.\nGridMask deletes the structured regions which are uniformly distributed squares.\nSince the deleting regions are continuous distributed, so the information missing problem can be improve.\nImage rotation is refer to Chris's great kernel and add some of mine code in it.\nWhich can rotate image with different aspect ratio.\nI also implemented some data augmentation methods(gaussian blur, random cutout..) in this kernel.\nMy Github repo : GridMask_tensorflow(not official)  Official GridMask implementation in pytorch : GridMask  Paper : GridMask Data Augmentation", "sum_nltk_words": 190, "sum_nltk_runtime": 0.003, "sum_t5": "GridMask is belong to Information dropping method. too much information dropping might result in under-fitting. too few might result in over-fitting. gridMask deletes the structured regions which are uniformly distributed squares. image rotation is refer to Chris's great kernel and add some of mine code in it. i also implemented some data augmentation methods(gaussian blur, random cutout.. in this kernel.", "sum_t5_words": 60, "sum_t5_runtime": 4.771, "runtime": 0.0, "nltk_category": "Construction & Engineering", "nltk_category_score": 0.32732704281806946, "nltk_category_runtime": 19.723, "nltk_subcategory": "General", "nltk_subcategory_score": 0.5868680477142334, "nltk_subcategory_runtime": 31.952, "category": "Construction & Engineering", "category_score": 0.32732704281806946, "subcategory": "General", "subcategory_score": 0.5868680477142334, "runtime_cat": 51.676, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.682", "language_code": "en", "language_score": "0.9999960149655813", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "gridmask data augmentationtype image data augmentation rougly divided 3 category spatial transformation randomcrop flip rotation color distortion random gamma brightness hue contrast information dropping random cutout random erasing hideandseek gridmask belong information dropping method information dropping might help improving model generalization enforcing model learn remain information keeping deletion reservation region balance relation needed much information dropping might result underfitting might result overfitting also concern old information dropping method since region dropped randomly information might totally gone dropping make data noise gridmask deletes structured region uniformly distributed square since deleting region continuous distributed information missing problem improve image rotation refer chriss great kernel add mine code rotate image different aspect ratio also implemented data augmentation methodsgaussian blur random cutout kernel github repo gridmask_tensorflownot official official gridmask implementation pytorch gridmask paper gridmask data augmentation", "tags_descriptive": []}