{"title": "Getting Started with Herbarium 2020", "description": "The New York Botanical Garden (NYBG) herbarium contains more than 7.8 million plant and fungal specimens. Herbaria are a massive repository of plant diversity data. These collections not only represent a vast amount of plant diversity, but since herbarium collections include specimens dating back hundreds of years, they provide snapshots of plant diversity through time. The integrity of the plant is maintained in herbaria as a pressed, dried specimen; a specimen collected nearly two hundred years ago by Darwin looks much the same as one collected a month ago by an NYBG botanist. All specimens not only maintain their morphological features but also include collection dates and locations, and the name of the person who collected the specimen. This information, multiplied by millions of plant collections, provides the framework for understanding plant diversity on a massive scale and learning how it has changed over time.", "link": "https://www.kaggle.com/rsingh99/getting-started-with-herbarium-2020", "tags": ["DL"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-03-11 20:41:44", "date_scraped": "2020-12-12 20:41:48", "words": 145, "sentences": 6, "runtime": 0.005, "description_category": "Utilities", "description_category_score": 0.33105698227882385, "description_category_runtime": 12.602, "description_subcategory": "Physical", "description_subcategory_score": 0.642459511756897, "description_subcategory_runtime": 19.514, "category": "Utilities", "category_score": 0.33105698227882385, "subcategory": "Physical", "subcategory_score": 0.642459511756897, "runtime_cat": 32.117, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.694", "language_code": "en", "language_score": "0.9999972327163666", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "new york botanical garden nybg herbarium contains 78 million plant fungal specimen herbarium massive repository plant diversity data collection represent vast amount plant diversity since herbarium collection include specimen dating back hundred year provide snapshot plant diversity time integrity plant maintained herbarium pressed dried specimen specimen collected nearly two hundred year ago darwin look much one collected month ago nybg botanist specimen maintain morphological feature also include collection date location name person collected specimen information multiplied million plant collection provides framework understanding plant diversity massive scale learning changed time", "tags_descriptive": ["Deep Learning (DL)"]}