{"title": "Simple Exploration Notebook - Zillow Prize", "description": "In this notebook, let us try and explore the data given for Zillow prize competition. Before we dive deep into the data, let us know a little more about the competition. Zillow: Zillow is an online real estate database company founded in 2006 - Wikipedia Zestimate: “Zestimates” are estimated home values based on 7.5 million statistical and machine learning models that analyze hundreds of data points on each property. And, by continually improving the median margin of error (from 14% at the onset to 5% today), Objective: Building a model to improve the Zestimate residual error. The competition is in two stages. This public competition will go on till Jan 2018 and has $50,000 in prize. Please make sure to read about the Prize details and Competition overview since it is quite different in this one. Let us first import the necessary modules.", "link": "https://www.kaggle.com/sudalairajkumar/simple-exploration-notebook-zillow-prize", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-06-03 15:40:10", "date_scraped": "2020-12-13 18:50:10", "words": 143, "sentences": 8, "runtime": 0.002, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.3213003873825073, "description_category_runtime": 12.884, "description_subcategory": "Real Estate", "description_subcategory_score": 0.8452312350273132, "description_subcategory_runtime": 20.017, "category": "Real Estate, Rental & Leasing", "category_score": 0.3213003873825073, "subcategory": "Real Estate", "subcategory_score": 0.8452312350273132, "runtime_cat": 32.902, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.818", "language_code": "en", "language_score": "0.9999977276770606", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notebook let u try explore data given zillow prize competition dive deep data let u know little competition zillow zillow online real estate database company founded 2006 wikipedia zestimate zestimates estimated home value based 75 million statistical machine learning model analyze hundred data point property continually improving median margin error 14 onset 5 today objective building model improve zestimate residual error competition two stage public competition go till jan 2018 50000 prize please make sure read prize detail competition overview since quite different one let u first import necessary module", "tags_descriptive": ["Exploratory Data Analysis"]}