{"title": "⚜️ The Hitchhiker's Guide to the Kaggle", "description": "Introduction : ⚜️ The Hitchhiker's Guide to the Kaggle GalaxyRoad to Kaggle Grandmaster!!  Hi, I'm a semi-newbie who loves kaggle :) First, I would like to thank the Kaggle team and the Kagglers for conducting this survey. I am happy to be able to analyze these data. I've been preparing for an algorithm competition (such as ICPC) for about three years, and it's been about a year since I entered the DS/ML field. I love the sharing culture of AI, so I have some community managers in Korea, and I have a Facebook page.  My Facebook Page Background, made by me :)  I'm going to analyze / visualize what I'd be curious about as a newbie Kaggler. I am analyzing what I was wondering about, what frameworks are some people doing, and what frameworks are they using? I'm not as good at English as a native speaker. Therefore, I will replace some of the articles with highly readable visualizations. Invites you to a world of interactive and unusual visualizations. Please enjoy my kernel!!  img from https://giphy.com/gifs/friends-nick-at-nite-xT0BKiK5sOCVdBUhiM   Table of Contents Simple Distribution (Age, Gender, Country) Age & Gender Gender & Country Thinking About Gender imbalance     Which Algorithm Is Most Popular? How About Machine Learning Frameworks & Tools? Correlation between Algorithm & Tools Relationship between structured data and unstructured data   How About Popularity of Kaggler's Programming Language? What is the relationship between ML Career and Language recommendations? What is the relationship between Programming Career and Language recommendations? Personal thoughts about the visualization library my experience & introduce visualization library   What kind of DB do people use?  How about Kaggler's development environment like? IDE Notebook   What kind of Jobs do Kagglers have? What is their educational background? Jobs & Education Jobs & Language Jobs & ML Framework   Is salary high depending on career? How about educational background? Career & Salary Education & Salary   How about Gender, Age, Country & Salary? Age & Salary Gender & Salary Gender wage inequality   Country & Salary   Where is the Best Source to study machine learning? Favorite Source Best Source   Who paid a lot? Gender & Spending Age & Spending", "link": "https://www.kaggle.com/subinium/the-hitchhiker-s-guide-to-the-kaggle", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "albumentations", "xgboost", "tensorflow", "lightgbm", "sklearn", "autosklearn", "pattern", "tpot"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-12-02 04:33:58", "date_scraped": "2020-12-13 12:25:09", "words": 379, "sentences": 9, "sum_nltk": "Hi, I'm a semi-newbie who loves kaggle :) First, I would like to thank the Kaggle team and the Kagglers for conducting this survey.\nMy Facebook Page Background, made by me :)  I'm going to analyze / visualize what I'd be curious about as a newbie Kaggler.\nI am analyzing what I was wondering about, what frameworks are some people doing, and what frameworks are they using?\nHow About Machine Learning Frameworks & Tools?\nCorrelation between Algorithm & Tools Relationship between structured data and unstructured data   How About Popularity of Kaggler's Programming Language?\nWhat is the relationship between ML Career and Language recommendations?\nWhat is the relationship between Programming Career and Language recommendations?\nHow about Kaggler's development environment like?\nIDE Notebook   What kind of Jobs do Kagglers have?\nJobs & Education Jobs & Language Jobs & ML Framework   Is salary high depending on career?\nHow about educational background?\nHow about educational background?\nCareer & Salary Education & Salary   How about Gender, Age, Country & Salary?\nAge & Salary Gender & Salary Gender wage inequality   Country & Salary   Where is the Best Source to study machine learning?\nGender & Spending Age & Spending", "sum_nltk_words": 191, "sum_nltk_runtime": 0.005, "sum_t5": "a survey of kagglers asked me what frameworks are some people doing. a kaggler's algorithm is popular, but is it a good fit for a newbie? a kaggler's DB is a great way to visualize data. a kaggler's DB is a great way to visualize data. a kaggler's DB is a great way to visualize data.", "sum_t5_words": 56, "sum_t5_runtime": 6.519, "runtime": 0.0, "nltk_category": "Manufacturing", "nltk_category_score": 0.08300970494747162, "nltk_category_runtime": 18.659, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.4969233572483063, "nltk_subcategory_runtime": 29.674, "category": "Manufacturing", "category_score": 0.08300970494747162, "subcategory": "Machine Learning", "subcategory_score": 0.4969233572483063, "runtime_cat": 48.334, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.74", "language_code": "en", "language_score": "0.9999980761788558", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introduction hitchhiker guide kaggle galaxyroad kaggle grandmaster hi im seminewbie love kaggle first would like thank kaggle team kagglers conducting survey happy able analyze data ive preparing algorithm competition icpc three year year since entered dsml field love sharing culture ai community manager korea facebook page facebook page background made im going analyze visualize id curious newbie kaggler analyzing wondering framework people framework using im good english native speaker therefore replace article highly readable visualization invite world interactive unusual visualization please enjoy kernel img httpsgiphycomgifsfriendsnickatnitext0bkik5socvdbuhim table content simple distribution age gender country age gender gender country thinking gender imbalance algorithm popular machine learning framework tool correlation algorithm tool relationship structured data unstructured data popularity kagglers programming language relationship ml career language recommendation relationship programming career language recommendation personal thought visualization library experience introduce visualization library kind db people use kagglers development environment like ide notebook kind job kagglers educational background job education job language job ml framework salary high depending career educational background career salary education salary gender age country salary age salary gender salary gender wage inequality country salary best source study machine learning favorite source best source paid lot gender spending age spending", "tags_descriptive": ["Exploratory Data Analysis"]}