{"title": "BQML : Predict Wait Times", "description": "Google BigQueryBigQuery is a popular data warehouse solution from Google. Its serverless architecture makes it highly scalable with very little effort. The serverless architecture allows end user to purely focus on the individual functions in the code. In Google BigQuery end user does not have to worry about the underlying hardware, virtual machine, and number of nodes or instances etc. The user simply writes an SQL query and executes it. BigQuery’s execution algorithm analyzes the necessary resources needed to execute the query as fast as possible, provisions the resources, performs the query execution, and releases the resources.", "link": "https://www.kaggle.com/sanikamal/bqml-predict-wait-times", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-10-17 15:20:36", "date_scraped": "2020-12-12 17:10:49", "words": 97, "sentences": 6, "runtime": 0.005, "description_category": "Justice, Law and Regulations", "description_category_score": 0.5410250425338745, "description_category_runtime": 9.098, "description_subcategory": "General", "description_subcategory_score": 0.7501708269119263, "description_subcategory_runtime": 13.961, "category": "Justice, Law and Regulations", "category_score": 0.5410250425338745, "subcategory": "General", "subcategory_score": 0.7501708269119263, "runtime_cat": 23.058, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.647", "language_code": "en", "language_score": "0.9999971613557015", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "google bigquerybigquery popular data warehouse solution google serverless architecture make highly scalable little effort serverless architecture allows end user purely focus individual function code google bigquery end user worry underlying hardware virtual machine number node instance etc user simply writes sql query executes bigquerys execution algorithm analyzes necessary resource needed execute query fast possible provision resource performs query execution release resource", "tags_descriptive": []}