{"title": "Beginner's Guide to Audio Data", "description": "Freesound General-Purpose Audio Tagging Challenge Freesound is a collaborative database of Creative Commons Licensed sounds. The aim of this competition is to classify audio files that cover real-world sounds from musical instruments, humans, animals, machines, etc. Few of the labels are: Trumpet, Squeak, Meow, Applause and Finger_sapping.  One of the challenges is that not all labels are manually verified. A creative solution should be able to partially rely on these weak annotations. Let's take a tour of the data visualization and model building through this kernel. If you like this work, please show your support by upvotes. Happy Kaggling! Contents Exploratory Data Analysis Loading data Distribution of Categories Reading Audio Files Audio Length   Building a Model using Raw Wave Model Discription Configuration DataGenerator class Normalization Training 1D Conv Ensembling 1D Conv Predictions   Introduction to MFCC Generating MFCC using Librosa   Building a Model using MFCC Preparing Data Normalization Training 2D Conv on MFCC Ensembling 2D Conv Predictions   Ensembling 1D Conv and 2D Conv Predictions Results and Conclusion   1. Exploratory Data Analysis", "link": "https://www.kaggle.com/fizzbuzz/beginner-s-guide-to-audio-data", "tags": ["DL", "CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-04-12 07:41:33", "date_scraped": "2020-12-12 20:04:19", "words": 181, "sentences": 9, "runtime": 0.006, "description_category": "Utilities", "description_category_score": 0.49724456667900085, "description_category_runtime": 17.333, "description_subcategory": "General", "description_subcategory_score": 0.8740489482879639, "description_subcategory_runtime": 27.419, "category": "Utilities", "category_score": 0.49724456667900085, "subcategory": "General", "subcategory_score": 0.8740489482879639, "runtime_cat": 44.753, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.816", "language_code": "en", "language_score": "0.9999962897428605", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "freesound generalpurpose audio tagging challenge freesound collaborative database creative common licensed sound aim competition classify audio file cover realworld sound musical instrument human animal machine etc label trumpet squeak meow applause finger_sapping one challenge label manually verified creative solution able partially rely weak annotation let take tour data visualization model building kernel like work please show support upvotes happy kaggling content exploratory data analysis loading data distribution category reading audio file audio length building model using raw wave model discription configuration datagenerator class normalization training 1d conv ensembling 1d conv prediction introduction mfcc generating mfcc using librosa building model using mfcc preparing data normalization training 2d conv mfcc ensembling 2d conv prediction ensembling 1d conv 2d conv prediction result conclusion 1 exploratory data analysis", "tags_descriptive": ["Deep Learning (DL)", "Convolutional Neural Network (CNN)"]}