{"title": "Fastai factory approach using mask images", "description": "I'm currently doing the fastai practical deep learning course. An option for lesson 3's homework was to try out a segmentation problem, so this seemed like a good opportunity to do that. To keep things simple I kept it to just the 27 main apparel items (no apparel parts or attributes), and I converted run-encoded pixels to png images to feed into the standard SegmentationItemList. Improvement areas:  Create a custom SegmentationItemList that takes the run length enconded masks directly (as is done in internueron's kernel) Use more data, currently limited to ~10% of the training images (5k) to save time Use larger images, currently using 224x224 images to save time  I may work on the above, but for now am going to continue with the course. Maybe this kernel helps others.", "link": "https://www.kaggle.com/solpaul/fastai-factory-approach-using-mask-images", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-10-17 18:38:10", "date_scraped": "2020-12-13 11:35:56", "words": 133, "sentences": 5, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.0895351693034172, "description_category_runtime": 12.792, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7356828451156616, "description_subcategory_runtime": 19.093, "category": "Wholesale & Retail", "category_score": 0.0895351693034172, "subcategory": "Machine Learning", "subcategory_score": 0.7356828451156616, "runtime_cat": 31.885, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.691", "language_code": "en", "language_score": "0.9999972840056492", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "im currently fastai practical deep learning course option lesson 3 homework try segmentation problem seemed like good opportunity keep thing simple kept 27 main apparel item apparel part attribute converted runencoded pixel png image feed standard segmentationitemlist improvement area create custom segmentationitemlist take run length enconded mask directly done internuerons kernel use data currently limited 10 training image 5k save time use larger image currently using 224x224 image save time may work going continue course maybe kernel help others", "tags_descriptive": []}