{"title": "Is there any job out there? Kaggle vs Glassdoor", "description": "Is there any job out there? Hello? Hello? Hello?  Is there any job out there? Just nod if you can hire me. Is there anyone at the HR? Come on now...  I hear you're feeling down.  Well I can ease your pain.  Get you on your feet again.  Relax. Adapted from Comfortably Numb by Pink Floyd   A comparison between Kaggle Survey and Glassdoor Jobs ListingsOn last year's survey I did an analysis to understand What Makes a Kaggler Valuable, the idea was basically to identify what makes someone earn more than USD 100k per year when working in data related jobs. One year after I have moved from Brazil to United Kingdom, from Data Science to Data Engineering, and from earning around USD 14k per year to more than halfway to the USD 100k/year. For this year survey, I thought it would be nice to compare Kagglers skills to job listings around the world. To achieve that I have scraped Glassdoor listings looking for the search terms from Question 5 (job title) of this year's survey. Then I compared the results from both survey respondents and Glassdoor Listings. Hope you find it informative and useful to plan your career!", "link": "https://www.kaggle.com/andresionek/is-there-any-job-out-there-kaggle-vs-glassdoor", "tags": ["Employment"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-12-03 00:12:44", "date_scraped": "2020-12-13 12:25:09", "words": 206, "sentences": 12, "sum_nltk": "Hello?\nHello?\nHello?\nIs there any job out there?\nIs there any job out there?\nJust nod if you can hire me.\nCome on now...\nI hear you're feeling down.\nWell I can ease your pain.\nGet you on your feet again.\nRelax.\nAdapted from Comfortably Numb by Pink Floyd   A comparison between Kaggle Survey and Glassdoor Jobs ListingsOn last year's survey I did an analysis to understand What Makes a Kaggler Valuable, the idea was basically to identify what makes someone earn more than USD 100k per year when working in data related jobs.\nOne year after I have moved from Brazil to United Kingdom, from Data Science to Data Engineering, and from earning around USD 14k per year to more than halfway to the USD 100k/year.\nFor this year survey, I thought it would be nice to compare Kagglers skills to job listings around the world.\nTo achieve that I have scraped Glassdoor listings looking for the search terms from Question 5 (job title) of this year's survey.\nThen I compared the results from both survey respondents and Glassdoor Listings.\nHope you find it informative and useful to plan your career!", "sum_nltk_words": 179, "sum_nltk_runtime": 0.003, "sum_t5": "a comparison between Kaggle Survey and Glassdoor jobs listings. the results were based on the search terms from last year's survey. the results were compared to both Glassdoor listings and the survey. the results were based on the search terms from Question 5 (job title). a kaggler earns more than USD 100k per year. a data scientist earns around USD 14k per year. a data engineer earns more than USD 100k per year.", "sum_t5_words": 73, "sum_t5_runtime": 5.046, "runtime": 0.002, "nltk_category": "Education & Research", "nltk_category_score": 0.3531143069267273, "nltk_category_runtime": 17.6, "nltk_subcategory": "Valuation", "nltk_subcategory_score": 0.7188658714294434, "nltk_subcategory_runtime": 28.418, "category": "Education & Research", "category_score": 0.3531143069267273, "subcategory": "Valuation", "subcategory_score": 0.7188658714294434, "runtime_cat": 46.018, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.735", "language_code": "en", "language_score": "0.9999955551010045", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "job hello hello hello job nod hire anyone hr come hear youre feeling well ease pain get foot relax adapted comfortably numb pink floyd comparison kaggle survey glassdoor job listingson last year survey analysis understand make kaggler valuable idea basically identify make someone earn usd 100k per year working data related job one year moved brazil united kingdom data science data engineering earning around usd 14k per year halfway usd 100kyear year survey thought would nice compare kagglers skill job listing around world achieve scraped glassdoor listing looking search term question 5 job title year survey compared result survey respondent glassdoor listing hope find informative useful plan career", "tags_descriptive": ["Employment"]}