{"title": "YouTube8M EDA", "description": "YouTube8M EDAThe YouTube8M challenge is a multi-class classification problem, where we are asked to predict for each video, given video & frame level audio and frame RGB features, to which group of categories it belongs to. For this task it is important to know:  the total number of classes/video categories the distribution of classes in the training set  In the first part I'll be focusing on how to take apart detailed information about the labels for the training data. Especially taking into account frequent patterns that occur in the data. We will also be looking at co-dependencies of the most frequent label categories. I've added a small section about the dependence of different video categories to the number of labels for each sample.", "link": "https://www.kaggle.com/philschmidt/youtube8m-eda", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["tensorflow", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-03-13 11:04:52", "date_scraped": "2020-12-13 18:41:49", "words": 125, "sentences": 5, "runtime": 0.002, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.3117498755455017, "description_category_runtime": 10.869, "description_subcategory": "Student", "description_subcategory_score": 0.465087354183197, "description_subcategory_runtime": 16.958, "category": "Real Estate, Rental & Leasing", "category_score": 0.3117498755455017, "subcategory": "Student", "subcategory_score": 0.465087354183197, "runtime_cat": 27.828, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.756", "language_code": "en", "language_score": "0.9999970582713504", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "youtube8m edathe youtube8m challenge multiclass classification problem asked predict video given video frame level audio frame rgb feature group category belongs task important know total number classesvideo category distribution class training set first part ill focusing take apart detailed information label training data especially taking account frequent pattern occur data also looking codependencies frequent label category ive added small section dependence different video category number label sample", "tags_descriptive": []}