{"title": "Knowledge graph analysis with node2vec", "description": "CareerVillage knowledge graph analysis with node embeddings1. Introductiona.) What is a knowledge graph?It is a network that represents multiple types of entities (nodes) and relations (edges) in the same graph. Each link of the network represents an (entity,relation,value) triplet. For example I give you some examples from the small knowledge graph below:  Eiffel Tower (entity) is located in (relation) in Paris (value) Paris (entity) is an instance of (relation) city (value) Alice (entity) is an instance of (relation) person (value)   The CareerVillage data set contains several different entities (persons, groups, schools, locations etc.). Thus one possible approach to analyse this data is to build a large knowledge graph representing as many relations as possible. b.) What are node embeddings?Embeddings, especially word representations (e.g. Word2Vec), is a hot research topic nowadays. The basic idea behind node embedding algorithms (e.g. node2vec, Line, DeepWalk etc.) is that if you generate node sequences originating from a given vertex and feed them to Word2Vec (like sentences from a text) you can map the nodes of the network into a low dimensional vector space. Usually these methods are optimized for the criteria to preserve the global/local role of each vertex in the graph.  c.) My workIn this work I use the node2vec algorithm to generate low dimensional representation for CareerVillage users based on the knowledge graph that I extracted from the data. My ultimate goal is to discover interesting user groups / clusters (e.g. popular professionals, satisfied students etc.) using only the available network structure.", "link": "https://www.kaggle.com/ferdzso/knowledge-graph-analysis-with-node2vec", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-05 13:54:33", "date_scraped": "2020-12-12 18:41:32", "words": 253, "sentences": 13, "sum_nltk": "CareerVillage knowledge graph analysis with node embeddings1.\nIntroductiona.) What is a knowledge graph?It is a network that represents multiple types of entities (nodes) and relations (edges) in the same graph.\nEach link of the network represents an (entity,relation,value) triplet.\nFor example I give you some examples from the small knowledge graph below:  Eiffel Tower (entity) is located in (relation) in Paris (value) Paris (entity) is an instance of (relation) city (value) Alice (entity) is an instance of (relation) person (value)   The CareerVillage data set contains several different entities (persons, groups, schools, locations etc.).\nThus one possible approach to analyse this data is to build a large knowledge graph representing as many relations as possible.\nb.) What are node embeddings?Embeddings, especially word representations (e.g. Word2Vec), is a hot research topic nowadays.\nThe basic idea behind node embedding algorithms (e.g. node2vec, Line, DeepWalk etc.) is that if you generate node sequences originating from a given vertex and feed them to Word2Vec (like sentences from a text) you can map the nodes of the network into a low dimensional vector space.\nc.) My workIn this work I use the node2vec algorithm to generate low dimensional representation for CareerVillage users based on the knowledge graph that I extracted from the data.", "sum_nltk_words": 203, "sum_nltk_runtime": 0.003, "sum_t5": "a knowledge graph is a network that represents multiple types of entities (nodes) and relations (edges) in the same graph. Embeddings, especially word representations (e.g. Word2Vec), is a hot research topic nowadays. if you generate node sequences originating from a given vertex and feed them to Word2Vec you can map the nodes into a low dimensional vector space.", "sum_t5_words": 58, "sum_t5_runtime": 5.987, "runtime": 0.0, "nltk_category": "Accommodation & Food", "nltk_category_score": 0.2701280117034912, "nltk_category_runtime": 21.584, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.4735460877418518, "nltk_subcategory_runtime": 34.738, "category": "Accommodation & Food", "category_score": 0.2701280117034912, "subcategory": "Tools", "subcategory_score": 0.4735460877418518, "runtime_cat": 56.324, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.754", "language_code": "en", "language_score": "0.9999968782190366", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "careervillage knowledge graph analysis node embeddings1 introductiona knowledge graphit network represents multiple type entity node relation edge graph link network represents entityrelationvalue triplet example give example small knowledge graph eiffel tower entity located relation paris value paris entity instance relation city value alice entity instance relation person value careervillage data set contains several different entity person group school location etc thus one possible approach analyse data build large knowledge graph representing many relation possible b node embeddingsembeddings especially word representation eg word2vec hot research topic nowadays basic idea behind node embedding algorithm eg node2vec line deepwalk etc generate node sequence originating given vertex feed word2vec like sentence text map node network low dimensional vector space usually method optimized criterion preserve globallocal role vertex graph c workin work use node2vec algorithm generate low dimensional representation careervillage user based knowledge graph extracted data ultimate goal discover interesting user group cluster eg popular professional satisfied student etc using available network structure", "tags_descriptive": []}