{"title": "Private test not that **private** afterall ", "description": "Private test not that private afterall Having access to any information regarding the private test dataset is always useful. In this competition even more since semi-supervised learning may play a decisive role. After some Googling, I came across the (probably) initial dataset that has been used by the author of this (atypical) Kaggle challenge. In this notebook, starting from the found dataset, I will attempt to create the private test dataset and will propose some ideas on how we can use this data to enhance our models. Clean data I believe that this is quite an important discovery, as the found dataset has not been processed. In the Exploratory Data Analysis part, we will see how salient information such as hashtags and uncensured words are present in that dataset. Also, and maybe even more important, all original 13 sentiments are still present (empty, sadness, enthusiasm, neutral, worry, surprise, love, fun, hate, happiness, boredom, relief, anger). Ideas Among others, one of the main advantages we can have by using this dataset is to find a subset of the training data that better match the private dataset set and try to overfit a model to that data. Also, as we will see later, the extra informations such as hahtags, tweet authors and sentiment can be used during pre and post-processing, as they play an important role in this challenge. Data leakage As some of you correctly specified, we cannot says that this is data leakage as the original dataset is mentioned in the challenge description: The dataset is titled Sentiment Analysis: Emotion in Text tweets. Nontheless, the link (https://www.figure-eight.com/data-for-everyone/) they refers to is broken. The dataset is also available here in Kaggle: https://www.kaggle.com/icw123/emotion", "link": "https://www.kaggle.com/jonathanbesomi/private-test-not-that-private-afterall", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-23 20:38:19", "date_scraped": "2020-12-13 17:53:52", "words": 281, "sentences": 12, "sum_nltk": "In this notebook, starting from the found dataset, I will attempt to create the private test dataset and will propose some ideas on how we can use this data to enhance our models.\nClean data I believe that this is quite an important discovery, as the found dataset has not been processed.\nIn the Exploratory Data Analysis part, we will see how salient information such as hashtags and uncensured words are present in that dataset.\nIdeas Among others, one of the main advantages we can have by using this dataset is to find a subset of the training data that better match the private dataset set and try to overfit a model to that data.\nAlso, as we will see later, the extra informations such as hahtags, tweet authors and sentiment can be used during pre and post-processing, as they play an important role in this challenge.\nData leakage As some of you correctly specified, we cannot says that this is data leakage as the original dataset is mentioned in the challenge description: The dataset is titled Sentiment Analysis: Emotion in Text tweets.\nNontheless, the link (https://www.figure-eight.com/data-for-everyone/) they refers to is broken.\nThe dataset is also available here in Kaggle: https://www.kaggle.com/icw123/emotion", "sum_nltk_words": 194, "sum_nltk_runtime": 0.004, "sum_t5": "a researcher has created a private test dataset. he will propose some ideas on how we can use this data to enhance our models. all original 13 sentiments are still present. the dataset is also available here in Kaggle. a researcher has also created a 'private test' dataset. a researcher has also created a 'private test' dataset. a researcher has also created a 'private test' dataset.", "sum_t5_words": 66, "sum_t5_runtime": 5.967, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.2646819055080414, "nltk_category_runtime": 18.96, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8274712562561035, "nltk_subcategory_runtime": 30.861, "category": "Finance", "category_score": 0.2646819055080414, "subcategory": "Machine Learning", "subcategory_score": 0.8274712562561035, "runtime_cat": 49.822, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.701", "language_code": "en", "language_score": "0.9999963507495284", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "private test private afterall access information regarding private test dataset always useful competition even since semisupervised learning may play decisive role googling came across probably initial dataset used author atypical kaggle challenge notebook starting found dataset attempt create private test dataset propose idea use data enhance model clean data believe quite important discovery found dataset processed exploratory data analysis part see salient information hashtags uncensured word present dataset also maybe even important original 13 sentiment still present empty sadness enthusiasm neutral worry surprise love fun hate happiness boredom relief anger idea among others one main advantage using dataset find subset training data better match private dataset set try overfit model data also see later extra information hahtags tweet author sentiment used pre postprocessing play important role challenge data leakage correctly specified cannot say data leakage original dataset mentioned challenge description dataset titled sentiment analysis emotion text tweet nontheless link httpswwwfigureeightcomdataforeveryone refers broken dataset also available kaggle httpswwwkagglecomicw123emotion", "tags_descriptive": []}