{"title": "Full Preprocessing Tutorial", "description": "IntroductionWorking with these files can be a challenge, especially given their heterogeneous nature. Some preprocessing is required before they are ready for consumption by your CNN. Fortunately, I participated in the LUNA16 competition as part of a university course on computer aided diagnosis, so I have some experience working with these files. At this moment we top the leaderboard there :) This tutorial aims to provide a comprehensive overview of useful steps to take before the data hits your ConvNet/other ML method. What we will cover:  Loading the DICOM files, and adding missing metadata   Converting the pixel values to Hounsfield Units (HU), and what tissue these unit values correspond to Resampling to an isomorphic resolution to remove variance in scanner resolution. 3D plotting, visualization is very useful to see what we are doing. Lung segmentation Normalization that makes sense. Zero centering the scans.   Before we start, let's import some packages and determine the available patients.", "link": "https://www.kaggle.com/jyotiislam/full-preprocessing-tutorial", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-03-24 05:30:33", "date_scraped": "2020-12-12 18:38:03", "words": 160, "sentences": 9, "runtime": 0.0, "description_category": "Healthcare", "description_category_score": 0.3511144518852234, "description_category_runtime": 14.267, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7449425458908081, "description_subcategory_runtime": 22.387, "category": "Healthcare", "category_score": 0.3511144518852234, "subcategory": "Machine Learning", "subcategory_score": 0.7449425458908081, "runtime_cat": 36.654, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.719", "language_code": "en", "language_score": "0.9999970747880326", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionworking file challenge especially given heterogeneous nature preprocessing required ready consumption cnn fortunately participated luna16 competition part university course computer aided diagnosis experience working file moment top leaderboard tutorial aim provide comprehensive overview useful step take data hit convnetother ml method cover loading dicom file adding missing metadata converting pixel value hounsfield unit hu tissue unit value correspond resampling isomorphic resolution remove variance scanner resolution 3d plotting visualization useful see lung segmentation normalization make sense zero centering scan start let import package determine available patient", "tags_descriptive": []}