{"title": "Costa Rica Poverty Exploration Kernel", "description": "Exploration Kernel - Costa Rica PovertyMany social programs have a hard time making sure the right people are given enough aid. It’s especially tricky when a program focuses on the poorest segment of the population. The world’s poorest typically can’t provide the necessary income and expense records to prove that they qualify. Beyond Costa Rica, many countries face this same problem of inaccurately assessing social need. A popular algorithm called the Proxy Means Test (or PMT) is used to verify income qualification along with family’s observable household attributes like the material of their walls and ceiling, or the assets found in the home to classify them and predict their level of need. This is an improvement but accuracy remains a problem as the region’s population grows and poverty declines. In this competition, the dataset is shared with similar attributes with an aim to improve the accuracy of household poverty prediction. In this kernel, I have performed exploration, feature engineering, and baseline model.", "link": "https://www.kaggle.com/shivamb/costa-rica-poverty-exploration-kernel", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-30 04:24:58", "date_scraped": "2020-12-12 17:59:32", "words": 162, "sentences": 8, "runtime": 0.003, "description_category": "Economics", "description_category_score": 0.09794896841049194, "description_category_runtime": 13.87, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.6292964220046997, "description_subcategory_runtime": 22.07, "category": "Economics", "category_score": 0.09794896841049194, "subcategory": "Machine Learning", "subcategory_score": 0.6292964220046997, "runtime_cat": 35.94, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.749", "language_code": "en", "language_score": "0.9999988508544514", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "exploration kernel costa rica povertymany social program hard time making sure right people given enough aid especially tricky program focus poorest segment population world poorest typically cant provide necessary income expense record prove qualify beyond costa rica many country face problem inaccurately assessing social need popular algorithm called proxy mean test pmt used verify income qualification along family observable household attribute like material wall ceiling asset found home classify predict level need improvement accuracy remains problem region population grows poverty decline competition dataset shared similar attribute aim improve accuracy household poverty prediction kernel performed exploration feature engineering baseline model", "tags_descriptive": ["Exploratory Data Analysis"]}