{"title": "Predicting Wait times at intersections", "description": "Objective :We’ve all been there: Stuck at a traffic light, only to be given mere seconds to pass through an intersection, behind a parade of other commuters. Imagine if you could help city planners and governments anticipate traffic hot spots ahead of time and reduce the stop-and-go stress of millions of commuters like you. The task here is to predict congestion, based on an aggregate measure of stopping distance and waiting times, at intersections in 4 major US cities: Atlanta, Boston, Chicago & Philadelphia. About the dataThe data consists of aggregated trip logging metrics from commercial vehicles, such as semi-trucks. The data have been grouped by :  intersection month hour of day direction driven through the intersection whether the day was on a weekend or not  For each grouping in the test set, you need to make predictions for three different quantiles, that is, 20th, 50th, and 80th percentiles for:  The total time stopped at an intersection  The distance between the intersection and the first place a vehicle stopped while waiting.", "link": "https://www.kaggle.com/prazhant/predicting-wait-times-at-intersections", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "h2o", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-23 20:02:39", "date_scraped": "2020-12-12 17:10:49", "words": 175, "sentences": 5, "runtime": 0.0, "description_category": "Government and Public Works", "description_category_score": 0.353901743888855, "description_category_runtime": 14.98, "description_subcategory": "Transportation", "description_subcategory_score": 0.7910361886024475, "description_subcategory_runtime": 23.903, "category": "Government and Public Works", "category_score": 0.353901743888855, "subcategory": "Transportation", "subcategory_score": 0.7910361886024475, "runtime_cat": 38.884, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.646", "language_code": "en", "language_score": "0.9999973928525391", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "objective weve stuck traffic light given mere second pas intersection behind parade commuter imagine could help city planner government anticipate traffic hot spot ahead time reduce stopandgo stress million commuter like task predict congestion based aggregate measure stopping distance waiting time intersection 4 major u city atlanta boston chicago philadelphia datathe data consists aggregated trip logging metric commercial vehicle semitrucks data grouped intersection month hour day direction driven intersection whether day weekend grouping test set need make prediction three different quantiles 20th 50th 80th percentile total time stopped intersection distance intersection first place vehicle stopped waiting", "tags_descriptive": []}