{"title": "QuickDraw with WaveNet Classifier", "description": "OverviewThe notebook is modified from one that was made for the Quick, Draw Dataset, it would actually be interesting to see how beneficial a transfer learning approach using that data as a starting point could be. This NotebookThe notebook takes and preprocesses the data from the QuickDraw Competition step (strokes) and trains an a WaveNet-style classifier (wavenet in its original implemention is https://deepmind.com/blog/high-fidelity-speech-synthesis-wavenet/ is intended for synthesis, but the dilated convolution approach can be applied). We use the implementation here as a reference. Fun ModelsAfter the classification models, we try to build a few models to understand what the WaveNet actually does. Here we experiment step by step to see how the prediction changes with each stop Next StepsThe next steps could be  use more data to train include the country code (different countries draw different things, different ways) more complex models", "link": "https://www.kaggle.com/kmader/quickdraw-with-wavenet-classifier", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-02 12:58:29", "date_scraped": "2020-12-13 16:18:48", "words": 143, "sentences": 5, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.12286528944969177, "description_category_runtime": 13.96, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9721826314926147, "description_subcategory_runtime": 22.571, "category": "Wholesale & Retail", "category_score": 0.12286528944969177, "subcategory": "Machine Learning", "subcategory_score": 0.9721826314926147, "runtime_cat": 36.532, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.728", "language_code": "en", "language_score": "0.9999977573223623", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "overviewthe notebook modified one made quick draw dataset would actually interesting see beneficial transfer learning approach using data starting point could notebookthe notebook take preprocesses data quickdraw competition step stroke train wavenetstyle classifier wavenet original implemention httpsdeepmindcombloghighfidelityspeechsynthesiswavenet intended synthesis dilated convolution approach applied use implementation reference fun modelsafter classification model try build model understand wavenet actually experiment step step see prediction change stop next stepsthe next step could use data train include country code different country draw different thing different way complex model", "tags_descriptive": []}