{"title": "2. Encourage Diversity, Reduce Bias - CoLA ", "description": "Data Science For Good : CoLA A Complete Pipeline for Structuring, Analysis and Recommendation Improve Hiring Process and Decisions  Key Objectives: Keeping these challenges in mind, an ideal solution for the City of Los Angeles has following key objectives: Develop an nlp framework to accurately structurize the job descriptions. Develop an analysis framework to identify the implict bias in the text and encourage diversity. Develop a system which can clearly identify the promotion pathways within the organization. My Submission: Following are parts of Kernels Submissions in order:  Part 1: Job Bulletin Structuring Engine - City of Los Angeles   Part 2: Encourage Diversity and Remove Unconsious Bias from Job Bulletins - A Deep Analysis  Part 3: Impact of Content, Tone, and Language : CTL Analysis for CoLA  Part 4: Increasing the Discoverability of Promotional Pathways (Explicit)  Part 5: Implicit Promotional Pathways Discoverability Part 2: Encourage Diversity, Reduce Unconscious Bias - Deep Analysis  Other Parts: Part 1 | Part 2 | Part 3 | Part 4 | Part 5The aim of this kernel is to analyse, measure, and quantify unconscious (or implicit) bias present in the job bulletin's of City of Los Angeles. This kernel uses bag of words, dictionary approch to check the presence of certain category of keywords in the text, it then applies different normalization techniques in order to quantify the amount of unconscious bias present in the text. Different data visualizations are used to showcase the key insights and related trends. In the end, I perform a simulation experiment to validate the hypothesis. Table of Contents1. What is Diversity Hiring?  2. Unconscious Gender Bias in City's Bulletins      2.1 Use of Gendered Keywords in City's Bulletins      2.2 Measuring the gender bias in City's Bulletins      2.3 Bulletins with High Masculine (or Feminine) Denotation      2.4 Masculine and Feminine Words Usage      2.5 Does (Masculine) Jobs are Offered Higher Salaries ?      2.6 Does More Masculine Class means Higher Salary?      2.7 Does Job Seniority Levels also show Gender Bias?      2.8 Has the use of gendered language changed over time?  3. Other forms of Unconscious Gender Bias      3.1 Use of Superlatives Keywords      3.2 Use of Master/Expert in Bulletins      3.3 Describing the Requirements - Number of lines      3.4 Keywords containing \"man\"      3.5 Bad Assumption that there are only two genders  4. Quantifying Unconscious Gender Bias  5. Design Experiment for Validation : A Simple Simulation     5.1 Analogy from Econometric Theory      5.2 Using the Analogy to Design Experiment      5.3 Creating Scenarios and Evaluating      5.4 Analysis - Does reducing bias garners more applicants?      5.5 Effect on Male Applicants      5.6 Effect on Female Applicants  6. Key Recommendations   1. What is Diversity HiringA Gentle Introduction to Diversity Hiring\"Diversity is the collective strength of any successful organization\". Diversity hiring is the hiring process that is free from bias based on age, race, gender, religion, sexual orientation, and other personal characteristics. Diversity is very crutial for any company as it leads to creation of a culture that enables new ways of thinking, gives them an edge versus their competitors, and in turn, impacts the bottom line and overall success of the company (Source: Forbes). However, Many companies struggle to ensure high levels of diversity among the employees and even the potential applicants for the open positions. In some cases, this is the due to explicit nature of companies to give less importance to diversity. But in large number of cases, it is due to the implicit Unconscious bias among different elements of the company such as hiring manager's mindset, company's actions, and even the job bulletins for the open positions. Unconscious Bias : What it it, Why it occurs? Unconscious bias is the set of assumptions directly linked to one's thinking, judgements, social background, personal values, etc. is often defined as prejudice or unsupported judgments in favor of or against one thing, person, or group as compared to another, in a way that is usually considered unfair. Most common example of Unconscious bias is the gender bias which exists in different cycles of hiring process. (Source: Empiric) Unconscious Bias in Job BulletinsResearch shows that use of masculine language in bulletins such as including adjectives like “competitive” and “determined,” results in women’s “perceiving that they would not belong in the work environment.” On the other hand, use of words like “collaborative” and “cooperative” tend to draw more women than men. Use of language and word choice plays a key role in encourgaing applicant's diversity. Thus, it is important for the company to write job bulletins which are gendered-neutral or are free of any Unconscious bias. In this kernel, I have performed different types of analysis which measure, quantify and analyse the Unconscious bias - specifically gender bias.  2. Unconscious Gender Bias in City of LA's Job Bulletins ? Job bulletins biased toward a specific gender can limit the candidate pool and diversity.  Following are some of the common traits of a gendered bias job bulletin.  1. High Use of Genderded Keywords: Words which are more ‘aggressive’, ‘assertive’ or ‘independent’ rather than things ‘conscientious’, ‘dedicated’ and ‘sociable’ will typically put off women. Using gender-charged words in job description can isolate a gender from applying 2. High Use of Superlatives Usage: Excessive use of superlatives such as “expert,” “superior,” “world class” can turn off female candidates who are more collaborative than competitive in nature    3. Less Use of Relationship/Family Keywords Usage: Descriptions in which there is more usage of family oriented keywords tend to attract more female than men.  4. Very Demanding Requirements: Research shows that women are unlikely to apply for a position unless they meet 100 percent of the requirements, while men will apply if they meet 60 percent of the requirements.   5. Use of Gendered pronouns: Using pronouns which are targeted for particular gender is not considered a good style of writing.   6. Use of Keywords containing \"man\": Keywords containing \"man\" may sound that they are only meant for males.     I used following sources to obtain all the relevant information related to unconscious bias in job bulletins. Sources: OnGig, LinkedIn, HarvardBusinessSchool, Lever, SHRM, Catalyst, SheGeeksOut, Katmatfield, ZipRecruiter, BBC, Textio In the following cell I have developed different functions that analyse these traits in the job bulletins. I curated several lists from multiple sources and complied them for different categories - masculine denotation, feminine denotation, superlatives, relationships etc. Following word clouds shows the top keywords related to feminine and masculine category.", "link": "https://www.kaggle.com/shivamb/2-encourage-diversity-reduce-bias-cola", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["nltk", "spacy"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-06-20 16:06:41", "date_scraped": "2020-12-12 18:42:37", "words": 1105, "sentences": 45, "sum_nltk": "Data Science For Good : CoLA A Complete Pipeline for Structuring, Analysis and Recommendation Improve Hiring Process and Decisions  Key Objectives: Keeping these challenges in mind, an ideal solution for the City of Los Angeles has following key objectives: Develop an nlp framework to accurately structurize the job descriptions.\nThis kernel uses bag of words, dictionary approch to check the presence of certain category of keywords in the text, it then applies different normalization techniques in order to quantify the amount of unconscious bias present in the text.\n2. Unconscious Gender Bias in City's Bulletins      2.1 Use of Gendered Keywords in City's Bulletins      2.2 Measuring the gender bias in City's Bulletins      2.3 Bulletins with High Masculine (or Feminine) Denotation      2.4 Masculine and Feminine Words Usage      2.5 Does (Masculine) Jobs are Offered Higher Salaries ?\n(Source: Empiric) Unconscious Bias in Job BulletinsResearch shows that use of masculine language in bulletins such as including adjectives like “competitive” and “determined,” results in women’s “perceiving that they would not belong in the work environment.” On the other hand, use of words like “collaborative” and “cooperative” tend to draw more women than men.", "sum_nltk_words": 191, "sum_nltk_runtime": 0.014, "sum_t5": "a kernel is a tool to analyze job bulletins of the city of los angeles. it uses a dictionary approch to check the presence of certain keywords. it then applies different normalization techniques to quantify the amount of unconscious bias present in the text. the kernel is a complete pipeline for structuring, analysis and recommendation. it is also a tool to help employers identify the promotion pathways within the organization. a kernel is a tool to help employers identify and eliminate unconscious bias.", "sum_t5_words": 83, "sum_t5_runtime": 6.826, "runtime": 0.005, "nltk_category": "Government and Public Works", "nltk_category_score": 0.33277973532676697, "nltk_category_runtime": 21.765, "nltk_subcategory": "Sequencing", "nltk_subcategory_score": 0.419068306684494, "nltk_subcategory_runtime": 34.32, "category": "Government and Public Works", "category_score": 0.33277973532676697, "subcategory": "Sequencing", "subcategory_score": 0.419068306684494, "runtime_cat": 56.085, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.699", "language_code": "en", "language_score": "0.9999969187257596", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data science good cola complete pipeline structuring analysis recommendation improve hiring process decision key objective keeping challenge mind ideal solution city los angeles following key objective develop nlp framework accurately structurize job description develop analysis framework identify implict bias text encourage diversity develop system clearly identify promotion pathway within organization submission following part kernel submission order part 1 job bulletin structuring engine city los angeles part 2 encourage diversity remove unconsious bias job bulletin deep analysis part 3 impact content tone language ctl analysis cola part 4 increasing discoverability promotional pathway explicit part 5 implicit promotional pathway discoverability part 2 encourage diversity reduce unconscious bias deep analysis part part 1 part 2 part 3 part 4 part 5the aim kernel analyse measure quantify unconscious implicit bias present job bulletin city los angeles kernel us bag word dictionary approch check presence certain category keywords text applies different normalization technique order quantify amount unconscious bias present text different data visualization used showcase key insight related trend end perform simulation experiment validate hypothesis table contents1 diversity hiring 2 unconscious gender bias city bulletin 21 use gendered keywords city bulletin 22 measuring gender bias city bulletin 23 bulletin high masculine feminine denotation 24 masculine feminine word usage 25 masculine job offered higher salary 26 masculine class mean higher salary 27 job seniority level also show gender bias 28 use gendered language changed time 3 form unconscious gender bias 31 use superlative keywords 32 use masterexpert bulletin 33 describing requirement number line 34 keywords containing man 35 bad assumption two gender 4 quantifying unconscious gender bias 5 design experiment validation simple simulation 51 analogy econometric theory 52 using analogy design experiment 53 creating scenario evaluating 54 analysis reducing bias garner applicant 55 effect male applicant 56 effect female applicant 6 key recommendation 1 diversity hiringa gentle introduction diversity hiringdiversity collective strength successful organization diversity hiring hiring process free bias based age race gender religion sexual orientation personal characteristic diversity crutial company lead creation culture enables new way thinking give edge versus competitor turn impact bottom line overall success company source forbes however many company struggle ensure high level diversity among employee even potential applicant open position case due explicit nature company give le importance diversity large number case due implicit unconscious bias among different element company hiring manager mindset company action even job bulletin open position unconscious bias occurs unconscious bias set assumption directly linked one thinking judgement social background personal value etc often defined prejudice unsupported judgment favor one thing person group compared another way usually considered unfair common example unconscious bias gender bias exists different cycle hiring process source empiric unconscious bias job bulletinsresearch show use masculine language bulletin including adjective like competitive determined result woman perceiving would belong work environment hand use word like collaborative cooperative tend draw woman men use language word choice play key role encourgaing applicant diversity thus important company write job bulletin genderedneutral free unconscious bias kernel performed different type analysis measure quantify analyse unconscious bias specifically gender bias 2 unconscious gender bias city la job bulletin job bulletin biased toward specific gender limit candidate pool diversity following common trait gendered bias job bulletin 1 high use genderded keywords word aggressive assertive independent rather thing conscientious dedicated sociable typically put woman using gendercharged word job description isolate gender applying 2 high use superlative usage excessive use superlative expert superior world class turn female candidate collaborative competitive nature 3 le use relationshipfamily keywords usage description usage family oriented keywords tend attract female men 4 demanding requirement research show woman unlikely apply position unless meet 100 percent requirement men apply meet 60 percent requirement 5 use gendered pronoun using pronoun targeted particular gender considered good style writing 6 use keywords containing man keywords containing man may sound meant male used following source obtain relevant information related unconscious bias job bulletin source ongig linkedin harvardbusinessschool lever shrm catalyst shegeeksout katmatfield ziprecruiter bbc textio following cell developed different function analyse trait job bulletin curated several list multiple source complied different category masculine denotation feminine denotation superlative relationship etc following word cloud show top keywords related feminine masculine category", "tags_descriptive": ["Exploratory Data Analysis"]}