{"title": "DSFG - Exploration of Jobs at LA", "description": "Problem Objective:Help the City of Los Angeles to structure and analyze its job descriptions The City of Los Angeles faces a big hiring challenge: 1/3 of its 50,000 workers are eligible to retire by July of 2020. The city has partnered with Kaggle to create a competition to improve the job bulletins that will fill all those open positions. The content, tone, and format of job bulletins can influence the quality of the applicant pool. Overly-specific job requirements may discourage diversity. The Los Angeles Mayor’s Office wants to reimagine the city’s job bulletins by using text analysis to identify needed improvements. The goal is to convert a folder full of plain-text job postings into a structured CSV file and then to use this data to: (1) identify language that can negatively bias the pool of applicants; (2) improve the diversity and quality of the applicant pool; and/or (3) make it easier to determine which promotions are available to employees in each job class.", "link": "https://www.kaggle.com/sudalairajkumar/dsfg-exploration-of-jobs-at-la", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["nltk", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-05-14 14:33:56", "date_scraped": "2020-12-12 18:42:37", "words": 163, "sentences": 6, "runtime": 0.005, "description_category": "Government and Public Works", "description_category_score": 0.33218246698379517, "description_category_runtime": 14.318, "description_subcategory": "Textual Analysis", "description_subcategory_score": 0.8923091888427734, "description_subcategory_runtime": 22.628, "category": "Government and Public Works", "category_score": 0.33218246698379517, "subcategory": "Textual Analysis", "subcategory_score": 0.8923091888427734, "runtime_cat": 36.945, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.7", "language_code": "en", "language_score": "0.9999955088763547", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "problem objectivehelp city los angeles structure analyze job description city los angeles face big hiring challenge 13 50000 worker eligible retire july 2020 city partnered kaggle create competition improve job bulletin fill open position content tone format job bulletin influence quality applicant pool overlyspecific job requirement may discourage diversity los angeles mayor office want reimagine city job bulletin using text analysis identify needed improvement goal convert folder full plaintext job posting structured csv file use data 1 identify language negatively bias pool applicant 2 improve diversity quality applicant pool andor 3 make easier determine promotion available employee job class", "tags_descriptive": []}