{"title": "Santander EDA, FE, FS and models", "description": "General informationIn Santander Customer Transaction Prediction competition we have a binary classification task. Train and test data have 200k samples each and we have 200 anonimyzed numerical columns. It would be interesting to try good models without overfitting and knowing the meaning of the features. In fact this competition seems to be similar to another current competition: don't overfit II, so I'll use a lot of ideas from my kernel. In this kernel I'll write the following things:  EDA on the features and trying to get some insights; Using permutation importance to select most impactful features; Comparing various models: linear models, tree based models and others; Trying various approaches to feature selection including taking top features from eli5; Hyperparameter optimization for models; Feature generation; Other things;   Work still in progress", "link": "https://www.kaggle.com/artgor/santander-eda-fe-fs-and-models", "tags": ["Exploratory Data Analysis", "Model Explainability"], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost", "lightgbm", "sklearn", "statsmodels", "catboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-03-31 19:40:28", "date_scraped": "2020-12-13 17:07:48", "words": 133, "sentences": 5, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.12062737345695496, "description_category_runtime": 12.062, "description_subcategory": "General", "description_subcategory_score": 0.9941281676292419, "description_subcategory_runtime": 18.611, "category": "Education & Research", "category_score": 0.12062737345695496, "subcategory": "General", "subcategory_score": 0.9941281676292419, "runtime_cat": 30.673, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.76", "language_code": "en", "language_score": "0.9999968314370256", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "general informationin santander customer transaction prediction competition binary classification task train test data 200k sample 200 anonimyzed numerical column would interesting try good model without overfitting knowing meaning feature fact competition seems similar another current competition dont overfit ii ill use lot idea kernel kernel ill write following thing eda feature trying get insight using permutation importance select impactful feature comparing various model linear model tree based model others trying various approach feature selection including taking top feature eli5 hyperparameter optimization model feature generation thing work still progress", "tags_descriptive": ["Exploratory Data Analysis", "Model Explainability"]}