{"title": "Redefining NCAA Basketball Positions using Data!", "description": "Redefining the RosterUsing unsupervised machine learning to cluster NCAA players by their stats. Most people who watch March Madness are familiar with the standard positions of basketball: guards, forwards, and centers. But as basketball continues to evolve, the lines that define players have become more blurred. In a 2013 article, Myron Medcalf questioned if the traditional positions were even still relevant. Metcalf said, \"The descriptors that made sense years ago feel inadequate today. Point guards, shooting guards, small forwards, power forwards and centers -- in some cases -- have been replaced by young men who simply call themselves players. [1]\" My question, then is: What does the data show us about player positions? Would it be possible to categorize players' positions based solely on the data? After defining these \"positions\" what types of rosters fare well in the March Madness tournament? Using an unsupervised machine learning technique called clustering, I've identified 5 distinct types of college basketball players. They are: Ball Distributors, Elite Bigs, Shot Takers, 3 Point Specialists, and Paint Dominators. In this notebook, I'll go through the process used to identify these groups, and go into more detail about what makes each unique. So let's let the data tell the story of the players who rule March Madness!", "link": "https://www.kaggle.com/robikscube/redefining-ncaa-basketball-positions-using-data", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-01 01:47:35", "date_scraped": "2020-12-13 13:49:58", "words": 210, "sentences": 10, "sum_nltk": "Redefining the RosterUsing unsupervised machine learning to cluster NCAA players by their stats.\nMost people who watch March Madness are familiar with the standard positions of basketball: guards, forwards, and centers.\nBut as basketball continues to evolve, the lines that define players have become more blurred.\nIn a 2013 article, Myron Medcalf questioned if the traditional positions were even still relevant.\nPoint guards, shooting guards, small forwards, power forwards and centers -- in some cases -- have been replaced by young men who simply call themselves players.\n[1]\" My question, then is: What does the data show us about player positions?\nWould it be possible to categorize players' positions based solely on the data?\nAfter defining these \"positions\" what types of rosters fare well in the March Madness tournament?\nUsing an unsupervised machine learning technique called clustering, I've identified 5 distinct types of college basketball players.\nThey are: Ball Distributors, Elite Bigs, Shot Takers, 3 Point Specialists, and Paint Dominators.\nIn this notebook, I'll go through the process used to identify these groups, and go into more detail about what makes each unique.\nSo let's let the data tell the story of the players who rule March Madness!", "sum_nltk_words": 187, "sum_nltk_runtime": 0.003, "sum_t5": "using unsupervised machine learning, a researcher has identified 5 types of college basketball players. the data shows what types of rosters fare well in the tournament. ball Distributors, Elite Bigs, Shot Takers, 3 Point Specialists, and Paint Dominators are among them. the data is used to categorize players' positions based solely on the data. a senate committee is considering whether to use clustering to categorize players.", "sum_t5_words": 66, "sum_t5_runtime": 4.824, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.360954225063324, "nltk_category_runtime": 18.08, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9407230019569397, "nltk_subcategory_runtime": 29.61, "category": "Utilities", "category_score": 0.360954225063324, "subcategory": "Machine Learning", "subcategory_score": 0.9407230019569397, "runtime_cat": 47.693, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.643", "language_code": "en", "language_score": "0.9999957733448733", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "redefining rosterusing unsupervised machine learning cluster ncaa player stats people watch march madness familiar standard position basketball guard forward center basketball continues evolve line define player become blurred 2013 article myron medcalf questioned traditional position even still relevant metcalf said descriptor made sense year ago feel inadequate today point guard shooting guard small forward power forward center case replaced young men simply call player 1 question data show u player position would possible categorize player position based solely data defining position type roster fare well march madness tournament using unsupervised machine learning technique called clustering ive identified 5 distinct type college basketball player ball distributor elite bigs shot taker 3 point specialist paint dominators notebook ill go process used identify group go detail make unique let let data tell story player rule march madness", "tags_descriptive": []}