{"title": "NFL 1st and Future - Analysis", "description": "NFL 1st and Future - Analytics By Ben Jenkins and Steve Jenkins Key Findings  We have verified that synthetic surfaces have a greater probability of injury.  From the data provided, synthetic surfaces have approximately 1.8 times greater injury rate compared to natural surfaces  Injuries tend to be more severe on synthetic surfaces in terms of days missed, and injuries on synthetic turf tend to more dispersed across the field. This suggests that non-contact injuries may play a larger role in synthetic compared to natural turf. Temperature plays a role in injuries. Low temperatures (10 degrees to 40 degrees) is a predictor of low injury rates. There are differences in speed and acceleration between the injured and non-injured population. The injured population has a higher average max speed and acceleration. For a given weight of player, greater acceleration would create more force (Force=Mass  times  Acceleration) and likelihood of injury.  Players tend to be injured early in the game. This tendency is more pronounced for natural playing surfaces compared to synthetic. Early in the game players tend to run faster and may generate more force leading to increased injury rate. There is a weak negative correlation between the number of plays a player participates in during a game, and their speed. The player location plays a role in injury incidence. A model was built to predict injuries based on the variables provided in the competition. The model's performance and findings are discussed in the presentation provided. The injury model suggests that there is a higher chance for injuries at low yardage (x axis is the long axis of field).  At high yardage, the model suggests that there is less chance for injury Recommendations for NFL  Substitute natural turf for synthetic turf. This analysis shows that this could significantly reduce the lower-limb injury incidence. Play in indoor stadiums. This allows the ability to control weather and temperature, which are shown to contribute to injuries. A variety of other factors considered in this analysis cannot be realistically addressed by the NFL, without drastic changes to the rules of the game.  We note that player speed, acceleration, number of plays, orientation and location on the field impact the probability of injury. Other factors not considered in this analysis such as type of footwear, padding, etc. may be useful to reduce injury Recommendations for Future Analysis  More data from lower-limb injuries is needed to allow the model to more accurately predict injury occurrence.  For example, collecting data on additional seasons would provide more information on injury trends. Higher quality data, such as helmet mounted accelerometers would likely improve injury prediction. Another key improvement to the model would be a detection of the exact time at which the injury occurred. This would allow analysis of the pre and post injury movements by the player. In some cases, the time of the injury may not be available.", "link": "https://www.kaggle.com/benjenkins96/nfl-1st-and-future-analysis", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-01-03 00:38:45", "date_scraped": "2020-12-13 14:23:02", "words": 486, "sentences": 26, "sum_nltk": "NFL 1st and Future - Analytics By Ben Jenkins and Steve Jenkins Key Findings  We have verified that synthetic surfaces have a greater probability of injury.\nFrom the data provided, synthetic surfaces have approximately 1.8 times greater injury rate compared to natural surfaces  Injuries tend to be more severe on synthetic surfaces in terms of days missed, and injuries on synthetic turf tend to more dispersed across the field.\nThis suggests that non-contact injuries may play a larger role in synthetic compared to natural turf.\nEarly in the game players tend to run faster and may generate more force leading to increased injury rate.\nThe player location plays a role in injury incidence.\nAt high yardage, the model suggests that there is less chance for injury Recommendations for NFL  Substitute natural turf for synthetic turf.\nWe note that player speed, acceleration, number of plays, orientation and location on the field impact the probability of injury.\nmay be useful to reduce injury Recommendations for Future Analysis  More data from lower-limb injuries is needed to allow the model to more accurately predict injury occurrence.\nThis would allow analysis of the pre and post injury movements by the player.", "sum_nltk_words": 191, "sum_nltk_runtime": 0.008, "sum_t5": "synthetic surfaces have a greater injury rate than natural surfaces. injuries tend to be more severe on synthetic surfaces in terms of days missed. temperatures are a predictor of low injury rates. players tend to be injured early in the game. early in the game players tend to run faster and generate more force. at high yardage, the model suggests that there is less chance for injury. this could reduce the lower-limb injury incidence. the model was built to predict injuries based on the variables provided in the competition.", "sum_t5_words": 89, "sum_t5_runtime": 6.959, "runtime": 0.006, "nltk_category": "Utilities", "nltk_category_score": 0.395685076713562, "nltk_category_runtime": 16.535, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.6924143433570862, "nltk_subcategory_runtime": 26.12, "category": "Utilities", "category_score": 0.395685076713562, "subcategory": "Physical", "subcategory_score": 0.6924143433570862, "runtime_cat": 42.654, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.655", "language_code": "en", "language_score": "0.9999953756846678", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "nfl 1st future analytics ben jenkins steve jenkins key finding verified synthetic surface greater probability injury data provided synthetic surface approximately 18 time greater injury rate compared natural surface injury tend severe synthetic surface term day missed injury synthetic turf tend dispersed across field suggests noncontact injury may play larger role synthetic compared natural turf temperature play role injury low temperature 10 degree 40 degree predictor low injury rate difference speed acceleration injured noninjured population injured population higher average max speed acceleration given weight player greater acceleration would create force forcemass time acceleration likelihood injury player tend injured early game tendency pronounced natural playing surface compared synthetic early game player tend run faster may generate force leading increased injury rate weak negative correlation number play player participates game speed player location play role injury incidence model built predict injury based variable provided competition model performance finding discussed presentation provided injury model suggests higher chance injury low yardage x axis long axis field high yardage model suggests le chance injury recommendation nfl substitute natural turf synthetic turf analysis show could significantly reduce lowerlimb injury incidence play indoor stadium allows ability control weather temperature shown contribute injury variety factor considered analysis cannot realistically addressed nfl without drastic change rule game note player speed acceleration number play orientation location field impact probability injury factor considered analysis type footwear padding etc may useful reduce injury recommendation future analysis data lowerlimb injury needed allow model accurately predict injury occurrence example collecting data additional season would provide information injury trend higher quality data helmet mounted accelerometer would likely improve injury prediction another key improvement model would detection exact time injury occurred would allow analysis pre post injury movement player case time injury may available", "tags_descriptive": []}