{"title": "Segmentation in PyTorch using convenient tools", "description": "General informationIn this kernel I work with the data from Understanding Clouds from Satellite Images competition. Shallow clouds play a huge role in determining the Earth's climate. They’re also difficult to understand and to represent in climate models. By classifying different types of cloud organization, researchers at Max Planck hope to improve our physical understanding of these clouds, which in turn will help us build better climate models. So in this competition we are tasked with multiclass segmentation task: finding 4 different cloud patterns in the images. On the other hand, we make predictions for each pair of image and label separately, so this could be treated as 4 binary segmentation tasks. It is important to notice that images (and masks) are 1400 x 2100, but predicted masks should be 350 x 525. In this kernel I'll use (or will use in next versions) the following notable libraries:  albumentations: this is a great library for image augmentation which makes it easier and more convenient catalyst: this is a great library which makes using PyTorch easier, helps with reprodicibility and contains a lot of useful utils segmentation_models_pytorch: this is a great library with convenient wrappers for models, losses and other useful things pytorch-toolbelt: this is a great library with many useful shortcuts for building pytorch models  UPD: Version 35 - changed calculation of optimal threshold and min size", "link": "https://www.kaggle.com/artgor/segmentation-in-pytorch-using-convenient-tools", "tags": ["DL", "CV", "Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["albumentations", "tensorflow", "sklearn", "opencv-python", "pattern", "pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-15 16:46:41", "date_scraped": "2020-12-13 18:07:53", "words": 229, "sentences": 8, "sum_nltk": "General informationIn this kernel I work with the data from Understanding Clouds from Satellite Images competition.\nBy classifying different types of cloud organization, researchers at Max Planck hope to improve our physical understanding of these clouds, which in turn will help us build better climate models.\nSo in this competition we are tasked with multiclass segmentation task: finding 4 different cloud patterns in the images.\nOn the other hand, we make predictions for each pair of image and label separately, so this could be treated as 4 binary segmentation tasks.\nIt is important to notice that images (and masks) are 1400 x 2100, but predicted masks should be 350 x 525.\nIn this kernel I'll use (or will use in next versions) the following notable libraries:  albumentations: this is a great library for image augmentation which makes it easier and more convenient catalyst: this is a great library which makes using PyTorch easier, helps with reprodicibility and contains a lot of useful utils segmentation_models_pytorch: this is a great library with convenient wrappers for models, losses and other useful things pytorch-toolbelt: this is a great library with many useful shortcuts for building pytorch models  UPD: Version 35 - changed calculation of optimal threshold and min size", "sum_nltk_words": 202, "sum_nltk_runtime": 0.002, "sum_t5": "researchers at max planck hope to improve our physical understanding of these clouds, which in turn will help us build better climate models. in this kernel I'll use (or will use in next versions) the following notable libraries: albumentations: this is a great library which makes using PyTorch easier and more convenient catalyst: this is a great library which makes using PyTorch easier and helps with reprodicibility. pytorch-toolbelt: this is a great library with convenient wrappers", "sum_t5_words": 76, "sum_t5_runtime": 5.244, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.6915611624717712, "nltk_category_runtime": 18.317, "nltk_subcategory": "General", "nltk_subcategory_score": 0.9791061878204346, "nltk_subcategory_runtime": 29.421, "category": "Utilities", "category_score": 0.6915611624717712, "subcategory": "General", "subcategory_score": 0.9791061878204346, "runtime_cat": 47.738, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.807", "language_code": "en", "language_score": "0.9999978009211339", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "general informationin kernel work data understanding cloud satellite image competition shallow cloud play huge role determining earth climate theyre also difficult understand represent climate model classifying different type cloud organization researcher max planck hope improve physical understanding cloud turn help u build better climate model competition tasked multiclass segmentation task finding 4 different cloud pattern image hand make prediction pair image label separately could treated 4 binary segmentation task important notice image mask 1400 x 2100 predicted mask 350 x 525 kernel ill use use next version following notable library albumentations great library image augmentation make easier convenient catalyst great library make using pytorch easier help reprodicibility contains lot useful utils segmentation_models_pytorch great library convenient wrapper model loss useful thing pytorchtoolbelt great library many useful shortcut building pytorch model upd version 35 changed calculation optimal threshold min size", "tags_descriptive": ["Deep Learning (DL)", "Computer Vision (CV)", "Exploratory Data Analysis"]}