{"title": "QuickDraw Baseline LSTM Reading and Submission", "description": "OverviewThe notebook is modified from one that was made for the Quick, Draw Dataset, it would actually be interesting to see how beneficial a transfer learning approach using that data as a starting point could be. This NotebookThe notebook takes and preprocesses the data from the QuickDraw Competition step (strokes) and trains an LSTM. The outcome variable (y) is always the same (category). The stroke-based LSTM. The model takes the stroke data and 'preprocesses' it a bit using 1D convolutions and then uses two stacked LSTMs followed by two dense layers to make the classification. The model can be thought to 'read' the drawing stroke by stroke. Fun ModelsAfter the classification models, we try to build a few models to understand what the LSTM actually does. Here we experiment step by step to see how the prediction changes with each stop Next StepsThe next steps could be  use more data to train include the country code (different countries draw different things, different ways) more complex models", "link": "https://www.kaggle.com/kmader/quickdraw-baseline-lstm-reading-and-submission", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-02 13:06:04", "date_scraped": "2020-12-13 16:18:48", "words": 167, "sentences": 8, "runtime": 0.01, "description_category": "Construction & Engineering", "description_category_score": 0.10664668679237366, "description_category_runtime": 15.036, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9181578755378723, "description_subcategory_runtime": 24.041, "category": "Construction & Engineering", "category_score": 0.10664668679237366, "subcategory": "Machine Learning", "subcategory_score": 0.9181578755378723, "runtime_cat": 39.078, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.763", "language_code": "en", "language_score": "0.9999971801935881", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "overviewthe notebook modified one made quick draw dataset would actually interesting see beneficial transfer learning approach using data starting point could notebookthe notebook take preprocesses data quickdraw competition step stroke train lstm outcome variable always category strokebased lstm model take stroke data preprocesses bit using 1d convolution us two stacked lstms followed two dense layer make classification model thought read drawing stroke stroke fun modelsafter classification model try build model understand lstm actually experiment step step see prediction change stop next stepsthe next step could use data train include country code different country draw different thing different way complex model", "tags_descriptive": []}