{"title": "Give Me Some Credit: EDA, XGBoost, LightGBM & SHAP", "description": "GIVE ME SOME CREDITThis notebook is created 9 years after this competition ended. The main aim of this project is to predict the probabily whether a customer will default in the future given his record present in the dataset. We will be using predict_proba to determine the delinquency probabilities of the customer. The Highlights of the notebook are:  Exploratory Data Analysis **Outlier Analysis **Null Handling **Distribution Analysis **Skewness Reduction (using Box Cox Transformation)   Feature Engineering LightGBM using RandomizedSearchCV (Classification) Evaluation Metrics Mean Squared Error Root Mean Squared Error Mean Absolute Error Mean Squared Logarithmic Error Root Mean Square Logarithmic Error Accuracy on Training Set Accuracy on Test Set F-Beta Score (Beta = 2) F1 Score Precision Recall Confusion Matrix AUC Curve   Probability Prediction on Validation Sets Delinquency Prediction on Validation Sets Feature Importances Summary Plot SHAP Analysis     XGBoost using RandomizedSearchCV (Classification) Evaluation Metrics Mean Squared Error Root Mean Squared Error Mean Absolute Error Mean Squared Logarithmic Error Root Mean Square Logarithmic Error Accuracy on Training Set Accuracy on Test Set F-Beta Score (Beta = 2) F1 Score Precision Recall Confusion Matrix AUC Curve   Probability Prediction on Validation Sets Delinquency Prediction on Validation Sets Feature Importances Summary Plot SHAP Analysis      Let's begin with importing the libraries we will be requiring for this notebook", "link": "https://www.kaggle.com/uditnagar5/give-me-some-credit-eda-xgboost-lightgbm-shap", "tags": ["Classification", "Exploratory Data Analysis", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "catboost", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-07-25 19:31:58", "date_scraped": "2020-12-12 20:13:55", "words": 228, "sentences": 4, "sum_nltk": "GIVE ME SOME CREDITThis notebook is created 9 years after this competition ended.\nThe main aim of this project is to predict the probabily whether a customer will default in the future given his record present in the dataset.\nWe will be using predict_proba to determine the delinquency probabilities of the customer.\nThe Highlights of the notebook are:  Exploratory Data Analysis **Outlier Analysis **Null Handling **Distribution Analysis **Skewness Reduction (using Box Cox Transformation)   Feature Engineering LightGBM using RandomizedSearchCV (Classification) Evaluation Metrics Mean Squared Error Root Mean Squared Error Mean Absolute Error Mean Squared Logarithmic Error Root Mean Square Logarithmic Error Accuracy on Training Set Accuracy on Test Set F-Beta Score (Beta = 2) F1 Score Precision Recall Confusion Matrix AUC Curve   Probability Prediction on Validation Sets Delinquency Prediction on Validation Sets Feature Importances Summary Plot SHAP Analysis     XGBoost using RandomizedSearchCV (Classification) Evaluation Metrics Mean Squared Error Root Mean Squared Error Mean Absolute Error Mean Squared Logarithmic Error Root Mean Square Logarithmic Error Accuracy on Training Set Accuracy on Test Set F-Beta Score (Beta = 2) F1 Score Precision Recall Confusion Matrix AUC Curve   Probability Prediction on Validation Sets Delinquency Prediction on Validation Sets Feature Importances Summary Plot SHAP Analysis      Let's begin with importing the libraries we will be requiring for this notebook", "sum_nltk_words": 225, "sum_nltk_runtime": 0.003, "sum_t5": "main aim of this project is to predict the probabily whether a customer will default in the future. we will be using predict_proba to determine the delinquency probabilities of the customer. the notebook is created 9 years after this competition ended. it will be available in a u.s. library store for $99. back to mail online home. back to the page you came from.. back to the page you came from.", "sum_t5_words": 71, "sum_t5_runtime": 5.95, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.2644854784011841, "nltk_category_runtime": 22.446, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6277214884757996, "nltk_subcategory_runtime": 35.601, "category": "Finance", "category_score": 0.2644854784011841, "subcategory": "Machine Learning", "subcategory_score": 0.6277214884757996, "runtime_cat": 58.046, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.63", "language_code": "en", "language_score": "0.9999964746811856", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "give creditthis notebook created 9 year competition ended main aim project predict probabily whether customer default future given record present dataset using predict_proba determine delinquency probability customer highlight notebook exploratory data analysis outlier analysis null handling distribution analysis skewness reduction using box cox transformation feature engineering lightgbm using randomizedsearchcv classification evaluation metric mean squared error root mean squared error mean absolute error mean squared logarithmic error root mean square logarithmic error accuracy training set accuracy test set fbeta score beta 2 f1 score precision recall confusion matrix auc curve probability prediction validation set delinquency prediction validation set feature importance summary plot shap analysis xgboost using randomizedsearchcv classification evaluation metric mean squared error root mean squared error mean absolute error mean squared logarithmic error root mean square logarithmic error accuracy training set accuracy test set fbeta score beta 2 f1 score precision recall confusion matrix auc curve probability prediction validation set delinquency prediction validation set feature importance summary plot shap analysis let begin importing library requiring notebook", "tags_descriptive": ["Classification", "Exploratory Data Analysis", "Feature Engineering"]}