{"title": "Predict the number of pups", "description": "I suspect that the pups will be difficult to count on the images because they are dark grey just like the rocks, they are usually very close to their mother, and they are pretty similar in shape, size, and color to the seals (see 5.jpg for example). However, all other sea lion types are light brown so they should be easier to locate and count. I explore in this notebook whether it is possible to predict the number of pups based on the number of other sea lions. That is, the pups are not directly counted but their number is inferred/estimated based on the number of males, females, juveniles, and subadult males using a regression model. This alternative approach could turn out to be more accurate than directly counting the pups and I hope some of you will find it useful to improve the overall accuracy of the counts.", "link": "https://www.kaggle.com/andraszsom/predict-the-number-of-pups", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-04-30 15:37:41", "date_scraped": "2020-12-13 14:32:38", "words": 149, "sentences": 5, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.2733840048313141, "description_category_runtime": 12.626, "description_subcategory": "Physical", "description_subcategory_score": 0.5101000666618347, "description_subcategory_runtime": 19.601, "category": "Utilities", "category_score": 0.2733840048313141, "subcategory": "Physical", "subcategory_score": 0.5101000666618347, "runtime_cat": 32.227, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.7", "language_code": "en", "language_score": "0.9999974741501493", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "suspect pup difficult count image dark grey like rock usually close mother pretty similar shape size color seal see 5jpg example however sea lion type light brown easier locate count explore notebook whether possible predict number pup based number sea lion pup directly counted number inferredestimated based number male female juvenile subadult male using regression model alternative approach could turn accurate directly counting pup hope find useful improve overall accuracy count", "tags_descriptive": []}