{"title": "Simple EDA Geo Data & Time Series", "description": "Zillow House EDA：The Fast &  Curious JourneyMajin Buu - UPDATED Year Build Error, 9 Sept 2017 UPDATE: Multiplicative Model  1 First Step 1.1 Load libraries and helper functions 1.2 Load data 1.3 Check the Memory Usage 1.4 DataType Converting 1.5 DateTime Parsing   2 Univariable Analysis 2.1 Basic Statistic using Pandas and Numpy 2.2 The Distribution of our target variables (logerror)     3 Multivariate Analysis 3.1 Target Variable Distribution Join Fips by Bokeh 3.2 Geographic Location by Folium and Cluster by KMeans 3.3 Where are the Perfect Estimation area ?   4 Time Series Approach 4.1 Aggragation & Visualization Time Series Components Combining Time Series Components   4.2 Moving Average Smoothing / Random Walk and Stationarity 4.3 Prophet Forecasting     Reference  In this Notebook, you will discover time series forecasting. After reading this Notebook, you will know:  Basic Time Series analysis, and time series forecasting.  The Time Series components to consider in time series data. Examples of Time Series to make your understanding concrete. Time Series Libararies  Let’s get started. NOTE - Please UPVOTING if you like, all your support is my motivation to update the notebook.", "link": "https://www.kaggle.com/kueipo/simple-eda-geo-data-time-series", "tags": ["Exploratory Data Analysis", "CLustering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-11-11 05:10:27", "date_scraped": "2020-12-13 18:50:10", "words": 202, "sentences": 6, "sum_nltk": "Zillow House EDA：The Fast &  Curious JourneyMajin Buu - UPDATED Year Build Error, 9 Sept 2017 UPDATE: Multiplicative Model  1 First Step 1.1 Load libraries and helper functions 1.2 Load data 1.3 Check the Memory Usage 1.4 DataType Converting 1.5 DateTime Parsing   2 Univariable Analysis 2.1 Basic Statistic using Pandas and Numpy 2.2 The Distribution of our target variables (logerror)     3 Multivariate Analysis 3.1 Target Variable Distribution Join Fips by Bokeh 3.2 Geographic Location by Folium and Cluster by KMeans 3.3 Where are the Perfect Estimation area ?\n4 Time Series Approach 4.1 Aggragation & Visualization Time Series Components Combining Time Series Components   4.2 Moving Average Smoothing / Random Walk and Stationarity 4.3 Prophet Forecasting     Reference  In this Notebook, you will discover time series forecasting.\nAfter reading this Notebook, you will know:  Basic Time Series analysis, and time series forecasting.\nThe Time Series components to consider in time series data.\nExamples of Time Series to make your understanding concrete.\nTime Series Libararies  Let’s get started.\nNOTE - Please UPVOTING if you like, all your support is my motivation to update the notebook.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.002, "sum_t5": "'multiplicative model' is a notebook that explains how to analyze time series data. it is a 'first step' to a more detailed analysis of time series data. it is a 'first step' to a more detailed analysis of time series data. it is a 'first step' to a more detailed analysis of time series data. it is a 'first step' to a more detailed analysis of time series data.", "sum_t5_words": 69, "sum_t5_runtime": 4.899, "runtime": 0.003, "nltk_category": "Real Estate, Rental & Leasing", "nltk_category_score": 0.16181166470050812, "nltk_category_runtime": 20.094, "nltk_subcategory": "Real Estate", "nltk_subcategory_score": 0.3126349449157715, "nltk_subcategory_runtime": 32.983, "category": "Real Estate, Rental & Leasing", "category_score": 0.16181166470050812, "subcategory": "Real Estate", "subcategory_score": 0.3126349449157715, "runtime_cat": 53.077, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.759", "language_code": "en", "language_score": "0.9999959997699404", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "zillow house edathe fast curious journeymajin buu updated year build error 9 sept 2017 update multiplicative model 1 first step 11 load library helper function 12 load data 13 check memory usage 14 datatype converting 15 datetime parsing 2 univariable analysis 21 basic statistic using panda numpy 22 distribution target variable logerror 3 multivariate analysis 31 target variable distribution join fips bokeh 32 geographic location folium cluster kmeans 33 perfect estimation area 4 time series approach 41 aggragation visualization time series component combining time series component 42 moving average smoothing random walk stationarity 43 prophet forecasting reference notebook discover time series forecasting reading notebook know basic time series analysis time series forecasting time series component consider time series data example time series make understanding concrete time series libararies let get started note please upvoting like support motivation update notebook", "tags_descriptive": ["Exploratory Data Analysis", "CLustering"]}