{"title": "EDA - Weird Images with New Updates!", "description": "Don't skip the analysis!!!Updated on 21 AprWhen it comes to image data, people tend to skip the data understanding step and goes straight into using powerful models for transfer learning or feature extractions. This is alright, but wouldn't you want to understand what goes on under the hood? In this kernel, I attempt to understand the data in a conventional data analysis approach (on the raw image metadata etc) and highlight interesting observations which can help your pre-processing pipeline and feature engineering. What is covered & what I plan to do over the next few weeks (or whenever I have time):  Image Shape (done!) Understanding Target Variable (done!) <---------------------------- NEW!!!! RGB Pixel Statistics (done!) <--------------------------------------- NEW!!!! Edge Detection Pixel Statistics (done!) <-------------------------- NEW!!!! Intensity Histogram Correlations of the above with Target Variable  TL;DR - Summary of Insights Super long images exist in the dataset Highly imbalanced dataset, over 1000 labels, with 90% images having less than 5 labels Similar target classes (e.g. men, women, portraits, human figures) RGB pixel statistics - normal distribution with different mean", "link": "https://www.kaggle.com/chewzy/eda-weird-images-with-new-updates", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-25 17:55:14", "date_scraped": "2020-12-13 11:40:08", "words": 178, "sentences": 4, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.152326762676239, "description_category_runtime": 15.857, "description_subcategory": "Student", "description_subcategory_score": 0.22846215963363647, "description_subcategory_runtime": 25.221, "category": "Utilities", "category_score": 0.152326762676239, "subcategory": "Student", "subcategory_score": 0.22846215963363647, "runtime_cat": 41.079, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.727", "language_code": "en", "language_score": "0.9999975530234964", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "dont skip analysisupdated 21 aprwhen come image data people tend skip data understanding step go straight using powerful model transfer learning feature extraction alright wouldnt want understand go hood kernel attempt understand data conventional data analysis approach raw image metadata etc highlight interesting observation help preprocessing pipeline feature engineering covered plan next week whenever time image shape done understanding target variable done new rgb pixel statistic done new edge detection pixel statistic done new intensity histogram correlation target variable tldr summary insight super long image exist dataset highly imbalanced dataset 1000 label 90 image le 5 label similar target class eg men woman portrait human figure rgb pixel statistic normal distribution different mean", "tags_descriptive": ["Exploratory Data Analysis"]}