{"title": "Exploration + Bi-LSTM Model", "description": "Problem Understanding The YouTube8M challenge is a multi-class classification problem, where we are asked to predict for each video, given video & frame level audio and frame RGB features, to which group of categories it belongs to. I have divided entire task into two parts  Simple Data Exploration,  Labels/classes study of sample videos.  Created a Bi-LSTM multilabel neural model by randomly created sample data.  Lets first explore the labels for the training data, their distribution and frequent patterns and co-occurance of the most frequent label categories. Since we have been given sample dataset  here, so all my exploration will be done on sample data, we can do the same anlaysis on large corpus using GCloud ML Engine", "link": "https://www.kaggle.com/amansrivastava/exploration-bi-lstm-model", "tags": ["DL", "LSTM"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow", "vocabulary", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-06-14 10:17:34", "date_scraped": "2020-12-13 18:43:34", "words": 122, "sentences": 5, "runtime": 0.003, "description_category": "Construction & Engineering", "description_category_score": 0.14719079434871674, "description_category_runtime": 11.024, "description_subcategory": "Student", "description_subcategory_score": 0.4653000831604004, "description_subcategory_runtime": 17.121, "category": "Construction & Engineering", "category_score": 0.14719079434871674, "subcategory": "Student", "subcategory_score": 0.4653000831604004, "runtime_cat": 28.145, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.739", "language_code": "en", "language_score": "0.999994050855155", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "problem understanding youtube8m challenge multiclass classification problem asked predict video given video frame level audio frame rgb feature group category belongs divided entire task two part simple data exploration labelsclasses study sample video created bilstm multilabel neural model randomly created sample data let first explore label training data distribution frequent pattern cooccurance frequent label category since given sample dataset exploration done sample data anlaysis large corpus using gcloud ml engine", "tags_descriptive": ["Deep Learning (DL)", "Long short-term memory (LSTM)"]}