{"title": "Hyperopt + LGBMClassifier,Simple EDA", "description": "Introduction Banks play a crucial role in market economies. They decide who can get financing and on what terms and can make or stop investment decisions. For markets and society to function, individuals and companies need access to credit. Credit scoring algorithms, which predict the probability of default, are the method used by banks to determine whether or not a loan should be granted.. objective Creation of a model in which he can try to predict the probability of the customer being able to repay the requested loan to the bank About Dataset  History of approx. 250,000 customers in which it was divided between training and test dataset Variable Name Description Type  Variable Description   SeriousDlqin2yrs Person experienced 90 days past due delinquency or worse Y/N   RevolvingUtilizationOfUnsecuredLines Total balance on credit cards and personal lines of credit except real estate and no installment debt like car loans divided by the sum of credit limits percentage   Age Age of borrower in years integer   NumberOfTime3059DaysPastDueNotWorse Number of times borrower has been 30-59 days past due but no worse in the last 2 years. integer   DebtRatio Monthly debt payments, alimony,living costs divided by monthy gross income percentage   MonthlyIncome Monthly income real   NumberOfOpenCreditLinesAndLoans Number of Open loans (installment like car loan or mortgage) and Lines of credit (e.g. credit cards) integer   NumberOfTimes90DaysLate Number of times borrower has been 90 days or more past due. integer   NumberRealEstateLoansOrLines Number of mortgage and real estate loans including home equity lines of credit integer   NumberOfTime60-89DaysPastDueNotWorse Number of times borrower has been 60-89 days past due but no worse in the last 2 years. integer   NumberOfDependents  Number of dependents in family excluding themselves (spouse, children etc.) integer", "link": "https://www.kaggle.com/vermillionz/hyperopt-lgbmclassifier-86-roc-auc-simple-eda", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-17 20:51:48", "date_scraped": "2020-12-12 20:13:55", "words": 302, "sentences": 10, "sum_nltk": "Credit scoring algorithms, which predict the probability of default, are the method used by banks to determine whether or not a loan should be granted..\n250,000 customers in which it was divided between training and test dataset Variable Name Description Type  Variable Description   SeriousDlqin2yrs Person experienced 90 days past due delinquency or worse Y/N   RevolvingUtilizationOfUnsecuredLines Total balance on credit cards and personal lines of credit except real estate and no installment debt like car loans divided by the sum of credit limits percentage   Age Age of borrower in years integer   NumberOfTime3059DaysPastDueNotWorse Number of times borrower has been 30-59 days past due but no worse in the last 2 years.\ninteger   DebtRatio Monthly debt payments, alimony,living costs divided by monthy gross income percentage   MonthlyIncome Monthly income real   NumberOfOpenCreditLinesAndLoans Number of Open loans (installment like car loan or mortgage) and Lines of credit (e.g. credit cards) integer   NumberOfTimes90DaysLate Number of times borrower has been 90 days or more past due.\ninteger   NumberRealEstateLoansOrLines Number of mortgage and real estate loans including home equity lines of credit integer   NumberOfTime60-89DaysPastDueNotWorse Number of times borrower has been 60-89 days past due but no worse in the last 2 years.", "sum_nltk_words": 211, "sum_nltk_runtime": 0.003, "sum_t5": "bank scoring algorithms predict the probability of default. people who have been 90 days past due are more likely to be able to repay. a person who has been 90 days past due is more likely to be able to repay. a person who has been 90 days past due is more likely to be able to repay. a person who has been 90 days past due is more likely to be able to repay. a person who has been 90 days past due is more likely to be able to repay a", "sum_t5_words": 93, "sum_t5_runtime": 6.665, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.6832311749458313, "nltk_category_runtime": 20.976, "nltk_subcategory": "Restaurant", "nltk_subcategory_score": 0.244734525680542, "nltk_subcategory_runtime": 33.404, "category": "Finance", "category_score": 0.6832311749458313, "subcategory": "Restaurant", "subcategory_score": 0.244734525680542, "runtime_cat": 54.38, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.702", "language_code": "en", "language_score": "0.9999968987653723", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introduction bank play crucial role market economy decide get financing term make stop investment decision market society function individual company need access credit credit scoring algorithm predict probability default method used bank determine whether loan granted objective creation model try predict probability customer able repay requested loan bank dataset history approx 250000 customer divided training test dataset variable name description type variable description seriousdlqin2yrs person experienced 90 day past due delinquency worse yn revolvingutilizationofunsecuredlines total balance credit card personal line credit except real estate installment debt like car loan divided sum credit limit percentage age age borrower year integer numberoftime3059dayspastduenotworse number time borrower 3059 day past due worse last 2 year integer debtratio monthly debt payment alimonyliving cost divided monthy gross income percentage monthlyincome monthly income real numberofopencreditlinesandloans number open loan installment like car loan mortgage line credit eg credit card integer numberoftimes90dayslate number time borrower 90 day past due integer numberrealestateloansorlines number mortgage real estate loan including home equity line credit integer numberoftime6089dayspastduenotworse number time borrower 6089 day past due worse last 2 year integer numberofdependents number dependent family excluding spouse child etc integer", "tags_descriptive": []}