{"title": "M5 Forecasting  - Starter Data Exploration ", "description": "M5 Forecasting Challenge The goal of this notebook is to give competitors a quick overview of the 2020 M5 competition. After reading it you should have a good idea of the objective you are trying to solve, the data provided and the metrics you will be scored on. Some tl;dr items to note:  There are two parallel competitions: Accuracy and Uncertainty The accuracy competition will use the metric: Weighted Root Mean Squared Scaled Error (RMSSE) The uncertainty competition will use the metric: Weighted Scaled Pinball Loss (WSPL)   We are tasked with forecasting hierarchical sales data from Wal-Mart. The data, covers stores in three US States (California, Texas, and Wisconsin) and includes item level, department, product categories, and store details. In addition, it has explanatory variables such as price, promotions, day of the week, and special events.", "link": "https://www.kaggle.com/robikscube/m5-forecasting-starter-data-exploration", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-03-27 18:02:43", "date_scraped": "2020-12-13 13:22:57", "words": 139, "sentences": 5, "runtime": 0.003, "description_category": "Wholesale & Retail", "description_category_score": 0.449876993894577, "description_category_runtime": 13.006, "description_subcategory": "Retail", "description_subcategory_score": 0.8067294955253601, "description_subcategory_runtime": 20.522, "category": "Wholesale & Retail", "category_score": 0.449876993894577, "subcategory": "Retail", "subcategory_score": 0.8067294955253601, "runtime_cat": 33.528, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.798", "language_code": "en", "language_score": "0.9999954416038404", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "m5 forecasting challenge goal notebook give competitor quick overview 2020 m5 competition reading good idea objective trying solve data provided metric scored tldr item note two parallel competition accuracy uncertainty accuracy competition use metric weighted root mean squared scaled error rmsse uncertainty competition use metric weighted scaled pinball loss wspl tasked forecasting hierarchical sale data walmart data cover store three u state california texas wisconsin includes item level department product category store detail addition explanatory variable price promotion day week special event", "tags_descriptive": []}