{"title": "Diabetic Retinopathy with ResNet50, Oversampling", "description": "Diabetic RetinopathyDiabetic retinopathy (DR), also known as diabetic eye disease, is a medical condition in which damage occurs to the retina due to diabetes mellitus. It is a leading cause of blindness. Diabetic retinopathy affects up to 80 percent of those who have had diabetes for 20 years or more. Diabetic retinopathy often has no early warning signs. Retinal (fundus) photography with manual interpretation is a widely accepted screening tool for diabetic retinopathy, with performance that can exceed that of in-person dilated eye examinations. The below figure shows an example of a healthy patient and a patient with diabetic retinopathy as viewed by fundus photography (source):  An automated tool for grading severity of diabetic retinopathy would be very useful for accerelating detection and treatment. Recently, there have been a number of attempts to utilize deep learning to diagnose DR and automatically grade diabetic retinopathy. This includes this competition and work by Google. Even one deep-learning based system is FDA approved. Clearly, this dataset and deep learning problem is quite well-characterized. A look at the data:Data description from the competition: You are provided with a large set of high-resolution retina images taken under a variety of imaging conditions. A left and right field is provided for every subject. >Images are labeled with a subject id as well as either left or right (e.g. 1_left.jpeg is the left eye of patient id 1). A clinician has rated the presence of diabetic retinopathy in each image on a scale of 0 to 4, according to the following scale: 0 - No DR 1 - Mild 2 - Moderate 3 - Severe 4 - Proliferative DR Your task is to create an automated analysis system capable of assigning a score based on this scale.  ... Like any real-world data set, you will encounter noise in both the images and labels. Images may contain artifacts, be out of focus, underexposed, or overexposed. A major aim of this competition is to develop robust algorithms that can function in the presence of noise and variation.  A minor problem! Due to the large image file size, there are only 1000 files with labels and one csv file with the labels of all the images in the directory available in the kernel, as demonstrated below. The actual competition had on the order of 35,000 files so this is clearly a very small subset of the data.  In addition, this is a highly imbalanced dataset. Originally, I had aimed to create a model that would be close to the SOTA, but clearly, with only 1000 images that's not possible. AIM OF KERNEL: I will utilize transfer learning, oversampling, and progressive resizing on this small, imbalanced dataset. Given that many real-world datasets are also small and imbalanced, it will be interesting to see how far these techniques will take us.", "link": "https://www.kaggle.com/tanlikesmath/diabetic-retinopathy-with-resnet50-oversampling", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch", "spacy", "Pillow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-02-28 22:19:14", "date_scraped": "2020-12-12 18:54:56", "words": 473, "sentences": 25, "sum_nltk": "Recently, there have been a number of attempts to utilize deep learning to diagnose DR and automatically grade diabetic retinopathy.\nClearly, this dataset and deep learning problem is quite well-characterized.\nA look at the data:Data description from the competition: You are provided with a large set of high-resolution retina images taken under a variety of imaging conditions.\n>Images are labeled with a subject id as well as either left or right (e.g. 1_left.jpeg is the left eye of patient id 1).\nA clinician has rated the presence of diabetic retinopathy in each image on a scale of 0 to 4, according to the following scale: 0 - No DR 1 - Mild 2 - Moderate 3 - Severe 4 - Proliferative DR Your task is to create an automated analysis system capable of assigning a score based on this scale.\nLike any real-world data set, you will encounter noise in both the images and labels.\nAIM OF KERNEL: I will utilize transfer learning, oversampling, and progressive resizing on this small, imbalanced dataset.\nGiven that many real-world datasets are also small and imbalanced, it will be interesting to see how far these techniques will take us.", "sum_nltk_words": 188, "sum_nltk_runtime": 0.005, "sum_t5": "a competition is being run by google to develop algorithms that can diagnose diabetic retinopathy. the algorithms will be able to automatically grade diabetic retinopathy. the competition is open to all users and is open to all. if you win, you will be able to see the retina in a different light. a 'diabetic eye disease' is a medical condition that affects up to 80 percent of those who have had diabetes for 20 years or more.", "sum_t5_words": 77, "sum_t5_runtime": 6.864, "runtime": 0.003, "nltk_category": "Healthcare", "nltk_category_score": 0.4601137638092041, "nltk_category_runtime": 17.848, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.5947751402854919, "nltk_subcategory_runtime": 28.153, "category": "Healthcare", "category_score": 0.4601137638092041, "subcategory": "Machine Learning", "subcategory_score": 0.5947751402854919, "runtime_cat": 46.001, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.75", "language_code": "en", "language_score": "0.9999977498526037", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "diabetic retinopathydiabetic retinopathy dr also known diabetic eye disease medical condition damage occurs retina due diabetes mellitus leading cause blindness diabetic retinopathy affect 80 percent diabetes 20 year diabetic retinopathy often early warning sign retinal fundus photography manual interpretation widely accepted screening tool diabetic retinopathy performance exceed inperson dilated eye examination figure show example healthy patient patient diabetic retinopathy viewed fundus photography source automated tool grading severity diabetic retinopathy would useful accerelating detection treatment recently number attempt utilize deep learning diagnose dr automatically grade diabetic retinopathy includes competition work google even one deeplearning based system fda approved clearly dataset deep learning problem quite wellcharacterized look datadata description competition provided large set highresolution retina image taken variety imaging condition left right field provided every subject image labeled subject id well either left right eg 1_leftjpeg left eye patient id 1 clinician rated presence diabetic retinopathy image scale 0 4 according following scale 0 dr 1 mild 2 moderate 3 severe 4 proliferative dr task create automated analysis system capable assigning score based scale like realworld data set encounter noise image label image may contain artifact focus underexposed overexposed major aim competition develop robust algorithm function presence noise variation minor problem due large image file size 1000 file label one csv file label image directory available kernel demonstrated actual competition order 35000 file clearly small subset data addition highly imbalanced dataset originally aimed create model would close sota clearly 1000 image thats possible aim kernel utilize transfer learning oversampling progressive resizing small imbalanced dataset given many realworld datasets also small imbalanced interesting see far technique take u", "tags_descriptive": []}