{"title": "Exploratory study on ML algorithms", "description": "Thank you for opening this script! I have made all efforts to document each and every step involved in the prediction process so that this notebook acts as a good starting point for new Kagglers and new machine learning enthusiasts. Please upvote this kernel so that it reaches the top of the chart and is easily locatable by new users. Your comments on how we can improve this kernel is welcome. Thanks. My other exploratory studies can be accessed here : https://www.kaggle.com/sharmasanthosh/kernels  Data statistics Shape Peek Description Skew  Transformation Correction of skew  Data Interaction Correlation Scatter plot  Data Visualization Box and density plots Grouping of one hot encoded attributes  Data Preparation One hot encoding of categorical data Test-train split  Evaluation, prediction, and analysis Linear Regression (Linear algo) Ridge Regression (Linear algo) LASSO Linear Regression (Linear algo) Elastic Net Regression (Linear algo) KNN (non-linear algo) CART (non-linear algo) SVM (Non-linear algo) Bagged Decision Trees (Bagging) Random Forest (Bagging) Extra Trees (Bagging) AdaBoost (Boosting) Stochastic Gradient Boosting (Boosting) MLP (Deep Learning) XGBoost  Make Predictions", "link": "https://www.kaggle.com/sharmasanthosh/exploratory-study-on-ml-algorithms", "tags": ["Model Comparison"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "keras", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2016-10-16 16:59:31", "date_scraped": "2020-12-12 16:36:58", "words": 179, "sentences": 5, "runtime": 0.0, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.13718870282173157, "description_category_runtime": 19.548, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9481666684150696, "description_subcategory_runtime": 30.925, "category": "Real Estate, Rental & Leasing", "category_score": 0.13718870282173157, "subcategory": "Machine Learning", "subcategory_score": 0.9481666684150696, "runtime_cat": 50.473, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.809", "language_code": "en", "language_score": "0.9999961497523574", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "thank opening script made effort document every step involved prediction process notebook act good starting point new kagglers new machine learning enthusiast please upvote kernel reach top chart easily locatable new user comment improve kernel welcome thanks exploratory study accessed httpswwwkagglecomsharmasanthoshkernels data statistic shape peek description skew transformation correction skew data interaction correlation scatter plot data visualization box density plot grouping one hot encoded attribute data preparation one hot encoding categorical data testtrain split evaluation prediction analysis linear regression linear algo ridge regression linear algo lasso linear regression linear algo elastic net regression linear algo knn nonlinear algo cart nonlinear algo svm nonlinear algo bagged decision tree bagging random forest bagging extra tree bagging adaboost boosting stochastic gradient boosting boosting mlp deep learning xgboost make prediction", "tags_descriptive": ["Model Comparison"]}