{"title": "NLP - Word2Vec", "description": "In this Notebook, I will be classifying reviews as positive or negative using 2 different concepts of Natural Language Procession -  The first one involves creating the classical bag of words model The second one involves involves creating a bag of vectors model i.e. each word is converted into a vector(Word to Vec)  The advantage of converting words to vector is that semantically similar words are placed near to each other and words opposite in meaning are placed further apart. In the project, the accuracy in predicting the sentiment of the reviews remains almost the same with both the approaches but it is found that when the amount of training data is increased, the word2vec approach performs better.  P.S. - Google Search utlises the word2vec approach.", "link": "https://www.kaggle.com/harshitmakkar/nlp-word2vec", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "nltk", "gensim", "tensorflow", "sklearn", "vocabulary"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-08-28 08:12:31", "date_scraped": "2020-12-13 18:30:04", "words": 129, "sentences": 5, "runtime": 0.003, "description_category": "Media & Publishing", "description_category_score": 0.23303334414958954, "description_category_runtime": 11.252, "description_subcategory": "Restaurant", "description_subcategory_score": 0.27291715145111084, "description_subcategory_runtime": 17.318, "category": "Media & Publishing", "category_score": 0.23303334414958954, "subcategory": "Restaurant", "subcategory_score": 0.27291715145111084, "runtime_cat": 28.57, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.69", "language_code": "en", "language_score": "0.9999947515073407", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notebook classifying review positive negative using 2 different concept natural language procession first one involves creating classical bag word model second one involves involves creating bag vector model ie word converted vectorword vec advantage converting word vector semantically similar word placed near word opposite meaning placed apart project accuracy predicting sentiment review remains almost approach found amount training data increased word2vec approach performs better p google search utlises word2vec approach", "tags_descriptive": []}