{"title": "Aerial Cactus Prediction using fast.ai & ResNet-34", "description": "Aerial Cactus Prediction using fast.ai & ResNet-34IntroductionTo assess the impact of climate change on Earth's flora and fauna, it is vital to quantify how human activities such as logging, mining, and agriculture are impacting our protected natural areas. Researchers in Mexico have created the VIGIA project, which aims to build a system for autonomous surveillance of protected areas. A first step in such an effort is the ability to recognize the vegetation inside the protected areas. In this competition, you are tasked with creation of an algorithm that can identify a specific type of cactus in aerial imagery. The original version of this data can be found here, with full details in López-Jiménez's master thesis: Efren López-Jiménez, Sistema embebido para la supervisión inteligente de terrenos con vehı́culos aéreos no tripulados. Master Thesis, Instituto Politécnico Nacional, 2018. DOI: 10.13140/RG.2.2.19455.46246.  In this kernel I will attempt to identify a specific type of cactus in aerial imagery using fast.ai and a ImageNet pre-trained ResNet-34. I will explain my process throughout the kernel, which should allow anyone familiar with the fast.ai library to follow along. Why train a smaller model and not a larger model such as DenseNet-161? While I could train a DenseNet-161 model using the fast.ai defaults and match the top results in this competition, a smaller model that can match the accuracy of a larger model is more flexible. It could more easily be deployed as part of a smartphone app, for example. Plus training a smaller model requires different approaches and hyperparameter tuning.", "link": "https://www.kaggle.com/benjaminwarner/aerial-cactus-prediction-using-fast-ai-resnet-34", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-05-24 06:29:00", "date_scraped": "2020-12-12 16:10:46", "words": 254, "sentences": 12, "sum_nltk": "Aerial Cactus Prediction using fast.ai & ResNet-34IntroductionTo assess the impact of climate change on Earth's flora and fauna, it is vital to quantify how human activities such as logging, mining, and agriculture are impacting our protected natural areas.\nResearchers in Mexico have created the VIGIA project, which aims to build a system for autonomous surveillance of protected areas.\nA first step in such an effort is the ability to recognize the vegetation inside the protected areas.\nIn this competition, you are tasked with creation of an algorithm that can identify a specific type of cactus in aerial imagery.\nThe original version of this data can be found here, with full details in López-Jiménez's master thesis: Efren López-Jiménez, Sistema embebido para la supervisión inteligente de terrenos con vehı́culos aéreos no tripulados.\nMaster Thesis, Instituto Politécnico Nacional, 2018.\nIn this kernel I will attempt to identify a specific type of cactus in aerial imagery using fast.ai and a ImageNet pre-trained ResNet-34.\nWhy train a smaller model and not a larger model such as DenseNet-161?\nWhile I could train a DenseNet-161 model using the fast.ai defaults and match the top results in this competition, a smaller model that can match the accuracy of a larger model is more flexible.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.003, "sum_t5": "researchers in Mexico have created the VIGIA project. the project aims to build a system for autonomous surveillance of protected areas. you are tasked with creating an algorithm that can identify a specific type of cactus. the process will explain my process throughout the kernel. a smaller model that can match the accuracy of a larger model is more flexible.. the winner will be announced in november. a cactus prediction kernel will be released later this year.", "sum_t5_words": 77, "sum_t5_runtime": 6.502, "runtime": 0.006, "nltk_category": "Healthcare", "nltk_category_score": 0.4148864150047302, "nltk_category_runtime": 21.391, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9233565926551819, "nltk_subcategory_runtime": 34.514, "category": "Healthcare", "category_score": 0.4148864150047302, "subcategory": "Machine Learning", "subcategory_score": 0.9233565926551819, "runtime_cat": 55.905, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.692", "language_code": "en", "language_score": "0.999997139299988", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "aerial cactus prediction using fastai resnet34introductionto ass impact climate change earth flora fauna vital quantify human activity logging mining agriculture impacting protected natural area researcher mexico created vigia project aim build system autonomous surveillance protected area first step effort ability recognize vegetation inside protected area competition tasked creation algorithm identify specific type cactus aerial imagery original version data found full detail lopezjimenezs master thesis efren lopezjimenez sistema embebido para la supervision inteligente de terrenos con vehculos aereos tripulados master thesis instituto politecnico nacional 2018 doi 1013140rg221945546246 kernel attempt identify specific type cactus aerial imagery using fastai imagenet pretrained resnet34 explain process throughout kernel allow anyone familiar fastai library follow along train smaller model larger model densenet161 could train densenet161 model using fastai default match top result competition smaller model match accuracy larger model flexible could easily deployed part smartphone app example plus training smaller model requires different approach hyperparameter tuning", "tags_descriptive": []}