{"title": "1. Coref visualization jupyter allenlp stanford...", "description": "Coreference visualization for jupyter notebooks (Code repository: https://github.com/sattree/gpr_pub) AllenNLP style highlighting of mention clusters (https://demo.allennlp.org/coreference-resolution/NjA2MjY3**) extended to stanford corenlp, huggingface, and pronoun resolutions  This notebook demonstrates two contributions made to the gpr visualization task:  Extend the visualization code logic for rendering in jupyter notebooks - allennlp functionality provides these visualizations only through a web app interface and is natively built in js. Extend the visualization api to cover and provide a uniform interface for stanford and huggingface coref apis, and to also handle pronoun resolution labels.  Visualization renderer has a displacy (spacy) style api interface, again aimed at maintaining uniformity in interfaces. I found allennlp entity highlighting and linking type of visualizations to be better suited for longer text snippets as opposed to the spacy dependency style visualizations offered by huggingface. This kernel is the first in a tri-series of self-contained installments to introduce the GPR problem.  Coref visualization Reproducing GAP results - achieves a logloss score of 0.84 A better baseline - without any training  By no means am I implying that this series is a comprehensive coverage of the problem. There are numerous wonderful kernels available in the competition to that effect. The aim of this series is to provide a good starting point for fellow participants to hit the ground running.", "link": "https://www.kaggle.com/sattree/1-coref-visualization-jupyter-allenlp-stanford", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["nltk", "vocabulary", "spacy", "pattern", "pytorch", "mxnet"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-02-18 05:22:10", "date_scraped": "2020-12-12 20:09:27", "words": 219, "sentences": 8, "sum_nltk": "Coreference visualization for jupyter notebooks (Code repository: https://github.com/sattree/gpr_pub) AllenNLP style highlighting of mention clusters (https://demo.allennlp.org/coreference-resolution/NjA2MjY3**) extended to stanford corenlp, huggingface, and pronoun resolutions  This notebook demonstrates two contributions made to the gpr visualization task:  Extend the visualization code logic for rendering in jupyter notebooks - allennlp functionality provides these visualizations only through a web app interface and is natively built in js.\nExtend the visualization api to cover and provide a uniform interface for stanford and huggingface coref apis, and to also handle pronoun resolution labels.\nVisualization renderer has a displacy (spacy) style api interface, again aimed at maintaining uniformity in interfaces.\nI found allennlp entity highlighting and linking type of visualizations to be better suited for longer text snippets as opposed to the spacy dependency style visualizations offered by huggingface.\nThis kernel is the first in a tri-series of self-contained installments to introduce the GPR problem.\nCoref visualization Reproducing GAP results - achieves a logloss score of 0.84 A better baseline - without any training  By no means am I implying that this series is a comprehensive coverage of the problem.\nThe aim of this series is to provide a good starting point for fellow participants to hit the ground running.", "sum_nltk_words": 199, "sum_nltk_runtime": 0.003, "sum_t5": "this kernel is the first in a tri-series of self-contained installments to introduce the GPR problem. it is the first in a tri-series of self-contained installments to introduce the problem. the aim of this series is to provide a good starting point for fellow participants to hit the ground running. the kernel is the first in a tri-series of self-contained installments to introduce the problem.", "sum_t5_words": 65, "sum_t5_runtime": 5.655, "runtime": 0.003, "nltk_category": "Finance", "nltk_category_score": 0.4430648684501648, "nltk_category_runtime": 22.036, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.7088555097579956, "nltk_subcategory_runtime": 35.308, "category": "Finance", "category_score": 0.4430648684501648, "subcategory": "Student", "subcategory_score": 0.7088555097579956, "runtime_cat": 57.344, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.705", "language_code": "en", "language_score": "0.9999965290218362", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "coreference visualization jupyter notebook code repository httpsgithubcomsattreegpr_pub allennlp style highlighting mention cluster httpsdemoallennlporgcoreferenceresolutionnja2mjy3 extended stanford corenlp huggingface pronoun resolution notebook demonstrates two contribution made gpr visualization task extend visualization code logic rendering jupyter notebook allennlp functionality provides visualization web app interface natively built j extend visualization api cover provide uniform interface stanford huggingface coref apis also handle pronoun resolution label visualization renderer displacy spacy style api interface aimed maintaining uniformity interface found allennlp entity highlighting linking type visualization better suited longer text snippet opposed spacy dependency style visualization offered huggingface kernel first triseries selfcontained installment introduce gpr problem coref visualization reproducing gap result achieves logloss score 084 better baseline without training mean implying series comprehensive coverage problem numerous wonderful kernel available competition effect aim series provide good starting point fellow participant hit ground running", "tags_descriptive": ["Exploratory Data Analysis"]}