{"title": "Triage Recommender with Cold Start  ", "description": "SummaryThe problemThis Kernel is an entry into the CareerVillage.org (CV) Kaggle competition with the following objective: develop a method to recommend relevant questions to the professionals who are most likely to answer them. The proposed solution should support the CV metric: A good recommender system should help us to reach a target of a high (95%?) percent of questions which get a 10-quality-point-answer within 24 hours, without churning the Pros, and within the bounds of fairness. Proposed SolutionA triage question handler is proposed together with a set of recommendations to handle the cold start problem and a method that provides a list of suggested questions for professionals that visit the CV site. The triage question handler compares a new question with all the previously asked questions and puts the question into one of three categories:  When there are many good matches with similar previously answered questions, students should be given immediate feedback by displaying this list of similar questions. They could be asked if their question was answered or if they still want professionals to be asked. This gives old questions/answers new life and the opportunity for professionals to get regular feedback to promote continued engagement. When there are fewer less good matches with similar previously answered questions, there is a group of questions where the matches are still good enough to find professionals who will find the student's question relevant. When there are very few or no good matches with similar previously answered questions the system can immediately flag this problem. Ideally CV could recruit a group of very engaged professionals who are willing to get involved in answering these difficult to answer questions. In some cases that answer may require the development of a dialogue which would require an extension to the current system.  A number of technologies are considered to drive the model. Six of these are explored in detail:  tfidf questions bags of words similarity  Word2Vec  FastText  GloVe  Universal sentence encoder (USE)  tfidf professionals bag of words similarity   For the first 5 models, the 10 best matches are found for the last 100 questions in the data set that are answered. An extensive but subjective comparison shows the FastText system is the most suitable with Word2Vec almost as good. The subjective analysis of the last 20 questions shows that the FastText method can deliver 4 relevant similar question out of 5 whereas the tfidf method only delivers 2 relevant similar question out of 3. A process is then developed to use the recommendations to tune the model to fulfil the problem requirements. SupportThe proposed solution is supported by an extensive Exploratory Data Analysis and recommendations for further improving the effectiveness of the system.", "link": "https://www.kaggle.com/rdhnw1/triage-recommender-with-cold-start", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["nltk", "gensim", "tensorflow", "sklearn", "vocabulary", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-23 18:55:11", "date_scraped": "2020-12-12 18:41:32", "words": 457, "sentences": 16, "sum_nltk": "SummaryThe problemThis Kernel is an entry into the CareerVillage.org (CV) Kaggle competition with the following objective: develop a method to recommend relevant questions to the professionals who are most likely to answer them.\nThe proposed solution should support the CV metric: A good recommender system should help us to reach a target of a high (95%?) percent of questions which get a 10-quality-point-answer within 24 hours, without churning the Pros, and within the bounds of fairness.\nThe triage question handler compares a new question with all the previously asked questions and puts the question into one of three categories:  When there are many good matches with similar previously answered questions, students should be given immediate feedback by displaying this list of similar questions.\nWhen there are very few or no good matches with similar previously answered questions the system can immediately flag this problem.\nSix of these are explored in detail:  tfidf questions bags of words similarity  Word2Vec  FastText  GloVe  Universal sentence encoder (USE)  tfidf professionals bag of words similarity   For the first 5 models, the 10 best matches are found for the last 100 questions in the data set that are answered.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.005, "sum_t5": "a method is proposed to recommend relevant questions to professionals. the system should help us to reach a target of a high (95%?) percent of questions which get a 10-quality-point-answer within 24 hours. a number of technologies are considered to drive the model. the proposed solution should support the CV metric. a number of technologies are considered to drive the model. a number of technologies are considered to drive the model.", "sum_t5_words": 71, "sum_t5_runtime": 6.197, "runtime": 0.005, "nltk_category": "Accommodation & Food", "nltk_category_score": 0.21309514343738556, "nltk_category_runtime": 17.328, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.6183896660804749, "nltk_subcategory_runtime": 27.554, "category": "Accommodation & Food", "category_score": 0.21309514343738556, "subcategory": "Student", "subcategory_score": 0.6183896660804749, "runtime_cat": 44.881, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.7", "language_code": "en", "language_score": "0.999998832910497", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "summarythe problemthis kernel entry careervillageorg cv kaggle competition following objective develop method recommend relevant question professional likely answer proposed solution support cv metric good recommender system help u reach target high 95 percent question get 10qualitypointanswer within 24 hour without churning pro within bound fairness proposed solutiona triage question handler proposed together set recommendation handle cold start problem method provides list suggested question professional visit cv site triage question handler compare new question previously asked question put question one three category many good match similar previously answered question student given immediate feedback displaying list similar question could asked question answered still want professional asked give old questionsanswers new life opportunity professional get regular feedback promote continued engagement fewer le good match similar previously answered question group question match still good enough find professional find student question relevant good match similar previously answered question system immediately flag problem ideally cv could recruit group engaged professional willing get involved answering difficult answer question case answer may require development dialogue would require extension current system number technology considered drive model six explored detail tfidf question bag word similarity word2vec fasttext glove universal sentence encoder use tfidf professional bag word similarity first 5 model 10 best match found last 100 question data set answered extensive subjective comparison show fasttext system suitable word2vec almost good subjective analysis last 20 question show fasttext method deliver 4 relevant similar question 5 whereas tfidf method delivers 2 relevant similar question 3 process developed use recommendation tune model fulfil problem requirement supportthe proposed solution supported extensive exploratory data analysis recommendation improving effectiveness system", "tags_descriptive": []}