{"title": "Baselines-To-Start-With(LB=0.56+)", "description": "Hi, Kagglers! Hereafter I will try to publish some basic approaches to climb up the Leaderboard Competition goal In this competition, Daimler is challenging Kagglers to tackle the curse of dimensionality and reduce the time that cars spend on the test bench. Competitors will work with a dataset representing different permutations of Mercedes-Benz car features to predict the time it takes to pass testing. Winning algorithms will contribute to speedier testing, resulting in lower carbon dioxide emissions without reducing Daimler’s standards. The Notebook adopts skeleton from (maybe?) this script: https://www.kaggle.com/ermolushka/starter-xgboost Stay tuned, this notebook will be updated on a regular basisP.s. Upvotes and comments would let me update it faster and in a more smart way :)", "link": "https://www.kaggle.com/frednavruzov/baselines-to-start-with-lb-0-56", "tags": ["Xgboost"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-06-03 12:27:21", "date_scraped": "2020-12-13 14:11:17", "words": 117, "sentences": 5, "runtime": 0.002, "description_category": "Manufacturing", "description_category_score": 0.08077560365200043, "description_category_runtime": 12.156, "description_subcategory": "Transportation", "description_subcategory_score": 0.23288960754871368, "description_subcategory_runtime": 18.97, "category": "Manufacturing", "category_score": 0.08077560365200043, "subcategory": "Transportation", "subcategory_score": 0.23288960754871368, "runtime_cat": 31.126, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.759", "language_code": "en", "language_score": "0.9999968191044906", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "hi kagglers hereafter try publish basic approach climb leaderboard competition goal competition daimler challenging kagglers tackle curse dimensionality reduce time car spend test bench competitor work dataset representing different permutation mercedesbenz car feature predict time take pas testing winning algorithm contribute speedier testing resulting lower carbon dioxide emission without reducing daimler standard notebook adopts skeleton maybe script httpswwwkagglecomermolushkastarterxgboost stay tuned notebook updated regular basisps upvotes comment would let update faster smart way", "tags_descriptive": ["Xgboost"]}