{"title": "DS4G: An analytical approach to NO2 emissions", "description": "(ignore this ⤴ warning about deleted datasets!) An Analytical Approach to NO2 EmissionsTL;DR: I take an analytical approach, measuring a line density of NO2 on windy days at each point and fitting a distribution function to this line. This function gives the emissions in kg/hr. I use night time lights satellite imagery as a proxy for human activity to separate power and non-power emissions and then use the generation at each site with this value to calculate an emissions factor in kg/MWh. OverviewWe need to calculate the emissions factor in kg/MWh (or some equivalent) averaged for one year of Puerto Rico's energy production. Bonus points if we can calculate sub-annual and marginal emissions factors. So we need to figure out the following system:  Puerto Rico's wind blows mainly from the east, so there won't be any pollution blown in. But the rest still need to be accounted for. This problem definitely seems to want an analytical approach (rather than statistics/machine learning) so I'm going to go with that (and check if it makes sense along the way). In addition, I'm going to keep the data sources as simple as possible! There are several places where I could improve the accuracy by including more data from Google Earth Engine and other sources, but as this is a demonstration of a method, I'm going to keep it simple. For example, as I'm going to focus on the troposphere as a whole, I should probably use several wind fields that apply to the whole troposphere, instead of just the GFS data near the ground. Emissions factorSimplifying from the EPA formula: EF = E / G where:  EF: emissions factor (kg/MWh) E: emissions (kg/hr) G: generation (MWh/hr)  So if I can determine the emissions that are attributable to electricity generation, and if I know the generation, then I can calculate the emissions factor! Quick explanation that may be useful: a plant's capacity, usually measured in MW (megawatts) is the maximum instantaneous power it can output, while it's generation, often in MWh (megawatt-hours) is the amount of energy actually produced in a given time period. If the plant runs at full capacity non-stop (i.e. capacity factor equals 100%) then the generation will be a simple multiple of capacity. Normally, however, plants produce much less, and have a capacity factor below 100%. It might be 30% for wind and solar, 50-60% for fossil fuels, and 80%+ for nuclear power.", "link": "https://www.kaggle.com/chrisarderne/ds4g-an-analytical-approach-to-no2-emissions", "tags": ["Geospatial Analysis", "Pollution"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-03-25 12:57:20", "date_scraped": "2020-12-12 19:11:13", "words": 406, "sentences": 15, "sum_nltk": "I use night time lights satellite imagery as a proxy for human activity to separate power and non-power emissions and then use the generation at each site with this value to calculate an emissions factor in kg/MWh. OverviewWe need to calculate the emissions factor in kg/MWh (or some equivalent) averaged for one year of Puerto Rico's energy production.\nSo we need to figure out the following system:  Puerto Rico's wind blows mainly from the east, so there won't be any pollution blown in.\nIn addition, I'm going to keep the data sources as simple as possible!\nThere are several places where I could improve the accuracy by including more data from Google Earth Engine and other sources, but as this is a demonstration of a method, I'm going to keep it simple.\nQuick explanation that may be useful: a plant's capacity, usually measured in MW (megawatts) is the maximum instantaneous power it can output, while it's generation, often in MWh (megawatt-hours) is the amount of energy actually produced in a given time period.\nIf the plant runs at full capacity non-stop (i.e. capacity factor equals 100%) then the generation will be a simple multiple of capacity.\nNormally, however, plants produce much less, and have a capacity factor below 100%.", "sum_nltk_words": 204, "sum_nltk_runtime": 0.004, "sum_t5": "a spokesman for the u.s. senate is considering a new method to calculate NO2 emissions. the method uses night time lights satellite imagery as a proxy for human activity. the method uses an emissions factor in kg/MWh averaged for one year of Puerto Rico's energy production. the method is based on a simple formula: 'emissions factor (kg/MWh)'. the method is a demonstration of a method, but it's going", "sum_t5_words": 68, "sum_t5_runtime": 7.025, "runtime": 0.007, "nltk_category": "Utilities", "nltk_category_score": 0.24405166506767273, "nltk_category_runtime": 18.646, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.5881097912788391, "nltk_subcategory_runtime": 29.771, "category": "Utilities", "category_score": 0.24405166506767273, "subcategory": "Physical", "subcategory_score": 0.5881097912788391, "runtime_cat": 48.417, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.656", "language_code": "en", "language_score": "0.9999972214966347", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "ignore warning deleted datasets analytical approach no2 emissionstldr take analytical approach measuring line density no2 windy day point fitting distribution function line function give emission kghr use night time light satellite imagery proxy human activity separate power nonpower emission use generation site value calculate emission factor kgmwh overviewwe need calculate emission factor kgmwh equivalent averaged one year puerto rico energy production bonus point calculate subannual marginal emission factor need figure following system puerto rico wind blow mainly east wont pollution blown rest still need accounted problem definitely seems want analytical approach rather statisticsmachine learning im going go check make sense along way addition im going keep data source simple possible several place could improve accuracy including data google earth engine source demonstration method im going keep simple example im going focus troposphere whole probably use several wind field apply whole troposphere instead gfs data near ground emission factorsimplifying epa formula ef e g ef emission factor kgmwh e emission kghr g generation mwhhr determine emission attributable electricity generation know generation calculate emission factor quick explanation may useful plant capacity usually measured mw megawatt maximum instantaneous power output generation often mwh megawatthours amount energy actually produced given time period plant run full capacity nonstop ie capacity factor equal 100 generation simple multiple capacity normally however plant produce much le capacity factor 100 might 30 wind solar 5060 fossil fuel 80 nuclear power", "tags_descriptive": ["Geospatial Analysis", "Pollution"]}