{"title": "Beginners Guide - EfficientNet With Keras ", "description": "In this kernel, we use efficientnet to complete the binary classification task. This kernel is especially helpful if you are making an introduction to computer vision and deep learning in general. In order to solve this challenge, the steps I take are the following:  Specify where the training and test folders are Visualize a few images to know what data we're dealing with Use Keras's ImageDataGenerator to augment the training data. If you haven't used this library before, or are new to data augmentation, take a look at this link: http://keras.io/preprocessing/image/ We use a pre-trained model called EfficientNet. You don't need to know how this works. We just feed the data to the model we obtain online, and it gives us a good accuracy. We finally make our predictions on the test images in the test zip file and format the submission.csv file to hold our own submissions!", "link": "https://www.kaggle.com/arjunrao2000/beginners-guide-efficientnet-with-keras", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-06-06 17:40:34", "date_scraped": "2020-12-12 16:10:46", "words": 149, "sentences": 7, "runtime": 0.005, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.11882323026657104, "description_category_runtime": 13.15, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9679417610168457, "description_subcategory_runtime": 20.929, "category": "Real Estate, Rental & Leasing", "category_score": 0.11882323026657104, "subcategory": "Machine Learning", "subcategory_score": 0.9679417610168457, "runtime_cat": 34.079, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.747", "language_code": "en", "language_score": "0.9999969225086014", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "kernel use efficientnet complete binary classification task kernel especially helpful making introduction computer vision deep learning general order solve challenge step take following specify training test folder visualize image know data dealing use kera imagedatagenerator augment training data havent used library new data augmentation take look link httpkerasiopreprocessingimage use pretrained model called efficientnet dont need know work feed data model obtain online give u good accuracy finally make prediction test image test zip file format submissioncsv file hold submission", "tags_descriptive": []}