{"title": "iWildCam basic EDA", "description": "General informationCamera Traps (or Wild Cams) enable the automatic collection of large quantities of image data. Biologists all over the world use camera traps to monitor biodiversity and population density of animal species As biologists try to expand the scope of these models from specific regions where they have collected training data to nearby areas they are faced with an interesting probem: how do you classify a species in a new region that you may not have seen in previous training data? In this challenge the training data and test data are from different regions, namely The American Southwest and the American Northwest. We have 23 classes for which we need to make a classification. Using external data is allowed.", "link": "https://www.kaggle.com/artgor/iwildcam-basic-eda", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "albumentations"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-03-26 05:35:15", "date_scraped": "2020-12-13 12:12:46", "words": 120, "sentences": 4, "runtime": 0.002, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.0718894749879837, "description_category_runtime": 10.029, "description_subcategory": "General", "description_subcategory_score": 0.801991879940033, "description_subcategory_runtime": 15.121, "category": "Biotechnological & Life Sciences", "category_score": 0.0718894749879837, "subcategory": "General", "subcategory_score": 0.801991879940033, "runtime_cat": 25.15, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.651", "language_code": "en", "language_score": "0.9999951759887578", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "general informationcamera trap wild cam enable automatic collection large quantity image data biologist world use camera trap monitor biodiversity population density animal specie biologist try expand scope model specific region collected training data nearby area faced interesting probem classify specie new region may seen previous training data challenge training data test data different region namely american southwest american northwest 23 class need make classification using external data allowed", "tags_descriptive": ["Exploratory Data Analysis"]}