{"title": "Q&A with Only Pictures!", "description": "Q&A with Only Pictuers! (RSNA Pneumonia Detection Challenge)This kernel poses and answers questions about the dataset using images! Questions Are the classes imbalanced? How many cases are there per image? Where is Pneumonia located? What is the age distribution by gender and target? What are the areas of the bounding boxes by gender? How is the pixel spacing distributed? How are the bounding box areas distributed by the number of boxes? Where are the outliers? What does the outliers look like? Are there images with mostly black pixels? What does the mostly black pixels look like? What does the mostly white pixel images look like? Can tradiational image processing find a bounding box around the cropped images? Can the bounding boxes be resized when cropping and resizing the cropped images? How are the bounding box aspect ratios distributed? What does the images with a high aspect ratio look like? Is there a relationship between the bounding box's aspect ratio and area?  More questions to come! ", "link": "https://www.kaggle.com/thomasjpfan/q-a-with-only-pictures", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-09-02 01:30:41", "date_scraped": "2020-12-13 16:48:20", "words": 167, "sentences": 1, "runtime": 0.004, "description_category": "Healthcare", "description_category_score": 0.09734544903039932, "description_category_runtime": 14.768, "description_subcategory": "Student", "description_subcategory_score": 0.2431776225566864, "description_subcategory_runtime": 23.445, "category": "Healthcare", "category_score": 0.09734544903039932, "subcategory": "Student", "subcategory_score": 0.2431776225566864, "runtime_cat": 38.213, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.723", "language_code": "en", "language_score": "0.9999957261598326", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "qa pictuers rsna pneumonia detection challengethis kernel pose answer question dataset using image question class imbalanced many case per image pneumonia located age distribution gender target area bounding box gender pixel spacing distributed bounding box area distributed number box outlier outlier look like image mostly black pixel mostly black pixel look like mostly white pixel image look like tradiational image processing find bounding box around cropped image bounding box resized cropping resizing cropped image bounding box aspect ratio distributed image high aspect ratio look like relationship bounding box aspect ratio area question come", "tags_descriptive": []}