{"title": "LearnDataScience Presentation, LGBM LB=0.836", "description": "Freesound Kaggle PresentationMatt PotmaMay 3, 2018This notebook has been written for a presentation happening at approximately 6:30pm PDT today, May 3rd. A link to the livestream will be posted here shortly before it begins, so anyone can view it. Without watching the presentation, and even with, the flow of the notebook may be a bit awkward, but the presentation will be left up on YouTube to be viewed at any time. At some point, I may edit this notebook to provide more context, but will be left as-is for now. Unfortunately, despite the notebook running from scratch on my laptop in about 2 hours, trying to Commit & Run the notebook ran out of time. I've added two flags at the beginning of the second code cell, cache and run_full_notebook. Both are set to False in this notebook, hoping that it can fully execute on this kernel. The cache flag saves intermediate results and calculates spectral features on audio files with silence trimmed off, and run_full_notebook trains a couple of extra LGBM models. By setting both of those flags to True and running the notebook locally, the last submission file is good for 0.836 on the Public Leaderboard, with lots that can be improved upon. A link to my presentation where I go through this notebook can be seen here https://www.youtube.com/watch?v=3CtPuwok7Nw", "link": "https://www.kaggle.com/mpotma/learndatascience-presentation-lgbm-lb-0-836", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-05-05 18:12:04", "date_scraped": "2020-12-12 20:04:19", "words": 221, "sentences": 10, "sum_nltk": "Freesound Kaggle PresentationMatt PotmaMay 3, 2018This notebook has been written for a presentation happening at approximately 6:30pm PDT today, May 3rd.\nA link to the livestream will be posted here shortly before it begins, so anyone can view it.\nWithout watching the presentation, and even with, the flow of the notebook may be a bit awkward, but the presentation will be left up on YouTube to be viewed at any time.\nAt some point, I may edit this notebook to provide more context, but will be left as-is for now.\nI've added two flags at the beginning of the second code cell, cache and run_full_notebook.\nBoth are set to False in this notebook, hoping that it can fully execute on this kernel.\nThe cache flag saves intermediate results and calculates spectral features on audio files with silence trimmed off, and run_full_notebook trains a couple of extra LGBM models.\nBy setting both of those flags to True and running the notebook locally, the last submission file is good for 0.836 on the Public Leaderboard, with lots that can be improved upon.\nA link to my presentation where I go through this notebook can be seen here https://www.youtube.com/watch?v=3CtPuwok7Nw", "sum_nltk_words": 188, "sum_nltk_runtime": 0.003, "sum_t5": "a notebook has been written for a presentation happening at approximately 6:30pm PDT today, may 3rd. despite the notebook running from scratch on my laptop in about 2 hours, trying to Commit & Run the notebook ran out of time. despite the notebook running from scratch on my laptop in about 2 hours, trying to Commit & Run the notebook ran out of time. a link to the livestream will be posted here shortly before it begins.", "sum_t5_words": 77, "sum_t5_runtime": 4.731, "runtime": 0.003, "nltk_category": "Finance", "nltk_category_score": 0.11324569582939148, "nltk_category_runtime": 18.871, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.24743255972862244, "nltk_subcategory_runtime": 30.762, "category": "Finance", "category_score": 0.11324569582939148, "subcategory": "Machine Learning", "subcategory_score": 0.24743255972862244, "runtime_cat": 49.633, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.674", "language_code": "en", "language_score": "0.9999968406246231", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "freesound kaggle presentationmatt potmamay 3 2018this notebook written presentation happening approximately 630pm pdt today may 3rd link livestream posted shortly begin anyone view without watching presentation even flow notebook may bit awkward presentation left youtube viewed time point may edit notebook provide context left asis unfortunately despite notebook running scratch laptop 2 hour trying commit run notebook ran time ive added two flag beginning second code cell cache run_full_notebook set false notebook hoping fully execute kernel cache flag save intermediate result calculates spectral feature audio file silence trimmed run_full_notebook train couple extra lgbm model setting flag true running notebook locally last submission file good 0836 public leaderboard lot improved upon link presentation go notebook seen httpswwwyoutubecomwatchv3ctpuwok7nw", "tags_descriptive": []}