{"title": "A complete ML pipeline (Fast.ai)", "description": "Sections of this kernel  Project understanding Data understanding Data visualization Baseline model (Fastai v1) Validation and analysis Metrics Prediction and activation visualizations ROC & AUC   Submit Deploy (example)    Section: Data visualization Section: Prediction and activation visualizations           Project understandingWhat exactly is the problem?Binary image classification problem. Identify the presence of metastases from 96 x 96px digital histopathology images. One key challenge is that the metastases can be as small as single cells in a large area of tissue. How would a solution look like?Our evaluation metric is area under the ROC curve. The ROC curve is a plot of True positive rate against False positive rate at various thresholds and the area under the curve (AUC) is equal to the probability that a classifier will rank a randomly chosen positive instance higher than a randomly chosen negative one. The best possible solution would yield an AUC of 1 which means we would classify all positive samples correctly without getting any false positives.   ROC curve from a previous run of this kernel What is known about the domain?The histopathological images are glass slide microscope images of lymph nodes that are stained with hematoxylin and eosin (H&E). This staining method is one of the most widely used in medical diagnosis and it produces blue, violet and red colors. Dark blue hematoxylin binds to negatively charged substances such as nucleic acids and pink eosin to positively charged substances like amino-acid side chains (most proteins). Typically nuclei are stained blue, whereas cytoplasm and extracellular parts in various shades of pink.   Low-resolution Mid-resolution High-resolution             Example of a metastatic region in lymph nodes, CHAMELYON17  Lymph nodes are small glands that filter the fluid in the lymphatic system and they are the first place a breast cancer is likely to spread. Histological assessment of lymph node metastases is part of determining the stage of breast cancer in TNM classification which is a globally recognized standard for classifying the extent of spread of cancer. The diagnostic procedure for pathologists is tedious and time-consuming as a large area of tissue has to be examined and small metastases can be easily missed. Useful links for background knowledge  Patch Camelyon (PCam) Hematoxylin and eosin staining of tissue and cell sections H&E-stained sentinel lymph node sections of breast cancer patients: the CAMELYON dataset CAMELYON16 - background CAMELYON17 - background TNM classification", "link": "https://www.kaggle.com/qitvision/a-complete-ml-pipeline-fast-ai", "tags": ["CV"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-03-06 10:29:34", "date_scraped": "2020-12-12 20:43:30", "words": 422, "sentences": 14, "sum_nltk": "Sections of this kernel  Project understanding Data understanding Data visualization Baseline model (Fastai v1) Validation and analysis Metrics Prediction and activation visualizations ROC & AUC   Submit Deploy (example)    Section: Data visualization Section: Prediction and activation visualizations           Project understandingWhat exactly is the problem?Binary image classification problem.\nThe ROC curve is a plot of True positive rate against False positive rate at various thresholds and the area under the curve (AUC) is equal to the probability that a classifier will rank a randomly chosen positive instance higher than a randomly chosen negative one.\nROC curve from a previous run of this kernel What is known about the domain?The histopathological images are glass slide microscope images of lymph nodes that are stained with hematoxylin and eosin (H&E).\nDark blue hematoxylin binds to negatively charged substances such as nucleic acids and pink eosin to positively charged substances like amino-acid side chains (most proteins).\nHistological assessment of lymph node metastases is part of determining the stage of breast cancer in TNM classification which is a globally recognized standard for classifying the extent of spread of cancer.\nUseful links for background knowledge  Patch Camelyon (PCam) Hematoxylin and eosin staining of tissue and cell sections H&E-stained sentinel lymph node sections of breast cancer patients: the CAMELYON dataset CAMELYON16 - background CAMELYON17 - background TNM classification", "sum_nltk_words": 230, "sum_nltk_runtime": 0.005, "sum_t5": "a key challenge is that metastases can be as small as single cells in a large area of tissue. the best possible solution would yield an AUC of 1. a ROC curve is a plot of True positive rate against False positive rate. a ROC curve is equal to the probability that a classifier will rank a positive instance higher than a negative one. a ROC curve is a plot of true positive rate against False positive rate.", "sum_t5_words": 78, "sum_t5_runtime": 6.742, "runtime": 0.005, "nltk_category": "Healthcare", "nltk_category_score": 0.28967931866645813, "nltk_category_runtime": 22.314, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.46384522318840027, "nltk_subcategory_runtime": 36.076, "category": "Healthcare", "category_score": 0.28967931866645813, "subcategory": "Machine Learning", "subcategory_score": 0.46384522318840027, "runtime_cat": 58.391, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.809", "language_code": "en", "language_score": "0.9999969988917775", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "section kernel project understanding data understanding data visualization baseline model fastai v1 validation analysis metric prediction activation visualization roc auc submit deploy example section data visualization section prediction activation visualization project understandingwhat exactly problembinary image classification problem identify presence metastasis 96 x 96px digital histopathology image one key challenge metastasis small single cell large area tissue would solution look likeour evaluation metric area roc curve roc curve plot true positive rate false positive rate various threshold area curve auc equal probability classifier rank randomly chosen positive instance higher randomly chosen negative one best possible solution would yield auc 1 mean would classify positive sample correctly without getting false positive roc curve previous run kernel known domainthe histopathological image glass slide microscope image lymph node stained hematoxylin eosin staining method one widely used medical diagnosis produce blue violet red color dark blue hematoxylin bind negatively charged substance nucleic acid pink eosin positively charged substance like aminoacid side chain protein typically nucleus stained blue whereas cytoplasm extracellular part various shade pink lowresolution midresolution highresolution example metastatic region lymph node chamelyon17 lymph node small gland filter fluid lymphatic system first place breast cancer likely spread histological assessment lymph node metastasis part determining stage breast cancer tnm classification globally recognized standard classifying extent spread cancer diagnostic procedure pathologist tedious timeconsuming large area tissue examined small metastasis easily missed useful link background knowledge patch camelyon pcam hematoxylin eosin staining tissue cell section hestained sentinel lymph node section breast cancer patient camelyon dataset camelyon16 background camelyon17 background tnm classification", "tags_descriptive": ["Computer Vision (CV)"]}