{"title": "Fraud complete EDA", "description": "IEEE Fraud Detection    Why fraud detection? Fraud is a billion-dollar business and it is increasing every year. The PwC global economic crime survey of 2018[1] found that half (49 percent) of the 7,200 companies they surveyed had experienced fraud of some kind. This is an increase from the PwC 2016 study in which slightly more than a third of organizations surveyed (36%) had experienced economic crime.  This competition is a binary classification problem - i.e. our target variable is a binary attribute (Is the user making the click fraudlent or not?) and our goal is to classify users into \"fraudlent\" or \"not fraudlent\" as well as possible. Unlike metrics such as LogLoss, the AUC score only depends on how well you well you can separate the two classes. In practice, this means that only the order of your predictions matter, as a result of this, any rescaling done to your model's output probabilities will have no effect on your score. click here to read more about AUC-ROC  Content Data exploration Missing Data. Imbalanced problem.   Plots Distribution plots Count plots Unique values Groups     Memory reduction  PCA    Models XGBoost Model. LGBM    Remember the upvote button is next to the fork button, and it's free too! ;)  References: https://www.kaggle.com/artgor/eda-and-models/data https://www.kaggle.com/artkulak/ieee-fraud-simple-baseline-0-9383-lb https://www.kaggle.com/robikscube/ieee-fraud-detection-first-look-and-eda https://www.kaggle.com/mjbahmani/reducing-memory-size-for-ieee", "link": "https://www.kaggle.com/jesucristo/fraud-complete-eda", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost", "lightgbm", "sklearn", "pattern", "catboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-18 09:27:34", "date_scraped": "2020-12-12 21:40:27", "words": 228, "sentences": 11, "sum_nltk": "IEEE Fraud Detection    Why fraud detection?\nFraud is a billion-dollar business and it is increasing every year.\nThe PwC global economic crime survey of 2018[1] found that half (49 percent) of the 7,200 companies they surveyed had experienced fraud of some kind.\nThis is an increase from the PwC 2016 study in which slightly more than a third of organizations surveyed (36%) had experienced economic crime.\nThis competition is a binary classification problem - i.e. our target variable is a binary attribute (Is the user making the click fraudlent or not?) and our goal is to classify users into \"fraudlent\" or \"not fraudlent\" as well as possible.\nUnlike metrics such as LogLoss, the AUC score only depends on how well you well you can separate the two classes.\nIn practice, this means that only the order of your predictions matter, as a result of this, any rescaling done to your model's output probabilities will have no effect on your score.\nclick here to read more about AUC-ROC  Content Data exploration Missing Data.\nImbalanced problem.\nPlots Distribution plots Count plots Unique values Groups     Memory reduction  PCA    Models XGBoost Model.\n;)  References: https://www.kaggle.com/artgor/eda-and-models/data https://www.kaggle.com/artkulak/ieee-fraud-simple-baseline-0-9383-lb https://www.kaggle.com/robikscube/ieee-fraud-detection-first-look-and-eda https://www.kaggle.com/mjbahmani/reducing-memory-size-for-ieee", "sum_nltk_words": 197, "sum_nltk_runtime": 0.002, "sum_t5": "half (49 percent) of the 7,200 companies surveyed had experienced fraud of some kind. this is an increase from the 2016 study in which slightly more than a third of organizations had experienced economic crime. the AUC score only depends on how well you can separate the two classes. the upvote button is next to the fork button, and it's free too!. ieee fraud detection is a billion-dollar business.", "sum_t5_words": 69, "sum_t5_runtime": 5.907, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.3765937387943268, "nltk_category_runtime": 27.147, "nltk_subcategory": "Fraud", "nltk_subcategory_score": 0.8237088918685913, "nltk_subcategory_runtime": 43.714, "category": "Finance", "category_score": 0.3765937387943268, "subcategory": "Fraud", "subcategory_score": 0.8237088918685913, "runtime_cat": 70.861, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.789", "language_code": "en", "language_score": "0.99999630005824", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "ieee fraud detection fraud detection fraud billiondollar business increasing every year pwc global economic crime survey 20181 found half 49 percent 7200 company surveyed experienced fraud kind increase pwc 2016 study slightly third organization surveyed 36 experienced economic crime competition binary classification problem ie target variable binary attribute user making click fraudlent goal classify user fraudlent fraudlent well possible unlike metric logloss auc score depends well well separate two class practice mean order prediction matter result rescaling done model output probability effect score click read aucroc content data exploration missing data imbalanced problem plot distribution plot count plot unique value group memory reduction pca model xgboost model lgbm remember upvote button next fork button free reference httpswwwkagglecomartgoredaandmodelsdata httpswwwkagglecomartkulakieeefraudsimplebaseline09383lb httpswwwkagglecomrobikscubeieeefrauddetectionfirstlookandeda httpswwwkagglecommjbahmanireducingmemorysizeforieee", "tags_descriptive": ["Exploratory Data Analysis"]}