{"title": "Download 500 tar Training dataset", "description": "Lots of folks confused on the Train dataset - several, including me trying to download the images using one of the offered scripts.  That's not how we get the train images. There are 500 seperate tar compressed files.  This script downloads and saves the tar files to a local drive.  Will work tomorrow on script to uncompress.   I am 6 month newbie in Python - so use with care:) DOWN LOAD THIS NOTEBOOK AND RUN ON YOUR LOCAL PC.   Since the script is written for local machine only it's filled with error messages here on Kaggle as I can seem to save a clean version without commit - which of course runs the script and generates errors. I had lots of starts and stops but guessing 6 hours total time with my 1GB internet connection.", "link": "https://www.kaggle.com/pcjimmmy/download-500-tar-training-dataset", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-10 03:59:10", "date_scraped": "2020-12-13 12:41:49", "words": 142, "sentences": 8, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.13328297436237335, "description_category_runtime": 11.735, "description_subcategory": "Failure", "description_subcategory_score": 0.4527519643306732, "description_subcategory_runtime": 18.364, "category": "Utilities", "category_score": 0.13328297436237335, "subcategory": "Failure", "subcategory_score": 0.4527519643306732, "runtime_cat": 30.099, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.722", "language_code": "en", "language_score": "0.9999968928031693", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "lot folk confused train dataset several including trying download image using one offered script thats get train image 500 seperate tar compressed file script downloads save tar file local drive work tomorrow script uncompress 6 month newbie python use care load notebook run local pc since script written local machine filled error message kaggle seem save clean version without commit course run script generates error lot start stop guessing 6 hour total time 1gb internet connection", "tags_descriptive": []}