{"title": "DogBreedIdentification", "description": "End to End Dog Breed Multi Class ClassificationThis notebook is written in tensorflow 2.0 and tensorhub 1.ProblemThere are 120 breeds of dog in the data. We have to identify according to their breeds. 2.DataThere are training set and a test set of images of dogs. Each image has a filename that is its unique id. The dataset comprises 120 breeds of dogs.  train.zip - the training set, you are provided the breed for these dogs test.zip - the test set, you must predict the probability of each breed for each image sample_submission.csv - a sample submission file in the correct format labels.csv - the breeds for the images in the train set  EvaluationPredicting the probability of each breed in test data. Features we are dealing with the unstructure data set. There are about 10000+ images in the training data. There are about 10000+ images in the test data.  Now Since we have unstructured data we have to work with the library like tensorflow. so lets import the necessary libraries and directly jump into the project", "link": "https://www.kaggle.com/nirajpoudel/dogbreedidentification", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-28 05:49:14", "date_scraped": "2020-12-12 18:55:48", "words": 178, "sentences": 11, "runtime": 0.003, "description_category": "Education & Research", "description_category_score": 0.40866512060165405, "description_category_runtime": 15.123, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8830242156982422, "description_subcategory_runtime": 24.6, "category": "Education & Research", "category_score": 0.40866512060165405, "subcategory": "Machine Learning", "subcategory_score": 0.8830242156982422, "runtime_cat": 39.724, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.647", "language_code": "en", "language_score": "0.9999955492538374", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "end end dog breed multi class classificationthis notebook written tensorflow 20 tensorhub 1problemthere 120 breed dog data identify according breed 2datathere training set test set image dog image filename unique id dataset comprises 120 breed dog trainzip training set provided breed dog testzip test set must predict probability breed image sample_submissioncsv sample submission file correct format labelscsv breed image train set evaluationpredicting probability breed test data feature dealing unstructure data set 10000 image training data 10000 image test data since unstructured data work library like tensorflow let import necessary library directly jump project", "tags_descriptive": []}