{"title": "EDA and models", "description": "General informationIn this kernel I work with IEEE Fraud Detection competition. EEE-CIS works across a variety of AI and machine learning areas, including deep neural networks, fuzzy systems, evolutionary computation, and swarm intelligence. Today they’re partnering with the world’s leading payment service company, Vesta Corporation, seeking the best solutions for fraud prevention industry, and now you are invited to join the challenge. We have a binary classification problem with a heavy imbalance which is an inherent property of such problems. At first I'll explore the data and try to find valuable insights, maybe I'll do some feature engineering and then it wil be time to build models.  Work in progress", "link": "https://www.kaggle.com/artgor/eda-and-models", "tags": ["Classification", "Exploratory Data Analysis", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "catboost", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-03 04:24:55", "date_scraped": "2020-12-12 21:40:27", "words": 111, "sentences": 6, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.10636445134878159, "description_category_runtime": 10.0, "description_subcategory": "General", "description_subcategory_score": 0.9879414439201355, "description_subcategory_runtime": 15.545, "category": "Education & Research", "category_score": 0.10636445134878159, "subcategory": "General", "subcategory_score": 0.9879414439201355, "runtime_cat": 25.545, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.823", "language_code": "en", "language_score": "0.9999973217077662", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "general informationin kernel work ieee fraud detection competition eeecis work across variety ai machine learning area including deep neural network fuzzy system evolutionary computation swarm intelligence today theyre partnering world leading payment service company vesta corporation seeking best solution fraud prevention industry invited join challenge binary classification problem heavy imbalance inherent property problem first ill explore data try find valuable insight maybe ill feature engineering wil time build model work progress", "tags_descriptive": ["Classification", "Exploratory Data Analysis", "Feature Engineering"]}