{"title": "Keras Landmark or Non-Landmark identification", "description": "In this competition it is not only important to predict the landmark for an image but also to make sure that if an image is not a landmark that we don't make a prediction. Correctly identifying non-landmark images in the test set will increase the score of a submission.  Removing as much of the non-landmark images from the training set will decrease the total amount of images that we need to train on and it will improve the 'correctness' of the model if it is trained on the landmark images and not on all the selfies, hotel-rooms and beds etcetera that were made near the landmark. A good way to start the identification is to use the Places365 dataset and models as described on this webpage. I've created a small dataset of 50 images selected from the 4+ million in the trainset to show how it could be done. In the Places365 dataset there 365 classes and each class is also marked as either 'indoor' or 'outdoor'. We could interpret this also as 'non-landmark' or 'landmark'. It could be further optimized offcourse...an image of the inside of a castle will be marked as 'indoor' but will very likely be a legitimate 'landmark'. Just by using the default 'indoor/outdoor' marker and determining it for both train and test data I was able to improve my best model so far with about 0.015 - 0.02 score on the leaderboard.", "link": "https://www.kaggle.com/rsmits/keras-landmark-or-non-landmark-identification", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-05-03 21:57:48", "date_scraped": "2020-12-13 12:41:49", "words": 238, "sentences": 9, "sum_nltk": "Correctly identifying non-landmark images in the test set will increase the score of a submission.\nRemoving as much of the non-landmark images from the training set will decrease the total amount of images that we need to train on and it will improve the 'correctness' of the model if it is trained on the landmark images and not on all the selfies, hotel-rooms and beds etcetera that were made near the landmark.\nA good way to start the identification is to use the Places365 dataset and models as described on this webpage.\nI've created a small dataset of 50 images selected from the 4+ million in the trainset to show how it could be done.\nIn the Places365 dataset there 365 classes and each class is also marked as either 'indoor' or 'outdoor'.\nWe could interpret this also as 'non-landmark' or 'landmark'.\nIt could be further optimized offcourse...an image of the inside of a castle will be marked as 'indoor' but will very likely be a legitimate 'landmark'.\nJust by using the default 'indoor/outdoor' marker and determining it for both train and test data I was able to improve my best model so far with about 0.015 - 0.02 score on the leaderboard.", "sum_nltk_words": 196, "sum_nltk_runtime": 0.003, "sum_t5": "correctly identifying non-landmark images in the test set will increase the score of a submission. removing as much of the non-landmark images from the training set will decrease the total amount of images that we need to train on. a small dataset of 50 images selected from the 4+ million in the trainset to show how it could be done. a castle image will be marked as 'indoor' but will very likely be a legitimate 'landmark'", "sum_t5_words": 76, "sum_t5_runtime": 6.025, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.4359247386455536, "nltk_category_runtime": 18.468, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8544321656227112, "nltk_subcategory_runtime": 29.516, "category": "Finance", "category_score": 0.4359247386455536, "subcategory": "Machine Learning", "subcategory_score": 0.8544321656227112, "runtime_cat": 47.984, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.735", "language_code": "en", "language_score": "0.9999980663785808", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "competition important predict landmark image also make sure image landmark dont make prediction correctly identifying nonlandmark image test set increase score submission removing much nonlandmark image training set decrease total amount image need train improve correctness model trained landmark image selfies hotelrooms bed etcetera made near landmark good way start identification use places365 dataset model described webpage ive created small dataset 50 image selected 4 million trainset show could done places365 dataset 365 class class also marked either indoor outdoor could interpret also nonlandmark landmark could optimized offcoursean image inside castle marked indoor likely legitimate landmark using default indooroutdoor marker determining train test data able improve best model far 0015 002 score leaderboard", "tags_descriptive": []}