{"title": "We´re all Kaggle users!", "description": "Since I'm surrounded by so many gifted and helpful people I couldn't present any conventional, generic Kaggle Notebook because everybody knows that I can't code. Besides, all works that I've already seen are great.Then I decided to answer the questions in a way that I couldn't do in the Survey.  Age, gender, country, level education, title, company's size doesn't matter, only coding. How much money spent on ML: I'm retired, just enjoying life while I can. I spent time but I gained Knowledge. Programming language: Python since I can't pretend to code with R. TPU: I barely used GPU in DL micro-course. Years using ML: Are you kidding? In fact, I do Machine Unlearning. NLP: The 1st time I read this I thought that it was about Neuro-linguist Programming and Bert was a character from Sesame street.  Cloud computing: only in my user name (wolke=cloud). Big data, I'd rather stay with just data. In fact, that are a lot of questions that I could answer:\"does not apply to me\". I'm not a bot, but my inseparable team mate is. I'd like to ask: Who is the father of the Bot? He rules my world.", "link": "https://www.kaggle.com/mpwolke/we-re-all-kaggle-users", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-11-14 13:46:07", "date_scraped": "2020-12-13 12:25:10", "words": 196, "sentences": 14, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.2776409387588501, "description_category_runtime": 18.473, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.6333752870559692, "description_subcategory_runtime": 29.597, "category": "Education & Research", "category_score": 0.2776409387588501, "subcategory": "Machine Learning", "subcategory_score": 0.6333752870559692, "runtime_cat": 48.071, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.615", "language_code": "en", "language_score": "0.999995693158329", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "since im surrounded many gifted helpful people couldnt present conventional generic kaggle notebook everybody know cant code besides work ive already seen greatthen decided answer question way couldnt survey age gender country level education title company size doesnt matter coding much money spent ml im retired enjoying life spent time gained knowledge programming language python since cant pretend code r tpu barely used gpu dl microcourse year using ml kidding fact machine unlearning nlp 1st time read thought neurolinguist programming bert character sesame street cloud computing user name wolkecloud big data id rather stay data fact lot question could answerdoes apply im bot inseparable team mate id like ask father bot rule world", "tags_descriptive": []}