{"title": "On Markov Chains and the Competition Data", "description": "IMPORTANT EDIT: A basic assumption in this notebook is wrong: the signal data is not the result of a first-order Markov process. In fact, the open_channel data itself is the result of a first-order Markov process. Therefore, the situation is more complicated than described here. Still, most of the arguments remain relevant. I've explained more here. This notebook analyzes and visualizes the training data and demonstrates that the signal data is indeed the result of a simple Markov process (however, a hidden one) combined with Gaussian (white) noise. This puts a strong upper limit on what a model can achieve in this competition.", "link": "https://www.kaggle.com/friedchips/on-markov-chains-and-the-competition-data", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-02 19:42:41", "date_scraped": "2020-12-13 13:17:30", "words": 103, "sentences": 7, "runtime": 0.001, "description_category": "Utilities", "description_category_score": 0.20750944316387177, "description_category_runtime": 10.151, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.4304312765598297, "description_subcategory_runtime": 15.427, "category": "Utilities", "category_score": 0.20750944316387177, "subcategory": "Machine Learning", "subcategory_score": 0.4304312765598297, "runtime_cat": 25.579, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.716", "language_code": "en", "language_score": "0.9999984533973023", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "important edit basic assumption notebook wrong signal data result firstorder markov process fact open_channel data result firstorder markov process therefore situation complicated described still argument remain relevant ive explained notebook analyzes visualizes training data demonstrates signal data indeed result simple markov process however hidden one combined gaussian white noise put strong upper limit model achieve competition", "tags_descriptive": []}