{"title": "One Cycle Policy with Keras", "description": "One Cycle Policy with KerasHighly inspired by following paper:  A disciplined approach to neural network hyper-parameters: Part 1 -- learning rate, batch size, momentum, and weight decay (Leslie N. Smith)  I have implemented the One Cycle Policy algorithm developed by Leslie N. Smith into the Keras Callback class. Leslie Smith suggests in this paper a slight modification of cyclical learning rate policy for super convergence using one cycle that is smaller than the total number of iterations/epochs and allow the learning rate todecrease several orders of magnitude less than the initial learning rate for the remaining miterations. In his experiments this policy allows the accuracy to plateau before the training ends. This approach (among others) helped me to improve my score.", "link": "https://www.kaggle.com/robotdreams/one-cycle-policy-with-keras", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-03-29 14:41:01", "date_scraped": "2020-12-12 20:43:30", "words": 123, "sentences": 6, "runtime": 0.005, "description_category": "Finance", "description_category_score": 0.3205535113811493, "description_category_runtime": 11.349, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8660709261894226, "description_subcategory_runtime": 17.433, "category": "Finance", "category_score": 0.3205535113811493, "subcategory": "Machine Learning", "subcategory_score": 0.8660709261894226, "runtime_cat": 28.784, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.728", "language_code": "en", "language_score": "0.9999954490829484", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "one cycle policy kerashighly inspired following paper disciplined approach neural network hyperparameters part 1 learning rate batch size momentum weight decay leslie n smith implemented one cycle policy algorithm developed leslie n smith kera callback class leslie smith suggests paper slight modification cyclical learning rate policy super convergence using one cycle smaller total number iterationsepochs allow learning rate todecrease several order magnitude le initial learning rate remaining miterations experiment policy allows accuracy plateau training end approach among others helped improve score", "tags_descriptive": []}