{"title": "LightFM Hybrid Recommendation system", "description": "IntroductionNotebook Overview: This notebook contains a solution for Career village recommendation system competition. In this notebook, I build a hybrid recommendation system for recommending students questions to professionals for CareerVillage.org. The recommender system works by matching professionals with questions by tags they follow, their previous answers' question tags and similar tags. Also, it overcomes some of the most highest rated problem for CareerVillage recommender system like cold-start and others. Competition problem statements: CareerVillage.org is a non-profit organization helping underserved youth to provide information to build their career. Students can ask their questions in the CareerVillage.org and professionals(expert people who love to help students) answer their questions. The challenge is that CareerVillage has to recommend correct questions to the professionals so that the questions match with the professional's interests. This will increase the likelihood of a question to get an answer. So in this competition, we have to make a recommendation system that will correctly recommend questions that will match with professionals interest.", "link": "https://www.kaggle.com/niyamatalmass/lightfm-hybrid-recommendation-system", "tags": ["Recommender"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-23 22:03:27", "date_scraped": "2020-12-12 18:41:32", "words": 162, "sentences": 9, "runtime": 0.002, "description_category": "Construction & Engineering", "description_category_score": 0.5908536911010742, "description_category_runtime": 14.345, "description_subcategory": "Quality", "description_subcategory_score": 0.7918175458908081, "description_subcategory_runtime": 22.789, "category": "Construction & Engineering", "category_score": 0.5908536911010742, "subcategory": "Quality", "subcategory_score": 0.7918175458908081, "runtime_cat": 37.135, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.775", "language_code": "en", "language_score": "0.9999962358424066", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionnotebook overview notebook contains solution career village recommendation system competition notebook build hybrid recommendation system recommending student question professional careervillageorg recommender system work matching professional question tag follow previous answer question tag similar tag also overcomes highest rated problem careervillage recommender system like coldstart others competition problem statement careervillageorg nonprofit organization helping underserved youth provide information build career student ask question careervillageorg professionalsexpert people love help student answer question challenge careervillage recommend correct question professional question match professional interest increase likelihood question get answer competition make recommendation system correctly recommend question match professional interest", "tags_descriptive": ["Recommender"]}