{"title": "DS4G: where does the NO2 come from?", "description": "The goal of this challenge is to:Develop a methodology to calculate an average historical emissions factor of electricity generated for a sub-national region, using remote sensing data and techniques.  1. What is a emission factor (EF)?In short, is a number that converts human activities to amount of pollutant released due to that activity. In this challenge, the focus is on trying to relate energy produced with NO22 released: NO22 = EF * Energy_created - Other_Factors The exact units of EF depend on the units of the NO22 and the energy used. I'll use EF in   1033 kg NO22/electrical generating megawatts /year. 2. Why is is hard to measure and how could it be easier?From the challenge description says: Current emissions factors methodologies are based on time-consuming data collection and may include errors derived from a lack of access to granular datasets, inability to refresh data on a frequent basis, overly general modeling assumptions, and inaccurate reporting of emissions sources like fuel consumption.  If we could use satelitte images, particularly of some pollutants, and 'trace them back' to what produced them (for example a power plant), then we could have a handy measurement of the emission factors, for some properties of the power plant (fuel type, energy capacity). 3. Summary of this analysisHere I'm using the satelite images of NO22 column density and 'distribute' that NO22 amongst the power plants of Puerto Rico, using a (rather naive) assumption that the closest a pixel is of a power plant, the more the NO22 on that pixel should have been produced by that power plant, but some of it might have still be produced by some closer by power plant. More on this lower down. I'll also add some other data sets privided in the challenge, that should try to account for either other sources of NO22 production (such as people travelling around) or the fact that the NO22 may move around due to winds, rain, etc. Although the actual electricity produced by a power plant should be a more precise way of measuring the EF, I'll use the electrical generating capacity in megawatts in the provided data set, that is more easily available. I'll also focus on power plants that use Oil as their primary fuel, although in principle I could have used the same analysis for other kinds of power plants. When calculating the EF, I'll use a Hierarchical Bayesian simple model, which has the advatage of using all the data of all Oil power plants to calculate an yearly average EF for these power plants, while still accounting for the fact that each oil power plant will have a slightly different EF due to other properties (year of construction, average use) that may even not be known. 4. Outlook1. Power Plants 2. Satelite data 3. Splitting NO22 between (overlapping) the power plants 4. EF calculation: Bayesian approach", "link": "https://www.kaggle.com/vpatricio/ds4g-where-does-the-no2-come-from", "tags": ["Exploratory Data Analysis", "Geospatial Analysis", "Environment"], "kind": ["Project", "(Notebook)"], "ml_libs": ["theano", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-03-24 12:56:04", "date_scraped": "2020-12-12 19:11:13", "words": 481, "sentences": 21, "sum_nltk": "The goal of this challenge is to:Develop a methodology to calculate an average historical emissions factor of electricity generated for a sub-national region, using remote sensing data and techniques.\n2. Why is is hard to measure and how could it be easier?From the challenge description says: Current emissions factors methodologies are based on time-consuming data collection and may include errors derived from a lack of access to granular datasets, inability to refresh data on a frequent basis, overly general modeling assumptions, and inaccurate reporting of emissions sources like fuel consumption.\nIf we could use satelitte images, particularly of some pollutants, and 'trace them back' to what produced them (for example a power plant), then we could have a handy measurement of the emission factors, for some properties of the power plant (fuel type, energy capacity).\nI'll also add some other data sets privided in the challenge, that should try to account for either other sources of NO22 production (such as people travelling around) or the fact that the NO22 may move around due to winds, rain, etc.\nAlthough the actual electricity produced by a power plant should be a more precise way of measuring the EF, I'll use the electrical generating capacity in megawatts in the provided data set, that is more easily available.", "sum_nltk_words": 210, "sum_nltk_runtime": 0.004, "sum_t5": "the goal of this challenge is to:Develop a methodology to calculate an average historical emissions factor of electricity generated for a sub-national region. in short, is a number that converts human activities to amount of pollutant released due to that activity. in this challenge, the focus is on trying to relate energy produced with NO22 released: NO22 = EF * Energy_created - Other_Factors. the exact units of EF depend on the units of the NO22 and the energy", "sum_t5_words": 78, "sum_t5_runtime": 6.91, "runtime": 0.006, "nltk_category": "Economics", "nltk_category_score": 0.4276028871536255, "nltk_category_runtime": 17.705, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.6695547103881836, "nltk_subcategory_runtime": 29.03, "category": "Economics", "category_score": 0.4276028871536255, "subcategory": "Physical", "subcategory_score": 0.6695547103881836, "runtime_cat": 46.735, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.658", "language_code": "en", "language_score": "0.9999966967186885", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "goal challenge todevelop methodology calculate average historical emission factor electricity generated subnational region using remote sensing data technique 1 emission factor efin short number convert human activity amount pollutant released due activity challenge focus trying relate energy produced no22 released no22 ef energy_created other_factors exact unit ef depend unit no22 energy used ill use ef 1033 kg no22electrical generating megawatt year 2 hard measure could easierfrom challenge description say current emission factor methodology based timeconsuming data collection may include error derived lack access granular datasets inability refresh data frequent basis overly general modeling assumption inaccurate reporting emission source like fuel consumption could use satelitte image particularly pollutant trace back produced example power plant could handy measurement emission factor property power plant fuel type energy capacity 3 summary analysishere im using satelite image no22 column density distribute no22 amongst power plant puerto rico using rather naive assumption closest pixel power plant no22 pixel produced power plant might still produced closer power plant lower ill also add data set privided challenge try account either source no22 production people travelling around fact no22 may move around due wind rain etc although actual electricity produced power plant precise way measuring ef ill use electrical generating capacity megawatt provided data set easily available ill also focus power plant use oil primary fuel although principle could used analysis kind power plant calculating ef ill use hierarchical bayesian simple model advatage using data oil power plant calculate yearly average ef power plant still accounting fact oil power plant slightly different ef due property year construction average use may even known 4 outlook1 power plant 2 satelite data 3 splitting no22 overlapping power plant 4 ef calculation bayesian approach", "tags_descriptive": ["Exploratory Data Analysis", "Geospatial Analysis", "Environment"]}