{"title": "4 - Exploring public models", "description": "4. Exploring public modelsAirbus Ship Detection Challenge - A quick overview for computer vision noobs  Hi, and welcome! This is the fourth kernel of the series Airbus Ship Detection Challenge - A quick overview for computer vision noobs. This short kernel has two goals: first, to do a quick research of the currently trending public models and, second, to analyze the main approaches those models take. The full series consist of the following notebooks:  Loading and visualizing the images Understanding and plotting rle bounding boxes  Basic exploratory analysis Exploring public models 1.0 submission: submitting the test file  This is an ongoing project, so expect more notebooks to be added to the series soon. Actually, we are currently working on the following ones:  Understanding and exploiting the data leak A quick overview of image segmentation domain Jumping into Pytorch Understanding U-net Proposing a simple improvement to U-net model", "link": "https://www.kaggle.com/julian3833/4-exploring-public-models", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "pytorch", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-09-12 16:58:25", "date_scraped": "2020-12-12 16:28:05", "words": 151, "sentences": 5, "runtime": 0.0, "description_category": "Manufacturing", "description_category_score": 0.1260562539100647, "description_category_runtime": 13.629, "description_subcategory": "Student", "description_subcategory_score": 0.39567339420318604, "description_subcategory_runtime": 20.493, "category": "Manufacturing", "category_score": 0.1260562539100647, "subcategory": "Student", "subcategory_score": 0.39567339420318604, "runtime_cat": 34.121, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.706", "language_code": "en", "language_score": "0.9999980805768135", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "4 exploring public modelsairbus ship detection challenge quick overview computer vision noobs hi welcome fourth kernel series airbus ship detection challenge quick overview computer vision noobs short kernel two goal first quick research currently trending public model second analyze main approach model take full series consist following notebook loading visualizing image understanding plotting rle bounding box basic exploratory analysis exploring public model 10 submission submitting test file ongoing project expect notebook added series soon actually currently working following one understanding exploiting data leak quick overview image segmentation domain jumping pytorch understanding unet proposing simple improvement unet model", "tags_descriptive": []}