{"title": "Simple Exploration Notebook - ASHRAE", "description": "Competition Objective:Energy savings is one of the important area of focus our current world. Energy savings has two key elements:  Forecasting future energy usage without improvements Forecasting energy use after a specific set of improvements have been implemented  Once we have implemented a set of improvements, the value of energy efficiency improvements can be challenging as there's no way to truly know how much energy a building would have used without the improvements. The best we can do is to build counterfactual models. his competition challenges you to build these counterfactual models across four energy types (chilled water, electricity, hot water, and steam) based on historic usage rates and observed weather.  Picture Source: wur.nl Notebook Objective:The objective of this notebook is to explore the data and make some inferences on the way. Dataset:The dataset includes three years of hourly meter readings from over one thousand buildings at several different sites around the world. We are given two main files - train.csv and test.csv just like other competitions. In addition to these files, we also have couple of more files  building_metadata.csv - meta data about the buildings weather.csv - weather information  First let us load the train file and look at the top few rows to get an idea about the data.", "link": "https://www.kaggle.com/sudalairajkumar/simple-exploration-notebook-ashrae", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-10-21 01:17:33", "date_scraped": "2020-12-12 16:41:48", "words": 216, "sentences": 8, "sum_nltk": "Competition Objective:Energy savings is one of the important area of focus our current world.\nEnergy savings has two key elements:  Forecasting future energy usage without improvements Forecasting energy use after a specific set of improvements have been implemented  Once we have implemented a set of improvements, the value of energy efficiency improvements can be challenging as there's no way to truly know how much energy a building would have used without the improvements.\nThe best we can do is to build counterfactual models.\nhis competition challenges you to build these counterfactual models across four energy types (chilled water, electricity, hot water, and steam) based on historic usage rates and observed weather.\nPicture Source: wur.nl Notebook Objective:The objective of this notebook is to explore the data and make some inferences on the way.\nWe are given two main files - train.csv and test.csv just like other competitions.\nIn addition to these files, we also have couple of more files  building_metadata.csv - meta data about the buildings weather.csv - weather information  First let us load the train file and look at the top few rows to get an idea about the data.", "sum_nltk_words": 188, "sum_nltk_runtime": 0.002, "sum_t5": "the dataset includes three years of hourly meter readings from over one thousand buildings at several different sites around the world. the objective of this notebook is to explore the data and make some inferences on the way. the dataset includes three years of hourly meter readings from over one thousand buildings at several different sites around the world. the objective of this notebook is to explore the data and make some inferences on the way. wur.nl has a competition to build counterfactual models across four energy", "sum_t5_words": 87, "sum_t5_runtime": 5.167, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.676188588142395, "nltk_category_runtime": 16.724, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.8062220811843872, "nltk_subcategory_runtime": 26.74, "category": "Utilities", "category_score": 0.676188588142395, "subcategory": "Quality", "subcategory_score": 0.8062220811843872, "runtime_cat": 43.465, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.734", "language_code": "en", "language_score": "0.9999984211452279", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "competition objectiveenergy saving one important area focus current world energy saving two key element forecasting future energy usage without improvement forecasting energy use specific set improvement implemented implemented set improvement value energy efficiency improvement challenging there way truly know much energy building would used without improvement best build counterfactual model competition challenge build counterfactual model across four energy type chilled water electricity hot water steam based historic usage rate observed weather picture source wurnl notebook objectivethe objective notebook explore data make inference way datasetthe dataset includes three year hourly meter reading one thousand building several different site around world given two main file traincsv testcsv like competition addition file also couple file building_metadatacsv meta data building weathercsv weather information first let u load train file look top row get idea data", "tags_descriptive": []}