{"title": "Ashrae: simple data cleanup (LB 1.08 no leaks)", "description": "Really simple cleanupIn this kernel, I provide basic routines to identify \"bad\" rows that can simply be dropped to improve overall performance. I identify four sorts of bad rows, with significant overlap:  Unjustified runs of zero readings: We identify sequences of more than 48 hours with zero readings which do not occur during the typical seasons for the designated meter type Zero readings for electical meters: There's no reason for a building to ever have zero electrical usage, so we simply throw them all away. The first 141 days of electricity for site 0: Most of these would be covered by the previous sets, but there are a few stray non-zero values that we ignore because they don't fit the overall pattern. Abnormally high readings from building 1099: These values are just absurdly high and don't fit an established pattern. Leaderboard probes show that we do indeed benefit by dropping the outliers.", "link": "https://www.kaggle.com/purist1024/ashrae-simple-data-cleanup-lb-1-08-no-leaks", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-11-26 01:40:11", "date_scraped": "2020-12-12 16:41:48", "words": 153, "sentences": 5, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.36210694909095764, "description_category_runtime": 13.253, "description_subcategory": "Quality", "description_subcategory_score": 0.40563273429870605, "description_subcategory_runtime": 20.641, "category": "Utilities", "category_score": 0.36210694909095764, "subcategory": "Quality", "subcategory_score": 0.40563273429870605, "runtime_cat": 33.895, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.754", "language_code": "en", "language_score": "0.99999817140437", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "really simple cleanupin kernel provide basic routine identify bad row simply dropped improve overall performance identify four sort bad row significant overlap unjustified run zero reading identify sequence 48 hour zero reading occur typical season designated meter type zero reading electical meter there reason building ever zero electrical usage simply throw away first 141 day electricity site 0 would covered previous set stray nonzero value ignore dont fit overall pattern abnormally high reading building 1099 value absurdly high dont fit established pattern leaderboard probe show indeed benefit dropping outlier", "tags_descriptive": []}