{"title": "3D Convolutional Neural Network w/o Programming", "description": "Welcome everyone to my post that will describe my experiments to get good scores for this problem. My aim will be to transfer my knowledge and make it easy for others to follow along. Talking about easy, we will in fact be building and training our neural networks without doing programming. Instead we will use drag and drop GUI based platform (Deep Learning Studio) to build and train neural network. We will try different experiments as we move forward with this competition. I will try to documents as much details as I can on this notebook. Please feel free to send your suggestions and comments. Today we will try 3D Convolutional Neural Network for this problem. Full discloure: I am one of the cofounder of the company who developed Deep Learning Studio software. Deep Learning Studio has a free monthly plan and it offers 2 hours of complementary training time on best GPU available in the Cloud (Nvidia K80 with 12GB RAM)", "link": "https://www.kaggle.com/deepman/3d-convolutional-neural-network-w-o-programming", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-02-22 00:17:21", "date_scraped": "2020-12-12 18:38:03", "words": 162, "sentences": 10, "runtime": 0.01, "description_category": "Justice, Law and Regulations", "description_category_score": 0.23570480942726135, "description_category_runtime": 13.362, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.79738849401474, "description_subcategory_runtime": 20.742, "category": "Justice, Law and Regulations", "category_score": 0.23570480942726135, "subcategory": "Machine Learning", "subcategory_score": 0.79738849401474, "runtime_cat": 34.104, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.762", "language_code": "en", "language_score": "0.999997036444895", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "welcome everyone post describe experiment get good score problem aim transfer knowledge make easy others follow along talking easy fact building training neural network without programming instead use drag drop gui based platform deep learning studio build train neural network try different experiment move forward competition try document much detail notebook please feel free send suggestion comment today try 3d convolutional neural network problem full discloure one cofounder company developed deep learning studio software deep learning studio free monthly plan offer 2 hour complementary training time best gpu available cloud nvidia k80 12gb ram", "tags_descriptive": []}