{"title": "Competition metric details + script", "description": "Evaluation metricIn this notebook I'll try to explain and implement the competition metrics. If you find a bug please leave a comment. Thanks. And do not forget to vote :)  UPDATE v2 - BUG fix! Inside the calculate_precision function I did not pass the form param, it was hardcoded coco. This caused wrong calculations if you used the pascal_voc format. UPDATE v3 - Optimized with Numba!  I optimized the code, so with help of numba it will run much faster Added the tips of Alexander (see the comments below) Importnat change: In some of the methods the order of the gt_box, pred_box arguments were mixed. Please double check your code. The correct order is gt first, pred second.  UPDATE v4 - Another BUG fixed!", "link": "https://www.kaggle.com/pestipeti/competition-metric-details-script", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-11 17:55:39", "date_scraped": "2020-12-12 20:14:55", "words": 127, "sentences": 9, "runtime": 0.005, "description_category": "Finance", "description_category_score": 0.3110952377319336, "description_category_runtime": 12.296, "description_subcategory": "Valuation", "description_subcategory_score": 0.48276931047439575, "description_subcategory_runtime": 18.922, "category": "Finance", "category_score": 0.3110952377319336, "subcategory": "Valuation", "subcategory_score": 0.48276931047439575, "runtime_cat": 31.218, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.748", "language_code": "en", "language_score": "0.9999968836189607", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "evaluation metricin notebook ill try explain implement competition metric find bug please leave comment thanks forget vote update v2 bug fix inside calculate_precision function pas form param hardcoded coco caused wrong calculation used pascal_voc format update v3 optimized numba optimized code help numba run much faster added tip alexander see comment importnat change method order gt_box pred_box argument mixed please double check code correct order gt first pred second update v4 another bug fixed", "tags_descriptive": []}