{"title": "Simple EDA & FE Notebook - DonorsChoose", "description": "Objective of this Notebook: In this notebook, let us try to do some Interactive Exploratory Data Analysis. Then we can concentrate on the Feature Engineering part followed by Modeling. The language in the notebook will be Python. About DonorsChoose: DonorsChoose.org empowers public school teachers from across the country to request much-needed materials and experiences for their students. At any given time, there are thousands of classroom requests that can be brought to life with a gift of any amount. Objective of the competition: DonorsChoose.org receives hundreds of thousands of project proposals each year for classroom projects in need of funding. Right now, a large number of volunteers is needed to manually screen each submission before it's approved to be posted on the DonorsChoose.org website.The goal of the competition is to predict whether or not a DonorsChoose.org project proposal submitted by a teacher will be approved, using the text of project descriptions as well as additional metadata about the project, teacher, and school. DonorsChoose.org can then use this information to identify projects most likely to need further review before approval. Let us start with importing the necessary modules.", "link": "https://www.kaggle.com/sudalairajkumar/simple-eda-fe-notebook-donorschoose", "tags": ["Exploratory Data Analysis", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-03-19 07:58:27", "date_scraped": "2020-12-12 19:01:17", "words": 187, "sentences": 9, "runtime": 0.003, "description_category": "Education & Research", "description_category_score": 0.42429912090301514, "description_category_runtime": 16.194, "description_subcategory": "Student", "description_subcategory_score": 0.6567476391792297, "description_subcategory_runtime": 26.221, "category": "Education & Research", "category_score": 0.42429912090301514, "subcategory": "Student", "subcategory_score": 0.6567476391792297, "runtime_cat": 42.415, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.651", "language_code": "en", "language_score": "0.9999967022503242", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "objective notebook notebook let u try interactive exploratory data analysis concentrate feature engineering part followed modeling language notebook python donorschoose donorschooseorg empowers public school teacher across country request muchneeded material experience student given time thousand classroom request brought life gift amount objective competition donorschooseorg receives hundred thousand project proposal year classroom project need funding right large number volunteer needed manually screen submission approved posted donorschooseorg websitethe goal competition predict whether donorschooseorg project proposal submitted teacher approved using text project description well additional metadata project teacher school donorschooseorg use information identify project likely need review approval let u start importing necessary module", "tags_descriptive": ["Exploratory Data Analysis", "Feature Engineering"]}