{"title": " Bounding box data for the whale flukes", "description": "Bounding box data for the whale flukesThis notebook explores the Humpback Whale Identification - Fluke Location dataset. This dataset is associated with the Humpback Whale Identification Challenge dataset. It contains the location of points on the edge of the fluke for 1200 pictures randomly selected from the Humpback Whale Identification Challenge training set. Points are selected to capture the leftmost and rightmost points, as well as the highest and lowest points. Additional points are added to help determine the fluke bounding box following an affine transformation on the image. The intent of this dataset is to build a model for locating the whale fluke inside the image. In the context of the Humpback Whale Identification Challenge, such a model can then be used to crop images around the region of interest.", "link": "https://www.kaggle.com/martinpiotte/bounding-box-data-for-the-whale-flukes", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-06-25 22:23:23", "date_scraped": "2020-12-13 18:17:20", "words": 131, "sentences": 7, "runtime": 0.01, "description_category": "Utilities", "description_category_score": 0.10783832520246506, "description_category_runtime": 11.491, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.5621135830879211, "description_subcategory_runtime": 17.616, "category": "Utilities", "category_score": 0.10783832520246506, "subcategory": "Machine Learning", "subcategory_score": 0.5621135830879211, "runtime_cat": 29.108, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.722", "language_code": "en", "language_score": "0.999995965005277", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "bounding box data whale flukesthis notebook explores humpback whale identification fluke location dataset dataset associated humpback whale identification challenge dataset contains location point edge fluke 1200 picture randomly selected humpback whale identification challenge training set point selected capture leftmost rightmost point well highest lowest point additional point added help determine fluke bounding box following affine transformation image intent dataset build model locating whale fluke inside image context humpback whale identification challenge model used crop image around region interest", "tags_descriptive": []}