{"title": "Object Detection using YOLOV3", "description": "Object Detection using YOLOV3 This is a starter kernel, mainly for learning purposes and getting started. There is so much to learn more and improve. I am using YOLOv3 model for object classification and detection using a pretrained model. References: The ideas presented in this notebook came primarily from the two YOLO papers. The implementation here also took significant inspiration and used many components from Allan Zelener's github repository. The pretrained weights used in this exercise came from the official YOLO website. Check the speed of detection using YOLO! This detection algorithm will need some fine tuning if you want to run for large number of images. Goal is to demonstrate how YOLO3 performs object detection Joseph Redmon, Santosh Divvala, Ross Girshick, Ali Farhadi - You Only Look Once: Unified, Real-Time Object Detection (2015) Joseph Redmon, Ali Farhadi - YOLO9000: Better, Faster, Stronger (2016) Allan Zelener - YAD2K: Yet Another Darknet 2 Keras The official YOLO website (https://pjreddie.com/darknet/yolo/)", "link": "https://www.kaggle.com/kraisin/object-detection-using-yolov3", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-03-17 15:26:53", "date_scraped": "2020-12-12 20:15:53", "words": 158, "sentences": 8, "runtime": 0.005, "description_category": "Education & Research", "description_category_score": 0.4686674177646637, "description_category_runtime": 16.803, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9621570706367493, "description_subcategory_runtime": 26.512, "category": "Education & Research", "category_score": 0.4686674177646637, "subcategory": "Machine Learning", "subcategory_score": 0.9621570706367493, "runtime_cat": 43.315, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.544", "language_code": "en", "language_score": "0.9999969438091468", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "object detection using yolov3 starter kernel mainly learning purpose getting started much learn improve using yolov3 model object classification detection using pretrained model reference idea presented notebook came primarily two yolo paper implementation also took significant inspiration used many component allan zeleners github repository pretrained weight used exercise came official yolo website check speed detection using yolo detection algorithm need fine tuning want run large number image goal demonstrate yolo3 performs object detection joseph redmon santosh divvala ross girshick ali farhadi look unified realtime object detection 2015 joseph redmon ali farhadi yolo9000 better faster stronger 2016 allan zelener yad2k yet another darknet 2 kera official yolo website httpspjreddiecomdarknetyolo", "tags_descriptive": []}