{"title": "Machine Learning for Geospatial Data Workshop #2A", "description": "Data exploration and basic ConvNN for Image classificationUniversity of Waterloo Geospatial Club - Winter 2019 Slides and Kernel for the first workshop on Machine Learning for Vector data.The purpose of the workshop is to give the UWaterloo students and the members of the Geospatial Club an introduction to the most recent Machine Learning tools for analysis of Geospatial data. The workshop is held in collaboration with the Geospatial Centre at the University of Waterloo. We hope that you will learn something new from the content of this workshop. If you have questions after the workshop, then please feel free to message the Geospatial Club or the workshop presenters.  Jaydeep Mistry at jaydeep.mistry@uwaterloo.ca  Juan Carrillo at jmcarril@uwaterloo.ca      References     [1] Planet: Understanding the Amazon from Space. Featured Kaggle Competition.   [2] Kernel by Philipp Schmidt   [3] Kernel by Tuatini Godard   [4] Source code by Mikel Bober   [5] Source code by Jason Brownlee   [6] Normalized Difference Vegetation Index (NDVI)   [7] t-Distributed Stochastic Neighbor Embedding (t-SNE)   [8] Matplotlib documentation   [9] tqdm documentation   [10] Scipy documentation", "link": "https://www.kaggle.com/jcarrillo/machine-learning-for-geospatial-data-workshop-2a", "tags": ["Geospatial Analysis", "Classification"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-02-14 17:14:47", "date_scraped": "2020-12-13 15:31:34", "words": 199, "sentences": 7, "runtime": 0.004, "description_category": "Education & Research", "description_category_score": 0.3128697872161865, "description_category_runtime": 20.872, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9495487213134766, "description_subcategory_runtime": 32.676, "category": "Education & Research", "category_score": 0.3128697872161865, "subcategory": "Machine Learning", "subcategory_score": 0.9495487213134766, "runtime_cat": 53.549, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.688", "language_code": "en", "language_score": "0.9999979255667828", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data exploration basic convnn image classificationuniversity waterloo geospatial club winter 2019 slide kernel first workshop machine learning vector datathe purpose workshop give uwaterloo student member geospatial club introduction recent machine learning tool analysis geospatial data workshop held collaboration geospatial centre university waterloo hope learn something new content workshop question workshop please feel free message geospatial club workshop presenter jaydeep mistry jaydeepmistryuwaterlooca juan carrillo jmcarriluwaterlooca reference 1 planet understanding amazon space featured kaggle competition 2 kernel philipp schmidt 3 kernel tuatini godard 4 source code mikel bober 5 source code jason brownlee 6 normalized difference vegetation index ndvi 7 tdistributed stochastic neighbor embedding tsne 8 matplotlib documentation 9 tqdm documentation 10 scipy documentation", "tags_descriptive": ["Geospatial Analysis", "Classification"]}