{"title": "Seismic data EDA and baseline", "description": "Important noticeDue to some weird bug I can't answer the comments on this kernel - my answers aren't posted. And I can't upvote comments on this kernel. So, I'm sorry, but I can't answer :( But it seems I can answer in other kernels, so I can reply, if you post a comment to my second kernel. General informationCorrectly predicting earthquakes is very important for preventing deaths and damage to infrastructure. In this competition we try to predict time left to the next laboratory earthquake based on seismic signal data. Training data represents one huge signal, but in test data we have many separate chunks, for each of which we need to predict time to failure. This kernel is dedicated to exploration of LANL Earthquake Prediction Challenge. In my second kernel I pay more attention to feature engineering and data generation.", "link": "https://www.kaggle.com/artgor/seismic-data-eda-and-baseline", "tags": ["Exploratory Data Analysis", "Feature Engineering", "Regression"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "catboost", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-10 21:27:19", "date_scraped": "2020-12-13 13:01:16", "words": 141, "sentences": 8, "runtime": 0.001, "description_category": "Utilities", "description_category_score": 0.06663795560598373, "description_category_runtime": 11.855, "description_subcategory": "General", "description_subcategory_score": 0.8447586297988892, "description_subcategory_runtime": 18.535, "category": "Utilities", "category_score": 0.06663795560598373, "subcategory": "General", "subcategory_score": 0.8447586297988892, "runtime_cat": 30.39, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.784", "language_code": "en", "language_score": "0.9999962032009182", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "important noticedue weird bug cant answer comment kernel answer arent posted cant upvote comment kernel im sorry cant answer seems answer kernel reply post comment second kernel general informationcorrectly predicting earthquake important preventing death damage infrastructure competition try predict time left next laboratory earthquake based seismic signal data training data represents one huge signal test data many separate chunk need predict time failure kernel dedicated exploration lanl earthquake prediction challenge second kernel pay attention feature engineering data generation", "tags_descriptive": ["Exploratory Data Analysis", "Feature Engineering", "Regression"]}