{"title": "COVID Global Forecast: SIR model + ML regressions", "description": "COVID Global Forecast: SIR model + ML regressionsIn the context of the global COVID-19 pandemic, Kaggle has launched several challenges in order to provide useful insights that may answer some of the open scientific questions about the virus. This is the case of the COVID19 Global Forecasting, in which participants are encouraged to fit worldwide data in order to predict the pandemic evolution, hopefully helping to determine which factors impact the transmission behavior of COVID-19. TABLE OF CONTENTS  Exploratory data analysis (EDA) 1.1. COVID-19 global tendency excluding China 1.2. COVID-19 tendency in China 1.3. Italy, Spain, UK and Singapore  SIR model 2.1. Implementing the SIR model 2.2. Fit SIR parameters to real data  Data enrichment 3.1. Join data, filter dates and clean missings 3.2. Compute lags and trends 3.3. Add country details  Predictions for the early stages of the transmission 4.1. Linear Regression for one country 4.2. Linear Regression for all countries (method 1) 4.3. Linear Regression for all countries (method 2) 4.4. Linear regression with lags  Predictions for the late stages of the transmission 5.1. Logistic curve fit 5.2. Logistic curve fit for all countries 5.3. ARIMA  Statement of the author   Disclaimer 1: this notebook is being updated frequently with the objective of improving predictions by using new models. Disclaimer 2: the training dataset is also updated on a daily basis in order to include the most recent cases. In order to be up to date and prevent data leaking and other potential problems, daily updates on \"filtered dates\" will be applied. Disclaimer 3: the COVID Global Forecasting competition is updated week by week (with a new competition). I'll move the notebook from previous weeks to the new one, so that it only appears in the most recent competition.", "link": "https://www.kaggle.com/saga21/covid-global-forecast-sir-model-ml-regressions", "tags": ["Exploratory Data Analysis", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost", "lightgbm", "sklearn", "pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-16 12:40:15", "date_scraped": "2020-12-12 18:17:35", "words": 298, "sentences": 22, "sum_nltk": "COVID Global Forecast: SIR model + ML regressionsIn the context of the global COVID-19 pandemic, Kaggle has launched several challenges in order to provide useful insights that may answer some of the open scientific questions about the virus.\nThis is the case of the COVID19 Global Forecasting, in which participants are encouraged to fit worldwide data in order to predict the pandemic evolution, hopefully helping to determine which factors impact the transmission behavior of COVID-19.\nCOVID-19 global tendency excluding China 1.2.\nAdd country details  Predictions for the early stages of the transmission 4.1.\nLinear Regression for one country 4.2.\nLinear regression with lags  Predictions for the late stages of the transmission 5.1.\nLogistic curve fit for all countries 5.3.\nARIMA  Statement of the author   Disclaimer 1: this notebook is being updated frequently with the objective of improving predictions by using new models.\nDisclaimer 2: the training dataset is also updated on a daily basis in order to include the most recent cases.\nIn order to be up to date and prevent data leaking and other potential problems, daily updates on \"filtered dates\" will be applied.\nDisclaimer 3: the COVID Global Forecasting competition is updated week by week (with a new competition).", "sum_nltk_words": 196, "sum_nltk_runtime": 0.004, "sum_t5": "COVID19 Global Forecasting is a competition for fit-ins to global data. participants are encouraged to fit global data in order to predict the pandemic evolution. the notebook is being updated frequently with the objective of improving predictions. the training dataset is also updated on a daily basis in order to include the most recent cases. the competition is updated week by week (with a new competition). a total of 88 countries have been affected by the global COVID-19 pandemic.", "sum_t5_words": 79, "sum_t5_runtime": 6.546, "runtime": 0.005, "nltk_category": "Healthcare", "nltk_category_score": 0.41273942589759827, "nltk_category_runtime": 19.331, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8768951296806335, "nltk_subcategory_runtime": 30.851, "category": "Healthcare", "category_score": 0.41273942589759827, "subcategory": "Machine Learning", "subcategory_score": 0.8768951296806335, "runtime_cat": 50.181, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.819", "language_code": "en", "language_score": "0.9999971534123706", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "covid global forecast sir model ml regressionsin context global covid19 pandemic kaggle launched several challenge order provide useful insight may answer open scientific question virus case covid19 global forecasting participant encouraged fit worldwide data order predict pandemic evolution hopefully helping determine factor impact transmission behavior covid19 table content exploratory data analysis eda 11 covid19 global tendency excluding china 12 covid19 tendency china 13 italy spain uk singapore sir model 21 implementing sir model 22 fit sir parameter real data data enrichment 31 join data filter date clean missings 32 compute lag trend 33 add country detail prediction early stage transmission 41 linear regression one country 42 linear regression country method 1 43 linear regression country method 2 44 linear regression lag prediction late stage transmission 51 logistic curve fit 52 logistic curve fit country 53 arima statement author disclaimer 1 notebook updated frequently objective improving prediction using new model disclaimer 2 training dataset also updated daily basis order include recent case order date prevent data leaking potential problem daily update filtered date applied disclaimer 3 covid global forecasting competition updated week week new competition ill move notebook previous week new one appears recent competition", "tags_descriptive": ["Exploratory Data Analysis", "Feature Engineering"]}