{"title": "Learning Pytorch LSTM Deep Learning with M5 Data ", "description": "Predicting Time Series with LSTM Deep Learning NetworkBackgroundSince this is my first Time Series competition in Kaggle, I am mainly using it for learning. There are great kernel here, mostly using the boosting models (the most popular is LightGBM  And I have learned how to prepare the data and use it with this popular model. Moving forwards, I have decided to learn a bit more about the use of deep learning for Time Series prediction. I do have a background from other competition with deep learning but for image vision, working mostly with Pytorch. To go deeper and learn the topic, I have decided to build a learning kernel, that at least at the beginning will explain the topic and the concepts, the definition and the basics, From my experience when you try to explain to others, you learn the most. So the first kernel is only trying to explain the basic idea using an arbitrary series from the M5 data. I hope that the next versions will go deeper and I can provide a full submission with deep learning. If you like my kernel - Please VoteIf You like this kernel  Here a similar one with Seq2Seq model : https://www.kaggle.com/omershect/learning-pytorch-seq2seq-with-m5-data-set", "link": "https://www.kaggle.com/omershect/learning-pytorch-lstm-deep-learning-with-m5-data", "tags": ["DL", "LSTM"], "kind": ["Project", "(Notebook)"], "ml_libs": ["gensim", "tensorflow", "lightgbm", "sklearn", "pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-02 21:30:52", "date_scraped": "2020-12-13 13:22:57", "words": 203, "sentences": 8, "sum_nltk": "Predicting Time Series with LSTM Deep Learning NetworkBackgroundSince this is my first Time Series competition in Kaggle, I am mainly using it for learning.\nThere are great kernel here, mostly using the boosting models (the most popular is LightGBM  And I have learned how to prepare the data and use it with this popular model.\nMoving forwards, I have decided to learn a bit more about the use of deep learning for Time Series prediction.\nI do have a background from other competition with deep learning but for image vision, working mostly with Pytorch.\nTo go deeper and learn the topic, I have decided to build a learning kernel, that at least at the beginning will explain the topic and the concepts, the definition and the basics, From my experience when you try to explain to others, you learn the most.\nSo the first kernel is only trying to explain the basic idea using an arbitrary series from the M5 data.\nI hope that the next versions will go deeper and I can provide a full submission with deep learning.\nIf you like my kernel - Please VoteIf You like this kernel  Here a similar one with Seq2Seq model : https://www.kaggle.com/omershect/learning-pytorch-seq2seq-with-m5-data-set", "sum_nltk_words": 196, "sum_nltk_runtime": 0.002, "sum_t5": "a kernel is a learning kernel that will explain the topic and the concepts. the first kernel is just trying to explain the basic idea using an arbitrary series from the M5 data. if you like this kernel - please vote. a similar one with Seq2Seq model is also available. if you like this kernel - please vote.. if you like this kernel - please vote...", "sum_t5_words": 66, "sum_t5_runtime": 4.618, "runtime": 0.003, "nltk_category": "Real Estate, Rental & Leasing", "nltk_category_score": 0.35814139246940613, "nltk_category_runtime": 18.783, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9147449731826782, "nltk_subcategory_runtime": 30.18, "category": "Real Estate, Rental & Leasing", "category_score": 0.35814139246940613, "subcategory": "Machine Learning", "subcategory_score": 0.9147449731826782, "runtime_cat": 48.963, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.753", "language_code": "en", "language_score": "0.9999966513441838", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predicting time series lstm deep learning networkbackgroundsince first time series competition kaggle mainly using learning great kernel mostly using boosting model popular lightgbm learned prepare data use popular model moving forward decided learn bit use deep learning time series prediction background competition deep learning image vision working mostly pytorch go deeper learn topic decided build learning kernel least beginning explain topic concept definition basic experience try explain others learn first kernel trying explain basic idea using arbitrary series m5 data hope next version go deeper provide full submission deep learning like kernel please voteif like kernel similar one seq2seq model httpswwwkagglecomomershectlearningpytorchseq2seqwithm5dataset", "tags_descriptive": ["Deep Learning (DL)", "Long short-term memory (LSTM)"]}