{"title": "nfl-punt-analytics-proposal", "description": "NFL Punt Analytics ProposalThirty seven known punt-related concussions occurred during the 2016 and 2017 NFL seasons. By reviewing the evidence from all 6,681 punt plays that are recorded from these two seasons, I seek to show that the following three rule changes will improve player safety while being implementable and preserving the excitement and unpredictability of the great game of football.  Proposal #1: Award a five yard bonus to the receiving team on a fair catch.  Proposal #2: Require single coverage of gunners by the receiving team. Proposal #3: Install helmet sensors to monitor deceleration.  In support of proposal #1, I attempt to quantify the risk-reward tradeoff of reducing the number of punt returns and increasing the number of fair catches. I find that 32% of punt returns conditional on a punt received yield fewer than five yards on the return. In the current framework, punt returners have an incentive to attempt a return whenever they think their expected value of returning is greater than 0 yards. In the new framework, punt returns will have an incentive to make a return only when they believe the expected value of returning is greater than 5 yards. The concussion rate is 10 injuries per 1000 plays for a fielded return versus 1.8 injuries per 1000 plays for a fair catch, so we expect a 80% decrease in concussions for each incremental fair catch that is called. On the other hand, punt returners will continue to be able to try to go for a return and make a play if they see an opportunity to go for it. In support of proposal #2, I analyze the injury rate conditioning on both the choice of coverage and on the yards between the line of scrimmage and the end zone, as these factors are not independent of one another. Teams are more likely to choose double coverage when there is more open field, i.e. greater yards to go between the kicking team and the receiving team's end zone. On the other hand, plays where the field is longer also have higher injury rates, perhaps because the possibility of a touchback or coffin corner is reduced and the coverage team has to run farther to reach the spot of punt reception, resulting in a more open field and higher speed play. I show that even when one conditions on yards-to-go, double coverage generates somewhat higher injury rates than single coverage in these long field situations. On the other hand, double coverage does not appear to help the receiving team make longer punt returns, i.e. the punt returner is able to generate just as much excitement whether or not the gunners were single covered or not. Enforcing single coverage would then appear to reduce injuries without limiting excitement, and so seems like a costless design proposal, although the statistical significance of these findings (recall there are only 37 concussion events in this entire sample) is limited by the small sample size. In support of proposal #3, I show that deceleration appears more important than velocity in determining injury, but that the NGS data is inherently limited in its ability to measure deceleration.. The code below attempts to measure each player's velocity and deceleration at the time of a tackle event. I find that players who are not injured on a play have velocity as great as or greater than players involved in an injury generating tackle. On the other hand, the injured player experiences much greater deceleration than uninjured players. This suggests that deceleration is a more important factor in injury than velocity. The NGS data provides (x, y) coordinates at 100 millisecond resolution, so a player who decelerates from 9.8 m/s to 0.0 m/s would be recorded as having experienced at most 10 g's in deceleration, since 10g = (9.8m/s - 0.0m/s) / 0.1s. In fact the player could have experienced much greater deceleration, e.g. he could have decelerated to 0 in 20 milliseconds, but the resolution of the NGS system is not granular enough to show this. For the purpose of measuring head injury, the deceleration experienced at the head would seem to be a critical indicator of whether injury is likely to have occurred. This data would be collected not to take players out of the game or to limit their playing time, but rather to better study the conditions and plays that result in greater head deceleration and likely injury. The notebook below provides the analysis and figures that support each of these three proposals. There is an extensive amount of formatting code and data preparation code, which I have attempted to hide, so that the focus can be on the interesting parts - the output and figures. Additional observations are found at the end. Final thoughts concludes.", "link": "https://www.kaggle.com/hallayang/nfl-punt-analytics-proposal", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-02-10 03:23:32", "date_scraped": "2020-12-13 14:25:10", "words": 798, "sentences": 33, "sum_nltk": "In the current framework, punt returners have an incentive to attempt a return whenever they think their expected value of returning is greater than 0 yards.\nIn support of proposal #2, I analyze the injury rate conditioning on both the choice of coverage and on the yards between the line of scrimmage and the end zone, as these factors are not independent of one another.\nTeams are more likely to choose double coverage when there is more open field, i.e. greater yards to go between the kicking team and the receiving team's end zone.\nOn the other hand, double coverage does not appear to help the receiving team make longer punt returns, i.e. the punt returner is able to generate just as much excitement whether or not the gunners were single covered or not.\nIn support of proposal #3, I show that deceleration appears more important than velocity in determining injury, but that the NGS data is inherently limited in its ability to measure deceleration..\nThis data would be collected not to take players out of the game or to limit their playing time, but rather to better study the conditions and plays that result in greater head deceleration and likely injury.", "sum_nltk_words": 197, "sum_nltk_runtime": 0.008, "sum_t5": "aaron carroll: 307 known punt-related concussions occurred during 2016 and 2017 seasons. carroll: reducing punt returns and increasing fair catches will improve player safety. he says teams are more likely to choose double coverage when there is more open field. carroll: if teams are able to run farther, they will be able to make more plays. he says the new rule will make it easier for punt returners to make plays.", "sum_t5_words": 71, "sum_t5_runtime": 6.775, "runtime": 0.002, "nltk_category": "Utilities", "nltk_category_score": 0.347634881734848, "nltk_category_runtime": 16.953, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.4323482811450958, "nltk_subcategory_runtime": 26.689, "category": "Utilities", "category_score": 0.347634881734848, "subcategory": "Student", "subcategory_score": 0.4323482811450958, "runtime_cat": 43.642, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.715", "language_code": "en", "language_score": "0.9999983863143409", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "nfl punt analytics proposalthirty seven known puntrelated concussion occurred 2016 2017 nfl season reviewing evidence 6681 punt play recorded two season seek show following three rule change improve player safety implementable preserving excitement unpredictability great game football proposal 1 award five yard bonus receiving team fair catch proposal 2 require single coverage gunner receiving team proposal 3 install helmet sensor monitor deceleration support proposal 1 attempt quantify riskreward tradeoff reducing number punt return increasing number fair catch find 32 punt return conditional punt received yield fewer five yard return current framework punt returners incentive attempt return whenever think expected value returning greater 0 yard new framework punt return incentive make return believe expected value returning greater 5 yard concussion rate 10 injury per 1000 play fielded return versus 18 injury per 1000 play fair catch expect 80 decrease concussion incremental fair catch called hand punt returners continue able try go return make play see opportunity go support proposal 2 analyze injury rate conditioning choice coverage yard line scrimmage end zone factor independent one another team likely choose double coverage open field ie greater yard go kicking team receiving team end zone hand play field longer also higher injury rate perhaps possibility touchback coffin corner reduced coverage team run farther reach spot punt reception resulting open field higher speed play show even one condition yardstogo double coverage generates somewhat higher injury rate single coverage long field situation hand double coverage appear help receiving team make longer punt return ie punt returner able generate much excitement whether gunner single covered enforcing single coverage would appear reduce injury without limiting excitement seems like costless design proposal although statistical significance finding recall 37 concussion event entire sample limited small sample size support proposal 3 show deceleration appears important velocity determining injury ng data inherently limited ability measure deceleration code attempt measure player velocity deceleration time tackle event find player injured play velocity great greater player involved injury generating tackle hand injured player experience much greater deceleration uninjured player suggests deceleration important factor injury velocity ng data provides x coordinate 100 millisecond resolution player decelerates 98 m 00 m would recorded experienced 10 g deceleration since 10g 98ms 00ms 01s fact player could experienced much greater deceleration eg could decelerated 0 20 millisecond resolution ng system granular enough show purpose measuring head injury deceleration experienced head would seem critical indicator whether injury likely occurred data would collected take player game limit playing time rather better study condition play result greater head deceleration likely injury notebook provides analysis figure support three proposal extensive amount formatting code data preparation code attempted hide focus interesting part output figure additional observation found end final thought concludes", "tags_descriptive": []}