{"title": "Time Series Clustering For Forecasting Preparation", "description": "Time Series Clustering For Forecasting PreparationThe M5 dataset is a set of time series of daily sales by item Categories, Departments, Stores, and Items. These levels of granularity have a heirarchical structure, in that:  A Category has multiple Departments A Department spans across multiple Stores A Department contains multiple Items A combination of Item and Store is a the most granular level of series (SKU).   Unlike more vanilla time series forecasting tasks - where one uses a single series to predict the future of the series, this structure allows for transfer learning between series. For example: It may be that a group of items have similar sales patterns, due to seasonality in demand or supply, etc. Thus, it would make sense for a model to learn learn shared patterns to provide more robust forecasts. On the other hand, demand for groups of items might differ substancially due to external forces. Training a model to try and find similarities between these groups might only introduce noise - as the demand/supply for these items are structurally different. Clustering seriesThe purpose of this notebook is to demonstrate how we might group items that have similar underlying structure before diving into modeling using several clustering approaches. This way, we could pre-process series within groups in a similar way, and train a model for each cluster which specializes in learning this underlying structure. In this notebook I'll use a naive heirarchical method to cluster the series, point out the shortcoming of this approach, and speak about a method to approach these shortcomings called Dynamic Time Warping.", "link": "https://www.kaggle.com/timib1203/time-series-clustering-for-forecasting-preparation", "tags": ["CLustering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-03-29 23:34:03", "date_scraped": "2020-12-13 13:24:02", "words": 264, "sentences": 10, "sum_nltk": "Time Series Clustering For Forecasting PreparationThe M5 dataset is a set of time series of daily sales by item Categories, Departments, Stores, and Items.\nUnlike more vanilla time series forecasting tasks - where one uses a single series to predict the future of the series, this structure allows for transfer learning between series.\nFor example: It may be that a group of items have similar sales patterns, due to seasonality in demand or supply, etc.\nTraining a model to try and find similarities between these groups might only introduce noise - as the demand/supply for these items are structurally different.\nClustering seriesThe purpose of this notebook is to demonstrate how we might group items that have similar underlying structure before diving into modeling using several clustering approaches.\nThis way, we could pre-process series within groups in a similar way, and train a model for each cluster which specializes in learning this underlying structure.\nIn this notebook I'll use a naive heirarchical method to cluster the series, point out the shortcoming of this approach, and speak about a method to approach these shortcomings called Dynamic Time Warping.", "sum_nltk_words": 180, "sum_nltk_runtime": 0.003, "sum_t5": "a naive heirarchical method is used to cluster the time series. this method allows for transfer learning between series. it is a good way to learn about the underlying structure of a series. it is also a good way to learn about the underlying structure of a series. a series of items have similar sales patterns due to seasonality. a group of items have similar demand/supply..", "sum_t5_words": 66, "sum_t5_runtime": 5.6, "runtime": 0.003, "nltk_category": "Economics", "nltk_category_score": 0.11971016228199005, "nltk_category_runtime": 16.127, "nltk_subcategory": "Preventative and Reactive", "nltk_subcategory_score": 0.14663642644882202, "nltk_subcategory_runtime": 25.75, "category": "Economics", "category_score": 0.11971016228199005, "subcategory": "Preventative and Reactive", "subcategory_score": 0.14663642644882202, "runtime_cat": 41.876, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.73", "language_code": "en", "language_score": "0.9999965954291774", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "time series clustering forecasting preparationthe m5 dataset set time series daily sale item category department store item level granularity heirarchical structure category multiple department department span across multiple store department contains multiple item combination item store granular level series sku unlike vanilla time series forecasting task one us single series predict future series structure allows transfer learning series example may group item similar sale pattern due seasonality demand supply etc thus would make sense model learn learn shared pattern provide robust forecast hand demand group item might differ substancially due external force training model try find similarity group might introduce noise demandsupply item structurally different clustering seriesthe purpose notebook demonstrate might group item similar underlying structure diving modeling using several clustering approach way could preprocess series within group similar way train model cluster specializes learning underlying structure notebook ill use naive heirarchical method cluster series point shortcoming approach speak method approach shortcoming called dynamic time warping", "tags_descriptive": ["CLustering"]}