{"title": "Time Split Validation - Malware - [0.68]", "description": "Time Split Validation - Adversarial EDA - Microsoft MalwareIs anyone else frustrated with the discrepency between CV and LB?! In this kernel, I show an example of two models that both have CV 0.730 but one has LB 0.670 while the other has LB 0.680. Why?! We will explore this and suggest ideas to more accurately estimate LB. The CulpritThe Microsoft Malware data has 82 explanatory variables which can all be intrepreted as categorical variables. The reason for CV and LB gap is the difference between TRAIN and TEST variable value distributions. In this kernel, we compare the variable distributions between TRAIN and TEST. If TRAIN and TEST were random samples from the same population then their distributions would be nearly identical (since sample size is a massive 8 million). But this is not what we see! Why? Because TRAIN is sampled from the population of August September 2018 while TEST is sampled from the different population October November 2018 (shown here). Furthermore we believe that PUBLIC TEST is October 2018 and PRIVATE TEST is November 2018 (shown here).", "link": "https://www.kaggle.com/cdeotte/time-split-validation-malware-0-68", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-02-21 01:31:18", "date_scraped": "2020-12-13 14:13:18", "words": 179, "sentences": 8, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.06548351794481277, "description_category_runtime": 15.364, "description_subcategory": "Valuation", "description_subcategory_score": 0.8410037755966187, "description_subcategory_runtime": 24.939, "category": "Wholesale & Retail", "category_score": 0.06548351794481277, "subcategory": "Valuation", "subcategory_score": 0.8410037755966187, "runtime_cat": 40.303, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.752", "language_code": "en", "language_score": "0.9999952110572399", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "time split validation adversarial eda microsoft malwareis anyone else frustrated discrepency cv lb kernel show example two model cv 0730 one lb 0670 lb 0680 explore suggest idea accurately estimate lb culpritthe microsoft malware data 82 explanatory variable intrepreted categorical variable reason cv lb gap difference train test variable value distribution kernel compare variable distribution train test train test random sample population distribution would nearly identical since sample size massive 8 million see train sampled population august september 2018 test sampled different population october november 2018 shown furthermore believe public test october 2018 private test november 2018 shown", "tags_descriptive": []}