{"title": "HomeCreditRisk: Extensive EDA + Baseline [0.772]", "description": "Home Credit Default Risk - Exploration + Baseline ModelMany people struggle to get loans due to insufficient or non-existent credit histories. And, unfortunately, this population is often taken advantage of by untrustworthy lenders. Home Credit strives to broaden financial inclusion for the unbanked population by providing a positive and safe borrowing experience. In order to make sure this underserved population has a positive loan experience, Home Credit makes use of a variety of alternative data--including telco and transactional information--to predict their clients' repayment abilities. While Home Credit is currently using various statistical and machine learning methods to make these predictions, they're challenging Kagglers to help them unlock the full potential of their data. Doing so will ensure that clients capable of repayment are not rejected and that loans are given with a principal, maturity, and repayment calendar that will empower their clients to be successful. This is a simple notebook on exploration and baseline model of home credit default risk data Contents 1. Dataset Preparation 2. Exploration - Applications Train      2.1 Snapshot - Application Train      2.2 Distribution of Target Variable      2.3 Applicant's Gender Type      2.4 Family Status of Applicants who takes the loan      2.5 Does applicants own Real Estate or Car      2.6 Suite Type and Income Type of Applicants      2.7 Applicants Contract Type      2.8 Education Type and Occupation Type      2.9 Organization Type and Occupation Type      2.10 Walls Material, Foundation and House Type      2.11 Amount Credit Distribution      2.12 Amount Annuity Distribution - Distribution      2.13 Amount Goods Price - Distribution      2.14 Amount Region Population Relative      2.15 Days Birth - Distribution      2.16 Days Employed - Distribution      2.17 Distribution of Num Days Registration      2.18 Applicants Number of Family Members      2.19 Applicants Number of Children 3. Exploration - Bureau Data      3.1 Snapshot - Bureau Data 4. Exploration - Bureau Balance Data      4.1 Snapshot - Bureau Balance Data 5. Exploration - Credit Card Balance Data      5.1 Snapshot - Credit Card Balance Data 6. Exploration - POS Cash Balance Data      6.1 Snapshot - POS Cash Balance Data 7. Exploration - Previous Application Data      7.1 Snapshot - Previous Application Data      7.2 Contract Status Distribution - Previous Applications      7.3 Suite Type Distribution - Previous Application      7.4 Client Type Distribution  - Previous Application      7.5 Channel Type Distribution - Previous Applications 8. Exploration - Installation Payments      8.1 Snapshot of Installation Payments 9. Baseline Model      9.1 Dataset Preparation      9.2 Handelling Categorical Features      9.3 Create Flat Dataset      9.4 Validation Sets Preparation      9.5 Model Fitting      9.6 Feature Importance      9.7 Prediction 1. Dataset Preparation", "link": "https://www.kaggle.com/shivamb/homecreditrisk-extensive-eda-baseline-0-772", "tags": ["Classification", "Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-06-27 04:00:27", "date_scraped": "2020-12-12 20:47:32", "words": 446, "sentences": 17, "sum_nltk": "Home Credit Default Risk - Exploration + Baseline ModelMany people struggle to get loans due to insufficient or non-existent credit histories.\nIn order to make sure this underserved population has a positive loan experience, Home Credit makes use of a variety of alternative data--including telco and transactional information--to predict their clients' repayment abilities.\nThis is a simple notebook on exploration and baseline model of home credit default risk data Contents 1.\nExploration - Applications Train      2.1 Snapshot - Application Train      2.2 Distribution of Target Variable      2.3 Applicant's Gender Type      2.4 Family Status of Applicants who takes the loan      2.5 Does applicants own Real Estate or Car      2.6 Suite Type and Income Type of Applicants      2.7 Applicants Contract Type      2.8 Education Type and Occupation Type      2.9 Organization Type and Occupation Type      2.10 Walls Material, Foundation and House Type      2.11 Amount Credit Distribution      2.12 Amount Annuity Distribution - Distribution      2.13 Amount Goods Price - Distribution      2.14 Amount Region Population Relative      2.15 Days Birth - Distribution      2.16 Days Employed - Distribution      2.17 Distribution of Num Days Registration      2.18 Applicants Number of Family Members      2.19 Applicants Number of Children 3.\nExploration - Bureau Balance Data      4.1 Snapshot - Bureau Balance Data 5.", "sum_nltk_words": 214, "sum_nltk_runtime": 0.004, "sum_t5": "home credit is a nonprofit that aims to broaden financial inclusion for the unbanked population. it uses alternative data to predict their clients' repayment abilities. the data is being used to help them make better predictions about their clients' repayment abilities. the data will help them to give their clients a repayment calendar that will empower them to be successful. the data will also help them to better understand their clients' credit history. the data will also help them to better understand their clients' credit history.", "sum_t5_words": 86, "sum_t5_runtime": 6.762, "runtime": 0.005, "nltk_category": "Finance", "nltk_category_score": 0.04103470221161842, "nltk_category_runtime": 21.707, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.038113757967948914, "nltk_subcategory_runtime": 34.687, "category": "Finance", "category_score": 0.04103470221161842, "subcategory": "Judicial Applied", "subcategory_score": 0.038113757967948914, "runtime_cat": 56.394, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.779", "language_code": "en", "language_score": "0.9999947560752123", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "home credit default risk exploration baseline modelmany people struggle get loan due insufficient nonexistent credit history unfortunately population often taken advantage untrustworthy lender home credit strives broaden financial inclusion unbanked population providing positive safe borrowing experience order make sure underserved population positive loan experience home credit make use variety alternative dataincluding telco transactional informationto predict client repayment ability home credit currently using various statistical machine learning method make prediction theyre challenging kagglers help unlock full potential data ensure client capable repayment rejected loan given principal maturity repayment calendar empower client successful simple notebook exploration baseline model home credit default risk data content 1 dataset preparation 2 exploration application train 21 snapshot application train 22 distribution target variable 23 applicant gender type 24 family status applicant take loan 25 applicant real estate car 26 suite type income type applicant 27 applicant contract type 28 education type occupation type 29 organization type occupation type 210 wall material foundation house type 211 amount credit distribution 212 amount annuity distribution distribution 213 amount good price distribution 214 amount region population relative 215 day birth distribution 216 day employed distribution 217 distribution num day registration 218 applicant number family member 219 applicant number child 3 exploration bureau data 31 snapshot bureau data 4 exploration bureau balance data 41 snapshot bureau balance data 5 exploration credit card balance data 51 snapshot credit card balance data 6 exploration po cash balance data 61 snapshot po cash balance data 7 exploration previous application data 71 snapshot previous application data 72 contract status distribution previous application 73 suite type distribution previous application 74 client type distribution previous application 75 channel type distribution previous application 8 exploration installation payment 81 snapshot installation payment 9 baseline model 91 dataset preparation 92 handelling categorical feature 93 create flat dataset 94 validation set preparation 95 model fitting 96 feature importance 97 prediction 1 dataset preparation", "tags_descriptive": ["Classification", "Exploratory Data Analysis"]}