{"title": "Predicting Mulliken Charges With ACSF Descriptors", "description": "Introducing Atom-Centered Symmetry Functions: Application to the prediction of Mulliken chargesGreetings everyone! One thing that you probably noticed in the Predicting Molecular Properties challenge is that the Mulliken charges are only available for the training set. And so are the dipole moments, magnetic shield tensor, potential energies, etc. Therefore, several attempts have been made to try and approximate these properties for the test set (see for instance this kernel by Alexandre). But what if we had a way to machine learn these properties and predict them for all the atoms/molecules of the test set? This would allow us to subsequently use them as input features for the prediction of the scalar coupling. It is actually possible to machine learn these properties using only the structural information contained in the structures.csv file. We do that using descriptors. You may have already heard about these descriptors (maybe because I'm mentioning them in almost all of my posts...) and it's time we took a look at them :) For this kernel I choose to focus on the Mulliken charges, but of course this can be applied to any of the properties mentioned above, however with some subtleties that I will explain. 1. What is a descriptor?The problem that we are facing is how to appropriately represent an atomic environment? In the challenge, we are provided with the cartesian positions of each atom in the molecules. While the cartesian system may seem like a simple and unequivocal descriptor of atomic configurations, it actually suffers a major drawback: the list of coordinates is ordered arbitrarily and two structures might be mapped to each other by a rotation, reflection, or translation so that two different lists of atomic coordinates can, in fact, represent the same or very similar structures. Therefore, a good representation is invariant with respect to permutational, rotational, reflectional, and translational symmetries, while retaining the faithfulness of the cartesian representation. This is what a descriptor does. It is also called the fingerprint of a molecule. During the last decade, a number of different descriptors have been established (and every month a new descriptor pops out, claiming it is superior to all the previous ones...) among which:  The symmetry functions by Behler and Parrinello: Phys. Rev. Lett. 98, 146401 (2007). The bispectrum by Bartok et al.: Phys. Rev. Lett. 104, 136403 (2010). The Coulomb matrix by Rupp et al.: Phys. Rev. Lett. 108, 058301 (2012). And others!  The descriptors can be global or local, depending on whether they represent the entire molecule (global) or the environment around each atom (local). The symmetry functions, bispectrum, and Coulomb matrix are all local descriptors: one descriptor for each atom in the molecule. Depending on the quantity that we want to predict, we will use global or local descriptors. For instance, the Mulliken charge is a local property (since there is one charge for each atom), so that it's better to use a local descriptor. On the contrary, the potential energy of the molecule is a global property, so we might instead use a global descriptor. 2. Atom-Centered Symmetry Functions (ACSF)ACSF are local descriptors that are rather easy to understand and are very powerful because they contain a lot of information on the chemical environment around each atom. They are based on a function called the cutoff function. 2.1. Understanding the cutoff functionThe cutoff function is expressed as follows: fc(Rij)={0.5[cos(πRijRc)+1]forRij≤Rc0forRij>Rc where Rij is the distance between atoms i and j, and if this distance is greater than a cutoff radius Rc, then the cutoff function becomes zero. If maths is not your cup of tea, this function might look barbaric. Let's try to understand it by plotting it for different values of Rc:", "link": "https://www.kaggle.com/borisdee/predicting-mulliken-charges-with-acsf-descriptors", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-06-17 05:16:29", "date_scraped": "2020-12-12 17:53:35", "words": 616, "sentences": 37, "sum_nltk": "Introducing Atom-Centered Symmetry Functions: Application to the prediction of Mulliken chargesGreetings everyone!\nBut what if we had a way to machine learn these properties and predict them for all the atoms/molecules of the test set?\nWhile the cartesian system may seem like a simple and unequivocal descriptor of atomic configurations, it actually suffers a major drawback: the list of coordinates is ordered arbitrarily and two structures might be mapped to each other by a rotation, reflection, or translation so that two different lists of atomic coordinates can, in fact, represent the same or very similar structures.\nThe descriptors can be global or local, depending on whether they represent the entire molecule (global) or the environment around each atom (local).\nThe symmetry functions, bispectrum, and Coulomb matrix are all local descriptors: one descriptor for each atom in the molecule.\nFor instance, the Mulliken charge is a local property (since there is one charge for each atom), so that it's better to use a local descriptor.\nOn the contrary, the potential energy of the molecule is a global property, so we might instead use a global descriptor.\n2. Atom-Centered Symmetry Functions (ACSF)ACSF are local descriptors that are rather easy to understand and are very powerful because they contain a lot of information on the chemical environment around each atom.", "sum_nltk_words": 210, "sum_nltk_runtime": 0.006, "sum_t5": "a number of different descriptors have been established for predicting atomic properties. the descriptors are used to represent atoms in a cartesian system. the descriptors can be used to predict scalar couplings. the descriptors can be used to predict atoms in a molecule. a descriptor can be used to predict atoms in a molecule.", "sum_t5_words": 54, "sum_t5_runtime": 6.207, "runtime": 0.004, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.13668188452720642, "nltk_category_runtime": 19.541, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.26093968749046326, "nltk_subcategory_runtime": 31.184, "category": "Biotechnological & Life Sciences", "category_score": 0.13668188452720642, "subcategory": "Physical", "subcategory_score": 0.26093968749046326, "runtime_cat": 50.725, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.728", "language_code": "en", "language_score": "0.9999977562957155", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introducing atomcentered symmetry function application prediction mulliken chargesgreetings everyone one thing probably noticed predicting molecular property challenge mulliken charge available training set dipole moment magnetic shield tensor potential energy etc therefore several attempt made try approximate property test set see instance kernel alexandre way machine learn property predict atomsmolecules test set would allow u subsequently use input feature prediction scalar coupling actually possible machine learn property using structural information contained structurescsv file using descriptor may already heard descriptor maybe im mentioning almost post time took look kernel choose focus mulliken charge course applied property mentioned however subtlety explain 1 descriptorthe problem facing appropriately represent atomic environment challenge provided cartesian position atom molecule cartesian system may seem like simple unequivocal descriptor atomic configuration actually suffers major drawback list coordinate ordered arbitrarily two structure might mapped rotation reflection translation two different list atomic coordinate fact represent similar structure therefore good representation invariant respect permutational rotational reflectional translational symmetry retaining faithfulness cartesian representation descriptor also called fingerprint molecule last decade number different descriptor established every month new descriptor pop claiming superior previous one among symmetry function behler parrinello phys rev lett 98 146401 2007 bispectrum bartok et al phys rev lett 104 136403 2010 coulomb matrix rupp et al phys rev lett 108 058301 2012 others descriptor global local depending whether represent entire molecule global environment around atom local symmetry function bispectrum coulomb matrix local descriptor one descriptor atom molecule depending quantity want predict use global local descriptor instance mulliken charge local property since one charge atom better use local descriptor contrary potential energy molecule global property might instead use global descriptor 2 atomcentered symmetry function acsfacsf local descriptor rather easy understand powerful contain lot information chemical environment around atom based function called cutoff function 21 understanding cutoff functionthe cutoff function expressed follows fcrij05cosrijrc1forrijrc0forrijrc rij distance atom j distance greater cutoff radius rc cutoff function becomes zero math cup tea function might look barbaric let try understand plotting different value rc", "tags_descriptive": []}