{"title": "MFCC implementation and tutorial", "description": "MFCC theory and implementationTheoryMel Frequency Cepstral Coefficents (MFCCs) is a way of extracting features from an audio. The MFCC uses the MEL scale to divide the frequency band to sub-bands and then extracts the Cepstral Coefficents using Discrete Cosine Transform (DCT). MEL scale is based on the way humans distinguish between frequencies which makes it very convenient to process sounds. Lets first understand how humans perceive sounds. Human voice sound perceptionAdult humans fundamental voice frequency range is between 85Hz to 255Hz (85Hz to 180Hz for male and 165Hz to 255Hz for female). On top of the fundamental frequency there are harmonics of fundamental frequencys. Harmonics are whole multiplications of the fundamental frequency. If for instance the fundamental frequency is 100Hz then its second harmonic will be 200Hz, third harmonic is 300Hz and so on. You can see an example in the image below [1] which shows frequency vs. time of several pronounced words and color represents frequency power at that point (yellow strongest and black weakest): <img src=\"https://static.scientificamerican.com/sciam/assets/media/sound/speechsep-audio/speechsep-2-spect.png\", width=600, height=200> Notice the first horizontal yellow line on the bottom of each segment. That is the fundamental frequency and its the strongest. Above that there are harmonics with the same frequncy distance from each other. Humans can hear roughly between 20Hz to 20KHz. The perception of sound is non-linear [2] and you can better distinguish between low frequency sounds than high frequency sounds e.g. humans can clearly hear the difference betwee 100Hz and 200Hz but not between 15kHz and 15.1kHz. You can try in usin a tone generator: http://www.szynalski.com/tone-generator/ MEL scaleA MEL scale is a unit of PITCH proposed by Stevens, Volkmann and Newmann in 1937. The MEL scale is a scale of pitches judged by listeners to be equal in distance one from another [3] [4]. Because of how humans perceive sound the MEL scale is a non-lenear scale and the distances between the pitches increeses with frequency. MFCC implementation [5] [6]Sample signalFirst, lets load a sample audio and start working with it:", "link": "https://www.kaggle.com/ilyamich/mfcc-implementation-and-tutorial", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-04-22 23:47:33", "date_scraped": "2020-12-12 20:04:19", "words": 333, "sentences": 19, "sum_nltk": "MFCC theory and implementationTheoryMel Frequency Cepstral Coefficents (MFCCs) is a way of extracting features from an audio.\nThe MFCC uses the MEL scale to divide the frequency band to sub-bands and then extracts the Cepstral Coefficents using Discrete Cosine Transform (DCT).\nMEL scale is based on the way humans distinguish between frequencies which makes it very convenient to process sounds.\nLets first understand how humans perceive sounds.\nHuman voice sound perceptionAdult humans fundamental voice frequency range is between 85Hz to 255Hz (85Hz to 180Hz for male and 165Hz to 255Hz for female).\nHarmonics are whole multiplications of the fundamental frequency.\nIf for instance the fundamental frequency is 100Hz then its second harmonic will be 200Hz, third harmonic is 300Hz and so on.\nThat is the fundamental frequency and its the strongest.\nThe MEL scale is a scale of pitches judged by listeners to be equal in distance one from another [3] [4].\nBecause of how humans perceive sound the MEL scale is a non-lenear scale and the distances between the pitches increeses with frequency.", "sum_nltk_words": 165, "sum_nltk_runtime": 0.003, "sum_t5": "the MFCC uses the MEL scale to divide the frequency band to sub-bands. the scale is based on the way humans distinguish between frequencies. humans can hear roughly between 20Hz and 20KHz. the MFCC uses a tone generator to extract the cepstral coefficents. a symphony of a symphony is used to extract the symphony.", "sum_t5_words": 54, "sum_t5_runtime": 6.297, "runtime": 0.006, "nltk_category": "Miscellaneous", "nltk_category_score": 0.1372331976890564, "nltk_category_runtime": 16.883, "nltk_subcategory": "General", "nltk_subcategory_score": 0.1833484172821045, "nltk_subcategory_runtime": 26.998, "category": "Miscellaneous", "category_score": 0.1372331976890564, "subcategory": "General", "subcategory_score": 0.1833484172821045, "runtime_cat": 43.882, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.787", "language_code": "en", "language_score": "0.9999952770406968", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "mfcc theory implementationtheorymel frequency cepstral coefficents mfccs way extracting feature audio mfcc us mel scale divide frequency band subbands extract cepstral coefficents using discrete cosine transform dct mel scale based way human distinguish frequency make convenient process sound let first understand human perceive sound human voice sound perceptionadult human fundamental voice frequency range 85hz 255hz 85hz 180hz male 165hz 255hz female top fundamental frequency harmonic fundamental frequency harmonic whole multiplication fundamental frequency instance fundamental frequency 100hz second harmonic 200hz third harmonic 300hz see example image 1 show frequency v time several pronounced word color represents frequency power point yellow strongest black weakest img srchttpsstaticscientificamericancomsciamassetsmediasoundspeechsepaudiospeechsep2spectpng width600 height200 notice first horizontal yellow line bottom segment fundamental frequency strongest harmonic frequncy distance human hear roughly 20hz 20khz perception sound nonlinear 2 better distinguish low frequency sound high frequency sound eg human clearly hear difference betwee 100hz 200hz 15khz 151khz try usin tone generator httpwwwszynalskicomtonegenerator mel scalea mel scale unit pitch proposed stevens volkmann newmann 1937 mel scale scale pitch judged listener equal distance one another 3 4 human perceive sound mel scale nonlenear scale distance pitch increeses frequency mfcc implementation 5 6sample signalfirst let load sample audio start working", "tags_descriptive": []}