{"title": "Simple ANN ", "description": "Nomad2018 Predicting Transparent ConductorsPredict the key properties of novel transparent semiconductors  The diffrent properties of Aluminum,Gallium,Indium is given in data set. In order to reduce electric transmission loss,discovery of new transparent conductor alloy is important. The transparent conductor having characteristic good conductivity and have a low absorption. The aim is to prediction of two target properties: the formation energy (which is an indication of the stability of a new material) and the bandgap energy (which is an indication of the potential for transparency over the visible range) to facilitate the discovery of new transparent conductors", "link": "https://www.kaggle.com/sudhirnl7/simple-ann", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-01-31 15:26:54", "date_scraped": "2020-12-13 14:37:12", "words": 96, "sentences": 4, "runtime": 0.004, "description_category": "Manufacturing", "description_category_score": 0.2600516974925995, "description_category_runtime": 9.527, "description_subcategory": "Transportation", "description_subcategory_score": 0.49090054631233215, "description_subcategory_runtime": 14.813, "category": "Manufacturing", "category_score": 0.2600516974925995, "subcategory": "Transportation", "subcategory_score": 0.49090054631233215, "runtime_cat": 24.34, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.67", "language_code": "en", "language_score": "0.9999966080758659", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "nomad2018 predicting transparent conductorspredict key property novel transparent semiconductor diffrent property aluminumgalliumindium given data set order reduce electric transmission lossdiscovery new transparent conductor alloy important transparent conductor characteristic good conductivity low absorption aim prediction two target property formation energy indication stability new material bandgap energy indication potential transparency visible range facilitate discovery new transparent conductor", "tags_descriptive": []}