{"title": "Starter EDA and Feature selection ASHRAE3", "description": "I'll summarise here the insights from my brief data analyses and whatever is shared in public discussions. This is still highly under progress and will be updated when possible. Quoting Chris Balbach (our Competition Host): Consider the scenario laid out in this diagram. This competition simulates the modelling challenge presented at the end of the timeline when measured energy and weather conditions are known and the adjusted baseline energy must be calculated.   For further details, I recommend reading this paper by Clayton Miller.  We are actually using data from 2016 to predict the demand for both 2017 and 2018, which is a hard task. However, other public kernels have showed that you can give a relatively good estimate even with a very simple linear model.", "link": "https://www.kaggle.com/hmendonca/starter-eda-and-feature-selection-ashrae3", "tags": ["Regression", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-10-18 13:30:48", "date_scraped": "2020-12-12 16:41:48", "words": 128, "sentences": 7, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.3484853208065033, "description_category_runtime": 10.562, "description_subcategory": "Physical", "description_subcategory_score": 0.45869505405426025, "description_subcategory_runtime": 16.503, "category": "Utilities", "category_score": 0.3484853208065033, "subcategory": "Physical", "subcategory_score": 0.45869505405426025, "runtime_cat": 27.065, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.751", "language_code": "en", "language_score": "0.9999959648560642", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "ill summarise insight brief data analysis whatever shared public discussion still highly progress updated possible quoting chris balbach competition host consider scenario laid diagram competition simulates modelling challenge presented end timeline measured energy weather condition known adjusted baseline energy must calculated detail recommend reading paper clayton miller actually using data 2016 predict demand 2017 2018 hard task however public kernel showed give relatively good estimate even simple linear model", "tags_descriptive": ["Regression", "Feature Engineering"]}