{"title": "How to *Correctly* Load Data into R", "description": "How To Correctly Load Data into RThere's a number of people asking how to load the listing data into R. There's a few incorrect solutions posted, so I want to clear this up. The mistake everyone is making when parsing the JSON is that they are expecting each variable in each row to contain just one object and are trying to parse the JSON as such, but this is not true. Each listing has only one price and one street_address, but can have many photos and features. This kernel will correctly load the data into a tibble using list-columns for the photos and features variables. The purrr package is extremely well suited for working with data like this and I recommend anyone who has not seen it before to check it out.", "link": "https://www.kaggle.com/danjordan/how-to-correctly-load-data-into-r", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-02-09 14:54:57", "date_scraped": "2020-12-13 17:56:15", "words": 132, "sentences": 6, "runtime": 0.0, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.5297103524208069, "description_category_runtime": 10.851, "description_subcategory": "Real Estate", "description_subcategory_score": 0.6302061080932617, "description_subcategory_runtime": 17.215, "category": "Real Estate, Rental & Leasing", "category_score": 0.5297103524208069, "subcategory": "Real Estate", "subcategory_score": 0.6302061080932617, "runtime_cat": 28.067, "programming_language": "R notebook", "ml_score": "0.5", "engagement_score": "0.745", "language_code": "en", "language_score": "0.9999962157113916", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "correctly load data rtheres number people asking load listing data r there incorrect solution posted want clear mistake everyone making parsing json expecting variable row contain one object trying parse json true listing one price one street_address many photo feature kernel correctly load data tibble using listcolumns photo feature variable purrr package extremely well suited working data like recommend anyone seen check", "tags_descriptive": []}