{"title": "Global Forecasting Covid-19 Random Forest", "description": "Global Covid-19 Forecasting using a Random ForestThis is a very simple starter submission kernel using a random forest. Feature engineering and tuning will help performance. As it turns out, it is very tough to make a RF algorithm properly extrapolate. Given the decision tree structure, conditional statements which recursively split the intpu space. There are ways to get random forests to predict values that fall outside the range of values of the targets in the training set, however I haven't become privy to these techniques. Take a look at the following: https://www.statworx.com/de/blog/time-series-forecasting-with-random-forest/Nevertheless, I will leave this notebook posted as an illustration, and we can consider week 1's submission as a bit of an experiment :-)", "link": "https://www.kaggle.com/dferhadi/global-forecasting-covid-19-random-forest", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-03-29 15:58:54", "date_scraped": "2020-12-12 18:11:58", "words": 115, "sentences": 6, "runtime": 0.002, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.04380207881331444, "description_category_runtime": 11.934, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7069309949874878, "description_subcategory_runtime": 18.291, "category": "Real Estate, Rental & Leasing", "category_score": 0.04380207881331444, "subcategory": "Machine Learning", "subcategory_score": 0.7069309949874878, "runtime_cat": 30.225, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.705", "language_code": "en", "language_score": "0.9999981366617492", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "global covid19 forecasting using random forestthis simple starter submission kernel using random forest feature engineering tuning help performance turn tough make rf algorithm properly extrapolate given decision tree structure conditional statement recursively split intpu space way get random forest predict value fall outside range value target training set however havent become privy technique take look following httpswwwstatworxcomdeblogtimeseriesforecastingwithrandomforestnevertheless leave notebook posted illustration consider week 1 submission bit experiment", "tags_descriptive": []}