{"title": "Lyft: Complete train and prediction pipeline", "description": "Lyft: Complete train and prediction pipeline (update for l5kit 1.1.0) The image from L5Kit official document: http://www.l5kit.org/README.html This notebook is updated to be compatible with the new lyft environment, see the discussion We did it all wrong and l5kit 1.1.0 release.For a high level overview, check out this article how to build a motion prediction model for autonomous vehicles. In this notebook I present an end-to-end train and prediction pipeline to predict vehicle motions with a pretrained model included. Unfortunately because of Kaggle memory constraint we can only either run the train part or the prediction part by toggling the parameters in the config part. Some of the code here are taken from the tutorial notebook and the following kernels:  Lyft: Training with multi-mode confidence Lyft: Prediction with multi-mode confidence  which is part of a wonderful series of introductory notebooks by corochann  Lyft: Comprehensive guide to start competition Lyft: Deep into the l5kit library Save your time, submit without kernel inference Lyft: pytorch implementation of evaluation metric Lyft: Training with multi-mode confidence Lyft: Prediction with multi-mode confidence  Note: This notebook aims to create the best single possible, i.e. without any ensemeble, which should only be done near the end of the competition. Since it is still early in the competition, this notebook is still a baseline, any suggestion to improve is appreciated.", "link": "https://www.kaggle.com/huanvo/lyft-complete-train-and-prediction-pipeline", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-10-11 14:27:02", "date_scraped": "2020-12-13 13:21:26", "words": 226, "sentences": 6, "sum_nltk": "Lyft: Complete train and prediction pipeline (update for l5kit 1.1.0) The image from L5Kit official document: http://www.l5kit.org/README.html This notebook is updated to be compatible with the new lyft environment, see the discussion We did it all wrong and l5kit 1.1.0 release.For a high level overview, check out this article how to build a motion prediction model for autonomous vehicles.\nIn this notebook I present an end-to-end train and prediction pipeline to predict vehicle motions with a pretrained model included.\nUnfortunately because of Kaggle memory constraint we can only either run the train part or the prediction part by toggling the parameters in the config part.\nSome of the code here are taken from the tutorial notebook and the following kernels:  Lyft: Training with multi-mode confidence Lyft: Prediction with multi-mode confidence  which is part of a wonderful series of introductory notebooks by corochann  Lyft: Comprehensive guide to start competition Lyft: Deep into the l5kit library Save your time, submit without kernel inference Lyft: pytorch implementation of evaluation metric Lyft: Training with multi-mode confidence Lyft: Prediction with multi-mode confidence  Note: This notebook aims to create the best single possible, i.e. without any ensemeble, which should only be done near the end of the competition.\nSince it is still early in the competition, this notebook is still a baseline, any suggestion to improve is appreciated.", "sum_nltk_words": 222, "sum_nltk_runtime": 0.003, "sum_t5": "this notebook is updated to be compatible with the new lyft environment. it aims to create the best single possible, i.e. without any ensemeble. since it is still early in the competition, this notebook is still a baseline. l5kit 1.1.0 is available now for free download.. if you want to improve this notebook, please contact corochann at l5kit.org.. if you have any questions, please contact corochann at", "sum_t5_words": 67, "sum_t5_runtime": 6.238, "runtime": 0.005, "nltk_category": "Utilities", "nltk_category_score": 0.09198721498250961, "nltk_category_runtime": 21.677, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6086364984512329, "nltk_subcategory_runtime": 34.886, "category": "Utilities", "category_score": 0.09198721498250961, "subcategory": "Machine Learning", "subcategory_score": 0.6086364984512329, "runtime_cat": 56.563, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.75", "language_code": "en", "language_score": "0.999997217704278", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "lyft complete train prediction pipeline update l5kit 110 image l5kit official document httpwwwl5kitorgreadmehtml notebook updated compatible new lyft environment see discussion wrong l5kit 110 releasefor high level overview check article build motion prediction model autonomous vehicle notebook present endtoend train prediction pipeline predict vehicle motion pretrained model included unfortunately kaggle memory constraint either run train part prediction part toggling parameter config part code taken tutorial notebook following kernel lyft training multimode confidence lyft prediction multimode confidence part wonderful series introductory notebook corochann lyft comprehensive guide start competition lyft deep l5kit library save time submit without kernel inference lyft pytorch implementation evaluation metric lyft training multimode confidence lyft prediction multimode confidence note notebook aim create best single possible ie without ensemeble done near end competition since still early competition notebook still baseline suggestion improve appreciated", "tags_descriptive": []}