{"title": "Cipher Challenge III Level 1", "description": "IntroductionTime to share solution of cipher level 1 so you can look at the next level.In the previous Cipher Challenge II one of the levels was a cipher with multiple substitutions generated from a key of length 8 if I remember correct. The level 1 of this Cipher Challenge III is the same kind but with a key of length 4, so only 4 substitutions are used for each character mapping. The cipher The cipher only apllies to UPPERCASE and LOWERCASE letters. The key only shifts every time an UPPERCASE or LOWERCASE letter is met.  PaddingFrom Cipher Challenge II it was found that padding could be done both up front and in the end. Number of padding characters in the end was always equal to or at most 1 character more (if number of characters to pad with was odd) than the number of padding characters up front. Level 1 solution", "link": "https://www.kaggle.com/kaggleuser58/cipher-challenge-iii-level-1", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-08-13 07:41:43", "date_scraped": "2020-12-12 17:56:23", "words": 152, "sentences": 7, "runtime": 0.002, "description_category": "Government and Public Works", "description_category_score": 0.27434900403022766, "description_category_runtime": 12.824, "description_subcategory": "Quality", "description_subcategory_score": 0.41433054208755493, "description_subcategory_runtime": 20.427, "category": "Government and Public Works", "category_score": 0.27434900403022766, "subcategory": "Quality", "subcategory_score": 0.41433054208755493, "runtime_cat": 33.251, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.653", "language_code": "en", "language_score": "0.9999975140154285", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductiontime share solution cipher level 1 look next levelin previous cipher challenge ii one level cipher multiple substitution generated key length 8 remember correct level 1 cipher challenge iii kind key length 4 4 substitution used character mapping cipher cipher apllies uppercase lowercase letter key shift every time uppercase lowercase letter met paddingfrom cipher challenge ii found padding could done front end number padding character end always equal 1 character number character pad odd number padding character front level 1 solution", "tags_descriptive": []}