{"title": "iMaterialist: Object Detection + Colors + EDA", "description": "Extensive EDA of iMaterialist (Fashion) Dataset with Object Detection and Color AnalysisThis notebook contains the exploration of iMaterialist Challenge (Fashion) at FGVC5 dataset About the iMaterialist (Fashion) Competition - As shoppers move online, it would be a dream come true to have products in photos classified automatically. But, automatic product recognition is tough because for the same product, a picture can be taken in different lighting, angles, backgrounds, and levels of occlusion. Meanwhile different fine-grained categories may look very similar, for example, royal blue vs turquoise in color. Many of today’s general-purpose recognition machines simply cannot perceive such subtle differences between photos, yet these differences could be important for shopping decisions. Tackling issues like this is why the Conference on Computer Vision and Pattern Recognition (CVPR) has put together a workshop specifically for data scientists focused on fine-grained visual categorization called the FGVC5 workshop. As part of this workshop, CVPR is partnering with Google, Wish, and Malong Technologies to challenge the data science community to help push the state of the art in automatic image classification. In this competition, FGVC workshop organizers with Wish and Malong Technologies challenge you to develop algorithms that will help with an important step towards automatic product detection – to accurately assign attribute labels for fashion images. Individuals/Teams with top submissions will be invited to present their work live at the FGVC5 workshop. Contents 1. Descriptive Statistics 1.1 Counts of Images and Labels   1.2 Top Labels in the dataset   1.3 Most Common Co-occuring Labels   1.4 Images with maxium Labels   1.5 Images with single Label   1.6 Freq Dist of Images in different label count buckets     2. Colors Used in the Images 2.1 Top Average Color of the images 2.2 Dominant Colors present in the images 2.3 Common Color Palletes   3. Object Detection 3.1 Top Colors Detected in the images 3.2 Top Objects Detected in the images", "link": "https://www.kaggle.com/djuuuu/imaterialist-object-detection-colors-eda", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-04-22 08:37:35", "date_scraped": "2020-12-12 21:47:00", "words": 326, "sentences": 12, "sum_nltk": "Extensive EDA of iMaterialist (Fashion) Dataset with Object Detection and Color AnalysisThis notebook contains the exploration of iMaterialist Challenge (Fashion) at FGVC5 dataset About the iMaterialist (Fashion) Competition - As shoppers move online, it would be a dream come true to have products in photos classified automatically.\nBut, automatic product recognition is tough because for the same product, a picture can be taken in different lighting, angles, backgrounds, and levels of occlusion.\nMeanwhile different fine-grained categories may look very similar, for example, royal blue vs turquoise in color.\nTackling issues like this is why the Conference on Computer Vision and Pattern Recognition (CVPR) has put together a workshop specifically for data scientists focused on fine-grained visual categorization called the FGVC5 workshop.\nAs part of this workshop, CVPR is partnering with Google, Wish, and Malong Technologies to challenge the data science community to help push the state of the art in automatic image classification.\nIn this competition, FGVC workshop organizers with Wish and Malong Technologies challenge you to develop algorithms that will help with an important step towards automatic product detection – to accurately assign attribute labels for fashion images.\nIndividuals/Teams with top submissions will be invited to present their work live at the FGVC5 workshop.", "sum_nltk_words": 199, "sum_nltk_runtime": 0.003, "sum_t5": "iMaterialist (Fashion) dataset contains the exploration of iMaterialist Challenge (Fashion) at FGVC5 dataset. a workshop specifically for data scientists focused on fine-grained visual categorization called the FGVC5 workshop. the workshop is partnering with Google, Wish, and Malong Technologies to challenge the data science community to help push the state of the art in automatic image classification. individual/teams with top submissions will be invited to present their work live", "sum_t5_words": 68, "sum_t5_runtime": 6.724, "runtime": 0.005, "nltk_category": "Wholesale & Retail", "nltk_category_score": 0.31453749537467957, "nltk_category_runtime": 19.388, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.6388005614280701, "nltk_subcategory_runtime": 30.811, "category": "Wholesale & Retail", "category_score": 0.31453749537467957, "subcategory": "Judicial Applied", "subcategory_score": 0.6388005614280701, "runtime_cat": 50.2, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.631", "language_code": "en", "language_score": "0.9999970400583663", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "extensive eda imaterialist fashion dataset object detection color analysisthis notebook contains exploration imaterialist challenge fashion fgvc5 dataset imaterialist fashion competition shopper move online would dream come true product photo classified automatically automatic product recognition tough product picture taken different lighting angle background level occlusion meanwhile different finegrained category may look similar example royal blue v turquoise color many today generalpurpose recognition machine simply cannot perceive subtle difference photo yet difference could important shopping decision tackling issue like conference computer vision pattern recognition cvpr put together workshop specifically data scientist focused finegrained visual categorization called fgvc5 workshop part workshop cvpr partnering google wish malong technology challenge data science community help push state art automatic image classification competition fgvc workshop organizer wish malong technology challenge develop algorithm help important step towards automatic product detection accurately assign attribute label fashion image individualsteams top submission invited present work live fgvc5 workshop content 1 descriptive statistic 11 count image label 12 top label dataset 13 common cooccuring label 14 image maxium label 15 image single label 16 freq dist image different label count bucket 2 color used image 21 top average color image 22 dominant color present image 23 common color palletes 3 object detection 31 top color detected image 32 top object detected image", "tags_descriptive": []}