{"title": "Brute force feature engineering", "description": "General informationWe all know that feature engineering is the most important things in competitions. If you have deep domain knowledge, you can create better features! Sadly, I have little domain knowledge (last time I paid attention to chemical formulas was in school)... So I'll to create a lot of features and hope that some of them work! Important! I have realized the main problem of features in my previous kernel: I created features based on the whole train/test set, but it makes much more sense to generate features based on molecules (for example mean distance per molecules). Let's try this!  ~Thanks to the new kaggle update we can write code in kernels and import it. This is much more convenient and useful. I'm moving all the functions I can into this script: https://www.kaggle.com/artgor/artgor-utils So if you see somewhere code like artgot_utils.function_name(parameters) - it is from this script~ Important: It seems that after forking the utility script isn't copied, so I have decided to move all the functions back into the kernel. But utility kernel can't be removed from the kernel... I hope I was able to deal with it.", "link": "https://www.kaggle.com/artgor/brute-force-feature-engineering", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "catboost", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-06-26 18:22:02", "date_scraped": "2020-12-12 17:53:35", "words": 190, "sentences": 8, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.6607867479324341, "description_category_runtime": 17.256, "description_subcategory": "General", "description_subcategory_score": 0.9265226721763611, "description_subcategory_runtime": 27.496, "category": "Utilities", "category_score": 0.6607867479324341, "subcategory": "General", "subcategory_score": 0.9265226721763611, "runtime_cat": 44.753, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.779", "language_code": "en", "language_score": "0.9999969122222349", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "general informationwe know feature engineering important thing competition deep domain knowledge create better feature sadly little domain knowledge last time paid attention chemical formula school ill create lot feature hope work important realized main problem feature previous kernel created feature based whole traintest set make much sense generate feature based molecule example mean distance per molecule let try thanks new kaggle update write code kernel import much convenient useful im moving function script httpswwwkagglecomartgorartgorutils see somewhere code like artgot_utilsfunction_nameparameters script important seems forking utility script isnt copied decided move function back kernel utility kernel cant removed kernel hope able deal", "tags_descriptive": []}