{"title": "TMDB Box Office Prediction EDA + ML", "description": "TMDB Box Office Prediction EDA + ML image-source In a world... where movies made an estimated $41.7 billion in 2018, the film industry is more popular than ever. But what movies make the most money at the box office? How much does a director matter? Or the budget? For some movies, it's \"You had me at 'Hello.'\" For others, the trailer falls short of expectations and you think \"What we have here is a failure to communicate.\" In this competition, you're presented with metadata on over 7,000 past films from The Movie Database to try and predict their overall worldwide box office revenue. Data points provided include cast, crew, plot keywords, budget, posters, release dates, languages, production companies, and countries. You can collect other publicly available data to use in your model predictions, but in the spirit of this competition, use only data that would have been available before a movie's release. Kernel in progress, is continuously being updated and extended", "link": "https://www.kaggle.com/praxitelisk/tmdb-box-office-prediction-eda-ml", "tags": ["Exploratory Data Analysis", "Regression"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-05-26 21:41:27", "date_scraped": "2020-12-13 17:40:32", "words": 161, "sentences": 6, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.1088423952460289, "description_category_runtime": 13.915, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.45529019832611084, "description_subcategory_runtime": 22.58, "category": "Education & Research", "category_score": 0.1088423952460289, "subcategory": "Machine Learning", "subcategory_score": 0.45529019832611084, "runtime_cat": 36.496, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.705", "language_code": "en", "language_score": "0.9999959849810742", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "tmdb box office prediction eda ml imagesource world movie made estimated 417 billion 2018 film industry popular ever movie make money box office much director matter budget movie hello others trailer fall short expectation think failure communicate competition youre presented metadata 7000 past film movie database try predict overall worldwide box office revenue data point provided include cast crew plot keywords budget poster release date language production company country collect publicly available data use model prediction spirit competition use data would available movie release kernel progress continuously updated extended", "tags_descriptive": ["Exploratory Data Analysis", "Regression"]}