{"title": "A Practical Guide to NY Taxi Data (0.379)", "description": "A Practical Guide to NY Taxi Data (0.379)2017/8/13 Weiying WangThe guide is aimed to assist beginners to understand the basic workflow of building a predictive model. Also I add descriptions to each steps that may save you some searching time. Hope you will find it helpful! I am welcome for any comment and suggestion that can help this kernel better. So far this competetion aroses lots of discussions and great analysis (the best analysis, I think, is probably Heads or Tails). The data provides a great opportunity of learning and applying things we learned at school. One must understand that 90% of the work is clean-up the data and acquire the relevent features, which is essential of getting a good analysis. There are already a lot of great kernels out there. Some of my features is from (Thanks for their dedication and great kernels!)  beluga Oscarleo Heads or Tails  This notebook is also available at my Github. Table of Content0. Import Modules and Data1. Features 1.1 Pickup Time and Weekend Features 1.2 Distance Features 1.2.1OSRM Features 1.2.2Appendix:Google Map API 1.2.2Other Distance Features   1.3 Location Features: K-means Clustering 1.4 Weather Features  2. Outliers 2.1 Outliers from 'trip_duration' 2.2 Outliers from Locations  3. Analysis of Features4. XGB Model: the Prediction of trip_duration 4.1 Using XGBoost Module 4.2 The Submission 4.3 Importance for each Feature", "link": "https://www.kaggle.com/onlyshadow/a-practical-guide-to-ny-taxi-data-0-379", "tags": ["Geospatial Analysis", "Xgboost", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-08-22 15:27:08", "date_scraped": "2020-12-13 14:39:46", "words": 228, "sentences": 14, "sum_nltk": "A Practical Guide to NY Taxi Data (0.379)2017/8/13 Weiying WangThe guide is aimed to assist beginners to understand the basic workflow of building a predictive model.\nI am welcome for any comment and suggestion that can help this kernel better.\nSo far this competetion aroses lots of discussions and great analysis (the best analysis, I think, is probably Heads or Tails).\nThe data provides a great opportunity of learning and applying things we learned at school.\nOne must understand that 90% of the work is clean-up the data and acquire the relevent features, which is essential of getting a good analysis.\nThere are already a lot of great kernels out there.\nSome of my features is from (Thanks for their dedication and great kernels!)  beluga Oscarleo Heads or Tails  This notebook is also available at my Github.\nImport Modules and Data1.\nFeatures 1.1 Pickup Time and Weekend Features 1.2 Distance Features 1.2.1OSRM Features 1.2.2Appendix:Google Map API 1.2.2Other Distance Features   1.3 Location Features: K-means Clustering 1.4 Weather Features  2.\nOutliers 2.1 Outliers from 'trip_duration' 2.2 Outliers from Locations  3.\nAnalysis of Features4.\nXGB Model: the Prediction of trip_duration 4.1 Using XGBoost Module 4.2 The Submission 4.3 Importance for each Feature", "sum_nltk_words": 194, "sum_nltk_runtime": 0.003, "sum_t5": "90% of the work is clean-up the data and acquire the relevent features. the best analysis, I think, is probably probably Heads or Tails. a practical guide to building a predictive model is available at my Github page. a 'heads or tails'-style kernel is available at my github page. a 'heads or tails'-style kernel is available at my github page.", "sum_t5_words": 60, "sum_t5_runtime": 4.764, "runtime": 0.003, "nltk_category": "Finance", "nltk_category_score": 0.13845382630825043, "nltk_category_runtime": 22.213, "nltk_subcategory": "Transportation", "nltk_subcategory_score": 0.7252805829048157, "nltk_subcategory_runtime": 35.208, "category": "Finance", "category_score": 0.13845382630825043, "subcategory": "Transportation", "subcategory_score": 0.7252805829048157, "runtime_cat": 57.421, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.733", "language_code": "en", "language_score": "0.9999963372384331", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "practical guide ny taxi data 03792017813 weiying wangthe guide aimed assist beginner understand basic workflow building predictive model also add description step may save searching time hope find helpful welcome comment suggestion help kernel better far competetion aroses lot discussion great analysis best analysis think probably head tail data provides great opportunity learning applying thing learned school one must understand 90 work cleanup data acquire relevent feature essential getting good analysis already lot great kernel feature thanks dedication great kernel beluga oscarleo head tail notebook also available github table content0 import module data1 feature 11 pickup time weekend feature 12 distance feature 121osrm feature 122appendixgoogle map api 122other distance feature 13 location feature kmeans clustering 14 weather feature 2 outlier 21 outlier trip_duration 22 outlier location 3 analysis features4 xgb model prediction trip_duration 41 using xgboost module 42 submission 43 importance feature", "tags_descriptive": ["Geospatial Analysis", "Xgboost", "Feature Engineering"]}