{"title": "APTOS : Eye Preprocessing in Diabetic Retinopathy", "description": "UPDATE on V9:This kernel have two important updates.  Before Version 8, I couldn't make Ben's and Cropping method work together nicely, so I emphasized on gray scale. Now, I adjust both functions and beleive that color version is better than gray scale.  Before Version 9, I found a bug that will cause an old crop function to fail in a private test set (it works fine on training and public test sets). Here, I fix that bug. However, I still cannot guarantee whether there will be any more cases on private test set that will fail the crop function. Update on V11 Now I was able to have a valid LB score with the new crop function, so if anybody still have some submission errors, that is the reason of other bugs.   update on V14. Compare to circle crop in Section 3.A2 according to @taindow : please visit his kernel : https://www.kaggle.com/taindow/pre-processing-train-and-test-images  Other minor updates. Note on estimation inconsistency and Aravind's history.", "link": "https://www.kaggle.com/ratthachat/aptos-eye-preprocessing-in-diabetic-retinopathy", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow", "sklearn", "opencv-python", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-09 08:07:58", "date_scraped": "2020-12-12 16:39:24", "words": 167, "sentences": 10, "runtime": 0.002, "description_category": "Agriculture", "description_category_score": 0.27208390831947327, "description_category_runtime": 15.771, "description_subcategory": "Quality", "description_subcategory_score": 0.28755414485931396, "description_subcategory_runtime": 25.444, "category": "Agriculture", "category_score": 0.27208390831947327, "subcategory": "Quality", "subcategory_score": 0.28755414485931396, "runtime_cat": 41.216, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.811", "language_code": "en", "language_score": "0.999996965986858", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "update v9this kernel two important update version 8 couldnt make ben cropping method work together nicely emphasized gray scale adjust function beleive color version better gray scale version 9 found bug cause old crop function fail private test set work fine training public test set fix bug however still cannot guarantee whether case private test set fail crop function update v11 able valid lb score new crop function anybody still submission error reason bug update v14 compare circle crop section 3a2 according taindow please visit kernel httpswwwkagglecomtaindowpreprocessingtrainandtestimages minor update note estimation inconsistency aravinds history", "tags_descriptive": ["Exploratory Data Analysis"]}