{"title": "Lyft: Training with multi-mode confidence", "description": "Lyft: Training with multi-mode confidence The image from L5Kit official document: http://www.l5kit.org/README.html Continued from the previous kernel:  Lyft: Comprehensive guide to start competition Lyft: Deep into the l5kit library  In this kernel, I will run pytorch CNN model training. Especially, followings are new items to try:  Predict multi-mode with confidence: As written in evaluation metric page, we can predict 3 modes of motion trajectory. Training loss with competition evaluation metric Use Training abstraction library pytorch-ignite and pytorch-pfn-extras.  [Update 2020/9/6] Published prediction kernel: Lyft: Prediction with multi-mode confidence Try yourself how good score you can get using only single model without ensemble! :)", "link": "https://www.kaggle.com/corochann/lyft-training-with-multi-mode-confidence", "tags": ["CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost", "lightgbm", "sklearn", "pytorch", "catboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-09-25 06:34:42", "date_scraped": "2020-12-13 13:21:26", "words": 106, "sentences": 4, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.17630304396152496, "description_category_runtime": 12.115, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8851000666618347, "description_subcategory_runtime": 18.524, "category": "Wholesale & Retail", "category_score": 0.17630304396152496, "subcategory": "Machine Learning", "subcategory_score": 0.8851000666618347, "runtime_cat": 30.639, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.734", "language_code": "en", "language_score": "0.9999979841705992", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "lyft training multimode confidence image l5kit official document httpwwwl5kitorgreadmehtml continued previous kernel lyft comprehensive guide start competition lyft deep l5kit library kernel run pytorch cnn model training especially following new item try predict multimode confidence written evaluation metric page predict 3 mode motion trajectory training loss competition evaluation metric use training abstraction library pytorchignite pytorchpfnextras update 202096 published prediction kernel lyft prediction multimode confidence try good score get using single model without ensemble", "tags_descriptive": ["Convolutional Neural Network (CNN)"]}