{"title": "EDA + Visualizations + simple baseline", "description": "1. Introduction There are already many projects underway to extensively monitor birds by continuously recording natural soundscapes over long periods. However, as many living and nonliving things make noise, the analysis of these datasets is often done manually by domain experts. These analyses are painstakingly slow, and results are often incomplete.   In this competition, you will identify a wide variety of bird vocalizations in soundscape recordings. Due to the complexity of the recordings, they contain weak labels. There might be anthropogenic sounds (e.g., airplane overflights) or other bird and non-bird (e.g., chipmunk) calls in the background, with a particular labeled bird species in the foreground. Bring your new ideas to build effective detectors and classifiers for analyzing complex soundscape recordings!  Which bird is this?", "link": "https://www.kaggle.com/rohitsingh9990/eda-visualizations-simple-baseline", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-08-06 21:38:44", "date_scraped": "2020-12-12 17:18:50", "words": 127, "sentences": 8, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.33390358090400696, "description_category_runtime": 12.001, "description_subcategory": "Quality", "description_subcategory_score": 0.5395295023918152, "description_subcategory_runtime": 18.513, "category": "Utilities", "category_score": 0.33390358090400696, "subcategory": "Quality", "subcategory_score": 0.5395295023918152, "runtime_cat": 30.514, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.688", "language_code": "en", "language_score": "0.9999950107037536", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "1 introduction already many project underway extensively monitor bird continuously recording natural soundscapes long period however many living nonliving thing make noise analysis datasets often done manually domain expert analysis painstakingly slow result often incomplete competition identify wide variety bird vocalization soundscape recording due complexity recording contain weak label might anthropogenic sound eg airplane overflight bird nonbird eg chipmunk call background particular labeled bird specie foreground bring new idea build effective detector classifier analyzing complex soundscape recording bird", "tags_descriptive": ["Exploratory Data Analysis"]}