{"title": "First pass through Data w/ 3D ConvNet", "description": "Applying a 3D convolutional neural network to the dataWelcome everyone to my coverage of the Kaggle Data Science Bowl 2017. My goal here is that anyone, even people new to kaggle, can follow along. If you are completely new to data science, I will do my best to link to tutorials and provide information on everything you need to take part. This notebook is my actual personal initial run through this data and my notes along the way. I am by no means an expert data analyst, statistician, and certainly not a doctor. This initial pass is not going to win the competition, but hopefully it can serve as a starting point or, at the very least, you can learn something new along with me. This is a \"raw\" look into the actual code I used on my first pass, there's a ton of room for improvment. If you see something that you could improve, share it with me! Quick introduction to Kaggle If you are new to kaggle, create an account, and start downloading the data. It's going to take a while. I found the torrent to download the fastest, so I'd suggest you go that route. When you create an account, head to competitions in the nav bar, choose the Data Science Bowl, then head to the \"data\" tab. You will need to accept the terms of the competition to proceed with downloading the data. Just in case you are new, how does all this work? In general, Kaggle competitions will come with training and testing data for you to build a model on, where both the training and testing data comes with labels so you can fit a model. Then there will be actual \"blind\" or \"out of sample\" testing data that you will actually use your model on, which will spit out an output CSV file with your predictions based on the input data. This is what you will upload to kaggle, and your score here is what you compete with. There's always a sample submission file in the dataset, so you can see how to exactly format your output predictions. In this case, the submission file should have two columns, one for the patient's id and another for the prediction of the liklihood that this patient has cancer, like: id,cancer 01e349d34c02410e1da273add27be25c,0.5 05a20caf6ab6df4643644c923f06a5eb,0.5 0d12f1c627df49eb223771c28548350e,0.5 ... You can submit up to 3 entries a day, so you want to be very happy with your model, and you are at least slightly disincentivised from trying to simply fit the answer key over time. It's still possible to cheat. If you do cheat, you wont win anything, since you will have to disclose your model for any prizes. At the end, you can submit 2 final submissions (allowing you to compete with 2 models if you like). This current competition is a 2 stage competition, where you have to participate in both stages to win. Stage one has you competing based on a validation dataset. At the release of stage 2, the validation set answers are released and then you make predictions on a new test set that comes out at the release of this second stage. About this specific competitionAt its core, the aim here is to take the sample data, consisting of low-dose CT scan information, and predict what the liklihood of a patient having lung cancer is. Your submission is scored based on the log loss of your predictions. The dataset is pretty large at ~140GB just in initial training data, so this can be somewhat restrictive right out of the gate. I am going to do my best to make this tutorial one that anyone can follow within the built-in Kaggle kernels Requirements and suggestions for following alongI will be using Python 3, and you should at least know the basics of Python 3. We will also be making use of: Pandas for some data analysis Matplotlib for data visualization You do not need to go through all of those tutorials to follow here, but, if you are confused, it might be useful to poke around those. For the actual dependency installs and such, I will link to them as we go. Alright, let's get started!", "link": "https://www.kaggle.com/sentdex/first-pass-through-data-w-3d-convnet", "tags": ["CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-02-10 15:10:32", "date_scraped": "2020-12-12 18:38:03", "words": 701, "sentences": 31, "sum_nltk": "If you are completely new to data science, I will do my best to link to tutorials and provide information on everything you need to take part.\nThis initial pass is not going to win the competition, but hopefully it can serve as a starting point or, at the very least, you can learn something new along with me.\nQuick introduction to Kaggle If you are new to kaggle, create an account, and start downloading the data.\nYou will need to accept the terms of the competition to proceed with downloading the data.\nThen there will be actual \"blind\" or \"out of sample\" testing data that you will actually use your model on, which will spit out an output CSV file with your predictions based on the input data.\nThere's always a sample submission file in the dataset, so you can see how to exactly format your output predictions.\nAt the end, you can submit 2 final submissions (allowing you to compete with 2 models if you like).\nAt the release of stage 2, the validation set answers are released and then you make predictions on a new test set that comes out at the release of this second stage.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.006, "sum_t5": "a kaggle data science bowl is taking place in california. the competition will come with training and testing data for you to build a model on. you will then be able to use your model to make predictions based on the input data. if you are completely new to kaggle, you can follow along. a kaggle user can submit a kaggle-based model to win a kaggle data science award.", "sum_t5_words": 69, "sum_t5_runtime": 6.802, "runtime": 0.005, "nltk_category": "Finance", "nltk_category_score": 0.41662949323654175, "nltk_category_runtime": 16.297, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.5051364302635193, "nltk_subcategory_runtime": 25.7, "category": "Finance", "category_score": 0.41662949323654175, "subcategory": "Machine Learning", "subcategory_score": 0.5051364302635193, "runtime_cat": 41.997, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.823", "language_code": "en", "language_score": "0.9999954389733284", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "applying 3d convolutional neural network datawelcome everyone coverage kaggle data science bowl 2017 goal anyone even people new kaggle follow along completely new data science best link tutorial provide information everything need take part notebook actual personal initial run data note along way mean expert data analyst statistician certainly doctor initial pas going win competition hopefully serve starting point least learn something new along raw look actual code used first pas there ton room improvment see something could improve share quick introduction kaggle new kaggle create account start downloading data going take found torrent download fastest id suggest go route create account head competition nav bar choose data science bowl head data tab need accept term competition proceed downloading data case new work general kaggle competition come training testing data build model training testing data come label fit model actual blind sample testing data actually use model spit output csv file prediction based input data upload kaggle score compete there always sample submission file dataset see exactly format output prediction case submission file two column one patient id another prediction liklihood patient cancer like idcancer 01e349d34c02410e1da273add27be25c05 05a20caf6ab6df4643644c923f06a5eb05 0d12f1c627df49eb223771c28548350e05 submit 3 entry day want happy model least slightly disincentivised trying simply fit answer key time still possible cheat cheat wont win anything since disclose model prize end submit 2 final submission allowing compete 2 model like current competition 2 stage competition participate stage win stage one competing based validation dataset release stage 2 validation set answer released make prediction new test set come release second stage specific competitionat core aim take sample data consisting lowdose ct scan information predict liklihood patient lung cancer submission scored based log loss prediction dataset pretty large 140gb initial training data somewhat restrictive right gate going best make tutorial one anyone follow within builtin kaggle kernel requirement suggestion following alongi using python 3 least know basic python 3 also making use panda data analysis matplotlib data visualization need go tutorial follow confused might useful poke around actual dependency installs link go alright let get started", "tags_descriptive": ["Convolutional Neural Network (CNN)"]}