{"title": "NFL Big Data Bowl - Plotting Player Position", "description": "NFL Big Data BowlPlotting the fieldUsing some code that I developed for last year's NFL challenege, this notebook shows how to plot player positions during a play on the football field. Using matplotlib we can call the create_football_field function to create a figure with the football field drawn out. You can then overlay any information from the training data to help visualize how players positions look on the field. The design is loosely based off of the 1991 video game Techo Super Bowl. A game which I spent many hours playing in my next door neighbor's basement growing up (I wasn't allowed to own a video game console so we had to play at his house).", "link": "https://www.kaggle.com/robikscube/nfl-big-data-bowl-plotting-player-position", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-10-14 22:42:48", "date_scraped": "2020-12-13 14:21:44", "words": 116, "sentences": 5, "runtime": 0.003, "description_category": "Utilities", "description_category_score": 0.003215248230844736, "description_category_runtime": 10.196, "description_subcategory": "Tools", "description_subcategory_score": 0.20597702264785767, "description_subcategory_runtime": 15.513, "category": "Utilities", "category_score": 0.003215248230844736, "subcategory": "Tools", "subcategory_score": 0.20597702264785767, "runtime_cat": 25.708, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.767", "language_code": "en", "language_score": "0.9999992746719584", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "nfl big data bowlplotting fieldusing code developed last year nfl challenege notebook show plot player position play football field using matplotlib call create_football_field function create figure football field drawn overlay information training data help visualize player position look field design loosely based 1991 video game techo super bowl game spent many hour playing next door neighbor basement growing wasnt allowed video game console play house", "tags_descriptive": []}