{"title": "M5 - Sales Uncertainty Prediction", "description": "M5 - Sales Uncertainty Prediction Sources and guidelines Preparing to start Loading packages Loading data   \"What is meant by probabilistic forecasting?\"... What is a grouped time series? How does the hierarchy look like? How can we generate forecasts for grouped timeseries?   The submission format Intro Prediction intervals and quartiles Aggregation levels Submission EDA   The Weighted Scaled Pinball loss The formula Playing with the loss implementation   The Naive method Prediction intervals for the Naive method Computing the loss for one timeseries of level 12   Facebook's Prophet LSTM and bootstrapped residuals Basic idea Setting up LSTM Fitting the model to the top-level series Check residuals for autocorrelation  Computing PIs using bootstrapped residuals   Where to go next?", "link": "https://www.kaggle.com/allunia/m5-sales-uncertainty-prediction", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-08 20:23:21", "date_scraped": "2020-12-13 13:24:02", "words": 127, "sentences": 2, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.062025949358940125, "description_category_runtime": 12.324, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.34633490443229675, "description_subcategory_runtime": 18.939, "category": "Wholesale & Retail", "category_score": 0.062025949358940125, "subcategory": "Machine Learning", "subcategory_score": 0.34633490443229675, "runtime_cat": 31.263, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.748", "language_code": "en", "language_score": "0.9999961745955225", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "m5 sale uncertainty prediction source guideline preparing start loading package loading data meant probabilistic forecasting grouped time series hierarchy look like generate forecast grouped timeseries submission format intro prediction interval quartile aggregation level submission eda weighted scaled pinball loss formula playing loss implementation naive method prediction interval naive method computing loss one timeseries level 12 facebooks prophet lstm bootstrapped residual basic idea setting lstm fitting model toplevel series check residual autocorrelation computing pi using bootstrapped residual go next", "tags_descriptive": ["Exploratory Data Analysis"]}