{"title": "Game of Life - Hashmap Solver", "description": "Game of Life - Hashmap SolverThe theoretical state space for Reverse Game of Life is 2^(25*25) = 1.4*10^188. However there is a 5-step warmup period for the start boards, meaning many possible T=-5 start patterns will naturally die out, thus reducing the state space for practical purposes. We can also take advantage of mirror/rotate/roll/flip symeteries of the board by using geometrically invarient hash functions. This notebook attempts to solve the Reverse Game of Life problem using only dictionary lookup and geometric transforms of the test dataset. UpdateI have updated the code to use a new Geometric Invariant Hash Function function that uses concentric circles rather than lines, and is better able to detect objects seperated by whitespace. I have also written a new Image Segmentation Solver which extends the ideas in this notebook to use image segmentation techniques. This gets a suprising high score of 0.08631 which is almost matches the 0.08549 score of my Z3 Constraint Satisfaction Solver after 1000s of hours of CPU runtime.", "link": "https://www.kaggle.com/jamesmcguigan/game-of-life-hashmap-solver", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-11-27 02:58:22", "date_scraped": "2020-12-12 17:58:02", "words": 166, "sentences": 7, "runtime": 0.003, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.016842085868120193, "description_category_runtime": 16.208, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.1656227707862854, "description_subcategory_runtime": 25.996, "category": "Biotechnological & Life Sciences", "category_score": 0.016842085868120193, "subcategory": "Machine Learning", "subcategory_score": 0.1656227707862854, "runtime_cat": 42.204, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.617", "language_code": "en", "language_score": "0.9999973492269045", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "game life hashmap solverthe theoretical state space reverse game life 22525 1410188 however 5step warmup period start board meaning many possible t5 start pattern naturally die thus reducing state space practical purpose also take advantage mirrorrotaterollflip symeteries board using geometrically invarient hash function notebook attempt solve reverse game life problem using dictionary lookup geometric transforms test dataset updatei updated code use new geometric invariant hash function function us concentric circle rather line better able detect object seperated whitespace also written new image segmentation solver extends idea notebook use image segmentation technique get suprising high score 008631 almost match 008549 score z3 constraint satisfaction solver 1000 hour cpu runtime", "tags_descriptive": []}