{"title": "Simple Exploration + Baseline Notebook - Avito", "description": "About the Competition: Avito, Russia’s largest classified advertisements website, is hosting its fourth Kaggle competition. The challenge is to predict demand for an online advertisement based on its full description (title, description, images, etc.), its context (geographically where it was posted, similar ads already posted) and historical demand for similar ads in similar contexts. About the Notebook: One more exciting competition ahead and this involves both NLP (text data in Russian) and Image data along with numerical . In this notebook, let us get into the basic data exploration using python. Thanks to Yandex Translate, I was able to get english names for the russian names and used them whenever possible. Most of the plots are in plotly and so please hover over them to see more details.", "link": "https://www.kaggle.com/sudalairajkumar/simple-exploration-baseline-notebook-avito", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-04-27 14:54:57", "date_scraped": "2020-12-12 16:57:26", "words": 128, "sentences": 6, "runtime": 0.0, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.19498245418071747, "description_category_runtime": 11.877, "description_subcategory": "Student", "description_subcategory_score": 0.32915791869163513, "description_subcategory_runtime": 18.209, "category": "Real Estate, Rental & Leasing", "category_score": 0.19498245418071747, "subcategory": "Student", "subcategory_score": 0.32915791869163513, "runtime_cat": 30.086, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.785", "language_code": "en", "language_score": "0.9999970320819471", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "competition avito russia largest classified advertisement website hosting fourth kaggle competition challenge predict demand online advertisement based full description title description image etc context geographically posted similar ad already posted historical demand similar ad similar context notebook one exciting competition ahead involves nlp text data russian image data along numerical notebook let u get basic data exploration using python thanks yandex translate able get english name russian name used whenever possible plot plotly please hover see detail", "tags_descriptive": []}