{"title": "A First Crack: Tools, Tips & 3 Cipher Solutions", "description": "A First Crack: Tools, Tips & 3 Cipher SolutionsTo get started on this Kaggle competition, we will need some tools for cracking simple ciphers. This kernel explores the data, creates some helpful functionality for all ciphers, and applies them to cracking the first three ciphers.  Loading the Source Data (Important!) Utility Functions Characteristics of Plaintext Data Length of the newsgroup documents (before being split into 300 char strings) Distribution of ASCII characters in plaintext Dictionary of most common words in the plaintext source   Cracking Cipher#1 Matching the observed character frequencies Optimizing the decryption with word frequency similarity (or ngrams) Finding actual plaintext in the source and fine-tuning   Cracking Cipher #2 Cracking Cipher #3 Make Predictions  In working on this, many thanks is due to:  Practical Cryptography for a summary of classic ciphers The scikit-learn tutorial for text data using the same \"20 Newgroups\" dataset   Hope you found this public kernel to be helpful!", "link": "https://www.kaggle.com/rturley/a-first-crack-tools-tips-3-cipher-solutions", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "vocabulary", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-01-16 08:08:25", "date_scraped": "2020-12-12 16:01:56", "words": 162, "sentences": 3, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.9313449859619141, "description_category_runtime": 15.363, "description_subcategory": "Tools", "description_subcategory_score": 0.955763578414917, "description_subcategory_runtime": 24.032, "category": "Utilities", "category_score": 0.9313449859619141, "subcategory": "Tools", "subcategory_score": 0.955763578414917, "runtime_cat": 39.395, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.709", "language_code": "en", "language_score": "0.9999974314062126", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "first crack tool tip 3 cipher solutionsto get started kaggle competition need tool cracking simple cipher kernel explores data creates helpful functionality cipher applies cracking first three cipher loading source data important utility function characteristic plaintext data length newsgroup document split 300 char string distribution ascii character plaintext dictionary common word plaintext source cracking cipher1 matching observed character frequency optimizing decryption word frequency similarity ngrams finding actual plaintext source finetuning cracking cipher 2 cracking cipher 3 make prediction working many thanks due practical cryptography summary classic cipher scikitlearn tutorial text data using 20 newgroups dataset hope found public kernel helpful", "tags_descriptive": ["Exploratory Data Analysis"]}