{"title": "Introduction to physiological data", "description": "Introduction to physiological dataIn this example, we're given three main physiological parameters:  Respiration Electrocardiogram (ECG) Electroencephalogram (EEG)  We'll talk through each of these in turn, some of their limitations, and how to process the data. I'm not going to talk about the galvanic skin response because it's use is, suffice to say, controversial. A short note on noise sourcesBiological sensors are quite susceptible to noise from outside sources. This can include lights (flickering at 50/60Hz depending on your AC frequency), and other electrical equipment. I think it's reasonable to assume that this experiment was in a chamber with a tonne of unshielded electronic high-tech stuff, all leaking noise at various frequencies. Hopefully this would be consistent between recordings, but it does make analysis more challenging, since removing any noise will usually remove a bit of signal too. RespirationThis is a simple measure of the rise and fall of the chest. It represents muscle activity of the diapragm and abdomen. We know that when someone is physiologically stressed, this rate increases. Could be interesting. Unfortunately, when we plot this data out, it seems to be largely affected by noise.", "link": "https://www.kaggle.com/stuartbman/introduction-to-physiological-data", "tags": ["Healthcare"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-01-18 17:13:10", "date_scraped": "2020-12-13 16:35:26", "words": 190, "sentences": 11, "runtime": 0.005, "description_category": "Healthcare", "description_category_score": 0.19261057674884796, "description_category_runtime": 17.491, "description_subcategory": "Physical", "description_subcategory_score": 0.4633236527442932, "description_subcategory_runtime": 27.709, "category": "Healthcare", "category_score": 0.19261057674884796, "subcategory": "Physical", "subcategory_score": 0.4633236527442932, "runtime_cat": 45.201, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.7", "language_code": "en", "language_score": "0.9999958643116365", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introduction physiological datain example given three main physiological parameter respiration electrocardiogram ecg electroencephalogram eeg well talk turn limitation process data im going talk galvanic skin response use suffice say controversial short note noise sourcesbiological sensor quite susceptible noise outside source include light flickering 5060hz depending ac frequency electrical equipment think reasonable assume experiment chamber tonne unshielded electronic hightech stuff leaking noise various frequency hopefully would consistent recording make analysis challenging since removing noise usually remove bit signal respirationthis simple measure rise fall chest represents muscle activity diapragm abdomen know someone physiologically stressed rate increase could interesting unfortunately plot data seems largely affected noise", "tags_descriptive": ["Healthcare"]}