{"title": "Fork_from_BiLSTM-attention-Kfold-0115 81a8d9", "description": "PrefaceHello . This is basically cutting and pasting from the amazing kernels of this competition. Please notify me if I don't attribute something correctly.  https://www.kaggle.com/gmhost/gru-capsule How to: Preprocessing when using embeddings https://www.kaggle.com/christofhenkel/how-to-preprocessing-when-using-embeddings Improve your Score with some Text Preprocessing https://www.kaggle.com/theoviel/improve-your-score-with-some-text-preprocessing Simple attention layer taken from https://github.com/mttk/rnn-classifier/blob/master/model.py https://www.kaggle.com/ziliwang/baseline-pytorch-bilstm https://www.kaggle.com/hengzheng/pytorch-starter  UPDATE: I seems that the shuffling the data doesn't add the features in the correct order. To address this issue I added a custom dataset class that can return indexes so that they can be accessed while training and properly put each feature with the corresponding sample. The training time though is increased, so you might need to make the model lighter in order to submit results.", "link": "https://www.kaggle.com/jannen/reaching-0-7-fork-from-bilstm-attention-kfold", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "nltk", "sklearn", "spacy", "textblob", "pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-01-19 10:07:56", "date_scraped": "2020-12-13 16:20:43", "words": 117, "sentences": 6, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.20441021025180817, "description_category_runtime": 18.831, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.24961957335472107, "description_subcategory_runtime": 29.609, "category": "Wholesale & Retail", "category_score": 0.20441021025180817, "subcategory": "Machine Learning", "subcategory_score": 0.24961957335472107, "runtime_cat": 48.441, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.756", "language_code": "en", "language_score": "0.9999967932171832", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "prefacehello basically cutting pasting amazing kernel competition please notify dont attribute something correctly httpswwwkagglecomgmhostgrucapsule preprocessing using embeddings httpswwwkagglecomchristofhenkelhowtopreprocessingwhenusingembeddings improve score text preprocessing httpswwwkagglecomtheovielimproveyourscorewithsometextpreprocessing simple attention layer taken httpsgithubcommttkrnnclassifierblobmastermodelpy httpswwwkagglecomziliwangbaselinepytorchbilstm httpswwwkagglecomhengzhengpytorchstarter update seems shuffling data doesnt add feature correct order address issue added custom dataset class return index accessed training properly put feature corresponding sample training time though increased might need make model lighter order submit result", "tags_descriptive": []}