{"title": "Starter's Pack for Invasives Detection", "description": "Starter's Pack for Invasive Species DetectionHello everyone! This is Chris, the main researcher behind the dataset featured in this competition!First of all, we want to send a huge amount of thanks to Kaggle for making this nonprofit competition a real thing! I am here to help everyone getting a head start in the competition! We are going to be building a pretty simple yet very powerful classificator based on the blog entry \"Building powerful image classification models using very little data\" by F. Chollet. We are going to make use of Keras (Theano as backend) and the VGG16 pretrained weights. We will build our own fully connected layers to replace the top of VGG16 and later fine-tune the model for a few epochs (so we get some juicy extra AUC points in the leaderboard). The training is light, so it should run in an average Intel I5 laptop's CPU overnight! To keep the code as similar as possible to the blog entry, this notebook is compiling together what in the blog are 2 different scripts. We are doing so sequentially, so it is easier to go to the source blog and get better understanding. First, we are going to predict features for our training and validation sets for the last convolutional layers and save those to disk. Then we are going to use those predicted features to train our little fully connected model that will tell us whether there is or not an invasive species.", "link": "https://www.kaggle.com/crequena/starter-s-pack-for-invasives-detection", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-05-07 00:05:20", "date_scraped": "2020-12-13 12:11:50", "words": 245, "sentences": 8, "sum_nltk": "Starter's Pack for Invasive Species DetectionHello everyone!\nThis is Chris, the main researcher behind the dataset featured in this competition!First of all, we want to send a huge amount of thanks to Kaggle for making this nonprofit competition a real thing!\nWe are going to be building a pretty simple yet very powerful classificator based on the blog entry \"Building powerful image classification models using very little data\" by F.\nWe are going to make use of Keras (Theano as backend) and the VGG16 pretrained weights.\nWe will build our own fully connected layers to replace the top of VGG16 and later fine-tune the model for a few epochs (so we get some juicy extra AUC points in the leaderboard).\nThe training is light, so it should run in an average Intel I5 laptop's CPU overnight!\nWe are doing so sequentially, so it is easier to go to the source blog and get better understanding.\nFirst, we are going to predict features for our training and validation sets for the last convolutional layers and save those to disk.\nThen we are going to use those predicted features to train our little fully connected model that will tell us whether there is or not an invasive species.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.003, "sum_t5": "a dataset from a nonprofit competition will be used to classify invasive species. the dataset will be used to train a model that will tell us whether there is an invasive species. the competition is open to all ages and is open to all ages. the dataset will be available in november. back to mail online home. back to the page you came from.. back to the page you came from..", "sum_t5_words": 71, "sum_t5_runtime": 4.676, "runtime": 0.003, "nltk_category": "Agriculture", "nltk_category_score": 0.17237038910388947, "nltk_category_runtime": 17.791, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9869301319122314, "nltk_subcategory_runtime": 28.572, "category": "Agriculture", "category_score": 0.17237038910388947, "subcategory": "Machine Learning", "subcategory_score": 0.9869301319122314, "runtime_cat": 46.365, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.68", "language_code": "en", "language_score": "0.9999984843750775", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "starter pack invasive specie detectionhello everyone chris main researcher behind dataset featured competitionfirst want send huge amount thanks kaggle making nonprofit competition real thing help everyone getting head start competition going building pretty simple yet powerful classificator based blog entry building powerful image classification model using little data f chollet going make use kera theano backend vgg16 pretrained weight build fully connected layer replace top vgg16 later finetune model epoch get juicy extra auc point leaderboard training light run average intel i5 laptop cpu overnight keep code similar possible blog entry notebook compiling together blog 2 different script sequentially easier go source blog get better understanding first going predict feature training validation set last convolutional layer save disk going use predicted feature train little fully connected model tell u whether invasive specie", "tags_descriptive": []}