{"title": "Prudential_Only Random_Forest", "description": "Problem StatementIn a one-click shopping world with on-demand everything, the life insurance application process is antiquated. Customers provide extensive information to identify risk classification and eligibility, including scheduling medical exams, a process that takes an average of 30 days. The result? People are turned off. That’s why only 40% of U.S. households own individual life insurance. Prudential wants to make it quicker and less labor intensive for new and existing customers to get a quote while maintaining privacy boundaries. By developing a predictive model that accurately classifies rirted tosk using a more automated approach, you can greatly impact public perception of the industry. The results will help Prudential better understand the predictive power of the data points in the existing assessment, enabling us to significantly streamline the process. For learning purpose , multiclasss classification has been converted to a two class classification problem", "link": "https://www.kaggle.com/gauravkkaushik/prudential-random-forest-and-xgb-classifier", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-30 23:23:37", "date_scraped": "2020-12-13 16:12:52", "words": 143, "sentences": 9, "runtime": 0.002, "description_category": "Emergency & Relief", "description_category_score": 0.13117602467536926, "description_category_runtime": 12.753, "description_subcategory": "Insurance and Risk", "description_subcategory_score": 0.6954431533813477, "description_subcategory_runtime": 19.664, "category": "Emergency & Relief", "category_score": 0.13117602467536926, "subcategory": "Insurance and Risk", "subcategory_score": 0.6954431533813477, "runtime_cat": 32.418, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.655", "language_code": "en", "language_score": "0.999996487577177", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "problem statementin oneclick shopping world ondemand everything life insurance application process antiquated customer provide extensive information identify risk classification eligibility including scheduling medical exam process take average 30 day result people turned thats 40 u household individual life insurance prudential want make quicker le labor intensive new existing customer get quote maintaining privacy boundary developing predictive model accurately classifies rirted tosk using automated approach greatly impact public perception industry result help prudential better understand predictive power data point existing assessment enabling u significantly streamline process learning purpose multiclasss classification converted two class classification problem", "tags_descriptive": []}