{"title": " EDA and Preprocessing for BERT", "description": "ObjectiveSentiment analysis is a common use case of NLP where the idea is to classify the tweet as positive, negative or neutral depending upon the text in the tweet. This problem goes a way ahead and expects us to also determine the words in the tweet which decide the polarity of the tweet. Understanding the Evaluation MetricThe metric in this competition is the word-level Jaccard score. Jaccard Score is a measure of how similar/dissimilar two sets are.  The higher the score, the more similar the two strings. The idea is to find the number of common tokens and divide it by the total number of unique tokens. Its expressed in the mathematical terms by,   Source Here is a great example to understand the Jaccard Similarity Metric in an inutitve way.Refer to the main blog for more details:FIVE MOST POPULAR SIMILARITY MEASURES IMPLEMENTATION IN PYTHON  Here is how one can implement the jaccard score in Python:", "link": "https://www.kaggle.com/parulpandey/eda-and-preprocessing-for-bert", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "nltk", "vocabulary"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-25 04:29:46", "date_scraped": "2020-12-13 17:53:52", "words": 159, "sentences": 7, "runtime": 0.002, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.038553863763809204, "description_category_runtime": 14.554, "description_subcategory": "Student", "description_subcategory_score": 0.12469463795423508, "description_subcategory_runtime": 23.18, "category": "Real Estate, Rental & Leasing", "category_score": 0.038553863763809204, "subcategory": "Student", "subcategory_score": 0.12469463795423508, "runtime_cat": 37.734, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.764", "language_code": "en", "language_score": "0.9999968381451936", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "objectivesentiment analysis common use case nlp idea classify tweet positive negative neutral depending upon text tweet problem go way ahead expects u also determine word tweet decide polarity tweet understanding evaluation metricthe metric competition wordlevel jaccard score jaccard score measure similardissimilar two set higher score similar two string idea find number common token divide total number unique token expressed mathematical term source great example understand jaccard similarity metric inutitve wayrefer main blog detailsfive popular similarity measure implementation python one implement jaccard score python", "tags_descriptive": []}