{"title": "Taxi fare prediction with Keras deep learning", "description": "This is an adaptation of the Coursera code (originally built with tensorflow), on this one i used Keras to make the model part simpler, maybe it can help people that are new to deep learning or anyone else that want to use Keras on this competition.Notes: Link for a tensorflow version Link for a more complete version on Github I'm not using \"passenger count\" because it something that is not supposed to really matter in this case. I've created two features derived from \"hour\" (night and late night), according to some research i did it's added an additional value if it's a business day (mon ~ fri), and it's night, also there's another added value if it's dawn. I'm binning latitudes and longitudes to make it easier to work with. Even tough deep learning is robust enough to deal with noisy data, i'm removing outliers (it may save some memory). Currently i'm using both Euclidean and Manhattan distances, it may be a bit redundant, but they have a different meaning and i'm still not sure of witch one is better(if you have some insights about this please let me know)", "link": "https://www.kaggle.com/dimitreoliveira/taxi-fare-prediction-with-keras-deep-learning", "tags": ["DL", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-29 20:51:17", "date_scraped": "2020-12-13 14:20:01", "words": 190, "sentences": 5, "runtime": 0.0, "description_category": "Accommodation & Food", "description_category_score": 0.23415377736091614, "description_category_runtime": 16.566, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9397323131561279, "description_subcategory_runtime": 26.401, "category": "Accommodation & Food", "category_score": 0.23415377736091614, "subcategory": "Machine Learning", "subcategory_score": 0.9397323131561279, "runtime_cat": 42.967, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.751", "language_code": "en", "language_score": "0.9999960213509981", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "adaptation coursera code originally built tensorflow one used kera make model part simpler maybe help people new deep learning anyone else want use kera competitionnotes link tensorflow version link complete version github im using passenger count something supposed really matter case ive created two feature derived hour night late night according research added additional value business day mon fri night also there another added value dawn im binning latitude longitude make easier work even tough deep learning robust enough deal noisy data im removing outlier may save memory currently im using euclidean manhattan distance may bit redundant different meaning im still sure witch one betterif insight please let know", "tags_descriptive": ["Deep Learning (DL)", "Feature Engineering"]}