{"title": "[0.53x] Clustering using Hough features - Basic", "description": "In this notebook, I would like to use the Hough transform to cluster hits. This notebook is therefore, get some materials from the past published kernels, In the previous notebook, we see a function relating phi and r like (where r=√x2+y2r=x2+y2−−−−−−√, ϕ=arctan2(y/x)ϕ=arctan2(y/x)): ϕnew=ϕ+i(ar+br2),ϕnew=ϕ+i(ar+br2), where ii is increased incrementally from 0 (straight tracks) to some number (curve tracks). However, the above equation is not exact to relate those two features. Instead, one might want to use the Hough transform: r2r0=cos(ϕ−θ)r2r0=cos(ϕ−θ) In the above equation, ϕϕ and rr are the original ϕϕ and rr of each hit, while r0r0 and θθ are the rr and ϕϕ of a specific point in the XY plane, that is the origin of a circle in XY plane. That circle passes through the inspected hit. Then, our clustering problem can be stated this way:  For each 12r012r0, starting from 0 (corresponding to straight tracks), to an appropriate stopping point, we calculate θ=ϕ−arccos(r2r0)θ=ϕ−arccos(r2r0) Group all hits with the near θθ and some other features to a detected track by DBSCAN. Since θθ can take very large or small values, using sin(θ)sin(θ) and cos(θ)cos(θ) is better.", "link": "https://www.kaggle.com/khahuras/0-53x-clustering-using-hough-features-basic", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-07-26 09:04:39", "date_scraped": "2020-12-13 17:43:28", "words": 189, "sentences": 7, "runtime": 0.0, "description_category": "Physics", "description_category_score": 0.3139890730381012, "description_category_runtime": 27.95, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.721573531627655, "description_subcategory_runtime": 44.958, "category": "Physics", "category_score": 0.3139890730381012, "subcategory": "Machine Learning", "subcategory_score": 0.721573531627655, "runtime_cat": 72.908, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.689", "language_code": "en", "language_score": "0.9999982507912726", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notebook would like use hough transform cluster hit notebook therefore get material past published kernel previous notebook see function relating phi r like rx2y2rx2y2 arctan2yxarctan2yx newiarbr2newiarbr2 ii increased incrementally 0 straight track number curve track however equation exact relate two feature instead one might want use hough transform r2r0cosr2r0cos equation rr original rr hit r0r0 rr specific point xy plane origin circle xy plane circle pass inspected hit clustering problem stated way 12r012r0 starting 0 corresponding straight track appropriate stopping point calculate arccosr2r0arccosr2r0 group hit near feature detected track dbscan since take large small value using sinsin coscos better", "tags_descriptive": []}