{"title": "CERN Simple Classification Models", "description": "Flavors of Physics This is a problem that is not easy to understand for someone who is not into Quantum Physics. Though a bit intriguing, the problem seems to be very interesting. In simple terms, as I could undertand, the scientists are trying to observe the decay of tau to three muons - a phenomenon that is very rare.  The null hypothesis is that this decay does not happen and the idea here is to see that the decay happens more than what is currently known. The dataset consists of real and simulated events. Real events (or Background events or those with Signal value = 0) and Simulated Events (or Signal Events or those with Signal value = 1) are part of the dataset. The analysis is to be done on the entire dataset to classify the data based on various attributes. Before the algorithm is evaluated (based on AUC metric), the algorithm needs to pass through Agreement Test and Correlation Test. The code for these tests is provided along with the dataset.", "link": "https://www.kaggle.com/achal71/cern-simple-classification-models", "tags": ["Classification"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-09-22 13:49:40", "date_scraped": "2020-12-12 19:55:11", "words": 174, "sentences": 9, "runtime": 0.002, "description_category": "Physics", "description_category_score": 0.988917887210846, "description_category_runtime": 14.209, "description_subcategory": "Physical", "description_subcategory_score": 0.2270658165216446, "description_subcategory_runtime": 21.982, "category": "Physics", "category_score": 0.988917887210846, "subcategory": "Physical", "subcategory_score": 0.2270658165216446, "runtime_cat": 36.191, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.622", "language_code": "en", "language_score": "0.9999970517522302", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "flavor physic problem easy understand someone quantum physic though bit intriguing problem seems interesting simple term could undertand scientist trying observe decay tau three muon phenomenon rare null hypothesis decay happen idea see decay happens currently known dataset consists real simulated event real event background event signal value 0 simulated event signal event signal value 1 part dataset analysis done entire dataset classify data based various attribute algorithm evaluated based auc metric algorithm need pas agreement test correlation test code test provided along dataset", "tags_descriptive": ["Classification"]}