{"title": "RAPIDS Ensemble for TReNDS Neuroimaging", "description": "This is an ensemble version of @aerdem4's excellent SVM notebook that can be found here: https://www.kaggle.com/aerdem4/rapids-svm-on-trends-neuroimaging Rapids is an open-source GPU accelerated Data Sceince and Machine Learning library, developed and mainatained by Nvidia. It is designed to be compatible with many existing CPU tools, such as Pandas, scikit-learn, numpy, etc. It enables massive acceleration of many data-science and machine learning tasks, oftentimes by a factor fo 100X, or even more. Rapids is still undergoing developemnt, and as of right now it's not availabel in the Kaggle Docker environment. If you are interested in installing and riunning Rapids locally on your own machine, then you should refer to the followong instructions.", "link": "https://www.kaggle.com/tunguz/rapids-ensemble-for-trends-neuroimaging", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-07-01 02:22:40", "date_scraped": "2020-12-13 17:52:38", "words": 110, "sentences": 5, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.05659523978829384, "description_category_runtime": 12.953, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.43947309255599976, "description_subcategory_runtime": 20.546, "category": "Education & Research", "category_score": 0.05659523978829384, "subcategory": "Machine Learning", "subcategory_score": 0.43947309255599976, "runtime_cat": 33.5, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.752", "language_code": "en", "language_score": "0.9999980514567456", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "ensemble version aerdem4s excellent svm notebook found httpswwwkagglecomaerdem4rapidssvmontrendsneuroimaging rapid opensource gpu accelerated data sceince machine learning library developed mainatained nvidia designed compatible many existing cpu tool panda scikitlearn numpy etc enables massive acceleration many datascience machine learning task oftentimes factor fo 100x even rapid still undergoing developemnt right availabel kaggle docker environment interested installing riunning rapid locally machine refer followong instruction", "tags_descriptive": []}