{"title": "Interactive Porto Insights - A Plot.ly Tutorial", "description": "IntroductionThis competition is hosted by the third largest insurance company in Brazil: Porto Seguro with the task of predicting the probability that a driver will initiate an insurance claim in the next year. This notebook will aim to provide some interactive charts and analysis of the competition data by way of the Python visualisation library Plot.ly and hopefully bring some insights and beautiful plots that others can take and replicate. Plot.ly is one of the main products offered by the software company - Plotly which specializes in providing online graphical and statistical visualisations (charts and dashboards) as well as providing an API to a whole rich suite of programming languages and tools such as Python, R, Matlab, Node.js etc. Listed below for easy convenience are links to the various Plotly plots in this notebook:  Simple horizontal bar plot - Used to inspect the Target variable distribution Correlation Heatmap plot  - Inspect the correlation between the different features Scatter plot - Compare the feature importances generated by Random Forest and Gradient-Boosted model Vertical bar plot - List in Descending order, the importance of the various features 3D Scatter plot   The themes in this notebook can be briefly summarized follows: 1. Data Quality Checks - Visualising and evaluating all missing/Null values (values that are -1) 2. Feature inspection and filtering - Correlation and feature Mutual information plots against the target variable. Inspection of the Binary, categorical and other variables. 3. Feature importance ranking via learning models  /n Building a Random Forest and Gradient Boosted model to help us rank features based off the learning process. Let's Go", "link": "https://www.kaggle.com/arthurtok/interactive-porto-insights-a-plot-ly-tutorial", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-12-13 18:01:55", "date_scraped": "2020-12-13 15:44:39", "words": 270, "sentences": 10, "sum_nltk": "This notebook will aim to provide some interactive charts and analysis of the competition data by way of the Python visualisation library Plot.ly and hopefully bring some insights and beautiful plots that others can take and replicate.\nPlot.ly is one of the main products offered by the software company - Plotly which specializes in providing online graphical and statistical visualisations (charts and dashboards) as well as providing an API to a whole rich suite of programming languages and tools such as Python, R, Matlab, Node.js etc.\nListed below for easy convenience are links to the various Plotly plots in this notebook:  Simple horizontal bar plot - Used to inspect the Target variable distribution Correlation Heatmap plot  - Inspect the correlation between the different features Scatter plot - Compare the feature importances generated by Random Forest and Gradient-Boosted model Vertical bar plot - List in Descending order, the importance of the various features 3D Scatter plot   The themes in this notebook can be briefly summarized follows: 1.\nFeature inspection and filtering - Correlation and feature Mutual information plots against the target variable.\n3. Feature importance ranking via learning models  /n Building a Random Forest and Gradient Boosted model to help us rank features based off the learning process.", "sum_nltk_words": 208, "sum_nltk_runtime": 0.003, "sum_t5": "notebook will aim to provide some interactive charts and analysis of the competition data by way of the Python visualisation library Plot.ly. Listed below for easy convenience are links to the various plots in this notebook. a total of 57 plots will be created using the Python visualisation library. a total of 57 plots will be created using the Python visualisation library. a total of 57 plots will be created using the Python visualisation library.", "sum_t5_words": 75, "sum_t5_runtime": 5.823, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.43622466921806335, "nltk_category_runtime": 17.608, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6733047366142273, "nltk_subcategory_runtime": 28.135, "category": "Utilities", "category_score": 0.43622466921806335, "subcategory": "Machine Learning", "subcategory_score": 0.6733047366142273, "runtime_cat": 45.742, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.799", "language_code": "en", "language_score": "0.9999971512888906", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionthis competition hosted third largest insurance company brazil porto seguro task predicting probability driver initiate insurance claim next year notebook aim provide interactive chart analysis competition data way python visualisation library plotly hopefully bring insight beautiful plot others take replicate plotly one main product offered software company plotly specializes providing online graphical statistical visualisation chart dashboard well providing api whole rich suite programming language tool python r matlab nodejs etc listed easy convenience link various plotly plot notebook simple horizontal bar plot used inspect target variable distribution correlation heatmap plot inspect correlation different feature scatter plot compare feature importance generated random forest gradientboosted model vertical bar plot list descending order importance various feature 3d scatter plot theme notebook briefly summarized follows 1 data quality check visualising evaluating missingnull value value 1 2 feature inspection filtering correlation feature mutual information plot target variable inspection binary categorical variable 3 feature importance ranking via learning model n building random forest gradient boosted model help u rank feature based learning process let go", "tags_descriptive": []}