{"title": "PANDA Challenge Starting EDA", "description": "IntroductionThis Kernel objective is to explore the dataset for Prostate cANcer graDe Assessment (PANDA) Challenge. Prostate cancer is the second most common cancer among males worldwide that results in more than 350k deaths annually. The key to decreasing mortality is developing more precise screeening procedures and diagnostics. Diagnosis of PCa is based on the grading of prostate tissue biopsies. These tissue samples are examined by a pathologist and scored according to the Gleason grading system. In the next Figure we show the principle of Gleason grading system.  The grading process consists of finding and classifying cancer tissue into so-called Gleason patterns (3, 4, or 5) based on the architectural growth patterns of the tumor (see Figure below). Based on presence of various formations, the Gleason score is given for majority (first digit in the score) and minority Gleason score (the second digit). After the biopsy is assigned a Gleason score (a combination of the two digits), it is converted into an ISUP grade on a 1-5 scale, using the correspondence matrix shown in the next Figure.", "link": "https://www.kaggle.com/gpreda/panda-challenge-starting-eda", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-01 16:58:16", "date_scraped": "2020-12-13 16:03:25", "words": 177, "sentences": 9, "runtime": 0.002, "description_category": "Healthcare", "description_category_score": 0.45933613181114197, "description_category_runtime": 15.749, "description_subcategory": "Life-sciences", "description_subcategory_score": 0.3308424651622772, "description_subcategory_runtime": 25.228, "category": "Healthcare", "category_score": 0.45933613181114197, "subcategory": "Life-sciences", "subcategory_score": 0.3308424651622772, "runtime_cat": 40.977, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.712", "language_code": "en", "language_score": "0.9999943902946047", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionthis kernel objective explore dataset prostate cancer grade assessment panda challenge prostate cancer second common cancer among male worldwide result 350k death annually key decreasing mortality developing precise screeening procedure diagnostics diagnosis pca based grading prostate tissue biopsy tissue sample examined pathologist scored according gleason grading system next figure show principle gleason grading system grading process consists finding classifying cancer tissue socalled gleason pattern 3 4 5 based architectural growth pattern tumor see figure based presence various formation gleason score given majority first digit score minority gleason score second digit biopsy assigned gleason score combination two digit converted isup grade 15 scale using correspondence matrix shown next figure", "tags_descriptive": ["Exploratory Data Analysis"]}