{"title": "Halite IV - DQN example - PyTorch", "description": "Version HistoryThis is a kernel that shows how to run reinforcement learning algorithms in Halite IV. A colleague of mine asked me to provide something so he could get started so I decided to make it publicly available. I think I will see how far I can push this kernel in terms of usefulness. Currently it is really just a toy example and  meant to be minimal Version 1 (03. Aug 2020)This is a first sketch of a simple DQN baseline. It has:  replay buffer target network simple reward function self play  A couple convolutional layers  ReferencesThere is plenty of good resources out there. First and foremost checkout a couple other notebooks in this competition since there is other RL starter notebooks.  Simple Reinforcement Learning with Tensorflow - Arthur Juliani Official Pytorch: Reinforcement Learning (DQN) Tutorial - Adam Paszke Couple of good ipynb notebooks for various rainbow DQN features higgsfield/RL-Adventure Pytorch Examples on Github", "link": "https://www.kaggle.com/hsperr/halite-iv-dqn-example-pytorch", "tags": ["RL"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-08-03 21:51:36", "date_scraped": "2020-12-12 20:40:17", "words": 159, "sentences": 8, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.025830652564764023, "description_category_runtime": 14.143, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.49395519495010376, "description_subcategory_runtime": 22.35, "category": "Wholesale & Retail", "category_score": 0.025830652564764023, "subcategory": "Machine Learning", "subcategory_score": 0.49395519495010376, "runtime_cat": 36.492, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.68", "language_code": "en", "language_score": "0.9999957865971271", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "version historythis kernel show run reinforcement learning algorithm halite iv colleague mine asked provide something could get started decided make publicly available think see far push kernel term usefulness currently really toy example meant minimal version 1 03 aug 2020this first sketch simple dqn baseline replay buffer target network simple reward function self play couple convolutional layer referencesthere plenty good resource first foremost checkout couple notebook competition since rl starter notebook simple reinforcement learning tensorflow arthur juliani official pytorch reinforcement learning dqn tutorial adam paszke couple good ipynb notebook various rainbow dqn feature higgsfieldrladventure pytorch example github", "tags_descriptive": ["Reinforcement Learning (RL)"]}