{"title": "Cheaters??? and Zombies!!!", "description": "Cheaters???My friend who plays PUBG said that there are cheaters in this game. If it's true, we should probably remove such players from the training dataset not to get the model confused. I learned that there are some types of cheats.   PlayerUnknown's Battlegrounds cheats explained | GamesRadar+ Aim HacksThey will take control of a players aim and automatically target it towards opponents.  Speed HacksThey usually give the player a massive speed increase, meaning they can go from one side of the map to the other in seconds.  Recoil Hacksautomatically manage the recoil. This means all they have to do is press the fire button and don’t have to adjust their mouse to account for the recoil, as the script will do it all for them and every shot will go exactly where they want it to.  Wall HacksWall hacks basically allow cheaters to see other players through walls, or add extra UI elements to reveal a players location.  How cheaters look likeNow I have some ideas about cheaters.  Acquiring 100 weapons without moving Killing 100 players without moving 100/100 kills are headshots Reviving 100 times ...  Let's take a look at the actual data.", "link": "https://www.kaggle.com/rejasupotaro/cheaters-and-zombies", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-09 20:13:10", "date_scraped": "2020-12-13 16:17:21", "words": 202, "sentences": 11, "sum_nltk": "Cheaters???My friend who plays PUBG said that there are cheaters in this game.\nIf it's true, we should probably remove such players from the training dataset not to get the model confused.\nI learned that there are some types of cheats.\nPlayerUnknown's Battlegrounds cheats explained | GamesRadar+ Aim HacksThey will take control of a players aim and automatically target it towards opponents.\nSpeed HacksThey usually give the player a massive speed increase, meaning they can go from one side of the map to the other in seconds.\nRecoil Hacksautomatically manage the recoil.\nThis means all they have to do is press the fire button and don’t have to adjust their mouse to account for the recoil, as the script will do it all for them and every shot will go exactly where they want it to.\nWall HacksWall hacks basically allow cheaters to see other players through walls, or add extra UI elements to reveal a players location.\nHow cheaters look likeNow I have some ideas about cheaters.\nAcquiring 100 weapons without moving Killing 100 players without moving 100/100 kills are headshots Reviving 100 times ...\nLet's take a look at the actual data.", "sum_nltk_words": 184, "sum_nltk_runtime": 0.002, "sum_t5": "PUBG cheaters are players who use a range of weapons to kill opponents. they can also use wall hacks to see other players through walls. if true, we should probably remove such players from the training dataset. a friend who plays PUBG said that there are cheaters in this game. he said that he's not sure if it's true. he's just trying to figure out what cheaters are.", "sum_t5_words": 68, "sum_t5_runtime": 4.611, "runtime": 0.002, "nltk_category": "Education & Research", "nltk_category_score": 0.210187628865242, "nltk_category_runtime": 17.764, "nltk_subcategory": "General", "nltk_subcategory_score": 0.43674492835998535, "nltk_subcategory_runtime": 28.25, "category": "Education & Research", "category_score": 0.210187628865242, "subcategory": "General", "subcategory_score": 0.43674492835998535, "runtime_cat": 46.014, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.743", "language_code": "en", "language_score": "0.9999971011404523", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "cheatersmy friend play pubg said cheater game true probably remove player training dataset get model confused learned type cheat playerunknowns battleground cheat explained gamesradar aim hacksthey take control player aim automatically target towards opponent speed hacksthey usually give player massive speed increase meaning go one side map second recoil hacksautomatically manage recoil mean press fire button dont adjust mouse account recoil script every shot go exactly want wall hackswall hack basically allow cheater see player wall add extra ui element reveal player location cheater look likenow idea cheater acquiring 100 weapon without moving killing 100 player without moving 100100 kill headshot reviving 100 time let take look actual data", "tags_descriptive": ["Exploratory Data Analysis"]}