{"title": "Supervised Generative Dog Net", "description": "Supervised Generative Dog NetworkDo GANs (Generative Adversarial Networks) memorize images or generalize images? This is a heavily debated question and it's hard to determine what a GAN is actually doing. If a GAN memorizes images, then choosing random seeds in latent space creates basic blends of training images. If a GAN generalizes images, then choosing random seeds produces exciting images that utilize patterns and components from training images but are not simple blend images. In this kernel, using supervision, we force a Generative Network (half a GAN) to memorize images. (A full Memorizing GAN is posted here). We then demonstrate that moving in a straight line through latent space produces a sequence of basic blended images instead of producing a sequence of exciting generalized images. (Exciting latent walk images can be seen here). (More information about latent walks can be found here in section 6.1) Load and Crop ImagesThank you Paulo Pinto for posting code to retrieve bounding box info here. Using bounding box information, we can crop dogs from the images. Below we can either create crops with dogs only or randomly crop full images using boolean DogsOnly = True.", "link": "https://www.kaggle.com/cdeotte/supervised-generative-dog-net", "tags": ["CV"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-11 06:00:25", "date_scraped": "2020-12-12 20:11:09", "words": 191, "sentences": 10, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.18826992809772491, "description_category_runtime": 16.787, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7943060994148254, "description_subcategory_runtime": 26.832, "category": "Education & Research", "category_score": 0.18826992809772491, "subcategory": "Machine Learning", "subcategory_score": 0.7943060994148254, "runtime_cat": 43.619, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.763", "language_code": "en", "language_score": "0.9999952219115793", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "supervised generative dog networkdo gans generative adversarial network memorize image generalize image heavily debated question hard determine gan actually gan memorizes image choosing random seed latent space creates basic blend training image gan generalizes image choosing random seed produce exciting image utilize pattern component training image simple blend image kernel using supervision force generative network half gan memorize image full memorizing gan posted demonstrate moving straight line latent space produce sequence basic blended image instead producing sequence exciting generalized image exciting latent walk image seen information latent walk found section 61 load crop imagesthank paulo pinto posting code retrieve bounding box info using bounding box information crop dog image either create crop dog randomly crop full image using boolean dogsonly true", "tags_descriptive": ["Computer Vision (CV)"]}