{"title": "2020 NCAA EDA: ALL files explained", "description": "2020 NCAA Men's and Women's Exploratory Data Analysis, All files explainedMarch Madness  is the collegiate men's and women's basketball tournaments in US, held by NCAA (National Collegiate Athletic Association). We will build a prediction model to predict which team wins for all combination of possible matchup. Large amount of historical data about college basketball games and teams are provided. This is 2 stage competition:  Stage 1 - You should submit predicted probabilities for every possible matchup in the past 5 NCAA® tournaments (seasons 2015-2019). Stage 2 - You should submit predicted probabilities for every possible matchup before the 2020 tournament begins.  I will also demonstrate how to get logloss=0 score for stage1. [Update] I wrote following kernels too, please check it as well!   2020 NCAAM: Fast data loading with feather  2020 NCAAW: Fast data loading with feather", "link": "https://www.kaggle.com/corochann/2020-ncaa-eda-all-files-explained", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "catboost", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-03-04 11:21:45", "date_scraped": "2020-12-12 20:18:13", "words": 143, "sentences": 7, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.22364214062690735, "description_category_runtime": 12.614, "description_subcategory": "Student", "description_subcategory_score": 0.5819680094718933, "description_subcategory_runtime": 19.879, "category": "Utilities", "category_score": 0.22364214062690735, "subcategory": "Student", "subcategory_score": 0.5819680094718933, "runtime_cat": 32.493, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.681", "language_code": "en", "language_score": "0.9999960156172902", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "2020 ncaa men woman exploratory data analysis file explainedmarch madness collegiate men woman basketball tournament u held ncaa national collegiate athletic association build prediction model predict team win combination possible matchup large amount historical data college basketball game team provided 2 stage competition stage 1 submit predicted probability every possible matchup past 5 ncaa tournament season 20152019 stage 2 submit predicted probability every possible matchup 2020 tournament begin also demonstrate get logloss0 score stage1 update wrote following kernel please check well 2020 ncaam fast data loading feather 2020 ncaaw fast data loading feather", "tags_descriptive": ["Exploratory Data Analysis"]}