{"title": "LANL Earthquake Prediction : Signal Denoising", "description": "IntroductionIn this kernel, I will walk you through some methods used to denoise seismic signals (and other signals in general) and explain exactly how they work. We will look at Wavelet Denoising with High-Pass Filters and Average Smoothing. The first method is used to remove the artificial impulse and the latter one is used to remove general noise.The main problem in the specific case of seismic signals is the fact that the signal we measure with a seismograph is not an accurate representation of the actual underground seismic signal we are trying to uncover. In seismology, we (the people trying to measure the seismic signals) artificially generate signals called impulse signals. These impulse signals interact with the Earth's actual seismic signal (which is what we need) to produce the final signal which our seismograph picks up (this same process takes place in the laboratory simulation of an earthquake). So, the real challenge is to uncover the actual signal from mixed seismogram (which is a combination of the Earth's impulse signal and the artificial impulse signal). This actual underlying signal would be a better predictor of earthquake timing than the original raw signal, because it represents the actual seismic activity.", "link": "https://www.kaggle.com/tarunpaparaju/lanl-earthquake-prediction-signal-denoising", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-09 10:17:13", "date_scraped": "2020-12-13 13:01:16", "words": 199, "sentences": 7, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.1579095423221588, "description_category_runtime": 16.392, "description_subcategory": "Physical", "description_subcategory_score": 0.6755937933921814, "description_subcategory_runtime": 25.866, "category": "Education & Research", "category_score": 0.1579095423221588, "subcategory": "Physical", "subcategory_score": 0.6755937933921814, "runtime_cat": 42.258, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.733", "language_code": "en", "language_score": "0.999997543243157", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionin kernel walk method used denoise seismic signal signal general explain exactly work look wavelet denoising highpass filter average smoothing first method used remove artificial impulse latter one used remove general noisethe main problem specific case seismic signal fact signal measure seismograph accurate representation actual underground seismic signal trying uncover seismology people trying measure seismic signal artificially generate signal called impulse signal impulse signal interact earth actual seismic signal need produce final signal seismograph pick process take place laboratory simulation earthquake real challenge uncover actual signal mixed seismogram combination earth impulse signal artificial impulse signal actual underlying signal would better predictor earthquake timing original raw signal represents actual seismic activity", "tags_descriptive": ["Exploratory Data Analysis"]}