{"title": "Private LB Probing - [0.950]", "description": "Does Private Dataset have same structure as Train Dataset?Answer: YESIn normal Kaggle competitions, the test.csv that we download contains the private test dataset and the above question is easy to verify. In this competition, \"Instant Gratification\", the test.csv that we download does not contain the private test dataset. Can we still answer the question above? Yes. The unique structure of the data has been explained here. (There are 512 partial datasets within the full dataset. And each partial dataset has a different set of approximately 40 important features as identified by different standard deviations.) We have observed that both the training dataset and public test dataset have this structure. Does the private dataset also have this structure? In this kernel, we probe the private dataset and confirm that it has the same structure. The structure of the data encourages building 512 separate models. In this kernel we also show how to build a single model instead of 512. We will build a high scoring NN (LB 0.930) by using the wonderful starter code provided by Abhishek here (please upvote Abishek's kernel) and improved upon by Vladislav here. This is accomplished by removing the dataset's useless datablocks and converting the magic variable into categorical. We will probe the Private LB and ask \"Does the private test dataset have the same special structure as training and public test?\". If the answer is \"yes\", this kernel will submit an ensemble of NN and SVC and score LB 0.950. If the answer is \"no\", this kernel will submit all zeros and score LB 0.500. To see the answer, view this kernel's LB score above.", "link": "https://www.kaggle.com/cdeotte/private-lb-probing-0-950", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-05-23 14:00:16", "date_scraped": "2020-12-13 11:53:26", "words": 270, "sentences": 15, "sum_nltk": "Does Private Dataset have same structure as Train Dataset?Answer: YESIn normal Kaggle competitions, the test.csv that we download contains the private test dataset and the above question is easy to verify.\nIn this competition, \"Instant Gratification\", the test.csv that we download does not contain the private test dataset.\nAnd each partial dataset has a different set of approximately 40 important features as identified by different standard deviations.) We have observed that both the training dataset and public test dataset have this structure.\nDoes the private dataset also have this structure?\nIn this kernel, we probe the private dataset and confirm that it has the same structure.\nThe structure of the data encourages building 512 separate models.\nWe will build a high scoring NN (LB 0.930) by using the wonderful starter code provided by Abhishek here (please upvote Abishek's kernel) and improved upon by Vladislav here.\nWe will probe the Private LB and ask \"Does the private test dataset have the same special structure as training and public test?\".\nIf the answer is \"yes\", this kernel will submit an ensemble of NN and SVC and score LB 0.950.\nIf the answer is \"no\", this kernel will submit all zeros and score LB 0.500.\nTo see the answer, view this kernel's LB score above.", "sum_nltk_words": 202, "sum_nltk_runtime": 0.003, "sum_t5": "if the answer is \"yes\", this kernel will submit an ensemble of NN and SVC and score LB 0.950. if the answer is \"no\", this kernel will submit all zeros and score LB 0.500. the structure of the data encourages building 512 separate models. in this kernel, we also show how to build a single model instead of 512. if the answer is \"yes\", this kernel will submit an ensemble of NN and SVC and score LB 0.950", "sum_t5_words": 78, "sum_t5_runtime": 6.481, "runtime": 0.0, "nltk_category": "Finance", "nltk_category_score": 0.4451184570789337, "nltk_category_runtime": 19.805, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8945991396903992, "nltk_subcategory_runtime": 31.194, "category": "Finance", "category_score": 0.4451184570789337, "subcategory": "Machine Learning", "subcategory_score": 0.8945991396903992, "runtime_cat": 51.0, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.732", "language_code": "en", "language_score": "0.999997108087379", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "private dataset structure train datasetanswer yesin normal kaggle competition testcsv download contains private test dataset question easy verify competition instant gratification testcsv download contain private test dataset still answer question yes unique structure data explained 512 partial datasets within full dataset partial dataset different set approximately 40 important feature identified different standard deviation observed training dataset public test dataset structure private dataset also structure kernel probe private dataset confirm structure structure data encourages building 512 separate model kernel also show build single model instead 512 build high scoring nn lb 0930 using wonderful starter code provided abhishek please upvote abisheks kernel improved upon vladislav accomplished removing datasets useless datablocks converting magic variable categorical probe private lb ask private test dataset special structure training public test answer yes kernel submit ensemble nn svc score lb 0950 answer kernel submit zero score lb 0500 see answer view kernel lb score", "tags_descriptive": []}