{"title": "Santander Magic LGB 0.901", "description": "Santander Customer Transaction Prediction Can you identify who will make a transaction?   Our data science team is continually challenging our machine learning algorithms, working with the global data science community to make sure we can more accurately identify new ways to solve our most common challenge, binary classification problems such as: is a customer satisfied? Will a customer buy this product? Can a customer pay this loan? In this challenge, we invite Kagglers to help us identify which customers will make a specific transaction in the future, irrespective of the amount of money transacted. The data provided for this competition has the same structure as the real data we have available to solve this problem. The data is anonimyzed, each row containing 200 numerical values identified just with a number.</b>", "link": "https://www.kaggle.com/jesucristo/santander-magic-lgb-0-901", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-03-23 10:03:54", "date_scraped": "2020-12-13 17:07:48", "words": 132, "sentences": 3, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.3555000424385071, "description_category_runtime": 11.519, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8802588582038879, "description_subcategory_runtime": 17.323, "category": "Finance", "category_score": 0.3555000424385071, "subcategory": "Machine Learning", "subcategory_score": 0.8802588582038879, "runtime_cat": 28.842, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.774", "language_code": "en", "language_score": "0.9999971985910194", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "santander customer transaction prediction identify make transaction data science team continually challenging machine learning algorithm working global data science community make sure accurately identify new way solve common challenge binary classification problem customer satisfied customer buy product customer pay loan challenge invite kagglers help u identify customer make specific transaction future irrespective amount money transacted data provided competition structure real data available solve problem data anonimyzed row containing 200 numerical value identified numberb", "tags_descriptive": []}