{"title": "Multilabel Classification & Rainforest EDA", "description": "Who can save the rainforest?In this competition we are given a multilabel classification problem, where we have to decide, given an image, which labels belong to it. From the evaluation section of the competition: For each image listed in the test set, predict a space-delimited list of tags which you believe are associated with the image. There are 17 possible tags: agriculture, artisinal_mine, bare_ground, blooming, blow_down, clear, cloudy, conventional_mine, cultivation, habitation, haze, partly_cloudy, primary, road, selective_logging, slash_burn, water. In this notebook we will:  generate a fun bernoulli trial sample submission look at the actual images to get a first impression of the data cluster the images according to their pixel intensities to find potentially formed groups compute standard NDVI values for images and rank them by this index.   A standard approach to multilabel classification is to learn as many OVA (one vs all) models as there are distinct labels and then assign labels by the classifier output of each of the models, we'll get to that later. If you like it, please upvote this :) Let's dive right into the data.", "link": "https://www.kaggle.com/philschmidt/multilabel-classification-rainforest-eda", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-04-30 19:49:17", "date_scraped": "2020-12-13 15:31:34", "words": 184, "sentences": 6, "runtime": 0.0, "description_category": "Agriculture", "description_category_score": 0.5730605721473694, "description_category_runtime": 17.6, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.3048442304134369, "description_subcategory_runtime": 28.241, "category": "Agriculture", "category_score": 0.5730605721473694, "subcategory": "Machine Learning", "subcategory_score": 0.3048442304134369, "runtime_cat": 45.841, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.773", "language_code": "en", "language_score": "0.9999963058018665", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "save rainforestin competition given multilabel classification problem decide given image label belong evaluation section competition image listed test set predict spacedelimited list tag believe associated image 17 possible tag agriculture artisinal_mine bare_ground blooming blow_down clear cloudy conventional_mine cultivation habitation haze partly_cloudy primary road selective_logging slash_burn water notebook generate fun bernoulli trial sample submission look actual image get first impression data cluster image according pixel intensity find potentially formed group compute standard ndvi value image rank index standard approach multilabel classification learn many ovum one v model distinct label assign label classifier output model well get later like please upvote let dive right data", "tags_descriptive": []}