{"title": "Featuretools for Good", "description": "Featuretools for GoodIn this notebook, we will implement automated feature engineering with Featuretools for the Costa Rican Household Poverty Challenge. The objective of this data science for good problem is to predict the poverty of households in Costa Rica. Automated Feature EngineeringAutomated feature engineering should be a default part of your data science workflow. Manual feature engineering is limited both by human creativity and time constraints but automated methods have no such constraints. At the moment, Featuretools is the only open-source Python library available for automated feature engineering. This library is extremely easy to get started with and very powerful (as the score from this kernel illustrates). For anyone new to featuretools, check out the documentation or an introductory blog post here.", "link": "https://www.kaggle.com/willkoehrsen/featuretools-for-good", "tags": ["Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-08-29 22:46:04", "date_scraped": "2020-12-12 17:59:32", "words": 122, "sentences": 7, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.011636495590209961, "description_category_runtime": 10.384, "description_subcategory": "Tools", "description_subcategory_score": 0.4774381220340729, "description_subcategory_runtime": 16.148, "category": "Utilities", "category_score": 0.011636495590209961, "subcategory": "Tools", "subcategory_score": 0.4774381220340729, "runtime_cat": 26.532, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.753", "language_code": "en", "language_score": "0.999995491062607", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "featuretools goodin notebook implement automated feature engineering featuretools costa rican household poverty challenge objective data science good problem predict poverty household costa rica automated feature engineeringautomated feature engineering default part data science workflow manual feature engineering limited human creativity time constraint automated method constraint moment featuretools opensource python library available automated feature engineering library extremely easy get started powerful score kernel illustrates anyone new featuretools check documentation introductory blog post", "tags_descriptive": ["Feature Engineering"]}