{"title": "Kannada MNIST:CNN Tutorial with App.(Top %2)", "description": "A Simple CNN Tutorial with App.Benan AKCA    INTRODUCTION  CONVOLUTIONAL NEURAL NETWORKS  Convolution Layer Steps of Convolution Operation Stride An Example of Convolution Operation Why Do We Use Filters?    Padding Why do we use Padding? Equation of Calculating Output Dimension Types of Padding in Keras   Pooling Layer Hyper Parameters of Pooling Operation Why do we use Pooling? Types of Pooling in Keras   Batch Normalization Layer Drop Out Layer   APPLICATION WITH CNN  Import Modules Understanding the Data Data Preprocessing Normalizing the Data Train and Test Splitting Reshape Data to Appropriate Sizes    Building and Training a CNN Model  Model - Build Model - Compile Categorical Cross Entropy Optimizer On-the-Fly Data Augmentation   Model - Fit   Evaluation of the Model  Accuracy and Loss Curves *  Test Set Accuracy Score Confusion Matrix F1 Score Calculation Evaluate with Another Dataset Submit for Competition     CONCLUSION", "link": "https://www.kaggle.com/benanakca/kannada-mnist-cnn-tutorial-with-app-top-2", "tags": ["DL", "CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-01-08 13:26:46", "date_scraped": "2020-12-13 12:26:21", "words": 166, "sentences": 1, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.0755799412727356, "description_category_runtime": 15.679, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.906006932258606, "description_subcategory_runtime": 24.675, "category": "Education & Research", "category_score": 0.0755799412727356, "subcategory": "Machine Learning", "subcategory_score": 0.906006932258606, "runtime_cat": 40.356, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.74", "language_code": "en", "language_score": "0.9999984030131019", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "simple cnn tutorial appbenan akca introduction convolutional neural network convolution layer step convolution operation stride example convolution operation use filter padding use padding equation calculating output dimension type padding kera pooling layer hyper parameter pooling operation use pooling type pooling kera batch normalization layer drop layer application cnn import module understanding data data preprocessing normalizing data train test splitting reshape data appropriate size building training cnn model model build model compile categorical cross entropy optimizer onthefly data augmentation model fit evaluation model accuracy loss curve test set accuracy score confusion matrix f1 score calculation evaluate another dataset submit competition conclusion", "tags_descriptive": ["Deep Learning (DL)", "Convolutional Neural Network (CNN)"]}