{"title": "Predicting rainfall", "description": "HOW MUCH DID IT RAIN ?For agriculture, it is extremely important to know how much it rained on a particular field. However, rainfall is variable in space and time and it is impossible to have rain gauges everywhere. Therefore, remote sensing instruments such as radar are used to provide wide spatial coverage. Rainfall estimates drawn from remotely sensed observations will never exactly match the measurements that are carried out using rain gauges, due to the inherent characteristics of both sensors. Currently, radar observations are \"corrected\" using nearby gauges and a single estimate of rainfall is provided to users who need to know how much it rained. The Challenge is to solve this in probabilistic manner.Knowing the full probabilistic spread of rainfall amounts can be very useful to drive hydrological and agronomic models -- much more than a single estimate of rainfall.  Unlike a conventional Doppler radar, a polarimetric radar transmits radio wave pulses that have both horizontal and vertical orientations. Because rain drops become flatter as they increase in size and because ice crystals tend to be elongated vertically, whereas liquid droplets tend to be flattened, it is possible to infer the size of rain drops and the type of hydrometeor from the differential reflectivity of the two orientations. We are given polarimetric radar values and derived quantities at a location over the period of one hour. You will need to produce a probabilistic distribution of the hourly rain gauge total. ABOUT POLAMETRIC RADAR MEASUREMNTSPolarimetric radar offers the promise of being able to better infer drop-sizes and thus improve rainfall estimates since smaller drops evaporate more and of being able to distinguish between echoes due to bioscatter and echoes due to weather.  The US National Weather Service's weather radar network (called NEXRAD) was recently upgraded to polarimetry, and it is the polarimetric radar data collected after the upgrade that you are provided. This is an kaggle competition and you can download the dataset from the link given below: https://www.kaggle.com/c/how-much-did-it-rain/data LET'S START OUR JOURNEYBefore understanding the data set I will be importing the python libraries that will be used later", "link": "https://www.kaggle.com/suchith0312/predicting-rainfall", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-03-05 09:20:23", "date_scraped": "2020-12-12 21:16:25", "words": 351, "sentences": 13, "sum_nltk": "Therefore, remote sensing instruments such as radar are used to provide wide spatial coverage.\nRainfall estimates drawn from remotely sensed observations will never exactly match the measurements that are carried out using rain gauges, due to the inherent characteristics of both sensors.\nCurrently, radar observations are \"corrected\" using nearby gauges and a single estimate of rainfall is provided to users who need to know how much it rained.\nUnlike a conventional Doppler radar, a polarimetric radar transmits radio wave pulses that have both horizontal and vertical orientations.\nBecause rain drops become flatter as they increase in size and because ice crystals tend to be elongated vertically, whereas liquid droplets tend to be flattened, it is possible to infer the size of rain drops and the type of hydrometeor from the differential reflectivity of the two orientations.\nABOUT POLAMETRIC RADAR MEASUREMNTSPolarimetric radar offers the promise of being able to better infer drop-sizes and thus improve rainfall estimates since smaller drops evaporate more and of being able to distinguish between echoes due to bioscatter and echoes due to weather.\nThe US National Weather Service's weather radar network (called NEXRAD) was recently upgraded to polarimetry, and it is the polarimetric radar data collected after the upgrade that you are provided.", "sum_nltk_words": 201, "sum_nltk_runtime": 0.004, "sum_t5": "kaggle is a competition to use polarimetric radar to predict rainfall amounts. the radar is a radio wave pulsed radar with horizontal and vertical orientations. the data will be used to determine how much rain it rained on a field. the data will be used to create a probabilistic distribution of the hourly rain gauge total. kaggle is a polarimetric radar company based in california.", "sum_t5_words": 65, "sum_t5_runtime": 6.398, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.43856081366539, "nltk_category_runtime": 18.954, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.648560106754303, "nltk_subcategory_runtime": 30.952, "category": "Utilities", "category_score": 0.43856081366539, "subcategory": "Physical", "subcategory_score": 0.648560106754303, "runtime_cat": 49.907, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.711", "language_code": "en", "language_score": "0.999998061891518", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "much rain agriculture extremely important know much rained particular field however rainfall variable space time impossible rain gauge everywhere therefore remote sensing instrument radar used provide wide spatial coverage rainfall estimate drawn remotely sensed observation never exactly match measurement carried using rain gauge due inherent characteristic sensor currently radar observation corrected using nearby gauge single estimate rainfall provided user need know much rained challenge solve probabilistic mannerknowing full probabilistic spread rainfall amount useful drive hydrological agronomic model much single estimate rainfall unlike conventional doppler radar polarimetric radar transmits radio wave pulse horizontal vertical orientation rain drop become flatter increase size ice crystal tend elongated vertically whereas liquid droplet tend flattened possible infer size rain drop type hydrometeor differential reflectivity two orientation given polarimetric radar value derived quantity location period one hour need produce probabilistic distribution hourly rain gauge total polametric radar measuremntspolarimetric radar offer promise able better infer dropsizes thus improve rainfall estimate since smaller drop evaporate able distinguish echo due bioscatter echo due weather u national weather service weather radar network called nexrad recently upgraded polarimetry polarimetric radar data collected upgrade provided kaggle competition download dataset link given httpswwwkagglecomchowmuchdiditraindata let start journeybefore understanding data set importing python library used later", "tags_descriptive": []}