{"title": "Data dictionary", "description": "Following is an aggregation of the details of most of the columns in the training data. The details were obtained by googling.  MachineIdentifier - Individual machine ID. Training dataset contains 89,21,483 (8 mn) unique machines.  ProductName - Defender state information e.g. win8defender win8defender     8826520 mse                94873 mseprerelease         53 scep                  22 windowsintune          8 fep                    7  EngineVersion - Defender state information e.g. 1.1.12603.0. There are 70 unique Engine versions in the training data. The 5 most common ones are : 1.1.15200.1    3845067 1.1.15100.1    3675915 1.1.15000.2     265218 1.1.14901.4     212408 1.1.14600.4     160585  AppVersion - Defender state information e.g. 4.9.10586.0. This has a long tailed frequency distribution, with a 110 unique App versions. Most common 5 versions are : 4.18.1807.18075     5139224 4.18.1806.18062      850929 4.12.16299.15        359871 4.10.209.0           272455 4.13.17134.1         257270  AvSigVersion - Defender state information e.g. 1.217.1014.0. Has 8,531 unique values.  IsBeta - Defender state information e.g. false IsBeta  HasDetections 0       0                4462557         1                4458859 1       0                     34         1                     33  RtpStateBitfield - (Most likely - RTP state:  (Enabled or Disabled)    source. Expected binary values, don't understand why values are multiple integers though. Frequency table -  7.0     8651487  0.0      190701 NaN        32318  8.0       21974  5.0       20328  3.0        3029  1.0        1625  35.0         21  IsSxsPassiveMode - Google searches suggest that this a active/passive mode of operation for Windows Defender. If another third party primary antivirus exists on the system, the Defender enters Passive mode. Passive mode obviously offers reduced functionality.Source 0    8766840 1     154643 Data shows that a machine which is in passive mode, has a higher prevalence of malwares. IsSxsPassiveMode  HasDetections 0                 1                4402017                   0                4364823 1                 0                  97768                   1                  56875  DefaultBrowsersIdentifier - ID for the machine's default browser. [This column has 2017 unique values, so these couldn't be direct browser name mappings. So probably, a browser-version combination ? Anyhow, this is what the top ten in the frequency chart look like - 239.0     46056 3195.0    42692 1632.0    28751 3176.0    24220 146.0     20756 1910.0    19416 1727.0    17393 2064.0    13990 2725.0    13338 1160.0    12594   AVProductStatesIdentifier - ID for the specific configuration of a user's antivirus software. 28,970 unique float values.  AVProductsInstalled - Assuming this to be the number of anti-virus products installed. 90% of the machines have 1-2 products installed. We should probably drop the one row with 0 AVProductsInstalled. Again, \"probably\".  1.0    6208893  2.0    2459008  3.0     208103 NaN       36221  4.0       8757  5.0        471  6.0         28  7.0          1  0.0          1  AVProductsEnabled - NA  1.0    8654101  2.0     198652 NaN       36221  0.0      25958  3.0       6075  4.0        453  5.0         23  HasTpm - True if machine has tpm. A Trusted Platform Module (TPM) is a specialized chip on an endpoint device that stores RSA encryption keys specific to the host system for hardware authentication. Each TPM chip contains an RSA key pair called the Endorsement Key (EK). The pair is maintained inside the chip and cannot be accessed by software.[source - google search] 1    8814167 0     107316  CountryIdentifier - ID for the country the machine is located in. This has 222 unique int64 IDs. Wikipedia cites 255+ countries and independent territories. source If these are exact country codes, then Austria (43) has the highest number of rows in this data set, while USA(001) has just 2 %.  CityIdentifier - ID for the city the machine is located in. 1,07,366 unique cities and huge number(~5%) of NaNs.  OrganizationIdentifier - ID for the organization the machine belongs in, organization ID is mapped to both specific companies and broad industries. There are 49 unique organisations, 50% of the computers being under one org, another 25% not-classified. Here's a breakup of the top 5 values - 27.0    4196457 NaN      2751518  18.0    1764175  48.0      63845  50.0      45502  GeoNameIdentifier - ID column for the 292 geographic regions, a machine is located in.  LocaleEnglishNameIdentifier - English name of Locale ID of the current user. The column contains 276 locale int64 IDs. \"A locale is neither a language nor a country, the same language may be spoken in multiple countries (often with subtle differences) and a single country may speak multiple languages. A locale is therefore an area where a particular language is spoken which may (or may not) align with geographical and/or political boundaries.\" source  Platform - Calculates platform name (of OS related properties and processor property). Frequency table - windows10      8618715 windows8        194508 windows7         93889 windows2016      14371  Processor - This is the process architecture of the installed operating system. Frequency - x64      8105435 x86       815702 arm64        346  OsVer - Version of the current operating system. 10.0.0.0        8632545 6.3.0.0          194447 6.1.1.0           93268 6.1.0.0             582 10.0.3.0            225 10.0.1.0            141  OsBuild - Build of the current operating system. Has 76 unique build numbers, of which ~5 form the majority. Distribution of the top 10 values - 17134    3915521 16299    2503681 15063     780270 14393     730819 10586     411606 10240     270192 9600      194508 7601       93306 17692       3184  OsSuite - Product suite mask for the current operating system. This has a very skewed distribution.  OsPlatformSubRelease - Returns the OS Platform sub-release (Windows Vista, Windows 7, Windows 8, TH1, TH2). Less skewed distribution than OsSuite. rs4           3915526 rs3           2503681 rs2            780270 rs1            730819 th2            411606 th1            270192 windows8.1     194508 windows7        93889 prers5          20992  OsBuildLab - Build lab that generated the current OS. Example: 9600.17630.amd64fre.winblue_r7.150109-2022. Top 5 values by counts- 17134.1.amd64fre.rs4_release.180410-1804                     3658199 16299.431.amd64fre.rs3_release_svc_escrow.180502-1908        1252674 16299.15.amd64fre.rs3_release.170928-1534                     961060 15063.0.amd64fre.rs2_release.170317-1834                      718033 17134.1.x86fre.rs4_release.180410-1804                        257074  SkuEdition - The goal of this feature is to use the Product Type defined in the MSDN to map to a 'SKU-Edition' name that is useful in population reporting. The valid Product Type are defined in %sdxroot%\\data\\windowseditions.xml. This API has been used since Vista and Server 2008, so there are many Product Types that do not apply to Windows 10. The 'SKU-Edition' is a string value that is in one of three classes of results. The design must hand each class. Home               5514341 Pro                3224164 Invalid              78054 Education            40694 Enterprise           34357 Enterprise LTSB      20702 Cloud                 5589 Server                3582  IsProtected - This is a calculated field derived from the Spynet Report's AV Products field. Returns: a. TRUE if there is at least one active and up-to-date antivirus product running on this machine. b. FALSE if there is no active AV product on this machine, or if the AV is active, but is not receiving the latest updates. c. null if there are no Anti Virus Products in the report. Returns: Whether a machine is protected. [jk: A machine that is not protected by an anti-virus has a lower chance of infection than one that is protected.] IsProtected  HasDetections 0.0          0                 298904              1                 184253 1.0          1                4261098              0                4141184  AutoSampleOptIn - This is the SubmitSamplesConsent value passed in from the service, available on CAMP 9+. [No clue what this is.] 0    8921225 1        258  PuaMode - Pua Enabled mode from the service. \"The Potentially Unwanted Applications (PUA) protection feature in Windows Defender Antivirus can identify and block PUAs from downloading and installing on endpoints in your network. These applications are not considered viruses, malware, or other types of threats, but might perform actions on endpoints that adversely affect their performance or use. PUA can also refer to applications that are considered to have a poor reputation.\" source  SMode - This field is set to true when the device is known to be in 'S Mode', as in, Windows 10 S mode, where only Microsoft Store apps can be installed  0.0    8379843 NaN      537759  1.0       3881  IeVerIdentifier -  Retrieves which version of Internet Explorer is running on this device.source This has 303 unique values. Here are the most frequent values, uptil a NaN. 137.0    3885842  117.0    1767931  108.0     474390  111.0     467828  98.0      354411  135.0     217458  53.0      204952  74.0      202542  94.0      173593  105.0     173448  333.0     156391  107.0     128633  103.0     114952  96.0       83559 NaN         58894  SmartScreen - This is the SmartScreen enabled string value from registry. This is obtained by checking in order, HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows\\System\\SmartScreenEnabled and HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\SmartScreenEnabled. If the value exists but is blank, the value \"ExistsNotSet\" is sent in telemetry. Windows Defender SmartScreen helps to protect your employees if they try to visit sites previously reported as phishing or malware websites, or if an employee tries to download potentially malicious files. This only applies to Win 10 and Win 10 mobile.  Firewall - This attribute is true (1) for Windows 8.1 and above if windows firewall is enabled, as reported by the service. 1.0     8641014 0.0      189119 NaN       91350  UacLuaenable - This attribute reports whether or not the \"administrator in Admin Approval Mode\" user type is disabled or enabled in UAC. The value reported is obtained by reading the regkey HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLUA. UAC stands for User Access Control and here is an interesting discussion on its usage & its annoyances. discussion  Census_MDC2FormFactor - A grouping based on a combination of Device Census level hardware characteristics. The logic used to define Form Factor is rooted in business and industry standards and aligns with how people think about their device. (Examples: Smartphone, Small Tablet, All in One, Convertible...)  Census_DeviceFamily - AKA DeviceClass. Indicates the type of device that an edition of the OS is intended for.  This has a very high proportion of Windows Desktop and very few of Windows Server and Windows.  Census_OEMNameIdentifier - NA  Census_OEMModelIdentifier - NA  Census_ProcessorCoreCount - Number of logical cores in the processor. Four core processors are the most common. There are 45 unique values in total:  4.0      5430193  2.0      2311969  8.0       865004  12.0       92702  1.0        70390  6.0        69910 NaN         41306  16.0       18551  3.0        13580  32.0        2136  Census_ProcessorManufacturerIdentifier - NA. Frequency distribution -  5.0     7839318  1.0     1040292 NaN        41313  10.0        339  3.0         218  9.0           1  7.0           1  4.0           1  Census_ProcessorModelIdentifier - NA. 3,428 unique values  Census_ProcessorClass - A classification of processors into high/medium/low. Initially used for Pricing Level SKU. No longer maintained and updated This column is mostly empty.  Census_PrimaryDiskTotalCapacity - Amount of disk space on primary disk of the machine in MB. Most popular disk sizes are 500gb and 1Tb, in that order. Unique value count: 5,735.  Census_PrimaryDiskTypeName - Friendly name of Primary Disk Type - HDD or SSD. HDD is twice as popular as SSD, in this dataset. HDD            5806804 SSD            2466808 UNKNOWN         358251 Unspecified     276776 NaN              12844  Census_SystemVolumeTotalCapacity - The size of the partition that the System volume is installed on in MB. 5,36,848 unique system volume sizes exist. The following frequency count was created after converting the data into Gigabytes and then binning them. a. <= 50          689171 b. 50-100         960770 c. 100 - 250     2845915 d. 250 - 500     2695227 e. 500 - 1000    1601322 f. > 1Tb           76014 Source code for creating the above cuts: _ = (round(df[col]/1032, 0)) pd.cut(_,  ​      labels=['a. <= 50', 'b. 50-100', 'c. 100 - 250', 'd. 250 - 500', 'e. 500 - 1000', 'f. > 1Tb'], ​      bins=[0, 50, 100, 250, 500, 1000, 10**4]).value_counts().sort_index()  Census_HasOpticalDiskDrive - True indicates that the machine has an optical disk drive (CD/DVD). Most systems don't have a disk drive. This column could provide an idea of how old the chassis is. And, older chassis might correlate with higher malware rates. Interestingly, none of the machines have a disk drive. 0.0    8921483 Name: Census_HasOpticalDiskDrive, dtype: int64  Census_TotalPhysicalRAM - Retrieves the physical RAM in MB. Since these are in MB, these are converted to GB by dividing them with 1032 and then the frequency count is created:  4.0       4102156  8.0       2200604  2.0       1108274  16.0       532480  6.0        400223  12.0       160345  3.0        156306 NaN          80533 Most popular - 4 Gb, 8 Gb, 2 Gb and 16Gb. Source code: (round(df['Census_TotalPhysicalRAM']/1032, 0)).value_counts(dropna=False).sort_values(ascending=False)  Census_ChassisTypeName - Retrieves a numeric representation of what type of chassis the machine has. A value of 0 means xx. Not all values are numerical in this column and the most popular ones don't seem to be mutually exclusive. For example, in the top5 common values, both Notebook  and Portable could be used interchangeably. Notebook               5248812 Desktop                1872125 Laptop                  685581 Portable                360903 AllinOne                204295  Census_InternalPrimaryDiagonalDisplaySizeInInches - Retrieves the physical diagonal length in inches of the primary display. Contains 785 unique display sizes. These can be used together withCensus_ChassisTypeName to differentiate the devices further.  Census_InternalPrimaryDisplayResolutionHorizontal - Retrieves the number of pixels in the horizontal direction of the internal display. 2,180 unique values are present. Most popular ones are 1,366 and 1,920 resolution. These values might indicate the age of the device. Higher resolutions most likely mean that the devices are relatively new, compared to the rest. This hypothesis would also be affected by Census_InternalPrimaryDiagonalDisplaySizeInInches. Most likely, larger displays will have higher resolution.  Census_InternalPrimaryDisplayResolutionVertical - Retrieves the number of pixels in the vertical direction of the internal display. 1,560 unique values.  Census_PowerPlatformRoleName - Indicates the OEM preferred power management profile. This value helps identify the basic form factor of the device  Census_InternalBatteryType - NA. Has a lot of inconsistent naming schemes.  For example - '#', 'lion', '4cel', 'l\u0006&#TAB#'. Majority of the machines are still represented in less than 10 labels. Some of these seem similar, for example - lion, li-i and liio could possibly be placeholders for lithium-ion batteries.  Census_InternalBatteryNumberOfCharges - Assuming this to be the number of battery cycles. If battery cycles are set to zero, could it be that these devices were in the first cycle of battery charge / are VMs or desktops ? What makes it more interesting is that 56% of the machines are in their first cycle of battery charge OR are non-battery operated.  Census_OSVersion - Numeric OS version Example - 10.0.10130.0. Contains 469 unique values.  Census_OSArchitecture - Architecture on which the OS is based. Derived from OSVersionFull. amd64    8105885 x86       815252 arm64        346  Census_OSBranch - Branch of the OS extracted from the OsVersionFull. 32 unique values. Five most common values: rs4_release                  4009158 rs3_release                  1237321 rs3_release_svc_escrow       1199767 rs2_release                   797066 rs1_release                   785534  Census_OSBuildNumber - OS Build number extracted from the OsVersionFull. Example - OsBuildNumber = 10512 or 10240. 165 unique values.  Census_OSBuildRevision - OS Build revision extracted from the OsVersionFull. Example - OsBuildRevision = 1000 or 16458. 285 unique values.  Census_OSEdition - Edition of the current OS. Sourced from HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion@EditionID in registry. 33 unique values. This column may also be linked to license type(Census_ActivationChannel). Top 5: Core                           3469991 Professional                   3130566 CoreSingleLanguage             1945461 CoreCountrySpecific             166100 ProfessionalEducation            56698  Census_OSSkuName - OS edition friendly name (currently Windows only). 30 unique values. Highly skewed by high numbers of:  'CORE', 'PROFESSIONAL', 'CORE_SINGLELANGUAGE' & 'CORE_COUNTRYSPECIFIC'  Census_OSInstallTypeName - Friendly description of what install was used on the machine i.e. clean UUPUpgrade        2608037 IBSClean          1650733 Update            1593308 Upgrade           1251559 Other              840121 Reset              649201 Refresh            205842 Clean               69073 CleanPCRefresh      53609  Census_OSInstallLanguageIdentifier - NA. 39 unique values.  Census_OSUILocaleIdentifier - NA. 147 unique values. 31, 34 and 30 are the top 3 Locale indentifiers.  Census_OSWUAutoUpdateOptionsName - Friendly name of the WindowsUpdate auto-update settings on the machine. FullAuto                                 3954497 UNKNOWN                                  2519925 Notify                                   2034254 AutoInstallAndRebootAtMaintenanceTime     371475 Off                                        26961 DownloadNotify                             14371  Census_IsPortableOperatingSystem - Indicates whether OS is booted up and running via Windows-To-Go on a USB stick. Assuming, 0 to be a \"False\" for Portability 0    8916619 1       4864  Census_GenuineStateName - Friendly name of OSGenuineStateID. 0 = Genuine. Expected integer values thanks to the description, but looks like we won't need to encode it. IS_GENUINE         7877597 INVALID_LICENSE     801692 OFFLINE             228366 UNKNOWN              13826 TAMPERED                 2  Census_ActivationChannel - Retail license key or Volume license key for a machine. Retail            4727589 OEM:DM            3413350 Volume:GVLK        450954 OEM:NONSLP         317980 Volume:MAK           8028 Retail:TB:Eval       3582  GVLK (group volume license key) is just an acronym for a volume license version of Windows, It's basically a bulk/volume license for Windows. Mostly available to large enterprises and govt institutions and comes with premium support. GLVK also needs a KMS (key management service) for deployment.source  KMS Client and Volume MAK product keys, are volume license keys that are not-for-resale.  They are issued by organizations for use on client computers associated in some way with the organization.  Volume license keys may not be transferred with the computer if the computer changes ownership.  OEM SLP and COA SLP product keys, are issued by large computer manufacturers and use SLP (System Locked Pre-installation) technology to bind the license to the original motherboard via the BIOS and software. The OEM SLP keys self-activate if the corresponding data in the BIOS is correct.  OEM SLP keys, which the user can read in the MGADiag report or software like KeyFinder, cannot be used by the end user to manually activate Windows.  The COA SLP key is printed on a sticker affixed to the side of the computer case (desktops), or on the bottom of the case (laptops), or in the battery compartment (newer laptops).  This is the key for the user to enter manually should he need to activate Windows himself.  OEM System Builder**, product keys are for use by smaller system builders, computer shops, consultants, and others who provide computers and services to their customers.  A system builder is defined by the System Builder license as \"an original equipment manufacturer, an assembler, a refurbisher, or a software pre-installer that sells the Customer System(s) to a third party.\"  Retail, product keys are what the customer gets when he buys a Full Packaged Product (FPP), commonly known as a \"boxed copy\", of Windows from a retail merchant or purchases Windows online from the Microsoft Store.  OEM NON-SLP then means license keys from an OEM but not bound to a System Locked Pre-installation. OEM keys are not-for-resale and may not be transferred to another computer.  They may, however, be transferred with the computer if the computer is transferred to new ownership.   ​         Source  Census_IsFlightingInternal - 'Flighting' in Windows Defender context means making new development features available as soon as possible, during the development cycle. This does not refer to a public release. The 'internal' most likely means the Window Insider community. source NaN     7408759 0.0     1512703 1.0          21  Census_IsFlightsDisabled - Indicates if the machine is participating in flighting. 0.0     8760872 NaN      160523 1.0          88 Assuming, 0 would mean that majority of the devices have 'flighting' enabled. Which then means, most of these machines are from the Windows Insider program.  Census_FlightRing - The ring that the device user would like to receive flights for. This might be different from the ring of the OS which is currently installed if the user changes the ring after getting a flight from a different ring. Retail      8355679 NOT_SET      287803 Unknown      243438 WIS           10648 WIF           10322 RP             9860 Disabled       3722 OSG               7 Canary            3 Invalid           1  Census_ThresholdOptIn - NA NaN     5667325  0.0    3253342  1.0        816  Census_FirmwareManufacturerIdentifier - NA. 712 unique values, with majority concentrated in the top 5 firmware manufacturer identifiers.  Census_FirmwareVersionIdentifier - NA. Around 50K unique values.  Census_IsSecureBootEnabled - Indicates if Secure Boot mode is enabled. (from google)Microsoft Secure Boot is a component of Microsoft's Windows 8 operating system that relies on the UEFI specification's secure boot functionality to help prevent malicious software applications and \"unauthorized\" operating systems from loading during the system start-up process. There is a 50-50 breakup of samples based on this criteria: 0    4585438 1    4336045 Each of these categories, has a 50-50 % breakup of malware classifications.  Census_IsWIMBootEnabled - NA. WimBoot is an alternative way for OEMs to deploy Windows. A WimBoot deployment boots and runs Windows directly out of a compressed Windows Image File (WIM). This WIM file is immutable, and access to it is managed by a new file system filter driver (WoF.sys). The result is a significant reduction in the disk space required to install Windows. source NaN     5659703  0.0    3261779  1.0          1  Census_IsVirtualDevice - Identifies a Virtual Machine (machine learning model). It is self explaratory except for the phrase:\"(machine learning model)\"  0.0    8842840  1.0      62690 NaN       15953  Census_IsTouchEnabled - Is this a touch device ? Most are not. 0    7801452 1    1120031  Census_IsPenCapable - Is the device capable of pen input ? Most are not. 0    8581834 1     339649  Census_IsAlwaysOnAlwaysConnectedCapable - Retreives information about whether the battery enables the device to be AlwaysOnAlwaysConnected .To specify whether Wi-Fi should remain on when the screen times out, set AlwaysOnAlwaysConnected to one of the following values source.aspx): States:  0 or 'Disabled': Disables Wi-Fi from always being on when the screen times out. The Keep Wi-Fi on when the screen times out in the Settings > Wi-Fi > manage screen is turned off. 1 or 'Enabled': Enables Wi-Fi to always be on by default when the screen times out. The Keep Wi-Fi on when the screen times out in the Settings > Wi-Fi > manage screen is turned on. 0.0    8341972 1.0     508168 NaN       71343  Wdft_IsGamer - Indicates whether the device is a gamer device or not based on its hardware combination.    0.0    6174143  1.0    2443889 NaN      303451  Wdft_RegionIdentifier - NA. 15 unique values. Microsoft documentation mentions regional identifier", "link": "https://www.kaggle.com/airbourne/data-dictionary", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-01-01 12:17:38", "date_scraped": "2020-12-13 14:13:18", "words": 5898, "sentences": 221, "sum_nltk": "PUA can also refer to applications that are considered to have a poor reputation.\" source  SMode - This field is set to true when the device is known to be in 'S Mode', as in, Windows 10 S mode, where only Microsoft Store apps can be installed  0.0    8379843 NaN      537759  1.0       3881  IeVerIdentifier -  Retrieves which version of Internet Explorer is running on this device.source This has 303 unique values.\nThere are 45 unique values in total:  4.0      5430193  2.0      2311969  8.0       865004  12.0       92702  1.0        70390  6.0        69910 NaN         41306  16.0       18551  3.0        13580  32.0        2136  Census_ProcessorManufacturerIdentifier - NA.\n> 1Tb'], ​      bins=[0, 50, 100, 250, 500, 1000, 10**4]).value_counts().sort_index()  Census_HasOpticalDiskDrive - True indicates that the machine has an optical disk drive (CD/DVD).\nSince these are in MB, these are converted to GB by dividing them with 1032 and then the frequency count is created:  4.0       4102156  8.0       2200604  2.0       1108274  16.0       532480  6.0        400223  12.0       160345  3.0        156306 NaN          80533 Most popular - 4 Gb, 8 Gb, 2 Gb and 16Gb. Source code: (round(df['Census_TotalPhysicalRAM']/1032, 0)).value_counts(dropna=False).sort_values(ascending=False)  Census_ChassisTypeName - Retrieves a numeric representation of what type of chassis the machine has.\nsource NaN     7408759 0.0     1512703 1.0          21  Census_IsFlightsDisabled - Indicates if the machine is participating in flighting.", "sum_nltk_words": 382, "sum_nltk_runtime": 0.065, "sum_t5": "training dataset contains 89,21,483 (8 mn) unique machines. there are 70 unique Engine versions in the training data. most common 5 versions are : 4.18.1807.18075 5139224 4.18.1806.18062 850929 4.12.16299.15 359871 4.10.209.0 272455 4.13.17134.1 257270 IsSxsPassiveMode - a passive/passive mode of operation for Windows Defender.", "sum_t5_words": 44, "sum_t5_runtime": 6.858, "runtime": 0.046, "nltk_category": "Manufacturing", "nltk_category_score": 0.04020236060023308, "nltk_category_runtime": 42.853, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.2179477959871292, "nltk_subcategory_runtime": 70.662, "category": "Manufacturing", "category_score": 0.04020236060023308, "subcategory": "Physical", "subcategory_score": 0.2179477959871292, "runtime_cat": 113.516, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.711", "language_code": "en", "language_score": "0.9999961012655859", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "following aggregation detail column training data detail obtained googling machineidentifier individual machine id training dataset contains 8921483 8 mn unique machine productname defender state information eg win8defender win8defender 8826520 mse 94873 mseprerelease 53 scep 22 windowsintune 8 fep 7 engineversion defender state information eg 11126030 70 unique engine version training data 5 common one 11152001 3845067 11151001 3675915 11150002 265218 11149014 212408 11146004 160585 appversion defender state information eg 49105860 long tailed frequency distribution 110 unique app version common 5 version 418180718075 5139224 418180618062 850929 4121629915 359871 4102090 272455 413171341 257270 avsigversion defender state information eg 121710140 8531 unique value isbeta defender state information eg false isbeta hasdetections 0 0 4462557 1 4458859 1 0 34 1 33 rtpstatebitfield likely rtp state enabled disabled source expected binary value dont understand value multiple integer though frequency table 70 8651487 00 190701 nan 32318 80 21974 50 20328 30 3029 10 1625 350 21 issxspassivemode google search suggest activepassive mode operation window defender another third party primary antivirus exists system defender enters passive mode passive mode obviously offer reduced functionalitysource 0 8766840 1 154643 data show machine passive mode higher prevalence malwares issxspassivemode hasdetections 0 1 4402017 0 4364823 1 0 97768 1 56875 defaultbrowsersidentifier id machine default browser column 2017 unique value couldnt direct browser name mapping probably browserversion combination anyhow top ten frequency chart look like 2390 46056 31950 42692 16320 28751 31760 24220 1460 20756 19100 19416 17270 17393 20640 13990 27250 13338 11600 12594 avproductstatesidentifier id specific configuration user antivirus software 28970 unique float value avproductsinstalled assuming number antivirus product installed 90 machine 12 product installed probably drop one row 0 avproductsinstalled probably 10 6208893 20 2459008 30 208103 nan 36221 40 8757 50 471 60 28 70 1 00 1 avproductsenabled na 10 8654101 20 198652 nan 36221 00 25958 30 6075 40 453 50 23 hastpm true machine tpm trusted platform module tpm specialized chip endpoint device store rsa encryption key specific host system hardware authentication tpm chip contains rsa key pair called endorsement key ek pair maintained inside chip cannot accessed softwaresource google search 1 8814167 0 107316 countryidentifier id country machine located 222 unique int64 id wikipedia cite 255 country independent territory source exact country code austria 43 highest number row data set usa001 2 cityidentifier id city machine located 107366 unique city huge number5 nan organizationidentifier id organization machine belongs organization id mapped specific company broad industry 49 unique organisation 50 computer one org another 25 notclassified here breakup top 5 value 270 4196457 nan 2751518 180 1764175 480 63845 500 45502 geonameidentifier id column 292 geographic region machine located localeenglishnameidentifier english name locale id current user column contains 276 locale int64 id locale neither language country language may spoken multiple country often subtle difference single country may speak multiple language locale therefore area particular language spoken may may align geographical andor political boundary source platform calculates platform name o related property processor property frequency table windows10 8618715 windows8 194508 windows7 93889 windows2016 14371 processor process architecture installed operating system frequency x64 8105435 x86 815702 arm64 346 osver version current operating system 10000 8632545 6300 194447 6110 93268 6100 582 10030 225 10010 141 osbuild build current operating system 76 unique build number 5 form majority distribution top 10 value 17134 3915521 16299 2503681 15063 780270 14393 730819 10586 411606 10240 270192 9600 194508 7601 93306 17692 3184 ossuite product suite mask current operating system skewed distribution osplatformsubrelease return o platform subrelease window vista window 7 window 8 th1 th2 le skewed distribution ossuite rs4 3915526 rs3 2503681 rs2 780270 rs1 730819 th2 411606 th1 270192 windows81 194508 windows7 93889 prers5 20992 osbuildlab build lab generated current o example 960017630amd64frewinblue_r71501092022 top 5 value count 171341amd64frers4_release1804101804 3658199 16299431amd64frers3_release_svc_escrow1805021908 1252674 1629915amd64frers3_release1709281534 961060 150630amd64frers2_release1703171834 718033 171341x86frers4_release1804101804 257074 skuedition goal feature use product type defined msdn map skuedition name useful population reporting valid product type defined sdxrootdatawindowseditionsxml api used since vista server 2008 many product type apply window 10 skuedition string value one three class result design must hand class home 5514341 pro 3224164 invalid 78054 education 40694 enterprise 34357 enterprise ltsb 20702 cloud 5589 server 3582 isprotected calculated field derived spynet report av product field return true least one active uptodate antivirus product running machine b false active av product machine av active receiving latest update c null anti virus product report return whether machine protected jk machine protected antivirus lower chance infection one protected isprotected hasdetections 00 0 298904 1 184253 10 1 4261098 0 4141184 autosampleoptin submitsamplesconsent value passed service available camp 9 clue 0 8921225 1 258 puamode pua enabled mode service potentially unwanted application pua protection feature window defender antivirus identify block puas downloading installing endpoint network application considered virus malware type threat might perform action endpoint adversely affect performance use pua also refer application considered poor reputation source smode field set true device known mode window 10 mode microsoft store apps installed 00 8379843 nan 537759 10 3881 ieveridentifier retrieves version internet explorer running devicesource 303 unique value frequent value uptil nan 1370 3885842 1170 1767931 1080 474390 1110 467828 980 354411 1350 217458 530 204952 740 202542 940 173593 1050 173448 3330 156391 1070 128633 1030 114952 960 83559 nan 58894 smartscreen smartscreen enabled string value registry obtained checking order hklmsoftwarepoliciesmicrosoftwindowssystemsmartscreenenabled hklmsoftwaremicrosoftwindowscurrentversionexplorersmartscreenenabled value exists blank value existsnotset sent telemetry window defender smartscreen help protect employee try visit site previously reported phishing malware website employee try download potentially malicious file applies win 10 win 10 mobile firewall attribute true 1 window 81 window firewall enabled reported service 10 8641014 00 189119 nan 91350 uacluaenable attribute report whether administrator admin approval mode user type disabled enabled uac value reported obtained reading regkey hklmsoftwaremicrosoftwindowscurrentversionpoliciessystemenablelua uac stand user access control interesting discussion usage annoyance discussion census_mdc2formfactor grouping based combination device census level hardware characteristic logic used define form factor rooted business industry standard aligns people think device example smartphone small tablet one convertible census_devicefamily aka deviceclass indicates type device edition o intended high proportion window desktop window server window census_oemnameidentifier na census_oemmodelidentifier na census_processorcorecount number logical core processor four core processor common 45 unique value total 40 5430193 20 2311969 80 865004 120 92702 10 70390 60 69910 nan 41306 160 18551 30 13580 320 2136 census_processormanufactureridentifier na frequency distribution 50 7839318 10 1040292 nan 41313 100 339 30 218 90 1 70 1 40 1 census_processormodelidentifier na 3428 unique value census_processorclass classification processor highmediumlow initially used pricing level sku longer maintained updated column mostly empty census_primarydisktotalcapacity amount disk space primary disk machine mb popular disk size 500gb 1tb order unique value count 5735 census_primarydisktypename friendly name primary disk type hdd ssd hdd twice popular ssd dataset hdd 5806804 ssd 2466808 unknown 358251 unspecified 276776 nan 12844 census_systemvolumetotalcapacity size partition system volume installed mb 536848 unique system volume size exist following frequency count created converting data gigabyte binning 50 689171 b 50100 960770 c 100 250 2845915 250 500 2695227 e 500 1000 1601322 f 1tb 76014 source code creating cut _ rounddfcol1032 0 pdcut_ labelsa 50 b 50100 c 100 250 250 500 e 500 1000 f 1tb bins0 50 100 250 500 1000 104value_countssort_index census_hasopticaldiskdrive true indicates machine optical disk drive cddvd system dont disk drive column could provide idea old chassis older chassis might correlate higher malware rate interestingly none machine disk drive 00 8921483 name census_hasopticaldiskdrive dtype int64 census_totalphysicalram retrieves physical ram mb since mb converted gb dividing 1032 frequency count created 40 4102156 80 2200604 20 1108274 160 532480 60 400223 120 160345 30 156306 nan 80533 popular 4 gb 8 gb 2 gb 16gb source code rounddfcensus_totalphysicalram1032 0value_countsdropnafalsesort_valuesascendingfalse census_chassistypename retrieves numeric representation type chassis machine value 0 mean xx value numerical column popular one dont seem mutually exclusive example top5 common value notebook portable could used interchangeably notebook 5248812 desktop 1872125 laptop 685581 portable 360903 allinone 204295 census_internalprimarydiagonaldisplaysizeininches retrieves physical diagonal length inch primary display contains 785 unique display size used together withcensus_chassistypename differentiate device census_internalprimarydisplayresolutionhorizontal retrieves number pixel horizontal direction internal display 2180 unique value present popular one 1366 1920 resolution value might indicate age device higher resolution likely mean device relatively new compared rest hypothesis would also affected census_internalprimarydiagonaldisplaysizeininches likely larger display higher resolution census_internalprimarydisplayresolutionvertical retrieves number pixel vertical direction internal display 1560 unique value census_powerplatformrolename indicates oem preferred power management profile value help identify basic form factor device census_internalbatterytype na lot inconsistent naming scheme example lion 4cel ltab majority machine still represented le 10 label seem similar example lion lii liio could possibly placeholder lithiumion battery census_internalbatterynumberofcharges assuming number battery cycle battery cycle set zero could device first cycle battery charge vms desktop make interesting 56 machine first cycle battery charge nonbattery operated census_osversion numeric o version example 100101300 contains 469 unique value census_osarchitecture architecture o based derived osversionfull amd64 8105885 x86 815252 arm64 346 census_osbranch branch o extracted osversionfull 32 unique value five common value rs4_release 4009158 rs3_release 1237321 rs3_release_svc_escrow 1199767 rs2_release 797066 rs1_release 785534 census_osbuildnumber o build number extracted osversionfull example osbuildnumber 10512 10240 165 unique value census_osbuildrevision o build revision extracted osversionfull example osbuildrevision 1000 16458 285 unique value census_osedition edition current o sourced hklmsoftwaremicrosoftwindows ntcurrentversioneditionid registry 33 unique value column may also linked license typecensus_activationchannel top 5 core 3469991 professional 3130566 coresinglelanguage 1945461 corecountryspecific 166100 professionaleducation 56698 census_osskuname o edition friendly name currently window 30 unique value highly skewed high number core professional core_singlelanguage core_countryspecific census_osinstalltypename friendly description install used machine ie clean uupupgrade 2608037 ibsclean 1650733 update 1593308 upgrade 1251559 840121 reset 649201 refresh 205842 clean 69073 cleanpcrefresh 53609 census_osinstalllanguageidentifier na 39 unique value census_osuilocaleidentifier na 147 unique value 31 34 30 top 3 locale indentifiers census_oswuautoupdateoptionsname friendly name windowsupdate autoupdate setting machine fullauto 3954497 unknown 2519925 notify 2034254 autoinstallandrebootatmaintenancetime 371475 26961 downloadnotify 14371 census_isportableoperatingsystem indicates whether o booted running via windowstogo usb stick assuming 0 false portability 0 8916619 1 4864 census_genuinestatename friendly name osgenuinestateid 0 genuine expected integer value thanks description look like wont need encode is_genuine 7877597 invalid_license 801692 offline 228366 unknown 13826 tampered 2 census_activationchannel retail license key volume license key machine retail 4727589 oemdm 3413350 volumegvlk 450954 oemnonslp 317980 volumemak 8028 retailtbeval 3582 gvlk group volume license key acronym volume license version window basically bulkvolume license window mostly available large enterprise govt institution come premium support glvk also need km key management service deploymentsource km client volume mak product key volume license key notforresale issued organization use client computer associated way organization volume license key may transferred computer computer change ownership oem slp coa slp product key issued large computer manufacturer use slp system locked preinstallation technology bind license original motherboard via bios software oem slp key selfactivate corresponding data bios correct oem slp key user read mgadiag report software like keyfinder cannot used end user manually activate window coa slp key printed sticker affixed side computer case desktop bottom case laptop battery compartment newer laptop key user enter manually need activate window oem system builder product key use smaller system builder computer shop consultant others provide computer service customer system builder defined system builder license original equipment manufacturer assembler refurbisher software preinstaller sell customer system third party retail product key customer get buy full packaged product fpp commonly known boxed copy window retail merchant purchase window online microsoft store oem nonslp mean license key oem bound system locked preinstallation oem key notforresale may transferred another computer may however transferred computer computer transferred new ownership source census_isflightinginternal flighting window defender context mean making new development feature available soon possible development cycle refer public release internal likely mean window insider community source nan 7408759 00 1512703 10 21 census_isflightsdisabled indicates machine participating flighting 00 8760872 nan 160523 10 88 assuming 0 would mean majority device flighting enabled mean machine window insider program census_flightring ring device user would like receive flight might different ring o currently installed user change ring getting flight different ring retail 8355679 not_set 287803 unknown 243438 wi 10648 wif 10322 rp 9860 disabled 3722 osg 7 canary 3 invalid 1 census_thresholdoptin na nan 5667325 00 3253342 10 816 census_firmwaremanufactureridentifier na 712 unique value majority concentrated top 5 firmware manufacturer identifier census_firmwareversionidentifier na around 50k unique value census_issecurebootenabled indicates secure boot mode enabled googlemicrosoft secure boot component microsofts window 8 operating system relies uefi specification secure boot functionality help prevent malicious software application unauthorized operating system loading system startup process 5050 breakup sample based criterion 0 4585438 1 4336045 category 5050 breakup malware classification census_iswimbootenabled na wimboot alternative way oems deploy window wimboot deployment boot run window directly compressed window image file wim wim file immutable access managed new file system filter driver wofsys result significant reduction disk space required install window source nan 5659703 00 3261779 10 1 census_isvirtualdevice identifies virtual machine machine learning model self explaratory except phrasemachine learning model 00 8842840 10 62690 nan 15953 census_istouchenabled touch device 0 7801452 1 1120031 census_ispencapable device capable pen input 0 8581834 1 339649 census_isalwaysonalwaysconnectedcapable retreives information whether battery enables device alwaysonalwaysconnected specify whether wifi remain screen time set alwaysonalwaysconnected one following value sourceaspx state 0 disabled disables wifi always screen time keep wifi screen time setting wifi manage screen turned 1 enabled enables wifi always default screen time keep wifi screen time setting wifi manage screen turned 00 8341972 10 508168 nan 71343 wdft_isgamer indicates whether device gamer device based hardware combination 00 6174143 10 2443889 nan 303451 wdft_regionidentifier na 15 unique value microsoft documentation mention regional identifier", "tags_descriptive": ["Exploratory Data Analysis"]}