{"title": "DSFG-CityOfLA-Analysis and Solution", "description": "Data Science for Good: City of Los AngelesTable of contents  1. Overview 1.1 Related existing systems at City of LA 1.2 Problem Statement 1.3 Challenges 1.4 Ideal Solution   2. What's in the Kernel 3. Data Conversion 3.1 Functions & Logic Explanations   4. Exploratory Data Analysis 4.1 Recommendation 1 (Reduce bias : competency analysis) 4.2 Recommendation 2 (Selection of job opening days) 4.3 Recommendation 3 (Engage quality applications) 4.4 Recommendation 4 (Increase applicant pool : content analysis) 4.5 Recommendation 5 (Readable to all : reach large audience) 4.6 Recommendation 6 (Attract diversity) 4.7 Recommendation 7 (HR Buzz words) 4.8 Recommendation 8 (Neutral message) 4.9 Recommendation 9 (Convice applicants) 4.10 Recommendation 10 (Find the match)   5. Applications 5.1 Application 1 - Job Search 5.2 Application 2 - Readability Score 5.3 Application 3 - Gender Biasedness Check 5.4 Application 4 - Promotional Paths   6. Extra Notes   1. OverviewThe City of Los Angeles faces a big hiring challenge - 1/3 of its 50,000 workers are eligible to retire by July of 2020. This is an issue of big concern. As mentioned by one of the competition hosts, there are some job classes that will be challenging to fill with qualified candidates fullfilling the vision of City of LA. Their vision is to maintain excellence, provide consistent services to customers, and to meet the challenges of tomorrow through expertise, innovation, and cooperative partnerships. To acheive this, they aim to fill the vacancies with quality resources maintaining diversity. We tried to parse the data for job bulletins and tried to simplify and highlight things to realise good and bad points to overcome this challenge. Here are few points we tried to focus on in the successive sections:  To get insights from the text. To identify implicit bias in text that might be putting off people of specific gender, age, race from applying to a job class. To achieve high quality and quantity of applications. To identify and simplify the process of promotional paths.   1.1 Related Existing Systems at City of LAJob Match The functionality is available at LA city web portal. Users can select multiple fields of their interest, education/training and experience, based on which jobs are searched and displayed. Job Analysis Below is an excerpt from LA city web portal. Job analysis is the systematic identification and documentation of the tasks performed on the job and the competencies required to perform the tasks based on information/data provided by a representative group of job experts.  Information in the job analysis must be sufficiently descriptive and detailed to provide an understanding of the job.  Job is a class in the City of Los Angeles Classification Plan. Tasks are discrete, self-contained units of work. They reflect the specific behavior of individuals when performing the work. Competencies are the knowledge, skill, ability, aptitude, capability, or other personal characteristics needed to perform the job. Representative group refers to a sufficiently large sample that proportionally reflects the class. Job experts are individuals with in-depth knowledge of the job and its requirements.  City of Los Angeles Personnel Department staff conducts job analyses by interviewing job experts, usually job incumbents and/or supervisors, and having them complete questionnaires. A formal observation of the job may also be conducted as part of the job analysis. Job Awareness From AMA discussion section:  Social media promotions Word of mouth, general interest in government. Job bulletins are available on current job openings web page.   1.2 Problem StatementKaggle describes it as: For filling vacancies several job ads are posted which plays one of the vital role to attract job applications. The content, tone, and format of job bulletins can influence the quality of the applicant pool. Overly-specific job requirements may discourage diversity. The Los Angeles Mayor’s Office wants to reimagine the city’s job bulletins by using text analysis to identify needed improvements. The goal is to convert a folder full of plain-text job postings into a single structured CSV file and then to use this data to:  identify language that can negatively bias the pool of applicants; improve the diversity and quality of the applicant pool; make it easier to determine which promotions are available to employees in each job class.  Data Description The job bulletins are provided as a folder of plain-text files, one for each job classification. Job Bulletins Folder  683 plain-text job postings  Instructions and Additional Documents Folder  Job Bulletins with Annotations Annotation Descriptions.docx City Job Paths PDFs Description of promotions in job bulletins.docx Job_titles.csv Kaggle_data_dictionary.csv Sample job class export template.csv   1.3 ChallengesDealing with unstructured data is a real challenge yet the most important task. The plain text/data have a low degree of organization and is thus bit difficult to scan. It is on top priority to make this kind of data easily scannable to make it into a good use. Here as well, the Job bulletins have data which is in unstructured format. It has internal structure but is not structured via pre-defined data models or schema which makes it difficult to parse. Extracting information from text files, converting unstructured information into a structured format, combining the data, and ensuring data quality are a few roadblocks faced when it comes to making sense of the data.  To get head around nondescript data and use it to validate assumptions and support decision-making ability, as well as integrate it with visualization tools is a challenge which needs to be overcome.  Finding an ideal data extraction solution required some time and effort, but it allows to consolidate structured and unstructured data and give it a clear purpose for a more effective solution.  1.4 Possible Solution Highlights1. Be where your candidates are!  Professional Job Platforms (LinkedIn)  City of LA web portal doesn't have link to the most used professionals' network portal. Social networking sites  Whether that’s Snapchat, Reddit, or LinkedIn. Use social media platform which helps to logon to most popular websites and reach large audience. Mobile App  According to Indeed, 65% of job seekers use their mobile devices to look for jobs. The ability to apply on mobile is especially important for hourly workers who might not have access to a desktop computer.  2. Deal with bias  Proactive measures  Understanding the hiring bias and how it works and by being actively alert to it creeping into your hiring process, you can nip it in the bud. Evaluate  Shortlist!! - Names, pictures and even post codes can influence the hiring decision. Ideally, candidates are judged on their qualifications and skills, not geography or the characteristics of their particular demographic. A blind resume review helps eliminate a number of unconscious biases from the process, while also help to avoid overcompensating for the same biases.  Put an everyday problem to your candidates, and assess whether their solution aligns with your organisation’s values or ways of getting things done. This keeps everything professional, and avoids a number of common biases, such as age, gender, personality or appearance.  Trainings to mitigate biases and increase cultural competency  3. Diversity Initiatives  For Female Employees  Show a viable path forward. Introduce them with females at senior levels or visible role models.  Improve and showcase work life balance.  Improve and showcase childcare and parental leaves. For General Diversity  Standardize the interview process. In order to get to the interview stage, you need to have an open minded diverse team of interviewee to ensure you’re not putting off great candidates.  Morever most people like everything straight. Indeed found 42% of job seekers found lengthy applications the most frustrating part of the application process. Try to cut-out on unwanted information. Keep it short: If possible, reduce candidate friction by creating a 1-click application process. If that doesn’t work for you, keep your qualification questions to a minimum (e.g., five and less)  The job description is often the first insight candidates have into your organisation’s culture. Be as neutral as possible, and be aware of the message that certain language sends.  You don’t have to write a completely bland job description devoid of any adjectives. However, if you seek to strike a balance, you may see changes in your pool of candidates.    2. What's in the KernelData Conversion Exploratory Data Analysis Recommendations Applications     3. Data ConversionLoading libraries", "link": "https://www.kaggle.com/tyagit3/dsfg-cityofla-analysis-and-solution", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["nltk", "sklearn", "vocabulary", "spacy", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-06-21 15:14:50", "date_scraped": "2020-12-12 18:42:37", "words": 1399, "sentences": 77, "sum_nltk": "Exploratory Data Analysis 4.1 Recommendation 1 (Reduce bias : competency analysis) 4.2 Recommendation 2 (Selection of job opening days) 4.3 Recommendation 3 (Engage quality applications) 4.4 Recommendation 4 (Increase applicant pool : content analysis) 4.5 Recommendation 5 (Readable to all : reach large audience) 4.6 Recommendation 6 (Attract diversity) 4.7 Recommendation 7 (HR Buzz words) 4.8 Recommendation 8 (Neutral message) 4.9 Recommendation 9 (Convice applicants) 4.10 Recommendation 10 (Find the match)   5.\nWe tried to parse the data for job bulletins and tried to simplify and highlight things to realise good and bad points to overcome this challenge.\nThe Los Angeles Mayor’s Office wants to reimagine the city’s job bulletins by using text analysis to identify needed improvements.\nThe goal is to convert a folder full of plain-text job postings into a single structured CSV file and then to use this data to:  identify language that can negatively bias the pool of applicants; improve the diversity and quality of the applicant pool; make it easier to determine which promotions are available to employees in each job class.\nData Description The job bulletins are provided as a folder of plain-text files, one for each job classification.", "sum_nltk_words": 194, "sum_nltk_runtime": 0.02, "sum_t5": "city of los angeles faces big hiring challenge - 1/3 of its 50,000 workers are eligible to retire by July of 2020. to acheive this, they aim to fill the vacancies with quality resources maintaining diversity. to get insights from the text. to identify implicit bias in text that might be putting off people of specific gender, age, race from applying to a job class. to achieve high quality and quantity of applications. to identify and simplify the process of promotional paths.", "sum_t5_words": 82, "sum_t5_runtime": 6.499, "runtime": 0.01, "nltk_category": "Government and Public Works", "nltk_category_score": 0.5910964012145996, "nltk_category_runtime": 19.807, "nltk_subcategory": "Textual Analysis", "nltk_subcategory_score": 0.9902530312538147, "nltk_subcategory_runtime": 31.27, "category": "Government and Public Works", "category_score": 0.5910964012145996, "subcategory": "Textual Analysis", "subcategory_score": 0.9902530312538147, "runtime_cat": 51.078, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.669", "language_code": "en", "language_score": "0.9999952639348737", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data science good city los angelestable content 1 overview 11 related existing system city la 12 problem statement 13 challenge 14 ideal solution 2 whats kernel 3 data conversion 31 function logic explanation 4 exploratory data analysis 41 recommendation 1 reduce bias competency analysis 42 recommendation 2 selection job opening day 43 recommendation 3 engage quality application 44 recommendation 4 increase applicant pool content analysis 45 recommendation 5 readable reach large audience 46 recommendation 6 attract diversity 47 recommendation 7 hr buzz word 48 recommendation 8 neutral message 49 recommendation 9 convice applicant 410 recommendation 10 find match 5 application 51 application 1 job search 52 application 2 readability score 53 application 3 gender biasedness check 54 application 4 promotional path 6 extra note 1 overviewthe city los angeles face big hiring challenge 13 50000 worker eligible retire july 2020 issue big concern mentioned one competition host job class challenging fill qualified candidate fullfilling vision city la vision maintain excellence provide consistent service customer meet challenge tomorrow expertise innovation cooperative partnership acheive aim fill vacancy quality resource maintaining diversity tried parse data job bulletin tried simplify highlight thing realise good bad point overcome challenge point tried focus successive section get insight text identify implicit bias text might putting people specific gender age race applying job class achieve high quality quantity application identify simplify process promotional path 11 related existing system city lajob match functionality available la city web portal user select multiple field interest educationtraining experience based job searched displayed job analysis excerpt la city web portal job analysis systematic identification documentation task performed job competency required perform task based informationdata provided representative group job expert information job analysis must sufficiently descriptive detailed provide understanding job job class city los angeles classification plan task discrete selfcontained unit work reflect specific behavior individual performing work competency knowledge skill ability aptitude capability personal characteristic needed perform job representative group refers sufficiently large sample proportionally reflects class job expert individual indepth knowledge job requirement city los angeles personnel department staff conduct job analysis interviewing job expert usually job incumbent andor supervisor complete questionnaire formal observation job may also conducted part job analysis job awareness ama discussion section social medium promotion word mouth general interest government job bulletin available current job opening web page 12 problem statementkaggle describes filling vacancy several job ad posted play one vital role attract job application content tone format job bulletin influence quality applicant pool overlyspecific job requirement may discourage diversity los angeles mayor office want reimagine city job bulletin using text analysis identify needed improvement goal convert folder full plaintext job posting single structured csv file use data identify language negatively bias pool applicant improve diversity quality applicant pool make easier determine promotion available employee job class data description job bulletin provided folder plaintext file one job classification job bulletin folder 683 plaintext job posting instruction additional document folder job bulletin annotation annotation descriptionsdocx city job path pdfs description promotion job bulletinsdocx job_titlescsv kaggle_data_dictionarycsv sample job class export templatecsv 13 challengesdealing unstructured data real challenge yet important task plain textdata low degree organization thus bit difficult scan top priority make kind data easily scannable make good use well job bulletin data unstructured format internal structure structured via predefined data model schema make difficult parse extracting information text file converting unstructured information structured format combining data ensuring data quality roadblock faced come making sense data get head around nondescript data use validate assumption support decisionmaking ability well integrate visualization tool challenge need overcome finding ideal data extraction solution required time effort allows consolidate structured unstructured data give clear purpose effective solution 14 possible solution highlights1 candidate professional job platform linkedin city la web portal doesnt link used professional network portal social networking site whether thats snapchat reddit linkedin use social medium platform help logon popular website reach large audience mobile app according indeed 65 job seeker use mobile device look job ability apply mobile especially important hourly worker might access desktop computer 2 deal bias proactive measure understanding hiring bias work actively alert creeping hiring process nip bud evaluate shortlist name picture even post code influence hiring decision ideally candidate judged qualification skill geography characteristic particular demographic blind resume review help eliminate number unconscious bias process also help avoid overcompensating bias put everyday problem candidate ass whether solution aligns organisation value way getting thing done keep everything professional avoids number common bias age gender personality appearance training mitigate bias increase cultural competency 3 diversity initiative female employee show viable path forward introduce female senior level visible role model improve showcase work life balance improve showcase childcare parental leaf general diversity standardize interview process order get interview stage need open minded diverse team interviewee ensure youre putting great candidate morever people like everything straight indeed found 42 job seeker found lengthy application frustrating part application process try cutout unwanted information keep short possible reduce candidate friction creating 1click application process doesnt work keep qualification question minimum eg five le job description often first insight candidate organisation culture neutral possible aware message certain language sends dont write completely bland job description devoid adjective however seek strike balance may see change pool candidate 2 whats kerneldata conversion exploratory data analysis recommendation application 3 data conversionloading library", "tags_descriptive": []}