{"title": "EDA_to_Insight", "description": "Data Description :Much of the Text was taken from the official page  This dataset contains photos of streets, taken from the roof of a car. We're attempting to predict the position and orientation of all un-masked cars in the test images. You should also provide a confidence score indicating how sure you are of your prediction. Pose Information (train.csv) Note that rotation values are angles expressed in radians, relative to the camera. The primary data is images of cars and related pose information. The pose information is formatted as strings, as follows: model type, yaw, pitch, roll, x, y, z A concrete example with two cars in the photo: 5 0.5 0.5 0.5 0.0 0.0 0.0 32 0.25 0.25 0.25 0.5 0.4 0.7 Submissions (per sample_submission.csv) are very similar, with the addition of a confidence score, and the removal of the model type. You are not required to predict the model type of the vehicle in question. ID, PredictionString ID_1d7bc9b31,0.5 0.5 0.5 0.0 0.0 0.0 1.0 indicating that this prediction has a confidence score of 1.0. Other Data: Image Masks (test_masks.zip / train_masks.zip) Some cars in the images are not of interest (too far away, etc.). Binary masks are provided to allow competitors to remove them from consideration. Car Models 3D models of all cars of interest are available for download as pickle files - they can be compared against cars in images, used as references for rotation, etc.", "link": "https://www.kaggle.com/dataraj/eda-to-insight", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-10-23 04:56:08", "date_scraped": "2020-12-13 15:26:06", "words": 240, "sentences": 11, "sum_nltk": "We're attempting to predict the position and orientation of all un-masked cars in the test images.\nYou should also provide a confidence score indicating how sure you are of your prediction.\nPose Information (train.csv) Note that rotation values are angles expressed in radians, relative to the camera.\nThe primary data is images of cars and related pose information.\nThe pose information is formatted as strings, as follows: model type, yaw, pitch, roll, x, y, z A concrete example with two cars in the photo: 5 0.5 0.5 0.5 0.0 0.0 0.0 32 0.25 0.25 0.25 0.5 0.4 0.7 Submissions (per sample_submission.csv) are very similar, with the addition of a confidence score, and the removal of the model type.\nID, PredictionString ID_1d7bc9b31,0.5 0.5 0.5 0.0 0.0 0.0 1.0 indicating that this prediction has a confidence score of 1.0.\nOther Data: Image Masks (test_masks.zip / train_masks.zip) Some cars in the images are not of interest (too far away, etc.).\nBinary masks are provided to allow competitors to remove them from consideration.\nCar Models 3D models of all cars of interest are available for download as pickle files - they can be compared against cars in images, used as references for rotation, etc.", "sum_nltk_words": 192, "sum_nltk_runtime": 0.003, "sum_t5": "the primary data is images of cars and related pose information. the pose information is formatted as strings, as follows: model type, yaw, pitch, roll, x, y, z. submissions are very similar, with the addition of a confidence score, and the removal of the model type. you are not required to predict the model type of the vehicle in question. binary masks are provided to allow competitors to remove them from consideration.", "sum_t5_words": 72, "sum_t5_runtime": 5.798, "runtime": 0.004, "nltk_category": "Wholesale & Retail", "nltk_category_score": 0.12544743716716766, "nltk_category_runtime": 22.196, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6682847142219543, "nltk_subcategory_runtime": 35.418, "category": "Wholesale & Retail", "category_score": 0.12544743716716766, "subcategory": "Machine Learning", "subcategory_score": 0.6682847142219543, "runtime_cat": 57.615, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.668", "language_code": "en", "language_score": "0.9999967131854017", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data description much text taken official page dataset contains photo street taken roof car attempting predict position orientation unmasked car test image also provide confidence score indicating sure prediction pose information traincsv note rotation value angle expressed radian relative camera primary data image car related pose information pose information formatted string follows model type yaw pitch roll x z concrete example two car photo 5 05 05 05 00 00 00 32 025 025 025 05 04 07 submission per sample_submissioncsv similar addition confidence score removal model type required predict model type vehicle question id predictionstring id_1d7bc9b3105 05 05 00 00 00 10 indicating prediction confidence score 10 data image mask test_maskszip train_maskszip car image interest far away etc binary mask provided allow competitor remove consideration car model 3d model car interest available download pickle file compared car image used reference rotation etc", "tags_descriptive": ["Exploratory Data Analysis"]}