{"title": "COVID19 Time series analysis+Plotly Visualization", "description": "source - https://www.google.com/covid19/ OverviewCoronavirus disease (COVID-19) is an infectious disease caused by a new virus. The disease causes respiratory illness (like the flu) with symptoms such as a cough, fever, and in more severe cases, difficulty breathing. You can protect yourself by washing your hands frequently, avoiding touching your face, and avoiding close contact (1 meter or 3 feet) with people who are unwell. How it spreadsCoronavirus disease spreads primarily through contact with an infected person when they cough or sneeze. It also spreads when a person touches a surface or object that has the virus on it, then touches their eyes, nose, or mouth. symptomsPeople may be sick with the virus for 1 to 14 days before developing symptoms. The most common symptoms of coronavirus disease (COVID-19) are fever, tiredness, and dry cough. Most people (about 80%) recover from the disease without needing special treatment. PreventionsYou can protect yourself and help prevent spreading the virus to others if you: Do  Wash your hands regularly for 20 seconds, with soap and water or alcohol-based hand rub  Cover your nose and mouth with a disposable tissue or flexed elbow when you cough or sneeze  Avoid close contact (1 meter or 3 feet) with people who are unwell  Stay home and self-isolate from others in the household if you feel unwell TreatmentsThere is no specific medicine to prevent or treat coronavirus disease (COVID-19). People may need supportive care to help them breathe.", "link": "https://www.kaggle.com/janmejoy/covid19-time-series-analysis-plotly-visualization", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-05 20:55:06", "date_scraped": "2020-12-12 18:15:06", "words": 244, "sentences": 10, "sum_nltk": "The disease causes respiratory illness (like the flu) with symptoms such as a cough, fever, and in more severe cases, difficulty breathing.\nYou can protect yourself by washing your hands frequently, avoiding touching your face, and avoiding close contact (1 meter or 3 feet) with people who are unwell.\nHow it spreadsCoronavirus disease spreads primarily through contact with an infected person when they cough or sneeze.\nIt also spreads when a person touches a surface or object that has the virus on it, then touches their eyes, nose, or mouth.\nThe most common symptoms of coronavirus disease (COVID-19) are fever, tiredness, and dry cough.\nPreventionsYou can protect yourself and help prevent spreading the virus to others if you: Do  Wash your hands regularly for 20 seconds, with soap and water or alcohol-based hand rub  Cover your nose and mouth with a disposable tissue or flexed elbow when you cough or sneeze  Avoid close contact (1 meter or 3 feet) with people who are unwell  Stay home and self-isolate from others in the household if you feel unwell TreatmentsThere is no specific medicine to prevent or treat coronavirus disease (COVID-19).\nPeople may need supportive care to help them breathe.", "sum_nltk_words": 196, "sum_nltk_runtime": 0.002, "sum_t5": "the disease causes respiratory illness (like the flu) with symptoms such as a cough, fever, and in more severe cases, difficulty breathing. you can protect yourself by washing your hands frequently, avoiding touching your face, and avoiding close contact (1 meter or 3 feet) with people who are unwell. symptomsPeople may be sick with the virus for 1 to 14 days before developing symptoms. most people (about 80%) recover from the disease without needing special treatment.", "sum_t5_words": 76, "sum_t5_runtime": 5.72, "runtime": 0.002, "nltk_category": "Healthcare", "nltk_category_score": 0.841118574142456, "nltk_category_runtime": 18.393, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.8752067685127258, "nltk_subcategory_runtime": 29.223, "category": "Healthcare", "category_score": 0.841118574142456, "subcategory": "Physical", "subcategory_score": 0.8752067685127258, "runtime_cat": 47.617, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.659", "language_code": "en", "language_score": "0.9999965395561458", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "source httpswwwgooglecomcovid19 overviewcoronavirus disease covid19 infectious disease caused new virus disease cause respiratory illness like flu symptom cough fever severe case difficulty breathing protect washing hand frequently avoiding touching face avoiding close contact 1 meter 3 foot people unwell spreadscoronavirus disease spread primarily contact infected person cough sneeze also spread person touch surface object virus touch eye nose mouth symptomspeople may sick virus 1 14 day developing symptom common symptom coronavirus disease covid19 fever tiredness dry cough people 80 recover disease without needing special treatment preventionsyou protect help prevent spreading virus others wash hand regularly 20 second soap water alcoholbased hand rub cover nose mouth disposable tissue flexed elbow cough sneeze avoid close contact 1 meter 3 foot people unwell stay home selfisolate others household feel unwell treatmentsthere specific medicine prevent treat coronavirus disease covid19 people may need supportive care help breathe", "tags_descriptive": []}