{"title": "Big GAN 128 - [LB 12]", "description": "Pretrained Big GAN 128 - Scores LB 12In this kernel, we load Pretrained Big GAN 128 and have fun generating some dog images. It's amazing how accurate Big GAN generated dogs appear. Big GAN 128 was trained on the same set of dogs that we are using in Kaggle's Dog Competition. (Stanford Dogs are a subset of ImageNet Dogs). If we were allowed more than 9 hours to train, we could train Big GAN 128 in a Kaggle notebook/kernel and submit it as our competition solution!! Big GAN 128 scores an amazing LB 12!! (Since we need to turn on internet to download pretrained network weights, the outputted images from this notebook/kernel cannot be submitted). Big GAN 128 can produce 1000 different classes of images. A full list is here. For example class 472 is a canoe and class 71 is a scorpion. Try changing the code below to see images besides dogs. Furthermore you can do latent walks between different classes. As an example I morph dogs into cats below. Dogs are classes 151 thru 280 and cats are 281 thru 293. You can read a blog about Big GAN here. A paper descibing Big GAN is here. We download Big GAN from GitHub here", "link": "https://www.kaggle.com/cdeotte/big-gan-128-lb-12", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-08-17 07:03:07", "date_scraped": "2020-12-12 20:11:09", "words": 206, "sentences": 15, "sum_nltk": "Pretrained Big GAN 128 - Scores LB 12In this kernel, we load Pretrained Big GAN 128 and have fun generating some dog images.\nIt's amazing how accurate Big GAN generated dogs appear.\nBig GAN 128 was trained on the same set of dogs that we are using in Kaggle's Dog Competition.\n(Stanford Dogs are a subset of ImageNet Dogs).\nIf we were allowed more than 9 hours to train, we could train Big GAN 128 in a Kaggle notebook/kernel and submit it as our competition solution!!\nBig GAN 128 scores an amazing LB 12!!\n(Since we need to turn on internet to download pretrained network weights, the outputted images from this notebook/kernel cannot be submitted).\nBig GAN 128 can produce 1000 different classes of images.\nFor example class 472 is a canoe and class 71 is a scorpion.\nTry changing the code below to see images besides dogs.\nFurthermore you can do latent walks between different classes.\nAs an example I morph dogs into cats below.\nDogs are classes 151 thru 280 and cats are 281 thru 293.\nYou can read a blog about Big GAN here.\nA paper descibing Big GAN is here.\nWe download Big GAN from GitHub here", "sum_nltk_words": 186, "sum_nltk_runtime": 0.003, "sum_t5": "Big GAN 128 was trained on the same set of dogs that we are using in Kaggle's Dog Competition. if we were allowed more than 9 hours to train, we could train Big GAN 128 in a Kaggle notebook/kernel and submit it as our competition solution. big GAN 128 can produce 1000 different classes of images. for example class 472 is a canoe and class 71 is a scorpion.", "sum_t5_words": 69, "sum_t5_runtime": 4.789, "runtime": 0.004, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.06424914300441742, "nltk_category_runtime": 18.383, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6271094083786011, "nltk_subcategory_runtime": 29.338, "category": "Biotechnological & Life Sciences", "category_score": 0.06424914300441742, "subcategory": "Machine Learning", "subcategory_score": 0.6271094083786011, "runtime_cat": 47.721, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.686", "language_code": "en", "language_score": "0.9999964754496004", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "pretrained big gan 128 score lb 12in kernel load pretrained big gan 128 fun generating dog image amazing accurate big gan generated dog appear big gan 128 trained set dog using kaggles dog competition stanford dog subset imagenet dog allowed 9 hour train could train big gan 128 kaggle notebookkernel submit competition solution big gan 128 score amazing lb 12 since need turn internet download pretrained network weight outputted image notebookkernel cannot submitted big gan 128 produce 1000 different class image full list example class 472 canoe class 71 scorpion try changing code see image besides dog furthermore latent walk different class example morph dog cat dog class 151 thru 280 cat 281 thru 293 read blog big gan paper descibing big gan download big gan github", "tags_descriptive": []}