{"title": "Simple Exploration Notebook - QIQC", "description": "Notebook Objective: Objective of the notebook is to explore the data and to build a simple baseline model. Objective of the competition: In this second competition by Quora, the objective is to predict whether a question asked on Quora is sincere or not. This is a kernels only comeptition. An insincere question is defined as a question intended to make a statement rather than look for helpful answers. Some characteristics that can signify that a question is insincere:  Has a non-neutral tone Has an exaggerated tone to underscore a point about a group of people Is rhetorical and meant to imply a statement about a group of people   Is disparaging or inflammatory Suggests a discriminatory idea against a protected class of people, or seeks confirmation of a stereotype Makes disparaging attacks/insults against a specific person or group of people Based on an outlandish premise about a group of people Disparages against a characteristic that is not fixable and not measurable   Isn't grounded in reality Based on false information, or contains absurd assumptions   Uses sexual content (incest, bestiality, pedophilia) for shock value, and not to seek genuine answers  P.S: This is a work in progress. Please stay tuned.!", "link": "https://www.kaggle.com/sudalairajkumar/simple-exploration-notebook-qiqc", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-11-07 11:09:20", "date_scraped": "2020-12-13 16:20:42", "words": 205, "sentences": 6, "sum_nltk": "Notebook Objective: Objective of the notebook is to explore the data and to build a simple baseline model.\nObjective of the competition: In this second competition by Quora, the objective is to predict whether a question asked on Quora is sincere or not.\nThis is a kernels only comeptition.\nAn insincere question is defined as a question intended to make a statement rather than look for helpful answers.\nSome characteristics that can signify that a question is insincere:  Has a non-neutral tone Has an exaggerated tone to underscore a point about a group of people Is rhetorical and meant to imply a statement about a group of people   Is disparaging or inflammatory Suggests a discriminatory idea against a protected class of people, or seeks confirmation of a stereotype Makes disparaging attacks/insults against a specific person or group of people Based on an outlandish premise about a group of people Disparages against a characteristic that is not fixable and not measurable   Isn't grounded in reality Based on false information, or contains absurd assumptions   Uses sexual content (incest, bestiality, pedophilia) for shock value, and not to seek genuine answers  P.S: This is a work in progress.\nPlease stay tuned.!", "sum_nltk_words": 200, "sum_nltk_runtime": 0.002, "sum_t5": "notebook is to explore the data and build a simple baseline model. the notebook is part of a competition to predict whether a question is sincere. an insincere question is defined as a question intended to make a statement. the notebook is available on ipad and ipad. click here to enter the notebook. a winner will be announced on november 8. a saturday, november 8 contest will be held in london.", "sum_t5_words": 71, "sum_t5_runtime": 5.097, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.5769391655921936, "nltk_category_runtime": 17.362, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.568877100944519, "nltk_subcategory_runtime": 28.224, "category": "Education & Research", "category_score": 0.5769391655921936, "subcategory": "Student", "subcategory_score": 0.568877100944519, "runtime_cat": 45.586, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.782", "language_code": "en", "language_score": "0.999995328309889", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notebook objective objective notebook explore data build simple baseline model objective competition second competition quora objective predict whether question asked quora sincere kernel comeptition insincere question defined question intended make statement rather look helpful answer characteristic signify question insincere nonneutral tone exaggerated tone underscore point group people rhetorical meant imply statement group people disparaging inflammatory suggests discriminatory idea protected class people seek confirmation stereotype make disparaging attacksinsults specific person group people based outlandish premise group people disparages characteristic fixable measurable isnt grounded reality based false information contains absurd assumption us sexual content incest bestiality pedophilia shock value seek genuine answer p work progress please stay tuned", "tags_descriptive": ["Exploratory Data Analysis"]}