{"title": "A Decade of  Championship Rankings Animated", "description": "Analyzing a Decade of NCAA Championship RankingsAs last year's winner of the Men's March Madness Competition I am eager to defend my title.  To kick things off, I wanted to start with a lightweight and fun animation with Plotly.  I chose to look at the Pomeroy Rankings for the last 10 National Championship winnning teams.  The below animation displays the change in the Pomeroy Rankings (team-by-team) for the last 15 weeks of the given regular season. Although its a simple animation, there are a few interesting insights that can infered from it.  The 2 Connecticut teams (2011 & 2014) were the only teams to have a ranking over 10 at any point in their championship seasons. 4 teams never had a rank over 5 at any point in their championship seasons. With the exception of the 2 Connecticut teams, all teams ranked in the top 5 at week #1 in the animation. Only one of those teams, Duke - 2015, finished outside the top 5 (7) at week #15.  So when I'm filling out my bracket this year and working on the algorithm for the 2019 Competition, I'm going to strongly weight teams that have had consistently strong Pomeroy rankings throughout the season. Feel free to check out my code and let me know what you think.  Thanks!", "link": "https://www.kaggle.com/mtodisco10/a-decade-of-championship-rankings-animated", "tags": ["Exploratory Data Analysis", "Sports"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-02-16 14:16:57", "date_scraped": "2020-12-13 13:59:30", "words": 224, "sentences": 12, "sum_nltk": "Analyzing a Decade of NCAA Championship RankingsAs last year's winner of the Men's March Madness Competition I am eager to defend my title.\nTo kick things off, I wanted to start with a lightweight and fun animation with Plotly.\nI chose to look at the Pomeroy Rankings for the last 10 National Championship winnning teams.\nThe below animation displays the change in the Pomeroy Rankings (team-by-team) for the last 15 weeks of the given regular season.\nAlthough its a simple animation, there are a few interesting insights that can infered from it.\nThe 2 Connecticut teams (2011 & 2014) were the only teams to have a ranking over 10 at any point in their championship seasons.\n4 teams never had a rank over 5 at any point in their championship seasons.\nWith the exception of the 2 Connecticut teams, all teams ranked in the top 5 at week #1 in the animation.\nOnly one of those teams, Duke - 2015, finished outside the top 5 (7) at week #15.\nSo when I'm filling out my bracket this year and working on the algorithm for the 2019 Competition, I'm going to strongly weight teams that have had consistently strong Pomeroy rankings throughout the season.", "sum_nltk_words": 194, "sum_nltk_runtime": 0.003, "sum_t5": "the 2 Connecticut teams (2011 & 2014) were the only teams to have a ranking over 10 at any point in their championship season. 4 teams never had a rank over 5 at any point in their championship season. only one of those teams, Duke - 2015, finished outside the top 5 (7) at week #15. if you have any questions, please contact eric saunders at ericsson@ericsa.edu.", "sum_t5_words": 67, "sum_t5_runtime": 4.792, "runtime": 0.004, "nltk_category": "Utilities", "nltk_category_score": 0.4842335879802704, "nltk_category_runtime": 17.782, "nltk_subcategory": "Valuation", "nltk_subcategory_score": 0.7256751656532288, "nltk_subcategory_runtime": 28.102, "category": "Utilities", "category_score": 0.4842335879802704, "subcategory": "Valuation", "subcategory_score": 0.7256751656532288, "runtime_cat": 45.885, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.645", "language_code": "en", "language_score": "0.9999984593691709", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "analyzing decade ncaa championship rankingsas last year winner men march madness competition eager defend title kick thing wanted start lightweight fun animation plotly chose look pomeroy ranking last 10 national championship winnning team animation display change pomeroy ranking teambyteam last 15 week given regular season although simple animation interesting insight infered 2 connecticut team 2011 2014 team ranking 10 point championship season 4 team never rank 5 point championship season exception 2 connecticut team team ranked top 5 week 1 animation one team duke 2015 finished outside top 5 7 week 15 im filling bracket year working algorithm 2019 competition im going strongly weight team consistently strong pomeroy ranking throughout season feel free check code let know think thanks", "tags_descriptive": ["Exploratory Data Analysis", "Sports"]}