{"title": "Object-based solution for DSTL", "description": "End-to-end object-based solution for DSTLThere are typically two approaches for geo-image-segmentation: pixel-based and object-based and I'm just surprised that the latter was rarely mentioned in the forum and there seems no kernels available for this competition so I decided to share my object-based solution and hopefully it will be of help. Again, this competition comes with tons of challenges mostly in programmming/engineering which have been a pain for me. I'm grateful for those who shared their scripts/solutions. Without them, I weren't be able to make a single valid submission. This solution was inspried by the following two articles:  Python for Object Based Image Analysis (OBIA) https://www.machinalis.com/blog/obia/  A Python-Based Open Source System for Geographic Object-Based Image Analysis (GEOBIA) Utilizing Raster Attribute Tables http://www.mdpi.com/2072-4292/6/7/6111/htm   Many ideas/functions/tools were borrowed from Konstantin Lopuhin's great kernel: https://www.kaggle.com/lopuhin/dstl-satellite-imagery-feature-detection/full-pipeline-demo-poly-pixels-ml-poly", "link": "https://www.kaggle.com/chriscc/object-based-solution-for-dstl", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "opencv-python"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-02-06 18:15:50", "date_scraped": "2020-12-12 19:16:58", "words": 136, "sentences": 5, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.07556694746017456, "description_category_runtime": 19.374, "description_subcategory": "Quality", "description_subcategory_score": 0.363583505153656, "description_subcategory_runtime": 31.62, "category": "Utilities", "category_score": 0.07556694746017456, "subcategory": "Quality", "subcategory_score": 0.363583505153656, "runtime_cat": 50.995, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.723", "language_code": "en", "language_score": "0.9999960539469239", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "endtoend objectbased solution dstlthere typically two approach geoimagesegmentation pixelbased objectbased im surprised latter rarely mentioned forum seems kernel available competition decided share objectbased solution hopefully help competition come ton challenge mostly programmmingengineering pain im grateful shared scriptssolutions without werent able make single valid submission solution inspried following two article python object based image analysis obia httpswwwmachinaliscomblogobia pythonbased open source system geographic objectbased image analysis geobia utilizing raster attribute table httpwwwmdpicom20724292676111htm many ideasfunctionstools borrowed konstantin lopuhins great kernel httpswwwkagglecomlopuhindstlsatelliteimageryfeaturedetectionfullpipelinedemopolypixelsmlpoly", "tags_descriptive": []}