{"title": "Python e Pandas - Exercício", "description": "Dicas de Jupyter NotebookEste programa que estamos usando no navegador se chama Jupyter Notebook e é um interpretador de Python interativo. Podemos digitar um comando de Python, apertar Shift + Enter e esse comando é executado, tendo seu resultado impresso na tela. Existem alguns atalhos bastante úteis para trabalhar com Jupyter Notebook: 0. 'Esc' - Saí do modo edição da célula atual (modo navegação) 1. 'Enter' - Edita a célula selecionada (modo navegação) 2. 'Shift + Enter' - Executa a célula selecionada (modo edição) 3. 'A' - Adiciona uma nova célula acima da célula atual (modo navegação) 4. 'B' - Adiciona uma nova célula abaixo da célula atual (modo navegação) 5. 'X' - Recorta a célula selecionada (modo navegação) 6. 'Z' - Desfaz a deleção de uma célula (modo navegação) 7. 'Ctrl + Z' - Desfaz as últimas edições (modo edição) 8. 'Ctrl + Shift + Z' - Refaz o último comando de desfazer (modo edição) 9. 'H' - Abre um arquivo de ajuda com todos os atalhos (modo navegação) 10. 'Tab' - Faz sugestões para completar o código (modo edição) 11. 'Shift + Tab' - Faz sugestões de assinatura de um método ou função (modo edição) 12. '?função' - Mostra a documentação de uma dada função (modo edição)", "link": "https://www.kaggle.com/joaoavf/python-e-pandas-exercicio", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "portuguese", "date_project": "2020-03-04 04:24:40", "date_scraped": "2020-12-12 17:15:12", "words": 209, "sentences": 16, "sum_nltk": "Dicas de Jupyter NotebookEste programa que estamos usando no navegador se chama Jupyter Notebook e é um interpretador de Python interativo.\nPodemos digitar um comando de Python, apertar Shift + Enter e esse comando é executado, tendo seu resultado impresso na tela.\nExistem alguns atalhos bastante úteis para trabalhar com Jupyter Notebook: 0.\n'Esc' - Saí do modo edição da célula atual (modo navegação) 1.\n'Enter' - Edita a célula selecionada (modo navegação) 2.\n'Shift + Enter' - Executa a célula selecionada (modo edição) 3.\n'A' - Adiciona uma nova célula acima da célula atual (modo navegação) 4.\n'B' - Adiciona uma nova célula abaixo da célula atual (modo navegação) 5.\n'X' - Recorta a célula selecionada (modo navegação) 6.\n'Z' - Desfaz a deleção de uma célula (modo navegação) 7.\n'Ctrl + Z' - Desfaz as últimas edições (modo edição) 8.\n'Ctrl + Shift + Z' - Refaz o último comando de desfazer (modo edição) 9.\n'H' - Abre um arquivo de ajuda com todos os atalhos (modo navegação) 10.\n'Tab' - Faz sugestões para completar o código (modo edição) 11.\n'Shift + Tab' - Faz sugestões de assinatura de um método ou função (modo edição) 12.\n'?função' - Mostra a documentação de uma dada função (modo edição)", "sum_nltk_words": 194, "sum_nltk_runtime": 0.004, "sum_t5": "'Jupyter Notebook' is a program that is used by web browsers. it is an interativo interpreter of Python. it can be used to digitize a comando, execute a célula and edit it. 'A' is a célula acima da célula atual. 'B' is a célula abaixo da célul", "sum_t5_words": 47, "sum_t5_runtime": 6.978, "runtime": 0.003, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.21593260765075684, "nltk_category_runtime": 37.989, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.4894954264163971, "nltk_subcategory_runtime": 61.76, "category": "Biotechnological & Life Sciences", "category_score": 0.21593260765075684, "subcategory": "Physical", "subcategory_score": 0.4894954264163971, "runtime_cat": 99.749, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.714", "language_code": "pt", "language_score": "0.999997628798602", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "dicas de jupyter notebookeste programa que estamos usando navegador se chama jupyter notebook e e um interpretador de python interativo podemos digitar um comando de python apertar shift enter e esse comando e executado tendo seu resultado impresso na tela existem alguns atalhos bastante uteis para trabalhar com jupyter notebook 0 esc sai modo edicao da celula atual modo navegacao 1 enter edita celula selecionada modo navegacao 2 shift enter executa celula selecionada modo edicao 3 adiciona uma nova celula acima da celula atual modo navegacao 4 b adiciona uma nova celula abaixo da celula atual modo navegacao 5 x recorta celula selecionada modo navegacao 6 z desfaz delecao de uma celula modo navegacao 7 ctrl z desfaz ultima edicoes modo edicao 8 ctrl shift z refaz ultimo comando de desfazer modo edicao 9 h abre um arquivo de ajuda com todos o atalhos modo navegacao 10 tab faz sugestoes para completar codigo modo edicao 11 shift tab faz sugestoes de assinatura de um metodo ou funcao modo edicao 12 funcao mostra documentacao de uma dada funcao modo edicao", "tags_descriptive": []}