{"title": " EDA, ISO, PCA, LLE + Stratified LSTM Attention", "description": "End to End Machine Learning for VSB Power Line Fault Detection  Faults in electric transmission lines can lead to a destructive phenomenon called partial discharge. If left alone, partial discharges can damage equipment to the point that it stops functioning entirely. Your challenge is to detect partial discharges so that repairs can be made before any lasting harm occurs. Each signal contains 800,000 measurements of a power line's voltage, taken over 20 milliseconds. As the underlying electric grid operates at 50 Hz, this means each signal covers a single complete grid cycle. The grid itself operates on a 3-phase power scheme, and all three phases are measured simultaneously.  The Challenge is to detect partial discharge patterns in signals acquired from these power lines with a new meter designed at the ENET Centre at VSB. Effective classifiers using this data will make it possible to continuously monitor power lines for faults. Inspired from Bruno Aquino's Kernel: https://www.kaggle.com/braquino/5-fold-lstm-attention-fully-commented-0-694 Content -  Import Library -  Define Matthews Correlation -  Create Attention Layer -  Import Data -  Define Transformations -  Prepare Training Data -  Data Exploration     - Distribution of mean values per rows     - Distribution of mean values per columns     - Distribution of S.D values per rows     - Distribution of S.D values per columns     - Distribution of Skewness values per rows     - Distribution of Skewness values per columns     - Distribution of Kurtosis values per rows     - Distribution of Kurtosis values per columns - Applying TSNE Transformation - Applying PCA Transformation> - Applying ISO Transformation - Applying LLE Transformation> - Building the RNN Model Architecture - Applying Stratified K Fold Technique - Identify the Best Threshold - Create Submission File", "link": "https://www.kaggle.com/roydatascience/eda-iso-pca-lle-stratified-lstm-attention", "tags": ["DL", "Classification", "RNN", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-07-06 06:40:36", "date_scraped": "2020-12-13 18:09:07", "words": 315, "sentences": 9, "sum_nltk": "End to End Machine Learning for VSB Power Line Fault Detection  Faults in electric transmission lines can lead to a destructive phenomenon called partial discharge.\nIf left alone, partial discharges can damage equipment to the point that it stops functioning entirely.\nYour challenge is to detect partial discharges so that repairs can be made before any lasting harm occurs.\nEach signal contains 800,000 measurements of a power line's voltage, taken over 20 milliseconds.\nAs the underlying electric grid operates at 50 Hz, this means each signal covers a single complete grid cycle.\nThe grid itself operates on a 3-phase power scheme, and all three phases are measured simultaneously.\nThe Challenge is to detect partial discharge patterns in signals acquired from these power lines with a new meter designed at the ENET Centre at VSB.\nEffective classifiers using this data will make it possible to continuously monitor power lines for faults.", "sum_nltk_words": 144, "sum_nltk_runtime": 0.003, "sum_t5": "a new meter is being developed at the VSB ENET Centre. it will detect partial discharge patterns in signals acquired from power lines. this will make it possible to continuously monitor power lines for faults. the challenge is to detect partial discharge patterns in signals. this will help to make repairs before any lasting harm occurs. a total of 800,000 measurements of a power line's voltage are taken. each signal covers a single complete grid cycle.", "sum_t5_words": 76, "sum_t5_runtime": 6.134, "runtime": 0.005, "nltk_category": "Utilities", "nltk_category_score": 0.5365822911262512, "nltk_category_runtime": 12.856, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9620745182037354, "nltk_subcategory_runtime": 20.337, "category": "Utilities", "category_score": 0.5365822911262512, "subcategory": "Machine Learning", "subcategory_score": 0.9620745182037354, "runtime_cat": 33.192, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.707", "language_code": "en", "language_score": "0.9999953133213408", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "end end machine learning vsb power line fault detection fault electric transmission line lead destructive phenomenon called partial discharge left alone partial discharge damage equipment point stop functioning entirely challenge detect partial discharge repair made lasting harm occurs signal contains 800000 measurement power line voltage taken 20 millisecond underlying electric grid operates 50 hz mean signal cover single complete grid cycle grid operates 3phase power scheme three phase measured simultaneously challenge detect partial discharge pattern signal acquired power line new meter designed enet centre vsb effective classifier using data make possible continuously monitor power line fault inspired bruno aquinos kernel httpswwwkagglecombraquino5foldlstmattentionfullycommented0694 content import library define matthew correlation create attention layer import data define transformation prepare training data data exploration distribution mean value per row distribution mean value per column distribution sd value per row distribution sd value per column distribution skewness value per row distribution skewness value per column distribution kurtosis value per row distribution kurtosis value per column applying tsne transformation applying pca transformation applying iso transformation applying lle transformation building rnn model architecture applying stratified k fold technique identify best threshold create submission file", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Recurrent Neural Network (RNN)", "Feature Engineering"]}