{"title": "Elo world", "description": "Elo worldIn this kernel, I build a LGBM model that aggregates the new_merchant_transactions.csv and historical_transactions.csv tables to the main train table. New features are built by successive grouping oncard_id and month_lag, in order to recover some information from the time serie. During the competition, I took into account the enlightments provided by others kernels, and included a few features that appeared to be important. In particular, I closely looked at the following kernels (ordered by release time):  You're Going to Want More Categories [LB 3.737] by Peter Hurford EloDA with Feature Engineering and Stacking by Bojan Tunguz A Closer Look at Date Variables by Robin Denz LGB + FE (LB 3.707) by Konrad Banachewicz My first kernel (3.699) by Chau Ngoc Huynh  Notebook  Content Loading the data Feature engineering Training the model Feature importance Submission", "link": "https://www.kaggle.com/fabiendaniel/elo-world", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-12-13 18:08:03", "date_scraped": "2020-12-12 19:19:31", "words": 138, "sentences": 4, "runtime": 0.002, "description_category": "Finance", "description_category_score": 0.1528221219778061, "description_category_runtime": 14.203, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7853825092315674, "description_subcategory_runtime": 22.967, "category": "Finance", "category_score": 0.1528221219778061, "subcategory": "Machine Learning", "subcategory_score": 0.7853825092315674, "runtime_cat": 37.17, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.806", "language_code": "en", "language_score": "0.9999959586018635", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "elo worldin kernel build lgbm model aggregate new_merchant_transactionscsv historical_transactionscsv table main train table new feature built successive grouping oncard_id month_lag order recover information time serie competition took account enlightments provided others kernel included feature appeared important particular closely looked following kernel ordered release time youre going want category lb 3737 peter hurford eloda feature engineering stacking bojan tunguz closer look date variable robin denz lgb fe lb 3707 konrad banachewicz first kernel 3699 chau ngoc huynh notebook content loading data feature engineering training model feature importance submission", "tags_descriptive": []}