{"title": "Madness at Home and on the Court - Part 1", "description": "Madness at Home and on the Court - Part 1Authors: Emilien Etchevers, Kieran Janin, Michael Karpe, Remi Le Thai, Haley Wohlever ContentsIn this notebook  Introduction  NCAA March Madness Data Analysis Seeding and Entertainment Madness through Unpredictability Entertainment due to Closeness of Games    In the second notebook:  Tweets on NCAA Data Analysis Temporal Evolution of Engagement Team Mentions Count in Tweets Sentiment Analysis for Tweets on NCAA   Conclusion  1. IntroductionMarch Madness is a period of excitement for everyone: from the die-hard fan to the serial gambler, this NCAA tournament has something for all. One of the major draws of the competition is its intangible and intoxicating element of unpredictability: with the closely packed games and high end teams, there’s always a chance for an upset, for an unexpected streak, or for a “Cinderella story.” We set out here to try to uncover whether or not these seemingly unpredictable moments could be anticipated? What truly contributes to the “madness” of a game and to this season of collegiate basketball? Our first challenge in this endeavor was attempting to define “madness.” Are we referring to the intensity of the game? the moves of each player on the court? Or are we referring to the crowd’s reaction to the outcome of a match? to the fan’s entertainment back home? Rather than limit our exploration, we decided to consider both possibilities. To do this effectively, we separated our work into two distinct categories: 1) that of empirical and “objective” madness that arises from the teams’ past game statistics and match events, and 2) that of emotional and “subjective” madness that comes from the enthusiasm of the fans while watching a game. This second type of madness is evaluated in a separate notebook which follows this one. Depending on who you ask, madness can have many meanings, but here we focus on it as the entertainment and pleasure that unites everyone around a great game of basketball. 2. NCAA March Madness Data AnalysisFor exploring the objective madness in this competition, the main data source at our disposal is the NCAA data provided through Kaggle. This data source is full of detailed and relevant information for the 2015 to 2019 seasons, from team and player names down to precisely recorded details on events that occur during each match! 2.1. Seeding and EntertainmentThe main question we explored is: can entertainment be linked to a team’s seed? In the extreme case of this is whether, by default, watching a seed 1 team compete will inherently be more enjoyable than watching a seed 16 team compete? We did this by first looking at specific events that occur during matches and working to see whether certain events were correlated with certain seeds. To perform this analysis, we start by loading useful packages as well as the relevant data. We opted to use some pre-processing performed by JasonVizkovic in his Notebook: Moreyball in the College Game...A Full NCAA EDA. It was particularly useful for helping us to isolate definite scoring attempts, understand whether they were assisted or not, and more.", "link": "https://www.kaggle.com/emimis/madness-at-home-and-on-the-court-part-1", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-01 01:35:02", "date_scraped": "2020-12-13 13:49:58", "words": 517, "sentences": 13, "sum_nltk": "Madness at Home and on the Court - Part 1Authors: Emilien Etchevers, Kieran Janin, Michael Karpe, Remi Le Thai, Haley Wohlever ContentsIn this notebook  Introduction  NCAA March Madness Data Analysis Seeding and Entertainment Madness through Unpredictability Entertainment due to Closeness of Games    In the second notebook:  Tweets on NCAA Data Analysis Temporal Evolution of Engagement Team Mentions Count in Tweets Sentiment Analysis for Tweets on NCAA   Conclusion  1.\nDepending on who you ask, madness can have many meanings, but here we focus on it as the entertainment and pleasure that unites everyone around a great game of basketball.\n2. NCAA March Madness Data AnalysisFor exploring the objective madness in this competition, the main data source at our disposal is the NCAA data provided through Kaggle.\nThis data source is full of detailed and relevant information for the 2015 to 2019 seasons, from team and player names down to precisely recorded details on events that occur during each match!\nSeeding and EntertainmentThe main question we explored is: can entertainment be linked to a team’s seed?\nWe opted to use some pre-processing performed by JasonVizkovic in his Notebook: Moreyball in the College Game...A Full NCAA EDA.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.005, "sum_t5": "a number of factors contribute to the \"madness\" of a game and to this season of collegiate basketball. the main data source at our disposal is the NCAA data provided through Kaggle. the data is full of detailed and relevant information for the 2015 to 2019 seasons. the main challenge in this endeavor was attempting to define \"madness\". a number of factors contribute to the \"madness\" of a game and to this season of collegiate basketball.", "sum_t5_words": 76, "sum_t5_runtime": 6.497, "runtime": 0.007, "nltk_category": "Utilities", "nltk_category_score": 0.06358572095632553, "nltk_category_runtime": 18.824, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.2750958502292633, "nltk_subcategory_runtime": 30.09, "category": "Utilities", "category_score": 0.06358572095632553, "subcategory": "Student", "subcategory_score": 0.2750958502292633, "runtime_cat": 48.914, "programming_language": "R notebook", "ml_score": "1.0", "engagement_score": "0.572", "language_code": "en", "language_score": "0.9999969865146507", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "madness home court part 1authors emilien etchevers kieran janin michael karpe remi le thai haley wohlever contentsin notebook introduction ncaa march madness data analysis seeding entertainment madness unpredictability entertainment due closeness game second notebook tweet ncaa data analysis temporal evolution engagement team mention count tweet sentiment analysis tweet ncaa conclusion 1 introductionmarch madness period excitement everyone diehard fan serial gambler ncaa tournament something one major draw competition intangible intoxicating element unpredictability closely packed game high end team there always chance upset unexpected streak cinderella story set try uncover whether seemingly unpredictable moment could anticipated truly contributes madness game season collegiate basketball first challenge endeavor attempting define madness referring intensity game move player court referring crowd reaction outcome match fan entertainment back home rather limit exploration decided consider possibility effectively separated work two distinct category 1 empirical objective madness arises team past game statistic match event 2 emotional subjective madness come enthusiasm fan watching game second type madness evaluated separate notebook follows one depending ask madness many meaning focus entertainment pleasure unites everyone around great game basketball 2 ncaa march madness data analysisfor exploring objective madness competition main data source disposal ncaa data provided kaggle data source full detailed relevant information 2015 2019 season team player name precisely recorded detail event occur match 21 seeding entertainmentthe main question explored entertainment linked team seed extreme case whether default watching seed 1 team compete inherently enjoyable watching seed 16 team compete first looking specific event occur match working see whether certain event correlated certain seed perform analysis start loading useful package well relevant data opted use preprocessing performed jasonvizkovic notebook moreyball college gamea full ncaa eda particularly useful helping u isolate definite scoring attempt understand whether assisted", "tags_descriptive": []}