{"title": "Kuzushiji Recognition Complete Guide", "description": "Kuzushiji Recognition Complete GuideBuild a model to transcribe ancient Kuzushiji into contemporary Japanese characters   Imagine the history contained in a thousand years of books. What stories are in those books? What knowledge can we learn from the world before our time? What was the weather like 500 years ago? What happened when Mt. Fuji erupted? How can one fold 100 cranes using only one piece of paper? The answers to these questions are in those books. Japan has millions of books and over a billion historical documents such as personal letters or diaries preserved nationwide. Most of them cannot be read by the majority of Japanese people living today because they were written in “Kuzushiji”. Even though Kuzushiji, a cursive writing style, had been used in Japan for over a thousand years, there are very few fluent readers of Kuzushiji today (only 0.01% of modern Japanese natives). Due to the lack of available human resources, there has been a great deal of interest in using Machine Learning to automatically recognize these historical texts and transcribe them into modern Japanese characters. kernel completed!  Content EDA New df_train missing data char stats top-10 chars top-100 chars (plot)     Simple Visualization KMINST Save the 683464 chars/digits images in kminst.zip and info.csv Examples of obtained chars from a random image.     KMINST Classification Simple KNN Deep Learning     Simple Predictions Visualization  Other kernelsI will create other kernels to perform different tasks: digitalize images, train models, do inferences etc . Here you can check them: More information Must-read material Worldwide Competition to Develop AI for Historical Japanese Character (Kuzushiji) Recognition KMNIST Dataset Osaka University", "link": "https://www.kaggle.com/jesucristo/kuzushiji-recognition-complete-guide", "tags": ["DL", "Classification"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-10-22 15:18:08", "date_scraped": "2020-12-13 12:36:30", "words": 282, "sentences": 10, "sum_nltk": "Kuzushiji Recognition Complete GuideBuild a model to transcribe ancient Kuzushiji into contemporary Japanese characters   Imagine the history contained in a thousand years of books.\nJapan has millions of books and over a billion historical documents such as personal letters or diaries preserved nationwide.\nMost of them cannot be read by the majority of Japanese people living today because they were written in “Kuzushiji”.\nEven though Kuzushiji, a cursive writing style, had been used in Japan for over a thousand years, there are very few fluent readers of Kuzushiji today (only 0.01% of modern Japanese natives).\nDue to the lack of available human resources, there has been a great deal of interest in using Machine Learning to automatically recognize these historical texts and transcribe them into modern Japanese characters.\nContent EDA New df_train missing data char stats top-10 chars top-100 chars (plot)     Simple Visualization KMINST Save the 683464 chars/digits images in kminst.zip and info.csv Examples of obtained chars from a random image.\nKMINST Classification Simple KNN Deep Learning     Simple Predictions Visualization  Other kernelsI will create other kernels to perform different tasks: digitalize images, train models, do inferences etc .\nHere you can check them: More information Must-read material Worldwide Competition to Develop AI for Historical Japanese Character (Kuzushiji) Recognition KMNIST Dataset Osaka University", "sum_nltk_words": 216, "sum_nltk_runtime": 0.004, "sum_t5": "machine learning could be used to automatically recognize historical texts. only 0.01% of modern Japanese natives are fluent readers of Kuzushiji. a model could be built to transcribe ancient Kuzushiji into contemporary characters. the kernel will be used to digitalize images, train models and do inferences. the winning kernel will be released in january.... microsoft has announced plans to release a version of its Kuzushiji recognition software.", "sum_t5_words": 67, "sum_t5_runtime": 6.364, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.3200502097606659, "nltk_category_runtime": 21.774, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9514372944831848, "nltk_subcategory_runtime": 34.501, "category": "Utilities", "category_score": 0.3200502097606659, "subcategory": "Machine Learning", "subcategory_score": 0.9514372944831848, "runtime_cat": 56.275, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.72", "language_code": "en", "language_score": "0.999995212520597", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "kuzushiji recognition complete guidebuild model transcribe ancient kuzushiji contemporary japanese character imagine history contained thousand year book story book knowledge learn world time weather like 500 year ago happened mt fuji erupted one fold 100 crane using one piece paper answer question book japan million book billion historical document personal letter diary preserved nationwide cannot read majority japanese people living today written kuzushiji even though kuzushiji cursive writing style used japan thousand year fluent reader kuzushiji today 001 modern japanese native due lack available human resource great deal interest using machine learning automatically recognize historical text transcribe modern japanese character kernel completed content eda new df_train missing data char stats top10 char top100 char plot simple visualization kminst save 683464 charsdigits image kminstzip infocsv example obtained char random image kminst classification simple knn deep learning simple prediction visualization kernelsi create kernel perform different task digitalize image train model inference etc check information mustread material worldwide competition develop ai historical japanese character kuzushiji recognition kmnist dataset osaka university", "tags_descriptive": ["Deep Learning (DL)", "Classification"]}