{"title": "LKH Solver", "description": "LKH 2.0.9LKH is an effective implementation of the Lin-Kernighan heuristic and is considered one of the best algorithms available for the TSP problem. Even though the algorithm is approximate, optimal solutions are produced with an impressively high frequency. It has been implemented in the programming language C and is distributed for academic and non-commercial use. In this notebook I will show how to run LKH for this competition in a kernel environment. For more information please refer to the official page or the original paper. Notes:  I'm not considering the prime penalty. Internet must be enabled.  Acknowledgments:  LKH author, Keld Helsgaun.", "link": "https://www.kaggle.com/jsaguiar/lkh-solver", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-12-05 17:04:05", "date_scraped": "2020-12-13 17:50:10", "words": 104, "sentences": 8, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.22965538501739502, "description_category_runtime": 10.729, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.29976052045822144, "description_subcategory_runtime": 16.242, "category": "Education & Research", "category_score": 0.22965538501739502, "subcategory": "Judicial Applied", "subcategory_score": 0.29976052045822144, "runtime_cat": 26.972, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.721", "language_code": "en", "language_score": "0.9999974215304299", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "lkh 209lkh effective implementation linkernighan heuristic considered one best algorithm available tsp problem even though algorithm approximate optimal solution produced impressively high frequency implemented programming language c distributed academic noncommercial use notebook show run lkh competition kernel environment information please refer official page original paper note im considering prime penalty internet must enabled acknowledgment lkh author keld helsgaun", "tags_descriptive": []}