{"title": "A deep learning of Deep Learning", "description": "A deep learning of Deep Learning Pic Credits: Getty Deep Learning (DL) is progressing by leaps and bounds at a phenomenally fast pace with so much new research, papers, ideas, models being developed throughout the world. The last few years have seen a lot of solutions being built using deep learning methods and frameworks and this is expected to only increase in the future. This notebook analyses the deep learning practitioners from the 2019 Kaggle ML & DS Survey to understand patterns, get insights, learn challenges and maybe even answer some questions regarding the current and future landscape of deep learning:  Who are these deep learning practitioners? Are they concentrated in a certain geography or age or background? Are deep learning practitioners very different from other machine learning practitioners? Do they have a different career path or have different salaries? Does deep learning require a lot of money and resources? Are the tools, products and languages used very different requiring special skills? What does the future of deep learning hold for us? Will it significantly change industries or even modeling and solutioning methods?     ...and many more. P.S.: The insights shared in this notebook are based on the 2019 Kaggle Survey data only and not all of them necessarily would be similar in the real world.", "link": "https://www.kaggle.com/rohanrao/a-deep-learning-of-deep-learning", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost", "pattern", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-07-05 21:57:52", "date_scraped": "2020-12-13 12:25:10", "words": 220, "sentences": 4, "sum_nltk": "A deep learning of Deep Learning Pic Credits: Getty Deep Learning (DL) is progressing by leaps and bounds at a phenomenally fast pace with so much new research, papers, ideas, models being developed throughout the world.\nThe last few years have seen a lot of solutions being built using deep learning methods and frameworks and this is expected to only increase in the future.\nThis notebook analyses the deep learning practitioners from the 2019 Kaggle ML & DS Survey to understand patterns, get insights, learn challenges and maybe even answer some questions regarding the current and future landscape of deep learning:  Who are these deep learning practitioners?\nAre they concentrated in a certain geography or age or background?\nAre deep learning practitioners very different from other machine learning practitioners?\nDoes deep learning require a lot of money and resources?\nAre the tools, products and languages used very different requiring special skills?\nWhat does the future of deep learning hold for us?\nWill it significantly change industries or even modeling and solutioning methods?\nP.S.: The insights shared in this notebook are based on the 2019 Kaggle Survey data only and not all of them necessarily would be similar in the real world.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.003, "sum_t5": "this notebook analyses the deep learning practitioners from the 2019 Kaggle ML & DS Survey. the insights shared in this notebook are based on the 2019 Kaggle Survey data only. deep learning is a powerful tool for understanding and analyzing complex data. it is also a powerful tool for understanding and analyzing complex data. the notebook concludes with a summary of the findings. and concludes with a summary of the findings.", "sum_t5_words": 71, "sum_t5_runtime": 4.517, "runtime": 0.0, "nltk_category": "Accommodation & Food", "nltk_category_score": 0.3822294771671295, "nltk_category_runtime": 16.228, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8311647772789001, "nltk_subcategory_runtime": 26.343, "category": "Accommodation & Food", "category_score": 0.3822294771671295, "subcategory": "Machine Learning", "subcategory_score": 0.8311647772789001, "runtime_cat": 42.572, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.72", "language_code": "en", "language_score": "0.9999970010879545", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "deep learning deep learning pic credit getty deep learning dl progressing leap bound phenomenally fast pace much new research paper idea model developed throughout world last year seen lot solution built using deep learning method framework expected increase future notebook analysis deep learning practitioner 2019 kaggle ml d survey understand pattern get insight learn challenge maybe even answer question regarding current future landscape deep learning deep learning practitioner concentrated certain geography age background deep learning practitioner different machine learning practitioner different career path different salary deep learning require lot money resource tool product language used different requiring special skill future deep learning hold u significantly change industry even modeling solutioning method many p insight shared notebook based 2019 kaggle survey data necessarily would similar real world", "tags_descriptive": ["Exploratory Data Analysis"]}