{"title": "Deep Learning for Time Series Forecasting", "description": "Deep Learning for Time Series Forecasting The goal of this notebook is to develop and compare different approaches to time-series problems.Content: Time series visualization with ploty. How to transform a time series dataset into a supervised learning problem. How to develop a Multilayer Perceptron model for a univariate time series forecasting problem. How to develop a Convolutional Neural Network model for a univariate time series forecasting problem. How to develop a Long Short-Term Memory network model for a univariate time series forecasting problem. How to develop a Hybrid CNN-LSTM model for a univariate time series forecasting problem.  The content here was inspired by this article at machinelearningmastery.com, How to Get Started with Deep Learning for Time Series Forecasting (7-Day Mini-Course)Dependencies", "link": "https://www.kaggle.com/dimitreoliveira/deep-learning-for-time-series-forecasting", "tags": ["DL", "LSTM"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-01-08 20:59:41", "date_scraped": "2020-12-12 18:46:39", "words": 121, "sentences": 7, "runtime": 0.001, "description_category": "Education & Research", "description_category_score": 0.09600436687469482, "description_category_runtime": 12.044, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9297285676002502, "description_subcategory_runtime": 18.517, "category": "Education & Research", "category_score": 0.09600436687469482, "subcategory": "Machine Learning", "subcategory_score": 0.9297285676002502, "runtime_cat": 30.561, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.815", "language_code": "en", "language_score": "0.999997795569443", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "deep learning time series forecasting goal notebook develop compare different approach timeseries problemscontent time series visualization ploty transform time series dataset supervised learning problem develop multilayer perceptron model univariate time series forecasting problem develop convolutional neural network model univariate time series forecasting problem develop long shortterm memory network model univariate time series forecasting problem develop hybrid cnnlstm model univariate time series forecasting problem content inspired article machinelearningmasterycom get started deep learning time series forecasting 7day minicoursedependencies", "tags_descriptive": ["Deep Learning (DL)", "Long short-term memory (LSTM)"]}