{"title": "TF Keras EffNet B2 - Non Landmark Removal", "description": "In the current competition there seem to be only a few kernels (ok .. besides the kernel provided by the competition organisers and related forks) that use a DL classification model. With this kernel I hope to add a little to the choices that are available and still provide a nice score given the GPU time available. Some keypoints of this kernel:  Simple EfficientNet B2 model Custom head Custom sampling An attempt to detect when an object is no landmark by using a Places365 model. I'am using the same model as in my notebook during last years Landmark Recognition Landmark Notebook  If you liked this kernel then please give it an upvote :-) I'am looking forward to any questions or remarks you might have that I can use to improve this kernel.", "link": "https://www.kaggle.com/rsmits/tf-keras-effnet-b2-non-landmark-removal", "tags": ["DL", "Classification", "CV"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow", "albumentations"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-08-23 23:59:32", "date_scraped": "2020-12-13 12:43:16", "words": 134, "sentences": 5, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.08896753191947937, "description_category_runtime": 11.294, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9480302929878235, "description_subcategory_runtime": 17.228, "category": "Wholesale & Retail", "category_score": 0.08896753191947937, "subcategory": "Machine Learning", "subcategory_score": 0.9480302929878235, "runtime_cat": 28.522, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.686", "language_code": "en", "language_score": "0.9999968509389259", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "current competition seem kernel ok besides kernel provided competition organiser related fork use dl classification model kernel hope add little choice available still provide nice score given gpu time available keypoints kernel simple efficientnet b2 model custom head custom sampling attempt detect object landmark using places365 model iam using model notebook last year landmark recognition landmark notebook liked kernel please give upvote iam looking forward question remark might use improve kernel", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Computer Vision (CV)"]}