{"title": "COVID-19 Forecasting: Modelling with Mobility", "description": "Modelling COVID-19 with Mobility FeaturesThis notebook aims to provide a basic workflow of how mobility data shared by Google and Apple can potentially be used as features into COVID-19 models. I will be maintaining a structured version of the dataset here: https://www.kaggle.com/rohanrao/covid19-mobility-data and also likely will use it to some extent for my final submission of this competition. The notebook demonstrates how the dataset can be merged and used with the competition data. I've also shared the validation and LB scores with and without using the features. P.S. If you plan to use the data / notebook, be careful to use the features with appropriate lagged values since the actual test data duration is 28 days.", "link": "https://www.kaggle.com/rohanrao/covid-19-forecasting-modelling-with-mobility", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-29 22:10:19", "date_scraped": "2020-12-12 18:20:14", "words": 116, "sentences": 6, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.08549396693706512, "description_category_runtime": 11.671, "description_subcategory": "Tools", "description_subcategory_score": 0.3790488839149475, "description_subcategory_runtime": 18.289, "category": "Finance", "category_score": 0.08549396693706512, "subcategory": "Tools", "subcategory_score": 0.3790488839149475, "runtime_cat": 29.959, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.682", "language_code": "en", "language_score": "0.9999968278265515", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "modelling covid19 mobility featuresthis notebook aim provide basic workflow mobility data shared google apple potentially used feature covid19 model maintaining structured version dataset httpswwwkagglecomrohanraocovid19mobilitydata also likely use extent final submission competition notebook demonstrates dataset merged used competition data ive also shared validation lb score without using feature p plan use data notebook careful use feature appropriate lagged value since actual test data duration 28 day", "tags_descriptive": []}