{"title": "Microsoft LightGBM Starter", "description": "Microsoft LightGBM is a powerful, open-source boosted decision tree library similar to xgboost. In practice, it runs even faster than xgboost and achieves better performance in some cases. To install LightGBM, follow the installation guide to get the C++ distribution. The python API can then be easily built with these instructions. Some useful resources for LightGBM python API and parameter tuning: Python API Documentation: this page includes all the functions and objects List of Parameters: all possible parameters for LightGBM functions and classes Parameter Tuning Guide: the advanced parameter tuning guide for LightGBM. Since most parameters in LightGBM are similar to those in XGBoost, it should be intuitive to follow.", "link": "https://www.kaggle.com/somnisight/microsoft-lightgbm-starter", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-04-10 22:28:47", "date_scraped": "2020-12-13 17:56:15", "words": 110, "sentences": 6, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.35709065198898315, "description_category_runtime": 10.635, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.5593122839927673, "description_subcategory_runtime": 16.866, "category": "Finance", "category_score": 0.35709065198898315, "subcategory": "Judicial Applied", "subcategory_score": 0.5593122839927673, "runtime_cat": 27.501, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.745", "language_code": "en", "language_score": "0.9999958630168602", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "microsoft lightgbm powerful opensource boosted decision tree library similar xgboost practice run even faster xgboost achieves better performance case install lightgbm follow installation guide get c distribution python api easily built instruction useful resource lightgbm python api parameter tuning python api documentation page includes function object list parameter possible parameter lightgbm function class parameter tuning guide advanced parameter tuning guide lightgbm since parameter lightgbm similar xgboost intuitive follow", "tags_descriptive": []}