{"title": "CheXNet: Radiologist-Level Pneumonia Detection ", "description": "RSNA Pneumonia Detection Challenge with ChexNet Why to detetct this Pneumonia accounts for over 15% of all deaths of children under 5 years old internationally. In 2015, 920,000 children under the age of 5 died from the disease.  In the United States,  pneumonia accounts for over 500,000 visits to emergency departments [1] and over 50,000 deaths in 2015 [2], keeping the ailment on the list of top 10 causes of death in the country.  Symptoms to detect Pneumonia The Diagnosis of pneumonia on CXR( is complicated because of a number of other nditions in the lungsuch as uid overload (pulmonary edema), bleeding, volume loss (atelectasis or collapse), lung cancer, or post-radiation or surgical changes.    Characteristics Pneumonia   History Underlying lung disease, contact with individuals having upper or lower respiratory infection, contact with birds/animals.   Causes Bacteria, virus, fungi; aspiration.   Body systems  Respiratory system—lungs.   Clinical symptoms High fever (sometimes with chills and rigors), cough, wheezing, breathing difficulty, chest pain.   Investigations Blood investigations—complete blood count, ESR, sputum examination and culture, chest X-ray, CT scan, bronchoscopy, thoracocentesis, pleural fluid aspiration and culture.   Treatments Appropriate antimicrobial therapy, expectorant, antipyretics and analgesics, oxygen therapy (if required), fluids.  Table References Goal of This competition In this competition, the primary endpoint will be the detection of bounding boxes corresponding to the diagnosis of pneumonia (e.g. lung infection) on chest radiographs, a special 2D high resolution grayscale medical image.  Note that pnuemonia is just one of many possible disease processes that can occur on a chest radiograph, and that any given single image may contain 0, 1 or many boxes corresponding to possible pneumonia locations.  Thanks to this kernel  https://www.kaggle.com/robikscube/eda-lets-detect-pneumonia-explore-lung-images    Data SummaryStage 1 Images - stage_1_train_images.zip and stage_1_test_images.zip images for the current stage. Filenames are also patient names.  Stage 1 Labels - stage_1_train_labels.csv and Stage 1 Sample Submission stage_1_sample_submission.csv Which provides the IDs for the test set, as well as a sample of what your submission should look like  Stage 1 Detailed Info - stage_1_detailed_class_info.csv contains detailed information about the positive and negative classes in the training set, and may be used to build more nuanced models.   File descriptions  stage_1_train.csv - the training set. Contains patientIds and bounding box / target information. stage_1_sample_submission.csv - a sample submission file in the correct format. Contains patientIds for the test set. Note that the sample submission contains one box per image, but there is no limit to the number of bounding boxes that can be assigned to a given image. stage_1_detailed_class_info.csv - provides detailed information about the type of positive or negative class for each image.  Data fields  patientId _- A patientId. Each patientId corresponds to a unique image. x_ - the upper-left x coordinate of the bounding box. y_ - the upper-left y coordinate of the bounding box. width_ - the width of the bounding box. height_ - the height of the bounding box. Target_ - the binary Target, indicating whether this sample has evidence of pneumonia.", "link": "https://www.kaggle.com/ashishpatel26/chexnet-radiologist-level-pneumonia-detection", "tags": ["DL", "Exploratory Data Analysis", "Classification", "CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-08-28 11:46:25", "date_scraped": "2020-12-13 16:48:20", "words": 495, "sentences": 29, "sum_nltk": "Characteristics Pneumonia   History Underlying lung disease, contact with individuals having upper or lower respiratory infection, contact with birds/animals.\nTable References Goal of This competition In this competition, the primary endpoint will be the detection of bounding boxes corresponding to the diagnosis of pneumonia (e.g. lung infection) on chest radiographs, a special 2D high resolution grayscale medical image.\nNote that pnuemonia is just one of many possible disease processes that can occur on a chest radiograph, and that any given single image may contain 0, 1 or many boxes corresponding to possible pneumonia locations.\nStage 1 Labels - stage_1_train_labels.csv and Stage 1 Sample Submission stage_1_sample_submission.csv Which provides the IDs for the test set, as well as a sample of what your submission should look like  Stage 1 Detailed Info - stage_1_detailed_class_info.csv contains detailed information about the positive and negative classes in the training set, and may be used to build more nuanced models.\nContains patientIds and bounding box / target information.\nNote that the sample submission contains one box per image, but there is no limit to the number of bounding boxes that can be assigned to a given image.\nstage_1_detailed_class_info.csv - provides detailed information about the type of positive or negative class for each image.", "sum_nltk_words": 200, "sum_nltk_runtime": 0.007, "sum_t5": "RSNA's Detection Challenge will detect pneumonia on chest radiographs. the challenge will be based on a special 2D high resolution grayscale medical image. in 2015, 920,000 children under the age of 5 died from the disease. pneumonia is on the list of top 10 causes of death in the country. pnuemonia is just one of many possible disease processes that can occur on a chest radiograph.", "sum_t5_words": 66, "sum_t5_runtime": 6.162, "runtime": 0.0, "nltk_category": "Healthcare", "nltk_category_score": 0.7391796708106995, "nltk_category_runtime": 20.646, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.7672672867774963, "nltk_subcategory_runtime": 32.998, "category": "Healthcare", "category_score": 0.7391796708106995, "subcategory": "Quality", "subcategory_score": 0.7672672867774963, "runtime_cat": 53.643, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.76", "language_code": "en", "language_score": "0.9999984364122076", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "rsna pneumonia detection challenge chexnet detetct pneumonia account 15 death child 5 year old internationally 2015 920000 child age 5 died disease united state pneumonia account 500000 visit emergency department 1 50000 death 2015 2 keeping ailment list top 10 cause death country symptom detect pneumonia diagnosis pneumonia cxr complicated number nditions lungsuch uid overload pulmonary edema bleeding volume loss atelectasis collapse lung cancer postradiation surgical change characteristic pneumonia history underlying lung disease contact individual upper lower respiratory infection contact birdsanimals cause bacteria virus fungi aspiration body system respiratory systemlungs clinical symptom high fever sometimes chill rigor cough wheezing breathing difficulty chest pain investigation blood investigationscomplete blood count esr sputum examination culture chest xray ct scan bronchoscopy thoracocentesis pleural fluid aspiration culture treatment appropriate antimicrobial therapy expectorant antipyretic analgesic oxygen therapy required fluid table reference goal competition competition primary endpoint detection bounding box corresponding diagnosis pneumonia eg lung infection chest radiograph special 2d high resolution grayscale medical image note pnuemonia one many possible disease process occur chest radiograph given single image may contain 0 1 many box corresponding possible pneumonia location thanks kernel httpswwwkagglecomrobikscubeedaletsdetectpneumoniaexplorelungimages data summarystage 1 image stage_1_train_imageszip stage_1_test_imageszip image current stage filename also patient name stage 1 label stage_1_train_labelscsv stage 1 sample submission stage_1_sample_submissioncsv provides id test set well sample submission look like stage 1 detailed info stage_1_detailed_class_infocsv contains detailed information positive negative class training set may used build nuanced model file description stage_1_traincsv training set contains patientids bounding box target information stage_1_sample_submissioncsv sample submission file correct format contains patientids test set note sample submission contains one box per image limit number bounding box assigned given image stage_1_detailed_class_infocsv provides detailed information type positive negative class image data field patientid _ patientid patientid corresponds unique image x_ upperleft x coordinate bounding box y_ upperleft coordinate bounding box width_ width bounding box height_ height bounding box target_ binary target indicating whether sample evidence pneumonia", "tags_descriptive": ["Deep Learning (DL)", "Exploratory Data Analysis", "Classification", "Convolutional Neural Network (CNN)"]}