{"title": "Quantile Reg. | LR-Schedulers| Checkpoints", "description": "Quick introCompetition descriptionImagine one day, your breathing became consistently labored and shallow. Months later you were finally diagnosed with pulmonary fibrosis, a disorder with no known cause and no known cure, created by scarring of the lungs. If that happened to you, you would want to know your prognosis. That’s where a troubling disease becomes frightening for the patient: outcomes can range from long-term stability to rapid deterioration, but doctors aren’t easily able to tell where an individual may fall on that spectrum. Your help, and data science, may be able to aid in this prediction, which would dramatically help both patients and clinicians. Current methods make fibrotic lung diseases difficult to treat, even with access to a chest CT scan. In addition, the wide range of varied prognoses create issues organizing clinical trials. Finally, patients suffer extreme anxiety—in addition to fibrosis-related symptoms—from the disease’s opaque path of progression. Open Source Imaging Consortium (OSIC) is a not-for-profit, co-operative effort between academia, industry and philanthropy. The group enables rapid advances in the fight against Idiopathic Pulmonary Fibrosis (IPF), fibrosing interstitial lung diseases (ILDs), and other respiratory diseases, including emphysematous conditions. Its mission is to bring together radiologists, clinicians and computational scientists from around the world to improve imaging-based treatments. In this competition, you’ll predict a patient’s severity of decline in lung function based on a CT scan of their lungs. You’ll determine lung function based on output from a spirometer, which measures the volume of air inhaled and exhaled. The challenge is to use machine learning techniques to make a prediction with the image, metadata, and baseline FVC as input. If successful, patients and their families would better understand their prognosis when they are first diagnosed with this incurable lung disease. Improved severity detection would also positively impact treatment trial design and accelerate the clinical development of novel treatments. What should I expect the data format to be & what am I predicting?Each row in the dataset contains a Patiend_ID, and a week; you must predict the FVC and a confidence. To avoid potential leakage in the timing of follow up visits, you are asked to predict every patient's FVC measurement for every possible week. Those weeks which are not in the final three visits are ignored in scoring. The final submission-file should contain a header and have the following format: Patient_Week,                 FVC,    Confidence ID00002637202176704235138_1, 2000,   100 ID00002637202176704235138_2, 2000,   100 ID00002637202176704235138_3, 2000,   100", "link": "https://www.kaggle.com/ChristianDenich/quantile-reg-lr-schedulers-checkpoints", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-10-02 12:20:21", "date_scraped": "2020-12-13 14:44:51", "words": 427, "sentences": 20, "sum_nltk": "Months later you were finally diagnosed with pulmonary fibrosis, a disorder with no known cause and no known cure, created by scarring of the lungs.\nThat’s where a troubling disease becomes frightening for the patient: outcomes can range from long-term stability to rapid deterioration, but doctors aren’t easily able to tell where an individual may fall on that spectrum.\nYour help, and data science, may be able to aid in this prediction, which would dramatically help both patients and clinicians.\nIn this competition, you’ll predict a patient’s severity of decline in lung function based on a CT scan of their lungs.\nIf successful, patients and their families would better understand their prognosis when they are first diagnosed with this incurable lung disease.\nWhat should I expect the data format to be & what am I predicting?Each row in the dataset contains a Patiend_ID, and a week; you must predict the FVC and a confidence.\nTo avoid potential leakage in the timing of follow up visits, you are asked to predict every patient's FVC measurement for every possible week.\nThe final submission-file should contain a header and have the following format: Patient_Week,                 FVC,    Confidence ID00002637202176704235138_1, 2000,   100 ID00002637202176704235138_2, 2000,   100 ID00002637202176704235138_3, 2000,   100", "sum_nltk_words": 220, "sum_nltk_runtime": 0.007, "sum_t5": "current methods make fibrotic lung diseases difficult to treat, even with access to a chest CT scan. the wide range of varied prognoses create issues organizing clinical trials. if successful, improved severity detection would positively impact treatment trial design and accelerate the development of novel treatments. if successful, patients and their families would better understand their prognosis when they are first diagnosed with this incurable lung disease. if successful, you’ll use machine learning techniques to make a prediction with the image, metadata, and baseline", "sum_t5_words": 84, "sum_t5_runtime": 6.938, "runtime": 0.004, "nltk_category": "Healthcare", "nltk_category_score": 0.6715153455734253, "nltk_category_runtime": 22.24, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.6981354355812073, "nltk_subcategory_runtime": 36.069, "category": "Healthcare", "category_score": 0.6715153455734253, "subcategory": "Judicial Applied", "subcategory_score": 0.6981354355812073, "runtime_cat": 58.31, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.739", "language_code": "en", "language_score": "0.9999961600348846", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "quick introcompetition descriptionimagine one day breathing became consistently labored shallow month later finally diagnosed pulmonary fibrosis disorder known cause known cure created scarring lung happened would want know prognosis thats troubling disease becomes frightening patient outcome range longterm stability rapid deterioration doctor arent easily able tell individual may fall spectrum help data science may able aid prediction would dramatically help patient clinician current method make fibrotic lung disease difficult treat even access chest ct scan addition wide range varied prognosis create issue organizing clinical trial finally patient suffer extreme anxietyin addition fibrosisrelated symptomsfrom disease opaque path progression open source imaging consortium osic notforprofit cooperative effort academia industry philanthropy group enables rapid advance fight idiopathic pulmonary fibrosis ipf fibrosing interstitial lung disease ilds respiratory disease including emphysematous condition mission bring together radiologist clinician computational scientist around world improve imagingbased treatment competition youll predict patient severity decline lung function based ct scan lung youll determine lung function based output spirometer measure volume air inhaled exhaled challenge use machine learning technique make prediction image metadata baseline fvc input successful patient family would better understand prognosis first diagnosed incurable lung disease improved severity detection would also positively impact treatment trial design accelerate clinical development novel treatment expect data format predictingeach row dataset contains patiend_id week must predict fvc confidence avoid potential leakage timing follow visit asked predict every patient fvc measurement every possible week week final three visit ignored scoring final submissionfile contain header following format patient_week fvc confidence id00002637202176704235138_1 2000 100 id00002637202176704235138_2 2000 100 id00002637202176704235138_3 2000 100", "tags_descriptive": []}