{"title": "Exploratory Data Analysis", "description": "OverviewWelcome to the 2018 RSNA Challenge co-hosted by Kaggle. In this competition, the primary endpoint will be the detection of bounding boxes corresponding to the diagnosis of pneumonia (e.g. lung infection) on chest radiographs, a special 2D high resolution grayscale medical image. Note that pnuemonia is just one of many possible disease processes that can occur on a chest radiograph, and that any given single image may contain 0, 1 or many boxes corresponding to possible pneumonia locations. My name is Peter Chang, MD. I am both a radiologist physician and a data scientist / software engineer with machine learning experience. Today, in this Jupyter notebook, we will explore the 2018 RSNA Challenge dataset including underlying data structures, imaging file formats and label types.", "link": "https://www.kaggle.com/peterchang77/exploratory-data-analysis", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-08-27 16:52:21", "date_scraped": "2020-12-13 16:48:20", "words": 124, "sentences": 7, "runtime": 0.001, "description_category": "Healthcare", "description_category_score": 0.589201807975769, "description_category_runtime": 11.799, "description_subcategory": "Tools", "description_subcategory_score": 0.45328882336616516, "description_subcategory_runtime": 18.245, "category": "Healthcare", "category_score": 0.589201807975769, "subcategory": "Tools", "subcategory_score": 0.45328882336616516, "runtime_cat": 30.045, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.79", "language_code": "en", "language_score": "0.9999967652065491", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "overviewwelcome 2018 rsna challenge cohosted kaggle competition primary endpoint detection bounding box corresponding diagnosis pneumonia eg lung infection chest radiograph special 2d high resolution grayscale medical image note pnuemonia one many possible disease process occur chest radiograph given single image may contain 0 1 many box corresponding possible pneumonia location name peter chang md radiologist physician data scientist software engineer machine learning experience today jupyter notebook explore 2018 rsna challenge dataset including underlying data structure imaging file format label type", "tags_descriptive": []}