{"title": "LightGBM Starter & Some Data Exploration", "description": "Full disclosure: I am actually a particle physicist, although I've never worked much with collider experiments. In this challenge, we are tasked with predicting whether or not a given reconstructed event in a particle physics experiment is from a τ→μ+μ−μ− decay. Tau leptons are basically like very heavy electrons, with a mass of 1.78 GeV rather than 511 keV. These are still quite light by the standards of proton colliders. The top quark, which is the heaviest known elementary particle, has a mass about 100 times higher. The LHC was built so that it would be able to create TeV-scale particles such as supersymmetric partners to regular Standard Model particles. Taus are unstable and decay with a lifetime of 3×10−13 s, or 300 femtoseconds. Due to conservation of lepton number, taus are created in τ+τ− pairs or in conjunction with neutrinos. In a facility like the LHC, this means that the taus will typically have a large amount of kinetic energy in the lab frame. The apparent lifetime in the lab frame is boosted from τ=300~fs to γτ, where γ is a relativistic factor equal to the ratio between the total energy in the lab frame and the rest mass. So, if γ=10 (that is, the τ has a total energy 17.8 GeV), it will have a lifetime of 3 picoseconds. Since the tau will be going nearly the speed of light, it will travel on average around 1 mm from the initial vertex before decaying. If you can reconstruct the separation between the tau decay and the vertex (at least in the transverse dimension), this will let you do things like compare the estimated γ of the tau (based on muon kinematics) to the distance traveled. This will give you some ability to at least start to select tau-like events.", "link": "https://www.kaggle.com/muonneutrino/lightgbm-starter-some-data-exploration", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-06-27 05:54:14", "date_scraped": "2020-12-12 19:55:11", "words": 301, "sentences": 14, "sum_nltk": "In this challenge, we are tasked with predicting whether or not a given reconstructed event in a particle physics experiment is from a τ→μ+μ−μ− decay.\nTau leptons are basically like very heavy electrons, with a mass of 1.78 GeV rather than 511 keV.\nIn a facility like the LHC, this means that the taus will typically have a large amount of kinetic energy in the lab frame.\nThe apparent lifetime in the lab frame is boosted from τ=300~fs to γτ, where γ is a relativistic factor equal to the ratio between the total energy in the lab frame and the rest mass.\nSo, if γ=10 (that is, the τ has a total energy 17.8 GeV), it will have a lifetime of 3 picoseconds.\nSince the tau will be going nearly the speed of light, it will travel on average around 1 mm from the initial vertex before decaying.\nIf you can reconstruct the separation between the tau decay and the vertex (at least in the transverse dimension), this will let you do things like compare the estimated γ of the tau (based on muon kinematics) to the distance traveled.\nThis will give you some ability to at least start to select tau-like events.", "sum_nltk_words": 196, "sum_nltk_runtime": 0.003, "sum_t5": "physicist robert mcgill is tasked with reconstructing a particle physics experiment. he says the challenge will help us predict whether a given event is from a + decay. mcgill: taus are unstable and decay with a lifetime of 31013 s. he says the challenge will help us to predict the 'tau-like' events in the experiment.", "sum_t5_words": 55, "sum_t5_runtime": 6.233, "runtime": 0.002, "nltk_category": "Physics", "nltk_category_score": 0.8616726398468018, "nltk_category_runtime": 18.97, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.7348837852478027, "nltk_subcategory_runtime": 30.709, "category": "Physics", "category_score": 0.8616726398468018, "subcategory": "Physical", "subcategory_score": 0.7348837852478027, "runtime_cat": 49.679, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.685", "language_code": "en", "language_score": "0.9999978033995887", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "full disclosure actually particle physicist although ive never worked much collider experiment challenge tasked predicting whether given reconstructed event particle physic experiment decay tau lepton basically like heavy electron mass 178 gev rather 511 kev still quite light standard proton collider top quark heaviest known elementary particle mass 100 time higher lhc built would able create tevscale particle supersymmetric partner regular standard model particle tau unstable decay lifetime 31013 300 femtosecond due conservation lepton number tau created pair conjunction neutrino facility like lhc mean tau typically large amount kinetic energy lab frame apparent lifetime lab frame boosted 300fs relativistic factor equal ratio total energy lab frame rest mass 10 total energy 178 gev lifetime 3 picosecond since tau going nearly speed light travel average around 1 mm initial vertex decaying reconstruct separation tau decay vertex least transverse dimension let thing like compare estimated tau based muon kinematics distance traveled give ability least start select taulike event", "tags_descriptive": []}