{"title": "What's Cooking?", "description": "What's Cooking:- Building a Text Classifier  This Kaggle competition asks us to predict the category of a dish's cuisine given a list of its ingredients.This Notebook explores and analyses this dataset to build a Text Classifier. It can also serve as a great starting point for learning how to explore, manipulate, transform and learn from textual data .   This Notebook is divided into the following sections:-  A Date with Data  : As they say, to know someone better you must meet him/her in person. In this section we will go on a date with data to explore and visualize it to gain insights  Experiencing the Change : As you and data fall in love, data experiences positive changes. In this section data is cleaned and pre-processed (which is a positive change) for model development. Exploring the Unknowns: As the relationship between you and data goes on, you tend to explore and dig into what suits data the most. In this section we will explore which Feature Engineering technique for representing and converting text data gives the best results. The Final Decision : Its time to build the Model   Let's Get the Party Started", "link": "https://www.kaggle.com/tanulsingh077/what-s-cooking", "tags": ["Feature Engineering", "Exploratory Data Analysis", "Classification"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "nltk", "gensim"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-11-19 21:19:10", "date_scraped": "2020-12-13 18:23:40", "words": 201, "sentences": 8, "sum_nltk": "What's Cooking:- Building a Text Classifier  This Kaggle competition asks us to predict the category of a dish's cuisine given a list of its ingredients.This Notebook explores and analyses this dataset to build a Text Classifier.\nIt can also serve as a great starting point for learning how to explore, manipulate, transform and learn from textual data .\nThis Notebook is divided into the following sections:-  A Date with Data  : As they say, to know someone better you must meet him/her in person.\nIn this section we will go on a date with data to explore and visualize it to gain insights  Experiencing the Change : As you and data fall in love, data experiences positive changes.\nIn this section data is cleaned and pre-processed (which is a positive change) for model development.\nExploring the Unknowns: As the relationship between you and data goes on, you tend to explore and dig into what suits data the most.\nIn this section we will explore which Feature Engineering technique for representing and converting text data gives the best results.\nThe Final Decision : Its time to build the Model   Let's Get the Party Started", "sum_nltk_words": 192, "sum_nltk_runtime": 0.002, "sum_t5": "Notebook explores and analyses datasets to build a Text Classifier. it can also serve as a great starting point for learning how to explore, manipulate, transform and learn from textual data. a date with data: as they say, to know someone better you must meet him/her in person. Experiencing the Change: as you and data fall in love, data experiences positive changes. Experiencing the Unknowns: as the relationship between you and data goes on, you tend to explore and dig", "sum_t5_words": 80, "sum_t5_runtime": 5.111, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.09495929628610611, "nltk_category_runtime": 16.607, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.6094578504562378, "nltk_subcategory_runtime": 26.402, "category": "Education & Research", "category_score": 0.09495929628610611, "subcategory": "Machine Learning", "subcategory_score": 0.6094578504562378, "runtime_cat": 43.009, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.685", "language_code": "en", "language_score": "0.9999985933771901", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "whats cooking building text classifier kaggle competition asks u predict category dish cuisine given list ingredientsthis notebook explores analysis dataset build text classifier also serve great starting point learning explore manipulate transform learn textual data notebook divided following section date data say know someone better must meet himher person section go date data explore visualize gain insight experiencing change data fall love data experience positive change section data cleaned preprocessed positive change model development exploring unknown relationship data go tend explore dig suit data section explore feature engineering technique representing converting text data give best result final decision time build model let get party started", "tags_descriptive": ["Feature Engineering", "Exploratory Data Analysis", "Classification"]}