{"title": "Exploratory Data Analysis and Factor Model Idea", "description": "ObjectiveIn this notebook i will perform a basic exploratory data analysis of the data, also we will make a simple model to calculate the emission factor coefficient of electricity that produce Green House Gases for Puerto Rico. Here is a link of a public kernel that help me understand better the problem we are trying to solve: https://www.kaggle.com/parulpandey/understanding-the-data-wip  The model needs to produce a value for the an annual average historical grid-level electricity emissions factor (based on rolling 12-months of data from July 2018 - July 2019) for the sub-national region?  We also recieve bonuses for other objectives but we will not cover them in this initial notebook", "link": "https://www.kaggle.com/ragnar123/exploratory-data-analysis-and-factor-model-idea", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-02-19 22:45:21", "date_scraped": "2020-12-12 19:11:13", "words": 110, "sentences": 2, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.3052702844142914, "description_category_runtime": 10.925, "description_subcategory": "Student", "description_subcategory_score": 0.46948039531707764, "description_subcategory_runtime": 16.829, "category": "Utilities", "category_score": 0.3052702844142914, "subcategory": "Student", "subcategory_score": 0.46948039531707764, "runtime_cat": 27.754, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.689", "language_code": "en", "language_score": "0.9999959699467091", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "objectivein notebook perform basic exploratory data analysis data also make simple model calculate emission factor coefficient electricity produce green house gas puerto rico link public kernel help understand better problem trying solve httpswwwkagglecomparulpandeyunderstandingthedatawip model need produce value annual average historical gridlevel electricity emission factor based rolling 12months data july 2018 july 2019 subnational region also recieve bonus objective cover initial notebook", "tags_descriptive": []}