{"title": "Let's Start from Here! Beginners' Data Analysis", "description": "Data Visualization Notebook1st public version: Created on May 6th, 2020. 2nd public version: Created on May 7th, 2020. 3rd public version: Created on May 10th, 2020. 4th public version: Created on May 15th, 2020.  (Add Department Analysis) 5th public version: Created on May 16th, 2020.  (Add Next week event and value analysis) 6th public version: Created on May 16th, 2020.  (Add Dynamic Factor Analysis) 7th public version: Created on May 23th, 2020.  (Fix some codes in Standard deviation analysis in each store, Thank you for your comment, Kevin.) 8th public version: Created on May 26th, 2020. (Fix Bugs and Add Calendar Plot) 9th public version: Created on May 26th, 2020. (Add more precise PCA Plot, See PCA Section) Hello, everyone. I'm one of the challenger of this competition M5 -accuracy- . I'd like to find some useful insights for predictiong the test dataset. Here I created a notebook for data visualization especially for beginners like me. I appreciate all of your views and comments. https://www.kaggle.com/robikscube/m5-forecasting-starter-data-exploration His notebook is super great. If you have time, I strongly recommend you to take a look. And I'll introduce other good kernels in Reference Section Here is table of contents in this notebook:  Import Libraries and Data Input Data Cleaning Data Visualization  Total Item Sold Transition Item Sold in each day type Item sold in each State and Store Standard deviation analysis in each store   Item Sold relation Analysis Dynamic Factor Analysis Trial Store Analysis Snap Purchase Analysis Event Pattern Analysis One Item Features Analysis Sell Price Analysis Sell price and value relationship Department Analysis Next Week Events and This Week Sales Relationship Analysis Relationship of Lag Variables Calendar Visualization PCA Trial   Summary  Future Work References", "link": "https://www.kaggle.com/ryuheeeei/let-s-start-from-here-beginners-data-analysis", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost", "lightgbm", "sklearn", "pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-26 15:52:06", "date_scraped": "2020-12-13 13:22:57", "words": 293, "sentences": 17, "sum_nltk": "Data Visualization Notebook1st public version: Created on May 6th, 2020.\n4th public version: Created on May 15th, 2020.\n4th public version: Created on May 15th, 2020.\n4th public version: Created on May 15th, 2020.\n(Add Department Analysis) 5th public version: Created on May 16th, 2020.\n(Add Next week event and value analysis) 6th public version: Created on May 16th, 2020.\n(Add Dynamic Factor Analysis) 7th public version: Created on May 23th, 2020.\n(Fix some codes in Standard deviation analysis in each store, Thank you for your comment, Kevin.) 8th public version: Created on May 26th, 2020.\n(Fix Bugs and Add Calendar Plot) 9th public version: Created on May 26th, 2020.\nHere I created a notebook for data visualization especially for beginners like me.\nAnd I'll introduce other good kernels in Reference Section Here is table of contents in this notebook:  Import Libraries and Data Input Data Cleaning Data Visualization  Total Item Sold Transition Item Sold in each day type Item sold in each State and Store Standard deviation analysis in each store   Item Sold relation Analysis Dynamic Factor Analysis Trial Store Analysis Snap Purchase Analysis Event Pattern Analysis One Item Features Analysis Sell Price Analysis Sell price and value relationship Department Analysis Next Week Events and This Week Sales Relationship Analysis Relationship of Lag Variables Calendar Visualization PCA Trial   Summary  Future Work References", "sum_nltk_words": 220, "sum_nltk_runtime": 0.004, "sum_t5": "robikscube is one of the challenger of this competition M5 -accuracy-. he'd like to find some useful insights for predictiong the test dataset. here he created a notebook for data visualization especially for beginners like me. he appreciates all of your views and comments. he also introduce other good kernels in Reference Section. he also created a notebook for a more precise PCA plot.", "sum_t5_words": 64, "sum_t5_runtime": 6.208, "runtime": 0.003, "nltk_category": "Real Estate, Rental & Leasing", "nltk_category_score": 0.5349171161651611, "nltk_category_runtime": 21.182, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.7738049626350403, "nltk_subcategory_runtime": 33.815, "category": "Real Estate, Rental & Leasing", "category_score": 0.5349171161651611, "subcategory": "Student", "subcategory_score": 0.7738049626350403, "runtime_cat": 54.996, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.753", "language_code": "en", "language_score": "0.9999978832486496", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data visualization notebook1st public version created may 6th 2020 2nd public version created may 7th 2020 3rd public version created may 10th 2020 4th public version created may 15th 2020 add department analysis 5th public version created may 16th 2020 add next week event value analysis 6th public version created may 16th 2020 add dynamic factor analysis 7th public version created may 23th 2020 fix code standard deviation analysis store thank comment kevin 8th public version created may 26th 2020 fix bug add calendar plot 9th public version created may 26th 2020 add precise pca plot see pca section hello everyone im one challenger competition m5 accuracy id like find useful insight predictiong test dataset created notebook data visualization especially beginner like appreciate view comment httpswwwkagglecomrobikscubem5forecastingstarterdataexploration notebook super great time strongly recommend take look ill introduce good kernel reference section table content notebook import library data input data cleaning data visualization total item sold transition item sold day type item sold state store standard deviation analysis store item sold relation analysis dynamic factor analysis trial store analysis snap purchase analysis event pattern analysis one item feature analysis sell price analysis sell price value relationship department analysis next week event week sale relationship analysis relationship lag variable calendar visualization pca trial summary future work reference", "tags_descriptive": ["Exploratory Data Analysis"]}