{"title": "#1 Smart Robots. Most Complete Notebook ", "description": "CareerCon 2019 - Help Navigate RobotsRobots are smart… by design !!  Robots are smart… by design. To fully understand and properly navigate a task, however, they need input about their environment. In this competition, you’ll help robots recognize the floor surface they’re standing on using data collected from Inertial Measurement Units (IMU sensors). We’ve collected IMU sensor data while driving a small mobile robot over different floor surfaces on the university premises. The task is to predict which one of the nine floor types (carpet, tiles, concrete) the robot is on using sensor data such as acceleration and velocity. Succeed and you'll help improve the navigation of robots without assistance across many different surfaces, so they won’t fall down on the job. Its a golden chance to help humanity, by helping Robots !", "link": "https://www.kaggle.com/jesucristo/1-smart-robots-most-complete-notebook", "tags": ["Classification", "Exploratory Data Analysis", "Robotics"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-12 08:44:46", "date_scraped": "2020-12-12 17:33:04", "words": 134, "sentences": 7, "runtime": 0.002, "description_category": "Construction & Engineering", "description_category_score": 0.3026127815246582, "description_category_runtime": 12.75, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.619080662727356, "description_subcategory_runtime": 19.439, "category": "Construction & Engineering", "category_score": 0.3026127815246582, "subcategory": "Judicial Applied", "subcategory_score": 0.619080662727356, "runtime_cat": 32.189, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.776", "language_code": "en", "language_score": "0.9999981985389534", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "careercon 2019 help navigate robotsrobots smart design robot smart design fully understand properly navigate task however need input environment competition youll help robot recognize floor surface theyre standing using data collected inertial measurement unit imu sensor weve collected imu sensor data driving small mobile robot different floor surface university premise task predict one nine floor type carpet tile concrete robot using sensor data acceleration velocity succeed youll help improve navigation robot without assistance across many different surface wont fall job golden chance help humanity helping robot", "tags_descriptive": ["Classification", "Exploratory Data Analysis", "Robotics"]}