{"title": "NFL Injuries", "description": "By: Elijah Hall Started: 11/27/2019  Completed: 1/2/2019  Updated: 1/19/2019   To see the results in a PPT click here.  IntroductionTable of Contents Problem DescriptionIn the NFL, 12 of the 31 stadiums have fields with synthetic turf. Recent investigations of lower limb injuries among football athletes have indicated significantly higher injury rates on synthetic turf compared with natural turf (Mack et al., 2018; Loughran et al., 2019). In conjunction with the epidemiologic investigations, biomechanical studies of football cleat-surface interactions have shown that synthetic turf surfaces do not release cleats as readily as natural turf and may contribute to the incidence of non-contact lower limb injuries (Kent et al., 2015). Given these differences in cleat-turf interactions, it has yet to be determined whether player movement patterns and other measures of player performance differ across playing surfaces and how these may contribute to the incidence of lower limb injury. Below I investigate the relationship between the playing surface and the injury and performance of National Football League (NFL) athletes and examine factors that may contribute to lower extremity injuries. I also try to characterize any differences in player movement between the playing surfaces and identify specific scenarios (e.g., field surface, weather, position, play type, etc.) that interact with player movement to present an elevated risk of injury. The ChallengeNFL player tracking, also known as Next Gen Stats (NGS), is the capture of real time location data, speed and acceleration for every player, every play on every inch of the field. As part of this challenge, the NFL has provided full player tracking of on-field position for 250 players over two regular season schedules. One hundred of the athletes in the study data set sustained one or more injuries during the study period that were identified as a non-contact injury of a type that may have turf interaction as a contributing factor to injury. The remaining 150 athletes serve as a representative sample of the larger NFL population that did not sustain a non-contact lower-limb injury during the study period. Details of the surface type and environmental parameters that may influence performance and outcome are also provided. About The NFLThe National Football League is America's most popular sports league, comprised of 32 franchises that compete each year to win the Super Bowl, the world's biggest annual sporting event. Founded in 1920, the NFL developed the model for the successful modern sports league, including national and international distribution, extensive revenue sharing, competitive excellence, and strong franchises across the country. The NFL is committed to advancing progress in the diagnosis, prevention and treatment of sports-related injuries. The NFL's ongoing health and safety efforts include support for independent medical research and engineering advancements and a commitment to work to better protect players and make the game safer, including enhancements to medical protocols and improvements to how our game is taught and played. As more is learned, the league evaluates and changes rules to evolve the game and try to improve protections for players. Since 2002 alone, the NFL has made 50 rules changes intended to eliminate potentially dangerous tactics and reduce the risk of injuries. The DataData FilesThere are three files provided in the dataset, as described below:  Injury Record: The injury record file in .csv format contains information on 105 lower-limb injuries that occurred during regular season games over the two seasons. Injuries can be linked to specific records in a player history using the PlayerKey, GameID, and PlayKey fields. Play List: – The play list file contains the details for the 267,005 player-plays that make up the dataset. Each play is indexed by PlayerKey, GameID, and PlayKey fields. Details about the game and play include the player’s assigned roster position, stadium type, field type, weather, play type, position for the play, and position group. Player Track Data: player level data that describes the location, orientation, speed, and direction of each player during a play recorded at 10 Hz (i.e. 10 observations recorded per second).  Field and Key DefinitionsThe following provides a description of each field contained within the datasets and their corresponding formats and descriptions. Key Variables are designated in bold.", "link": "https://www.kaggle.com/elijah24/nfl-injuries", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost", "tensorflow", "sklearn", "pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-01-23 17:14:27", "date_scraped": "2020-12-13 14:23:02", "words": 692, "sentences": 27, "sum_nltk": "In conjunction with the epidemiologic investigations, biomechanical studies of football cleat-surface interactions have shown that synthetic turf surfaces do not release cleats as readily as natural turf and may contribute to the incidence of non-contact lower limb injuries (Kent et al., 2015).\nGiven these differences in cleat-turf interactions, it has yet to be determined whether player movement patterns and other measures of player performance differ across playing surfaces and how these may contribute to the incidence of lower limb injury.\nBelow I investigate the relationship between the playing surface and the injury and performance of National Football League (NFL) athletes and examine factors that may contribute to lower extremity injuries.\nI also try to characterize any differences in player movement between the playing surfaces and identify specific scenarios (e.g., field surface, weather, position, play type, etc.) that interact with player movement to present an elevated risk of injury.\nThe DataData FilesThere are three files provided in the dataset, as described below:  Injury Record: The injury record file in .csv format contains information on 105 lower-limb injuries that occurred during regular season games over the two seasons.", "sum_nltk_words": 183, "sum_nltk_runtime": 0.008, "sum_t5": "study finds higher injury rates on synthetic turf compared with natural turf. cleat-turf interactions may contribute to lower limb injuries. nfl provides full player tracking of on-field position for 250 players. results are available in a PPT file. cnn.com/sloan/sloan/sloan/sloan/sloan/sloan/sloan/sloan/sloan/s", "sum_t5_words": 39, "sum_t5_runtime": 6.995, "runtime": 0.01, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.25279557704925537, "nltk_category_runtime": 16.648, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.6415387988090515, "nltk_subcategory_runtime": 25.874, "category": "Biotechnological & Life Sciences", "category_score": 0.25279557704925537, "subcategory": "Physical", "subcategory_score": 0.6415387988090515, "runtime_cat": 42.521, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.691", "language_code": "en", "language_score": "0.9999959084493829", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "elijah hall started 11272019 completed 122019 updated 1192019 see result ppt click introductiontable content problem descriptionin nfl 12 31 stadium field synthetic turf recent investigation lower limb injury among football athlete indicated significantly higher injury rate synthetic turf compared natural turf mack et al 2018 loughran et al 2019 conjunction epidemiologic investigation biomechanical study football cleatsurface interaction shown synthetic turf surface release cleat readily natural turf may contribute incidence noncontact lower limb injury kent et al 2015 given difference cleatturf interaction yet determined whether player movement pattern measure player performance differ across playing surface may contribute incidence lower limb injury investigate relationship playing surface injury performance national football league nfl athlete examine factor may contribute lower extremity injury also try characterize difference player movement playing surface identify specific scenario eg field surface weather position play type etc interact player movement present elevated risk injury challengenfl player tracking also known next gen stats ng capture real time location data speed acceleration every player every play every inch field part challenge nfl provided full player tracking onfield position 250 player two regular season schedule one hundred athlete study data set sustained one injury study period identified noncontact injury type may turf interaction contributing factor injury remaining 150 athlete serve representative sample larger nfl population sustain noncontact lowerlimb injury study period detail surface type environmental parameter may influence performance outcome also provided nflthe national football league america popular sport league comprised 32 franchise compete year win super bowl world biggest annual sporting event founded 1920 nfl developed model successful modern sport league including national international distribution extensive revenue sharing competitive excellence strong franchise across country nfl committed advancing progress diagnosis prevention treatment sportsrelated injury nfls ongoing health safety effort include support independent medical research engineering advancement commitment work better protect player make game safer including enhancement medical protocol improvement game taught played learned league evaluates change rule evolve game try improve protection player since 2002 alone nfl made 50 rule change intended eliminate potentially dangerous tactic reduce risk injury datadata filesthere three file provided dataset described injury record injury record file csv format contains information 105 lowerlimb injury occurred regular season game two season injury linked specific record player history using playerkey gameid playkey field play list play list file contains detail 267005 playerplays make dataset play indexed playerkey gameid playkey field detail game play include player assigned roster position stadium type field type weather play type position play position group player track data player level data describes location orientation speed direction player play recorded 10 hz ie 10 observation recorded per second field key definitionsthe following provides description field contained within datasets corresponding format description key variable designated bold", "tags_descriptive": []}