{"title": "️ IEEE Fraud Detection - First Look and EDA", "description": "IEEE Fraud Detection Competition In this kernel I do some basic exploritory data analysis on the IEEE Fraud Detection dataset. Please upvote if you find this kernel helpful. I will continue to update as I find more discoveries. I suggest you also read the complete competition overview and data description found in the competition page. I purposefully show all of my code. The intention is to not only show the results, but also have clear code that shows how similar analysis can be done on any dataset. From the competition overview: In this competition, you’ll benchmark machine learning models on a challenging large-scale dataset. The data comes from Vesta's real-world e-commerce transactions and contains a wide range of features from device type to product features. You also have the opportunity to create new features to improve your results. If successful, you’ll improve the efficacy of fraudulent transaction alerts for millions of people around the world, helping hundreds of thousands of businesses reduce their fraud loss and increase their revenue. And of course, you will save party people just like you the hassle of false positives.", "link": "https://www.kaggle.com/robikscube/ieee-fraud-detection-first-look-and-eda", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-17 03:32:21", "date_scraped": "2020-12-12 21:40:28", "words": 185, "sentences": 11, "runtime": 0.002, "description_category": "Finance", "description_category_score": 0.05819251760840416, "description_category_runtime": 15.094, "description_subcategory": "Fraud", "description_subcategory_score": 0.7462023496627808, "description_subcategory_runtime": 23.725, "category": "Finance", "category_score": 0.05819251760840416, "subcategory": "Fraud", "subcategory_score": 0.7462023496627808, "runtime_cat": 38.819, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.782", "language_code": "en", "language_score": "0.9999952278376026", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "ieee fraud detection competition kernel basic exploritory data analysis ieee fraud detection dataset please upvote find kernel helpful continue update find discovery suggest also read complete competition overview data description found competition page purposefully show code intention show result also clear code show similar analysis done dataset competition overview competition youll benchmark machine learning model challenging largescale dataset data come vesta realworld ecommerce transaction contains wide range feature device type product feature also opportunity create new feature improve result successful youll improve efficacy fraudulent transaction alert million people around world helping hundred thousand business reduce fraud loss increase revenue course save party people like hassle false positive", "tags_descriptive": []}