{"title": "Exploration of data step by step", "description": "General informationThis kernel is dedicated to EDA of PetFinder.my Adoption Prediction challenge as well as feature engineering and modelling.  (a screenshot of the PetFinder.my site) In this dataset we have lots of information: tabular data, texts and even images! This gives a lot of possibilties for feature engineering and modelling. The only limiting factor is the fact that the competition is kernel-only. On the other hand this will ensure everyone has the same computational resources. In this kernel I want to pay attention to several things:  comparing distribution of features in train and test data; exploring features and their interactions; trying various types of feature engineering; trying various models without neural nets (for now);  It is important to remember that this competition has stage 2, so our models will run against unseen data. Work still in progress", "link": "https://www.kaggle.com/artgor/exploration-of-data-step-by-step", "tags": ["Classification", "Exploratory Data Analysis", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["nltk", "xgboost", "lightgbm", "sklearn", "catboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-03-15 09:27:39", "date_scraped": "2020-12-13 15:07:40", "words": 140, "sentences": 6, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.0070989131927490234, "description_category_runtime": 12.441, "description_subcategory": "General", "description_subcategory_score": 0.9790434241294861, "description_subcategory_runtime": 19.128, "category": "Education & Research", "category_score": 0.0070989131927490234, "subcategory": "General", "subcategory_score": 0.9790434241294861, "runtime_cat": 31.57, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.795", "language_code": "en", "language_score": "0.9999979544098097", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "general informationthis kernel dedicated eda petfindermy adoption prediction challenge well feature engineering modelling screenshot petfindermy site dataset lot information tabular data text even image give lot possibilties feature engineering modelling limiting factor fact competition kernelonly hand ensure everyone computational resource kernel want pay attention several thing comparing distribution feature train test data exploring feature interaction trying various type feature engineering trying various model without neural net important remember competition stage 2 model run unseen data work still progress", "tags_descriptive": ["Classification", "Exploratory Data Analysis", "Feature Engineering"]}