{"title": "Clockwise or Counterclockwise?", "description": "When asked to draw a simple shape, do you usually draw it clockwise or counterclockwise? Does it depend on the shape in question? Does it depend on your cultural background? These are the questions we rarely ask ourselves, but can potentially lead to interesting discoveries. Maybe before reading this notebook, try this yourself. Draw a circle, square and hexagon each, and see instinctively, which direction your hand is going, and then find out below if you draw the same way the majority of people from your region do. To determine how people from different parts of the world draw simple shapes, we will be using the QuickDraw dataset, which is a collection of various simple shapes people drew online when asked to do a sketch of a given object. Here we are most interested in how people draw the most basic shapes (circle, square, hexagon). The dataset includes the country code of the user as an attribute, allowing us to perform some geography / culture-based analysis on our results. The goal of our analysis is to find out if there are any differences in the direction people draw simple shapes around the world. To do so, we will have to come up with a measure of 'counterclockwiseness' for each of the sktches in the dataset. But first, let us look at in what format the drawings appear in the dataset. Let us load the hexagon drawings first:", "link": "https://www.kaggle.com/mithrillion/clockwise-or-counterclockwise", "tags": ["CV"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-01 12:07:28", "date_scraped": "2020-12-13 16:18:48", "words": 237, "sentences": 10, "sum_nltk": "When asked to draw a simple shape, do you usually draw it clockwise or counterclockwise?\nDoes it depend on the shape in question?\nThese are the questions we rarely ask ourselves, but can potentially lead to interesting discoveries.\nDraw a circle, square and hexagon each, and see instinctively, which direction your hand is going, and then find out below if you draw the same way the majority of people from your region do.\nTo determine how people from different parts of the world draw simple shapes, we will be using the QuickDraw dataset, which is a collection of various simple shapes people drew online when asked to do a sketch of a given object.\nHere we are most interested in how people draw the most basic shapes (circle, square, hexagon).\nThe dataset includes the country code of the user as an attribute, allowing us to perform some geography / culture-based analysis on our results.\nThe goal of our analysis is to find out if there are any differences in the direction people draw simple shapes around the world.\nBut first, let us look at in what format the drawings appear in the dataset.\nLet us load the hexagon drawings first:", "sum_nltk_words": 191, "sum_nltk_runtime": 0.003, "sum_t5": "draw a circle, square and hexagon and see if you draw the same way people do. use the quickdraw dataset to determine how people draw simple shapes. the goal of our analysis is to find out if there are any differences in direction people draw simple shapes around the world. if you draw the hexagon, you will have to draw it clockwise or counterclockwise. if you draw the hexagon, you will have to draw it counterclockwise.", "sum_t5_words": 76, "sum_t5_runtime": 4.69, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.5248752236366272, "nltk_category_runtime": 16.519, "nltk_subcategory": "Valuation", "nltk_subcategory_score": 0.593554675579071, "nltk_subcategory_runtime": 26.374, "category": "Utilities", "category_score": 0.5248752236366272, "subcategory": "Valuation", "subcategory_score": 0.593554675579071, "runtime_cat": 42.894, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.672", "language_code": "en", "language_score": "0.9999981661442734", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "asked draw simple shape usually draw clockwise counterclockwise depend shape question depend cultural background question rarely ask potentially lead interesting discovery maybe reading notebook try draw circle square hexagon see instinctively direction hand going find draw way majority people region determine people different part world draw simple shape using quickdraw dataset collection various simple shape people drew online asked sketch given object interested people draw basic shape circle square hexagon dataset includes country code user attribute allowing u perform geography culturebased analysis result goal analysis find difference direction people draw simple shape around world come measure counterclockwiseness sktches dataset first let u look format drawing appear dataset let u load hexagon drawing first", "tags_descriptive": ["Computer Vision (CV)"]}