{"title": "Feature Engineering & LightGBM", "description": "About this kernelHey, everyone! This was my first solution to this competition. There is nothing revolutionary here as this is my first competition and I'm trying to learn with all the public kernels. I decided to share this solution to help people that are beginners like me, to at least give them an idea of what to do and where to begin. Later, I'll add a cell with all the advice people gave me in the discussions so we can talk more about it here. I'll also add a reference to the kernels I used here. Please, give me some feedback if you can. I would love to hear what you believe could be improved in this kernel. Hope you are enjoying this competition as much as I am. Good luck and I hope you like this kernel. [UPDATE] In the comments section, @cebeci told me the merging process was wrong and it really was. I'm sorry about it, merging is now correct. Also in the comments, @lftuwujie told me the GPU makes almost no difference to LGBM. I tested it and he was (as expected) correct, so this was also changed. Thank you for all the feedback and support. It's been really nice to learn with all of you.", "link": "https://www.kaggle.com/davidcairuz/feature-engineering-lightgbm", "tags": ["Classification", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-01 17:03:38", "date_scraped": "2020-12-12 21:40:28", "words": 210, "sentences": 15, "sum_nltk": "This was my first solution to this competition.\nThere is nothing revolutionary here as this is my first competition and I'm trying to learn with all the public kernels.\nI decided to share this solution to help people that are beginners like me, to at least give them an idea of what to do and where to begin.\nLater, I'll add a cell with all the advice people gave me in the discussions so we can talk more about it here.\nI'll also add a reference to the kernels I used here.\nPlease, give me some feedback if you can.\nI would love to hear what you believe could be improved in this kernel.\nHope you are enjoying this competition as much as I am.\nGood luck and I hope you like this kernel.\n[UPDATE] In the comments section, @cebeci told me the merging process was wrong and it really was.\nI'm sorry about it, merging is now correct.\nAlso in the comments, @lftuwujie told me the GPU makes almost no difference to LGBM.\nI tested it and he was (as expected) correct, so this was also changed.\nThank you for all the feedback and support.", "sum_nltk_words": 183, "sum_nltk_runtime": 0.003, "sum_t5": "this kernel was my first solution to this competition. it's a simple solution to learn with all the public kernels. it's been really nice to learn with all of you. it's been really nice to learn with all of you. if you have any suggestions, please send them a message. a link to the kernel will be added later. a wiki page will be added to this post. a kernel will be released later this year.", "sum_t5_words": 76, "sum_t5_runtime": 4.87, "runtime": 0.0, "nltk_category": "Justice, Law and Regulations", "nltk_category_score": 0.4649919271469116, "nltk_category_runtime": 16.921, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.5846574306488037, "nltk_subcategory_runtime": 27.177, "category": "Justice, Law and Regulations", "category_score": 0.4649919271469116, "subcategory": "Student", "subcategory_score": 0.5846574306488037, "runtime_cat": 44.098, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.777", "language_code": "en", "language_score": "0.9999970850164115", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "kernelhey everyone first solution competition nothing revolutionary first competition im trying learn public kernel decided share solution help people beginner like least give idea begin later ill add cell advice people gave discussion talk ill also add reference kernel used please give feedback would love hear believe could improved kernel hope enjoying competition much good luck hope like kernel update comment section cebeci told merging process wrong really im sorry merging correct also comment lftuwujie told gpu make almost difference lgbm tested expected correct also changed thank feedback support really nice learn", "tags_descriptive": ["Classification", "Feature Engineering"]}