{"title": "Mercari RNN + 2Ridge models with notes (~0.42755)", "description": "DescriptionThis is an associated model using RNN ,Ridge, and a RidgeCV to solve Mercari Price Suggestion Challenge competition. It currently gets a RMSLE of ~0.419 in the development set and around ~0.427 in the competition, which is better than the currently public Kernals for the competition. I figure I don't have time to keep working on this for the next few weeks so I will simply share this model, along with some notes and thoughts, so that it can help others with their own models or function as a good jumping off point. After this kernal, I will probably bow out for the rest of the comp. If you find this kernal useful, please give me some of them sweet sweet kernel likes. I left some old code attempts in comments as well as a few repeated lines. This is just more matterial to play with if they change the code around. (Referenced Kernal links at the bottom.)", "link": "https://www.kaggle.com/valkling/mercari-rnn-2ridge-models-with-notes-0-42755", "tags": ["RNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "nltk", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-01-22 02:42:38", "date_scraped": "2020-12-13 14:05:42", "words": 158, "sentences": 8, "runtime": 0.003, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.21006563305854797, "description_category_runtime": 13.564, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9803138971328735, "description_subcategory_runtime": 21.67, "category": "Real Estate, Rental & Leasing", "category_score": 0.21006563305854797, "subcategory": "Machine Learning", "subcategory_score": 0.9803138971328735, "runtime_cat": 35.234, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.75", "language_code": "en", "language_score": "0.9999982648275623", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "descriptionthis associated model using rnn ridge ridgecv solve mercari price suggestion challenge competition currently get rmsle 0419 development set around 0427 competition better currently public kernals competition figure dont time keep working next week simply share model along note thought help others model function good jumping point kernal probably bow rest comp find kernal useful please give sweet sweet kernel like left old code attempt comment well repeated line matterial play change code around referenced kernal link bottom", "tags_descriptive": ["Recurrent Neural Network (RNN)"]}