{"title": "Cervix Image Segmentation", "description": "Cervix Image SegmentationI'd first like to say thank you to  https://www.kaggle.com/philschmidt/intel-mobileodt-cervical-cancer-screening/cervix-eda/notebook Those competing in the Lung Cancer detection competition for the masking idea All those I have learned from in the Kaggle community and outside   I hope you learn from this script and is improved upon. This is my first Kaggle kernel so please give feedback where you see appropriate :D IF YOU KNOW A BETTER WAY TO DO A CLUSTER CROP, PLEASE LET ME KNOW :) One of the first things I noticed about the images is that there are borders of a \"random\" width/height that contain no \"information\". We really want to reduce the data to just the necessary components, ie. the cervix in this instance. AFAIK, all other parts of the picture provide no information that will help our classifier. From here I looked into medical imaging but saw k-means clustering with cv2 seemed to handle the task pretty well.", "link": "https://www.kaggle.com/cpruce/cervix-image-segmentation", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-08-27 01:45:01", "date_scraped": "2020-12-13 11:58:48", "words": 156, "sentences": 6, "runtime": 0.0, "description_category": "Healthcare", "description_category_score": 0.4901021122932434, "description_category_runtime": 16.032, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9110152721405029, "description_subcategory_runtime": 25.607, "category": "Healthcare", "category_score": 0.4901021122932434, "subcategory": "Machine Learning", "subcategory_score": 0.9110152721405029, "runtime_cat": 41.64, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.733", "language_code": "en", "language_score": "0.9999966484480222", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "cervix image segmentationid first like say thank httpswwwkagglecomphilschmidtintelmobileodtcervicalcancerscreeningcervixedanotebook competing lung cancer detection competition masking idea learned kaggle community outside hope learn script improved upon first kaggle kernel please give feedback see appropriate know better way cluster crop please let know one first thing noticed image border random widthheight contain information really want reduce data necessary component ie cervix instance afaik part picture provide information help classifier looked medical imaging saw kmeans clustering cv2 seemed handle task pretty well", "tags_descriptive": []}