{"title": "TReNDS Neuroimaging - Data Analysis & 3D Features", "description": "1. Train Scores (Targets)train_scores.csv is the file which consists of target features. Those features are age, domain1_var1, domain1_var2, domain2_var1 and domain2_var2. There are 5 target features to predict and submissions are scored using feature-weighted, normalized absolute errors. score =∑fwf(∑i|yf,i−y^f,i|∑iy^f,i)=∑fwf(∑i|yf,i−y^f,i|∑iy^f,i) The weights are [.3, .175, .175, .175, .175] corresponding to features [age, domain1_var1, domain1_var2, domain2_var1, domain2_var2]. This means every targets normalized absolute error is independent from each other. They can be trained and predicted with a single model or 5 different models. Another important thing to consider is, train_scores.csv are not the original age and raw assessment values. They have been transformed and de-identified to help protect subject identity and minimize the risk of unethical usage of the data. Nonetheless, they are directly derived from the original assessment values and, thus, associations with the provided features is equally likely. Before transformation, the age in the training set is rounded to nearest year for privacy reasons. However, age is not rounded to year (higher precision) in the test set. Thus, heavily overfitting to the training set age will very likely have a negative impact on your submissions.", "link": "https://www.kaggle.com/gunesevitan/trends-neuroimaging-data-analysis-3d-features", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-30 13:31:44", "date_scraped": "2020-12-13 17:52:38", "words": 185, "sentences": 13, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.5195351243019104, "description_category_runtime": 22.833, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9234640598297119, "description_subcategory_runtime": 37.64, "category": "Utilities", "category_score": 0.5195351243019104, "subcategory": "Machine Learning", "subcategory_score": 0.9234640598297119, "runtime_cat": 60.473, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.726", "language_code": "en", "language_score": "0.9999975527660696", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "1 train score targetstrain_scorescsv file consists target feature feature age domain1_var1 domain1_var2 domain2_var1 domain2_var2 5 target feature predict submission scored using featureweighted normalized absolute error score fwfiyfiyfiiyfifwfiyfiyfiiyfi weight 3 175 175 175 175 corresponding feature age domain1_var1 domain1_var2 domain2_var1 domain2_var2 mean every target normalized absolute error independent trained predicted single model 5 different model another important thing consider train_scorescsv original age raw assessment value transformed deidentified help protect subject identity minimize risk unethical usage data nonetheless directly derived original assessment value thus association provided feature equally likely transformation age training set rounded nearest year privacy reason however age rounded year higher precision test set thus heavily overfitting training set age likely negative impact submission", "tags_descriptive": ["Exploratory Data Analysis"]}