{"title": "Data Science Bowl 2019 EDA and Baseline", "description": "Data Science Bowl 2019IntroductionPBS KIDS, a trusted name in early childhood education for decades, aims to gain insights into how media can help children learn important skills for success in school and life. In this challenge, you’ll use anonymous gameplay data, including knowledge of videos watched and games played, from the PBS KIDS Measure Up! app, a game-based learning tool developed as a part of the CPB-PBS Ready To Learn Initiative with funding from the U.S. Department of Education. Competitors will be challenged to predict scores on in-game assessments and create an algorithm that will lead to better-designed games and improved learning outcomes. Your solutions will aid in discovering important relationships between engagement with high-quality educational media and learning processes. Where does the data for the competition come from? The data used in this competition is anonymous, tabular data of interactions with the PBS KIDS Measure Up! app. Select data, such as a user’s in-app assessment score or their path through the game, is collected by the PBS KIDS Measure Up! app, a game-based learning tool. What is the PBS KIDS Measure Up! app? In the PBS KIDS Measure Up! app, children ages 3 to 5 learn early STEM concepts focused on length, width, capacity, and weight while going on an adventure through Treetop City, Magma Peak, and Crystal Caves. Joined by their favorite PBS KIDS characters, children can also collect rewards and unlock digital toys as they play. Besides the info provided above by Kaggle, I found the following additional info on the website of the app: Specific features of Measure Up! include:  19 unique measuring games. 10 measurement-focused video clips. Sticker books featuring favorite PBS KIDS characters. Rewards for completion of tasks. Embedded challenges and reports to help parents and caregivers monitor kids’ progress. Ability to track your child's progress using the PBS KIDS Super Vision companion app.  Evaluation Submissions are scored based on the quadratic weighted kappa, which measures the agreement between two outcomes. This metric typically varies from 0 (random agreement) to 1 (complete agreement). In the event that there is less agreement than expected by chance, the metric may go below 0. The outcomes in this competition are grouped into 4 groups (labeled accuracy_group in the data): 3: the assessment was solved on the first attempt 2: the assessment was solved on the second attempt 1: the assessment was solved after 3 or more attempts 0: the assessment was never solved For each installation_id represented in the test set, you must predict the accuracy_group of the last assessment for that installation_id. Note that the training set contains many installation_ids which never took assessments, whereas every installation_id in the test set made an attempt on at least one assessment. The file train_labels.csv has been provided to show how these groups would be computed on the assessments in the training set. Assessment attempts are captured in event_code 4100 for all assessments except for Bird Measurer, which uses event_code 4110. If the attempt was correct, it contains \"correct\":true.", "link": "https://www.kaggle.com/erikbruin/data-science-bowl-2019-eda-and-baseline", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "catboost", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-12-15 10:49:53", "date_scraped": "2020-12-12 18:40:29", "words": 502, "sentences": 23, "sum_nltk": "Data Science Bowl 2019IntroductionPBS KIDS, a trusted name in early childhood education for decades, aims to gain insights into how media can help children learn important skills for success in school and life.\nIn this challenge, you’ll use anonymous gameplay data, including knowledge of videos watched and games played, from the PBS KIDS Measure Up!\napp, a game-based learning tool developed as a part of the CPB-PBS Ready To Learn Initiative with funding from the U.S. Department of Education.\nThe data used in this competition is anonymous, tabular data of interactions with the PBS KIDS Measure Up!\nSelect data, such as a user’s in-app assessment score or their path through the game, is collected by the PBS KIDS Measure Up!\napp, a game-based learning tool.\nJoined by their favorite PBS KIDS characters, children can also collect rewards and unlock digital toys as they play.\nEvaluation Submissions are scored based on the quadratic weighted kappa, which measures the agreement between two outcomes.\nThe outcomes in this competition are grouped into 4 groups (labeled accuracy_group in the data): 3: the assessment was solved on the first attempt 2: the assessment was solved on the second attempt 1: the assessment was solved after 3 or more attempts 0: the assessment was never solved For each installation_id represented in the test set, you must predict the accuracy_group of the last assessment for that installation_id.", "sum_nltk_words": 222, "sum_nltk_runtime": 0.007, "sum_t5": "data from the PBS KIDS Measure Up! app is anonymous. the app is a game-based learning tool developed as a part of the CPB-PBS Ready to Learn Initiative. the competition will be held on november 14 at the san francisco olympic park. the results will be compared to the results of the previous competition. the results will be compared to the results of the previous competition.", "sum_t5_words": 66, "sum_t5_runtime": 6.295, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.46247485280036926, "nltk_category_runtime": 21.318, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.4759399890899658, "nltk_subcategory_runtime": 33.979, "category": "Education & Research", "category_score": 0.46247485280036926, "subcategory": "Student", "subcategory_score": 0.4759399890899658, "runtime_cat": 55.296, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.782", "language_code": "en", "language_score": "0.9999948866578299", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data science bowl 2019introductionpbs kid trusted name early childhood education decade aim gain insight medium help child learn important skill success school life challenge youll use anonymous gameplay data including knowledge video watched game played pb kid measure app gamebased learning tool developed part cpbpbs ready learn initiative funding u department education competitor challenged predict score ingame assessment create algorithm lead betterdesigned game improved learning outcome solution aid discovering important relationship engagement highquality educational medium learning process data competition come data used competition anonymous tabular data interaction pb kid measure app select data user inapp assessment score path game collected pb kid measure app gamebased learning tool pb kid measure app pb kid measure app child age 3 5 learn early stem concept focused length width capacity weight going adventure treetop city magma peak crystal cave joined favorite pb kid character child also collect reward unlock digital toy play besides info provided kaggle found following additional info website app specific feature measure include 19 unique measuring game 10 measurementfocused video clip sticker book featuring favorite pb kid character reward completion task embedded challenge report help parent caregiver monitor kid progress ability track child progress using pb kid super vision companion app evaluation submission scored based quadratic weighted kappa measure agreement two outcome metric typically varies 0 random agreement 1 complete agreement event le agreement expected chance metric may go 0 outcome competition grouped 4 group labeled accuracy_group data 3 assessment solved first attempt 2 assessment solved second attempt 1 assessment solved 3 attempt 0 assessment never solved installation_id represented test set must predict accuracy_group last assessment installation_id note training set contains many installation_ids never took assessment whereas every installation_id test set made attempt least one assessment file train_labelscsv provided show group would computed assessment training set assessment attempt captured event_code 4100 assessment except bird measurer us event_code 4110 attempt correct contains correcttrue", "tags_descriptive": []}