{"title": "Training using Google AutoML", "description": "Set ParametersIn GCP, work is organized into projects. gcs_path is the path that images and the training csv will be uploaded to. AutoML Vision requires the images to be stored in a directory with the root directory being gs://{project_id}-vcm. train_filename is the name of the csv file that's uploaded to GCS. Doesn't matter what you choose here. gcp_service_account_json is the path to the service account key. Service accounts allow you to authenticate with GCP using a JSON key (rather than typing in a password). I uploaded my service account key as a private dataset. Read more about setting one up at https://cloud.google.com/iam/docs/understanding-service-accounts train_budget is the number of node hours. 1 is min. 24 is maximum. I believe AutoML Vision Classifaction costs $20 per node hour. dataset_name is the name of the dataset that's loaded into AutoML. Doesn't matter what you choose here. model_name is the name of the model in AutoML. Doesn't matter what you choose here. I use the convention of dataset_name underscore train_budget", "link": "https://www.kaggle.com/antgoldbloom/training-using-google-automl", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-31 19:48:43", "date_scraped": "2020-12-13 16:34:09", "words": 165, "sentences": 17, "runtime": 0.002, "description_category": "Construction & Engineering", "description_category_score": 0.5302551984786987, "description_category_runtime": 17.343, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7192339301109314, "description_subcategory_runtime": 27.518, "category": "Construction & Engineering", "category_score": 0.5302551984786987, "subcategory": "Machine Learning", "subcategory_score": 0.7192339301109314, "runtime_cat": 44.863, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.655", "language_code": "en", "language_score": "0.9999971383051512", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "set parametersin gcp work organized project gcs_path path image training csv uploaded automl vision requires image stored directory root directory gsproject_idvcm train_filename name csv file thats uploaded gc doesnt matter choose gcp_service_account_json path service account key service account allow authenticate gcp using json key rather typing password uploaded service account key private dataset read setting one httpscloudgooglecomiamdocsunderstandingserviceaccounts train_budget number node hour 1 min 24 maximum believe automl vision classifaction cost 20 per node hour dataset_name name dataset thats loaded automl doesnt matter choose model_name name model automl doesnt matter choose use convention dataset_name underscore train_budget", "tags_descriptive": []}