{"title": "Quora EDA & Model selection (ROC, PR plots)", "description": "Quora Question-pair classificationThis competition is about modelling whether a pair of questions on Quora is asking the same question. For this problem we have about 400.000 training examples. Each row consists of two sentences and a binary label that indicates to us whether the two questions were the same or not. Inspired by this nice kernel from Anisotropic I've added a few interactive 2D and 3D scatter plots. To get an insight into how the duplicates evolve over the number of words in the questions, I've added a plotly animation that encodes number of words and word share similarity in a scatter plot. We will be looking in detail at:  question pair TF-IDF encodings basic feature engineering and their embeddings in lower dimensional spaces parallel coordinates visualization model selection and evaluation + sample submission.  If you like this kernel, please upvote it :D, thanks!  Added a final section for cross-validated model selection and evaluation. We will look at standard binary classification metrics, like ROC and PR curves and their AUCs. The best (linear) model that we found then generates a submission.", "link": "https://www.kaggle.com/philschmidt/quora-eda-model-selection-roc-pr-plots", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-04-15 00:37:24", "date_scraped": "2020-12-13 16:22:58", "words": 184, "sentences": 9, "runtime": 0.002, "description_category": "Accommodation & Food", "description_category_score": 0.07727483659982681, "description_category_runtime": 16.173, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.17893962562084198, "description_subcategory_runtime": 25.564, "category": "Accommodation & Food", "category_score": 0.07727483659982681, "subcategory": "Machine Learning", "subcategory_score": 0.17893962562084198, "runtime_cat": 41.737, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.79", "language_code": "en", "language_score": "0.9999951237828302", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "quora questionpair classificationthis competition modelling whether pair question quora asking question problem 400000 training example row consists two sentence binary label indicates u whether two question inspired nice kernel anisotropic ive added interactive 2d 3d scatter plot get insight duplicate evolve number word question ive added plotly animation encodes number word word share similarity scatter plot looking detail question pair tfidf encoding basic feature engineering embeddings lower dimensional space parallel coordinate visualization model selection evaluation sample submission like kernel please upvote thanks added final section crossvalidated model selection evaluation look standard binary classification metric like roc pr curve auc best linear model found generates submission", "tags_descriptive": ["Exploratory Data Analysis"]}