{"title": "Fastai resnet34 transfer learning", "description": "Getting pretrained model to start from with no internetThanks to https://www.kaggle.com/aminyakubu/aptos-2019-blindness-detection-fast-ai for the guidance on how to load pretrained models into this.  I just watched the error for learn = cnn_learner(....) from two cells down to identify the directory to copy the pth file to and what the postfixed id was. This is the original instructions shared:  Later, I use resnet as the base architecture. However, since we can't use the internet for this kernel in this competition I will set these directories which will contain the models. This is because, cnn_learner will check those directories first before attempting to download. When internet for the kernel is turned off and these models don't exist, an error will be raised. To add the models, click on add dataset at the top right corner of this kernel and search for resnet. Make sure to choose resnet for PyTorch Thanks Amin!  https://www.kaggle.com/aminyakubu", "link": "https://www.kaggle.com/finlaymacrae/fastai-resnet34-transfer-learning", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-09 01:45:30", "date_scraped": "2020-12-13 11:41:37", "words": 152, "sentences": 8, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.3050153851509094, "description_category_runtime": 16.021, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9170029759407043, "description_subcategory_runtime": 25.755, "category": "Utilities", "category_score": 0.3050153851509094, "subcategory": "Machine Learning", "subcategory_score": 0.9170029759407043, "runtime_cat": 41.777, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.603", "language_code": "en", "language_score": "0.9999975040346639", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "getting pretrained model start internetthanks httpswwwkagglecomaminyakubuaptos2019blindnessdetectionfastai guidance load pretrained model watched error learn cnn_learner two cell identify directory copy pth file postfixed id original instruction shared later use resnet base architecture however since cant use internet kernel competition set directory contain model cnn_learner check directory first attempting download internet kernel turned model dont exist error raised add model click add dataset top right corner kernel search resnet make sure choose resnet pytorch thanks amin httpswwwkagglecomaminyakubu", "tags_descriptive": []}