{"title": "YOLOv3 Keras - Image Object Detection", "description": "YOLOv3 Keras API Image Object DetectionIn this notebook I want to implement simple object detection with Keras of some JPEG images in our training set. I use a pretrained (MSCOCO dataset) YOLOv3 model. This kernel is mainly based on https://machinelearningmastery.com/how-to-perform-object-detection-with-yolov3-in-keras and adapted for Lyft 3D Object Detection for Autonomous Driving challenge. I highly advise you to read to throught the blog for deeper understanding, and giving the original blogger the props. Please note that the model hasn't been fine tuned, or trained myself. The following implementation should serve the purpose of facilitating to get started with the current challenge. I don't know how relevant object detection with images is, in a 3D object detection challenge, as the LiDAR data is not regarded. If this Kernel helped you in any way, give it an upvote (such that I can increasy my online self-esteem...)$", "link": "https://www.kaggle.com/fanconic/yolov3-keras-image-object-detection", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-15 02:43:59", "date_scraped": "2020-12-12 16:08:03", "words": 142, "sentences": 8, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.04005453363060951, "description_category_runtime": 14.862, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9754568934440613, "description_subcategory_runtime": 23.936, "category": "Utilities", "category_score": 0.04005453363060951, "subcategory": "Machine Learning", "subcategory_score": 0.9754568934440613, "runtime_cat": 38.798, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.739", "language_code": "en", "language_score": "0.9999971422730946", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "yolov3 kera api image object detectionin notebook want implement simple object detection kera jpeg image training set use pretrained mscoco dataset yolov3 model kernel mainly based httpsmachinelearningmasterycomhowtoperformobjectdetectionwithyolov3inkeras adapted lyft 3d object detection autonomous driving challenge highly advise read throught blog deeper understanding giving original blogger prop please note model hasnt fine tuned trained following implementation serve purpose facilitating get started current challenge dont know relevant object detection image 3d object detection challenge lidar data regarded kernel helped way give upvote increasy online selfesteem", "tags_descriptive": []}