{"title": "True Tracks VS Clustered Hits (Predicted Tracks)", "description": "Visualization: True Tracks VS Clustered Hits (Predicted Tracks)I created this kernel because I wanted to know what the tracks look like, what the clusters (made w/ DBSCAN) look like, and if the clustering is working correctly (or working at all) aside from knowing the LB score. I will show plots of tracks and plots of clustered hits (or predicted tracks) on the same points. The tracks are plotted using the raw hits coordinates and also using the transformed hits coordinates (based on the DBSCAN benchmark kernel). I will also relate the plots to how the clustering is expected to work. Clustered hits are visualized for 4 different settings using DBSCAN. The code for the track visualizations are based on Joshua Bonatt's kernel: https://www.kaggle.com/jbonatt/trackml-eda-etc The code for the coordinate transformation are based on Mikhail Hushchyn's DBSCAN benchmark kernel: https://www.kaggle.com/mikhailhushchyn/dbscan-benchmark Learned how to import trackml from Wesam Elshamy's kernel: https://www.kaggle.com/wesamelshamy/trackml-problem-explanation-and-data-exploration", "link": "https://www.kaggle.com/jollibobert/true-tracks-vs-clustered-hits-predicted-tracks", "tags": ["Physics", "CLustering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-05-07 18:43:01", "date_scraped": "2020-12-13 17:43:28", "words": 148, "sentences": 6, "runtime": 0.005, "description_category": "Finance", "description_category_score": 0.1998146027326584, "description_category_runtime": 18.937, "description_subcategory": "Restaurant", "description_subcategory_score": 0.24413782358169556, "description_subcategory_runtime": 29.59, "category": "Finance", "category_score": 0.1998146027326584, "subcategory": "Restaurant", "subcategory_score": 0.24413782358169556, "runtime_cat": 48.527, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.694", "language_code": "en", "language_score": "0.9999989784986806", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "visualization true track v clustered hit predicted tracksi created kernel wanted know track look like cluster made w dbscan look like clustering working correctly working aside knowing lb score show plot track plot clustered hit predicted track point track plotted using raw hit coordinate also using transformed hit coordinate based dbscan benchmark kernel also relate plot clustering expected work clustered hit visualized 4 different setting using dbscan code track visualization based joshua bonatts kernel httpswwwkagglecomjbonatttrackmledaetc code coordinate transformation based mikhail hushchyns dbscan benchmark kernel httpswwwkagglecommikhailhushchyndbscanbenchmark learned import trackml wesam elshamys kernel httpswwwkagglecomwesamelshamytrackmlproblemexplanationanddataexploration", "tags_descriptive": ["Physics", "CLustering"]}