{"title": "COVID-19:Analysis+EDA+Forecasting", "description": "Introduction (Although it doesn't need any) Corona Virus Coronaviruses are zoonotic viruses (means transmitted between animals and people).   Symptoms include from fever, cough, respiratory symptoms, and breathing difficulties.  In severe cases, it can cause pneumonia, severe acute respiratory syndrome (SARS), kidney failure and even death. Coronaviruses are also asymptomatic, means a person can be a carrier for the infection but experiences no symptoms  Novel coronavirus (nCoV) A novel coronavirus (nCoV) is a new strain that has not been previously identified in humans.  COVID-19 (Corona Virus Disease 2019) Caused by a SARS-COV-2 corona virus.   First identified in Wuhan, Hubei, China. Earliest reported symptoms reported in November 2019.  First cases were linked to contact with the Huanan Seafood Wholesale Market, which sold live animals.  On 30 January the WHO declared the outbreak to be a Public Health Emergency of International Concern", "link": "https://www.kaggle.com/deepakdeepu8978/covid-19-analysis-eda-forecasting", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-02 05:32:03", "date_scraped": "2020-12-12 18:11:58", "words": 148, "sentences": 9, "runtime": 0.002, "description_category": "Emergency & Relief", "description_category_score": 0.41004854440689087, "description_category_runtime": 15.525, "description_subcategory": "Wholesale", "description_subcategory_score": 0.5868406295776367, "description_subcategory_runtime": 24.241, "category": "Emergency & Relief", "category_score": 0.41004854440689087, "subcategory": "Wholesale", "subcategory_score": 0.5868406295776367, "runtime_cat": 39.766, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.759", "language_code": "en", "language_score": "0.9999966023601932", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introduction although doesnt need corona virus coronaviruses zoonotic virus mean transmitted animal people symptom include fever cough respiratory symptom breathing difficulty severe case cause pneumonia severe acute respiratory syndrome sars kidney failure even death coronaviruses also asymptomatic mean person carrier infection experience symptom novel coronavirus ncov novel coronavirus ncov new strain previously identified human covid19 corona virus disease 2019 caused sarscov2 corona virus first identified wuhan hubei china earliest reported symptom reported november 2019 first case linked contact huanan seafood wholesale market sold live animal 30 january declared outbreak public health emergency international concern", "tags_descriptive": ["Exploratory Data Analysis"]}