{"title": "CIFAR 10 88% Accuracy using Keras", "description": "ContextAny one who started their Deep learning Journey will mostly start with MNIST or CIFAR 10 as their initial problem set. MNSIT might be very easy for most of the beginers since it is a very small dataset and easy to get good accuracy, with bit of optimizations you can easily acheieve top 10% result. If you find this Kernal helpful , Please Upvote the notebook. That will enchourage me a lot. Thank you :) CIFAR 10I choose CIFAR 10 dataset to experiment my deep learning theory for the below reasons  CIFAR 10 is a bit challenging since it has 60K images, which is a lot for a begginer. The images are compressed so that they can be trained with less computational power. CIFAR 10 is very popular so that if I was struck at some point I can easily get lot of help from community. I dont need to deal with the hasle of downloading and handeling the data by writing python code. The data is readily available in keras datasets so that I can focus on the deep learning algorithm rather than the data cleaning.   KerasI choose Keras as my deep learning framework since it is begginer friendly and the learning keras is very easy. Also lots and lots of online tutorials or articles are written in Keras so its easy to get out if you are struck somewhere. In this notebook you see me using tensorflow.keras instead of keras directly. Either ways its okay, feel free to use tensorflow.keras or keras directly.", "link": "https://www.kaggle.com/kedarsai/cifar-10-88-accuracy-using-keras", "tags": ["DL", "Classification", "Keras", "CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-12-07 04:30:40", "date_scraped": "2020-12-12 17:54:35", "words": 258, "sentences": 13, "sum_nltk": "ContextAny one who started their Deep learning Journey will mostly start with MNIST or CIFAR 10 as their initial problem set.\nMNSIT might be very easy for most of the beginers since it is a very small dataset and easy to get good accuracy, with bit of optimizations you can easily acheieve top 10% result.\nThank you :) CIFAR 10I choose CIFAR 10 dataset to experiment my deep learning theory for the below reasons  CIFAR 10 is a bit challenging since it has 60K images, which is a lot for a begginer.\nCIFAR 10 is very popular so that if I was struck at some point I can easily get lot of help from community.\nThe data is readily available in keras datasets so that I can focus on the deep learning algorithm rather than the data cleaning.\nKerasI choose Keras as my deep learning framework since it is begginer friendly and the learning keras is very easy.\nAlso lots and lots of online tutorials or articles are written in Keras so its easy to get out if you are struck somewhere.\nIn this notebook you see me using tensorflow.keras instead of keras directly.\nEither ways its okay, feel free to use tensorflow.keras or keras directly.", "sum_nltk_words": 199, "sum_nltk_runtime": 0.003, "sum_t5": "if you find this notebook helpful, please upvote the notebook. tensorflow.keras is my deep learning framework. tensorflow.keras is a free open source framework. tensorflow.keras is a free open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open source open", "sum_t5_words": 76, "sum_t5_runtime": 6.346, "runtime": 0.003, "nltk_category": "Government and Public Works", "nltk_category_score": 0.27934300899505615, "nltk_category_runtime": 18.577, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.747941255569458, "nltk_subcategory_runtime": 29.387, "category": "Government and Public Works", "category_score": 0.27934300899505615, "subcategory": "Machine Learning", "subcategory_score": 0.747941255569458, "runtime_cat": 47.964, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.682", "language_code": "en", "language_score": "0.9999961429790443", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "contextany one started deep learning journey mostly start mnist cifar 10 initial problem set mnsit might easy beginers since small dataset easy get good accuracy bit optimization easily acheieve top 10 result find kernal helpful please upvote notebook enchourage lot thank cifar 10i choose cifar 10 dataset experiment deep learning theory reason cifar 10 bit challenging since 60k image lot begginer image compressed trained le computational power cifar 10 popular struck point easily get lot help community dont need deal hasle downloading handeling data writing python code data readily available kera datasets focus deep learning algorithm rather data cleaning kerasi choose kera deep learning framework since begginer friendly learning kera easy also lot lot online tutorial article written kera easy get struck somewhere notebook see using tensorflowkeras instead kera directly either way okay feel free use tensorflowkeras kera directly", "tags_descriptive": ["Deep Learning (DL)", "Classification", "Keras", "Convolutional Neural Network (CNN)"]}