{"title": "notebook85513b724f", "description": "Predicting the Sale Price of Bulldozers using Machine LearningIn this notebook, we're going to go through an example machine learning project with the goal of predicting the sale price of bulldozers. Since we're trying to predict a number, this kind of problem is known as a regression problem. The data and evaluation metric we'll be using (root mean square log error or RMSLE) is from the Kaggle Bluebook for Bulldozers competition. The techniques used in here have been inspired and adapted from the fast.ai machine learning course. What we'll end up with To work through these topics, we'll use pandas, Matplotlib and NumPy for data anaylsis, as well as, Scikit-Learn for machine learning and modelling tasks. Tools which can be used for each step of the machine learning modelling process. We'll work through each step and by the end of the notebook, we'll have a trained machine learning model which predicts the sale price of a bulldozer given different characteristics about it. 1. Problem DefinitionFor this dataset, the problem we're trying to solve, or better, the question we're trying to answer is, How well can we predict the future sale price of a bulldozer, given its characteristics previous examples of how much similar bulldozers have been sold for?   2. DataLooking at the dataset from Kaggle, you can you it's a time series problem. This means there's a time attribute to dataset. In this case, it's historical sales data of bulldozers. Including things like, model type, size, sale date and more. There are 3 datasets: Train.csv - Historical bulldozer sales examples up to 2011 (close to 400,000 examples with 50+ different attributes, including SalePrice which is the target variable). Valid.csv - Historical bulldozer sales examples from January 1 2012 to April 30 2012 (close to 12,000 examples with the same attributes as Train.csv). Test.csv - Historical bulldozer sales examples from May 1 2012 to November 2012 (close to 12,000 examples but missing the SalePrice attribute, as this is what we'll be trying to predict).   3. EvaluationFor this problem, Kaggle has set the evaluation metric to being root mean squared log error (RMSLE). As with many regression evaluations, the goal will be to get this value as low as possible. To see how well our model is doing, we'll calculate the RMSLE and then compare our results to others on the Kaggle leaderboard. 4. FeaturesFeatures are different parts of the data. During this step, you'll want to start finding out what you can about the data. One of the most common ways to do this, is to create a data dictionary. For this dataset, Kaggle provide a data dictionary which contains information about what each attribute of the dataset means. You can download this file directly from the Kaggle competition page (account required) or view it on Google Sheets. With all of this being known, let's get started! First, we'll import the dataset and start exploring. Since we know the evaluation metric we're trying to minimise, our first goal will be building a baseline model and seeing how it stacks up against the competition.", "link": "https://www.kaggle.com/radhakrishnasp/bulldozer-price-prediction", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-08-15 21:38:28", "date_scraped": "2020-12-12 17:19:45", "words": 516, "sentences": 28, "sum_nltk": "The data and evaluation metric we'll be using (root mean square log error or RMSLE) is from the Kaggle Bluebook for Bulldozers competition.\nWe'll work through each step and by the end of the notebook, we'll have a trained machine learning model which predicts the sale price of a bulldozer given different characteristics about it.\n1. Problem DefinitionFor this dataset, the problem we're trying to solve, or better, the question we're trying to answer is, How well can we predict the future sale price of a bulldozer, given its characteristics previous examples of how much similar bulldozers have been sold for?\nThere are 3 datasets: Train.csv - Historical bulldozer sales examples up to 2011 (close to 400,000 examples with 50+ different attributes, including SalePrice which is the target variable).\nValid.csv - Historical bulldozer sales examples from January 1 2012 to April 30 2012 (close to 12,000 examples with the same attributes as Train.csv).\nTest.csv - Historical bulldozer sales examples from May 1 2012 to November 2012 (close to 12,000 examples but missing the SalePrice attribute, as this is what we'll be trying to predict).\n3. EvaluationFor this problem, Kaggle has set the evaluation metric to being root mean squared log error (RMSLE).", "sum_nltk_words": 196, "sum_nltk_runtime": 0.006, "sum_t5": "this notebook will go through an example machine learning project. the data and evaluation metric we'll be using is from the Kaggle Bluebook for Bulldozers competition. the techniques used in here have been inspired and adapted from the fast.ai machine learning course. the notebook will be available in october. and october.........", "sum_t5_words": 51, "sum_t5_runtime": 6.161, "runtime": 0.004, "nltk_category": "Finance", "nltk_category_score": 0.24403591454029083, "nltk_category_runtime": 18.643, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9270110726356506, "nltk_subcategory_runtime": 30.087, "category": "Finance", "category_score": 0.24403591454029083, "subcategory": "Machine Learning", "subcategory_score": 0.9270110726356506, "runtime_cat": 48.73, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.479", "language_code": "en", "language_score": "0.9999973923151246", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predicting sale price bulldozer using machine learningin notebook going go example machine learning project goal predicting sale price bulldozer since trying predict number kind problem known regression problem data evaluation metric well using root mean square log error rmsle kaggle bluebook bulldozer competition technique used inspired adapted fastai machine learning course well end work topic well use panda matplotlib numpy data anaylsis well scikitlearn machine learning modelling task tool used step machine learning modelling process well work step end notebook well trained machine learning model predicts sale price bulldozer given different characteristic 1 problem definitionfor dataset problem trying solve better question trying answer well predict future sale price bulldozer given characteristic previous example much similar bulldozer sold 2 datalooking dataset kaggle time series problem mean there time attribute dataset case historical sale data bulldozer including thing like model type size sale date 3 datasets traincsv historical bulldozer sale example 2011 close 400000 example 50 different attribute including saleprice target variable validcsv historical bulldozer sale example january 1 2012 april 30 2012 close 12000 example attribute traincsv testcsv historical bulldozer sale example may 1 2012 november 2012 close 12000 example missing saleprice attribute well trying predict 3 evaluationfor problem kaggle set evaluation metric root mean squared log error rmsle many regression evaluation goal get value low possible see well model well calculate rmsle compare result others kaggle leaderboard 4 featuresfeatures different part data step youll want start finding data one common way create data dictionary dataset kaggle provide data dictionary contains information attribute dataset mean download file directly kaggle competition page account required view google sheet known let get started first well import dataset start exploring since know evaluation metric trying minimise first goal building baseline model seeing stack competition", "tags_descriptive": []}