{"title": "Part 2 - Extracting Audio Features", "description": "Part 2 - Extracting Audio FeaturesEu Jin Lok Kernel post for Speech Accent Archive on Kaggle 20 January 2019 IntroductionTo understand the various features we can extract from audio, and use it to predict gender and accentsIn part 2 of this series, I'll introduce the various types of features from audio and we can see how these features differ when we compare between genders and accent types. I'm hoping one of these features will be distinctive enough that we could use it for predictive modelling in the next part. I would also like to acknowledge 2 people whom I've learnt alot from:  Jayesh Saita, whose blog I really liked and helped me understand audio features and MFCCs in the early stages of my journey    Zafarullah Mahmood, whose Kaggle Kernel basically became the canvas for all audio work that I do at work and outside work. Please do check out his kernels whom I've drawn lots of inspiration from!   This part 2 kernel will cover quite a few items so I'll provide a brief agenda:  Core concepts in Audio Time domain features  1. Audio wave   Frequency domain features 2. MFCC 3. Log Mel-spectogram 4. Harmonic-percussive source separation (HPSS) 5. Chroma   Final thoughts  Again, thanks to the awesome Kaggle community, and the broader data science community. Without further ado, lets begin!", "link": "https://www.kaggle.com/ejlok1/part-2-extracting-audio-features", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-08-24 08:53:07", "date_scraped": "2020-12-12 20:04:19", "words": 232, "sentences": 10, "sum_nltk": "Part 2 - Extracting Audio FeaturesEu Jin Lok Kernel post for Speech Accent Archive on Kaggle 20 January 2019 IntroductionTo understand the various features we can extract from audio, and use it to predict gender and accentsIn part 2 of this series, I'll introduce the various types of features from audio and we can see how these features differ when we compare between genders and accent types.\nI'm hoping one of these features will be distinctive enough that we could use it for predictive modelling in the next part.\nI would also like to acknowledge 2 people whom I've learnt alot from:  Jayesh Saita, whose blog I really liked and helped me understand audio features and MFCCs in the early stages of my journey    Zafarullah Mahmood, whose Kaggle Kernel basically became the canvas for all audio work that I do at work and outside work.\nPlease do check out his kernels whom I've drawn lots of inspiration from!\nThis part 2 kernel will cover quite a few items so I'll provide a brief agenda:  Core concepts in Audio Time domain features  1.\nAudio wave   Frequency domain features 2.\nMFCC 3.\nChroma   Final thoughts  Again, thanks to the awesome Kaggle community, and the broader data science community.", "sum_nltk_words": 210, "sum_nltk_runtime": 0.003, "sum_t5": "a kernel is a tool that extracts audio features to predict gender and accents. it's a great way to learn about the different features we can extract from audio. it's also a great way to learn about the different types of features we can extract from audio. it's also a great way to learn about the different types of features we can extract from audio. it's also a great way to learn about the different types of features we can extract from audio.", "sum_t5_words": 83, "sum_t5_runtime": 4.981, "runtime": 0.0, "nltk_category": "Education & Research", "nltk_category_score": 0.3426516354084015, "nltk_category_runtime": 18.342, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.495466023683548, "nltk_subcategory_runtime": 29.659, "category": "Education & Research", "category_score": 0.3426516354084015, "subcategory": "Student", "subcategory_score": 0.495466023683548, "runtime_cat": 48.001, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.711", "language_code": "en", "language_score": "0.9999959816160137", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "part 2 extracting audio featureseu jin lok kernel post speech accent archive kaggle 20 january 2019 introductionto understand various feature extract audio use predict gender accentsin part 2 series ill introduce various type feature audio see feature differ compare gender accent type im hoping one feature distinctive enough could use predictive modelling next part would also like acknowledge 2 people ive learnt alot jayesh saita whose blog really liked helped understand audio feature mfccs early stage journey zafarullah mahmood whose kaggle kernel basically became canvas audio work work outside work please check kernel ive drawn lot inspiration part 2 kernel cover quite item ill provide brief agenda core concept audio time domain feature 1 audio wave frequency domain feature 2 mfcc 3 log melspectogram 4 harmonicpercussive source separation hp 5 chroma final thought thanks awesome kaggle community broader data science community without ado let begin", "tags_descriptive": []}