{"title": "InceptionResNetV2 for Cloud Classifier", "description": "this kernel was forked from here : https://www.kaggle.com/samusram/cloud-classifier-for-post-processing?scriptVersionId=20265194 highest  accuracy of that kernel was 0.629 which is same as this one : https://www.kaggle.com/artgor/segmentation-in-pytorch-using-convenient-tools?scriptVersionId=20202006 of Andrew Lukyanenko (  @artgor)  thanks a lot to them for their public kernels,i recommend everyone playing with those kernels because those kernels has got solid baseline. my special thanks goes to Andrew Lukyanenko (  @artgor) ,i learnt plenty from his works Here in this kernel i got 0.63 after trying InceptionResNetV2 so i decided to share it with you guys,please leave your precious comment below,this is just a starting,i will write my own notebook when time permits but i would like to spend more time on @artgor's kernel to observe if i can improve his work little bit,i recommend you the same. whats new here?  InceptionResNetV2 instead of densenet121 image height and width 229x229 instead of 224 version 1 has got 0.63 public lb accuracy ,so please upvote this notebok and obviously main author's notebook if you find these helpful in version 3 i will try to leave everything as it was before but 5 epochs for initial tuning and 10 epochs for fine tuning", "link": "https://www.kaggle.com/mobassir/inceptionresnetv2-for-cloud-classifier", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "albumentations", "tensorflow", "sklearn", "pattern", "pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-11-18 15:03:15", "date_scraped": "2020-12-13 18:07:53", "words": 194, "sentences": 3, "runtime": 0.002, "description_category": "Finance", "description_category_score": 0.14601723849773407, "description_category_runtime": 21.54, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.7387582659721375, "description_subcategory_runtime": 34.619, "category": "Finance", "category_score": 0.14601723849773407, "subcategory": "Machine Learning", "subcategory_score": 0.7387582659721375, "runtime_cat": 56.159, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.733", "language_code": "en", "language_score": "0.9999967177197733", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "kernel forked httpswwwkagglecomsamusramcloudclassifierforpostprocessingscriptversionid20265194 highest accuracy kernel 0629 one httpswwwkagglecomartgorsegmentationinpytorchusingconvenienttoolsscriptversionid20202006 andrew lukyanenko artgor thanks lot public kernelsi recommend everyone playing kernel kernel got solid baseline special thanks go andrew lukyanenko artgor learnt plenty work kernel got 063 trying inceptionresnetv2 decided share guysplease leave precious comment belowthis startingi write notebook time permit would like spend time artgors kernel observe improve work little biti recommend whats new inceptionresnetv2 instead densenet121 image height width 229x229 instead 224 version 1 got 063 public lb accuracy please upvote notebok obviously main author notebook find helpful version 3 try leave everything 5 epoch initial tuning 10 epoch fine tuning", "tags_descriptive": []}