{"title": "Cats II with Rapids Ridge Regression", "description": "Rapids is an open-source GPU accelerated Data Sceince and Machien Learnign library, developed adn mainatained by Nvidia. It is designed to be compatible with many existing CPU tools, such as Pandas, scikit-learn, numpy, etc. It enables massive acceleration of many data-science and machine learning tasks, oftentimes by a factor fo 100X, or even more. Rapids is still undergoing developemnt, and as of right now it's not availabel in the Kaggle Docker environment. If you are interested in installing and riunning Rapids locally on your own machine, then you shoudl refer to the followong instructions. The first successful install of a Rapids library on kaggle was done by Chris Deotte in the follwiong Digit Recognizer kernel. An improved install version that uses a Kaggle Dataset for install can be found here.  In this kerenl we'll follow that approach.", "link": "https://www.kaggle.com/tunguz/cats-ii-with-rapids-ridge-regression", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "xgboost", "tensorflow", "Pillow", "lightgbm", "sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-01-29 16:21:49", "date_scraped": "2020-12-12 17:42:12", "words": 138, "sentences": 8, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.2888375520706177, "description_category_runtime": 13.888, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8834525346755981, "description_subcategory_runtime": 22.119, "category": "Education & Research", "category_score": 0.2888375520706177, "subcategory": "Machine Learning", "subcategory_score": 0.8834525346755981, "runtime_cat": 36.007, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.69", "language_code": "en", "language_score": "0.9999970762505852", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "rapid opensource gpu accelerated data sceince machien learnign library developed adn mainatained nvidia designed compatible many existing cpu tool panda scikitlearn numpy etc enables massive acceleration many datascience machine learning task oftentimes factor fo 100x even rapid still undergoing developemnt right availabel kaggle docker environment interested installing riunning rapid locally machine shoudl refer followong instruction first successful install rapid library kaggle done chris deotte follwiong digit recognizer kernel improved install version us kaggle dataset install found kerenl well follow approach", "tags_descriptive": []}