{"title": "Feature Extractor Matlab2python translated", "description": "This is the direct translation of the Matlab getting started code shared by the organizers.  This feature extractor was used as part of a winning solution in a past competition. EDIT: I have fixed the mistakes in the original Matlab code in this new version. NOTE: I just tried to translate it from the Matlab version as close as possible.              Use at your own risk. Correctness is not guaranteed and there might be bugs in              this translation and/or the original Matalb version. So, debug very well before              incorporating it to your pipeline. DISCLAIMER: I still haven't tried it with my training pipeline so I am not sure for correctness yet. GIVE BACK: Please, consider to fork and contribute back your feature additions and/or corrections.", "link": "https://www.kaggle.com/deepcnn/feature-extractor-matlab2python-translated", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2016-10-02 00:26:43", "date_scraped": "2020-12-13 13:55:25", "words": 164, "sentences": 9, "runtime": 0.003, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.17913319170475006, "description_category_runtime": 13.429, "description_subcategory": "Quality", "description_subcategory_score": 0.5519989132881165, "description_subcategory_runtime": 21.505, "category": "Biotechnological & Life Sciences", "category_score": 0.17913319170475006, "subcategory": "Quality", "subcategory_score": 0.5519989132881165, "runtime_cat": 34.934, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.751", "language_code": "en", "language_score": "0.9999974067643648", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "direct translation matlab getting started code shared organizer feature extractor used part winning solution past competition edit fixed mistake original matlab code new version note tried translate matlab version close possible use risk correctness guaranteed might bug translation andor original matalb version debug well incorporating pipeline disclaimer still havent tried training pipeline sure correctness yet give back please consider fork contribute back feature addition andor correction", "tags_descriptive": []}