{"title": "NFL Punt Data - Interactive Plots using Bokeh", "description": "Interactive Plot of Plays with CodeNOTE: INTERACTIVITY REQUIRES FORKING THE NOTEBOOK AND RUNNING IN EDIT MODE - IT WILL NOT WORK IN KAGGLE'S RENDERED NOTEBOOK In this notebook I'm sharing some code I put together to allow you to interactively scroll through an individual play and see the position of the players on the field as scroll. It's still a work in progress but has been helpful in my analysis. Please let me if you have any suggestions. There are a lot of things I still plan to add (players' speed, any event notes, etc). Example of how it works (it's a little laggy):  Please upvote if you find this helpful. Please reference this notebook if you use the code elseware.", "link": "https://www.kaggle.com/robikscube/nfl-punt-data-interactive-plots-using-bokeh", "tags": ["Exploratory Data Analysis", "Sports"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-12-27 05:15:27", "date_scraped": "2020-12-13 14:25:09", "words": 122, "sentences": 6, "runtime": 0.002, "description_category": "Agriculture", "description_category_score": 0.14250993728637695, "description_category_runtime": 11.765, "description_subcategory": "Quality", "description_subcategory_score": 0.316869854927063, "description_subcategory_runtime": 18.17, "category": "Agriculture", "category_score": 0.14250993728637695, "subcategory": "Quality", "subcategory_score": 0.316869854927063, "runtime_cat": 29.935, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.708", "language_code": "en", "language_score": "0.9999965258609973", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "interactive plot play codenote interactivity requires forking notebook running edit mode work kaggles rendered notebook notebook im sharing code put together allow interactively scroll individual play see position player field scroll still work progress helpful analysis please let suggestion lot thing still plan add player speed event note etc example work little laggy please upvote find helpful please reference notebook use code elseware", "tags_descriptive": ["Exploratory Data Analysis", "Sports"]}