{"title": "️ Big Data Bowl - Comprehensive EDA with Pandas", "description": "2020 NFL Big Data Bowl In this notebook I will attempt to provide a basic overview of the data given in the NFL Big Data Bowl kaggle challenge. We will attempt to better understand each variable provided to us in the train.csv data file. From the competition overview: In this competition, you will develop a model to predict how many yards a team will gain on given rushing plays as they happen. You'll be provided game, play, and player-level data, including the position and speed of players as provided in the NFL’s Next Gen Stats data. And the best part - you can see how your model performs from your living room, as the leaderboard will be updated week after week on the current season’s game data as it plays out.", "link": "https://www.kaggle.com/robikscube/big-data-bowl-comprehensive-eda-with-pandas", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-10-22 19:57:07", "date_scraped": "2020-12-13 14:21:44", "words": 131, "sentences": 5, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.15879224240779877, "description_category_runtime": 11.342, "description_subcategory": "Tools", "description_subcategory_score": 0.42792829871177673, "description_subcategory_runtime": 17.164, "category": "Utilities", "category_score": 0.15879224240779877, "subcategory": "Tools", "subcategory_score": 0.42792829871177673, "runtime_cat": 28.507, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.723", "language_code": "en", "language_score": "0.9999937957556126", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "2020 nfl big data bowl notebook attempt provide basic overview data given nfl big data bowl kaggle challenge attempt better understand variable provided u traincsv data file competition overview competition develop model predict many yard team gain given rushing play happen youll provided game play playerlevel data including position speed player provided nfls next gen stats data best part see model performs living room leaderboard updated week week current season game data play", "tags_descriptive": []}