{"title": "Herbarium via ResNet50 and 3-step classification", "description": "Herbarium via ResNet50 and 3-step classificationOur data consists out of input images of Herbariums, each of which belongs to one of 309 families, one of 3,677 geni and one of 32,093 categories. Thus it is a good idea to first guess an images family, then its genus and finally infer from this its category. In this notebook, we  crop the input images, because Herbariums seem to show pathologic margins that do not contain useful information, use ResNet50 in order to 'preprocess' our input images, use a Dense Neural Network after that to first make a guess for the family of the input, then make a guess for the genus of the input via another Dense layer whose inputs are the guessed family and the ResNet50 output, finally guess the category of the input via another Dense layer, whose inputs are the guessed family and genus as well as the output of ResNet50, activate training for genus and category, only after the network is trained well on for the family, then genus, and only in the end start to train inference of category.", "link": "https://www.kaggle.com/jullang/herbarium-via-resnet50-and-3-step-classification", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-17 00:12:36", "date_scraped": "2020-12-12 20:41:48", "words": 183, "sentences": 3, "runtime": 0.005, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.08620887994766235, "description_category_runtime": 15.714, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9840100407600403, "description_subcategory_runtime": 25.414, "category": "Biotechnological & Life Sciences", "category_score": 0.08620887994766235, "subcategory": "Machine Learning", "subcategory_score": 0.9840100407600403, "runtime_cat": 41.128, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.655", "language_code": "en", "language_score": "0.9999964300353431", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "herbarium via resnet50 3step classificationour data consists input image herbarium belongs one 309 family one 3677 geni one 32093 category thus good idea first guess image family genus finally infer category notebook crop input image herbarium seem show pathologic margin contain useful information use resnet50 order preprocess input image use dense neural network first make guess family input make guess genus input via another dense layer whose input guessed family resnet50 output finally guess category input via another dense layer whose input guessed family genus well output resnet50 activate training genus category network trained well family genus end start train inference category", "tags_descriptive": []}