{"title": "Am I Over-fitting?", "description": "From the univariate analysis notebook, https://www.kaggle.com/sudalairajkumar/two-sigma-financial-modeling/univariate-analysis-regression-lb-0-006/notebook it seems we are getting a good score if we use the variable 'technical_20' and build a model. However if we use the top 4 variables and build a model, we are getting a negative public score though our local validation score improved to 0.0195. So how do we tackle this? Also from the kagglegym api, we get the rewards (R value) for individual timestamps and finally for the whole test data set. These individual rewards are very hard to make sense since it is highly influenced by the mean target value of the given timestamp. So I thought probably looking at the cumulative R value till the given timestamp might help a little more (as mean target values are averaged over all the points till the given timestamp) to build a more robust model and here is an attempt to understand the performance of some of the top public scripts. Kindly upvote if you find this useful and / or share your comments.", "link": "https://www.kaggle.com/sudalairajkumar/am-i-over-fitting", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-01-04 02:04:10", "date_scraped": "2020-12-13 18:01:01", "words": 170, "sentences": 6, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.5757690072059631, "description_category_runtime": 16.501, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8772979378700256, "description_subcategory_runtime": 26.449, "category": "Finance", "category_score": 0.5757690072059631, "subcategory": "Machine Learning", "subcategory_score": 0.8772979378700256, "runtime_cat": 42.95, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.762", "language_code": "en", "language_score": "0.999994721299713", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "univariate analysis notebook httpswwwkagglecomsudalairajkumartwosigmafinancialmodelingunivariateanalysisregressionlb0006notebook seems getting good score use variable technical_20 build model however use top 4 variable build model getting negative public score though local validation score improved 00195 tackle also kagglegym api get reward r value individual timestamps finally whole test data set individual reward hard make sense since highly influenced mean target value given timestamp thought probably looking cumulative r value till given timestamp might help little mean target value averaged point till given timestamp build robust model attempt understand performance top public script kindly upvote find useful share comment", "tags_descriptive": []}