{"title": "Bayesian + RaNDoM FoReSt + Lightgbm", "description": "Exploration of Forest Cover The National Forest System, the Rocky Mountain Region(Region-2) enjoys a proud heritage in the Forest Service. The Shoshone National Forest in Wyoming and the White River National Forest in Colorado are among the first National Forests Congress created from the original Forest Reserves. The Region, headquartered in Golden, Colorado, comprises 17 national forests and 7 national grasslands. The US Forest Service Rocky Mountain Region has formally identified four overarching themes as emphasis areas on which to focus strategic long-term efforts to preserve their special values: Forest and Grassland Health, Recreation, Water and Public Service. Forests and Grasslands continue to hold in trust America's resources- timber, wildlife, water, range, recreation - to ensure their availability today and tomorrow.", "link": "https://www.kaggle.com/ashishpatel26/bayesian-random-forest-lightgbm", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-08-10 15:34:10", "date_scraped": "2020-12-12 19:58:02", "words": 121, "sentences": 5, "runtime": 0.005, "description_category": "Government and Public Works", "description_category_score": 0.3681180775165558, "description_category_runtime": 11.228, "description_subcategory": "General", "description_subcategory_score": 0.332944393157959, "description_subcategory_runtime": 17.275, "category": "Government and Public Works", "category_score": 0.3681180775165558, "subcategory": "General", "subcategory_score": 0.332944393157959, "runtime_cat": 28.504, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.652", "language_code": "en", "language_score": "0.9999971925228899", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "exploration forest cover national forest system rocky mountain regionregion2 enjoys proud heritage forest service shoshone national forest wyoming white river national forest colorado among first national forest congress created original forest reserve region headquartered golden colorado comprises 17 national forest 7 national grassland u forest service rocky mountain region formally identified four overarching theme emphasis area focus strategic longterm effort preserve special value forest grassland health recreation water public service forest grassland continue hold trust america resource timber wildlife water range recreation ensure availability today tomorrow", "tags_descriptive": ["Exploratory Data Analysis"]}