{"title": "Mask-RCNN Sample Starter Code ", "description": "Mask-RCNN Sample Starter Model for the RSNA Pneumonia Detection Challenge MD.ai. The dataset for this challenge, created on the MD.ai platform in collaboration with the Radiological Society of North America (RSNA), the Society of Thoracic Radiology (STR), the US National Institutes of Health (NIH), and Kaggle. This notebook covers the basics of parsing the competition dataset, training using a detector basd on the Mask-RCNN algorithm for object detection and instance segmentation. Note that the Mask-RCNN detector configuration parameters have been selected to reduce training time for demonstration purposes, they are not optimal. This is based on our deep learning for medical imaging lessons:  Lesson 1. Classification of chest vs. adominal X-rays using TensorFlow/Keras Github Annotator Lesson 2. Lung X-Rays Semantic Segmentation using UNets. Github Annotator  Lesson 3. RSNA Pneumonia detection using Kaggle data format Github Annotator  Lesson 3. RSNA Pneumonia detection using MD.ai python client library Github Annotator   Copyright 2018 MD.ai, Inc. Licensed under the Apache License, Version 2.0", "link": "https://www.kaggle.com/drt2290078/mask-rcnn-sample-starter-code", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-09-03 14:52:39", "date_scraped": "2020-12-13 16:48:20", "words": 164, "sentences": 12, "runtime": 0.0, "description_category": "Healthcare", "description_category_score": 0.5518737435340881, "description_category_runtime": 17.758, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9471361637115479, "description_subcategory_runtime": 27.814, "category": "Healthcare", "category_score": 0.5518737435340881, "subcategory": "Machine Learning", "subcategory_score": 0.9471361637115479, "runtime_cat": 45.572, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.788", "language_code": "en", "language_score": "0.9999974215847569", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "maskrcnn sample starter model rsna pneumonia detection challenge mdai dataset challenge created mdai platform collaboration radiological society north america rsna society thoracic radiology str u national institute health nih kaggle notebook cover basic parsing competition dataset training using detector basd maskrcnn algorithm object detection instance segmentation note maskrcnn detector configuration parameter selected reduce training time demonstration purpose optimal based deep learning medical imaging lesson lesson 1 classification chest v adominal xrays using tensorflowkeras github annotator lesson 2 lung xrays semantic segmentation using unets github annotator lesson 3 rsna pneumonia detection using kaggle data format github annotator lesson 3 rsna pneumonia detection using mdai python client library github annotator copyright 2018 mdai inc licensed apache license version 20", "tags_descriptive": []}