{"title": "COVID-19 A few charts and a simple baseline", "description": "COVID-19 W2: A few charts and a simple baselineSummaryDisclaimer We still have limited data to predict or understand what will happen in the next few weeks (months). At this point I see more value in collecting data and monitoring the outbreak than trying to predict the future. Please don't kill yourself because I published a notebook Challenges The outbreak patterns vary a lot among countries Most countries have only 2 weeks data Only a handful countries managed to succesfuly slow down the outbreak Almost every country had several serious regulations in recent weeks Increasing testing capacity could have serious impact on confirmed cases  Assumptions As we are still in the early period, we will see exponential growth in the next few weeks Thanks to the panic/awareness/regulations/social distancing the exponential increase will slow down  As the process is not stationary at all I decided to use a simple heuristic approach. Maybe I will import sklearn next week. TIL Namibia's country code is NA. Now I remember I heard it in joke before, but I had to investigate a bug learn it again :) I haven't used plotly recently, I quite enjoyed the \"new\" Plotly Express interface", "link": "https://www.kaggle.com/gaborfodor/covid-19-a-few-charts-and-a-simple-baseline", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-01 22:40:13", "date_scraped": "2020-12-12 18:13:38", "words": 197, "sentences": 6, "runtime": 0.005, "description_category": "Healthcare", "description_category_score": 0.39912334084510803, "description_category_runtime": 16.333, "description_subcategory": "General", "description_subcategory_score": 0.41494283080101013, "description_subcategory_runtime": 25.776, "category": "Healthcare", "category_score": 0.39912334084510803, "subcategory": "General", "subcategory_score": 0.41494283080101013, "runtime_cat": 42.11, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.696", "language_code": "en", "language_score": "0.9999975208423272", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "covid19 w2 chart simple baselinesummarydisclaimer still limited data predict understand happen next week month point see value collecting data monitoring outbreak trying predict future please dont kill published notebook challenge outbreak pattern vary lot among country country 2 week data handful country managed succesfuly slow outbreak almost every country several serious regulation recent week increasing testing capacity could serious impact confirmed case assumption still early period see exponential growth next week thanks panicawarenessregulationssocial distancing exponential increase slow process stationary decided use simple heuristic approach maybe import sklearn next week til namibia country code na remember heard joke investigate bug learn havent used plotly recently quite enjoyed new plotly express interface", "tags_descriptive": []}