{"title": " (How to get 81%) GRU-ATT + LGBM + TF-IDF + EDA", "description": "Hi, Welcome to my kernel. We will show you how we achieve 80+% in this challenge.If you find this helpful, please support us!!!We will focus on the rate of REJECTED according to different factors. This may help you to design your model on features that truly matter. DonorsChoose is an US organisation that provide funding to school teachers who wish to improve their education environment. They received approximately thounsands of project proposals every year and the challange they are facing is dealing with enormous of proposal with limited volunteers. We're writing this kernel to help the organizer and participants to filter out insignificant features when designing pre-screening algorithm.Let's see what we going to analyze in this kernel: Introduction of datasetImporting the libraries Data preparation     AnalysisWhich state has the highest rate of rejected? What is the relationship between funding amount and rate of rejected?   Will grade categories affect the rate of rejected?  Which combination of category and sub-category has highest rate of rejected?  What is the relationship between essay sentiment and rate of rejected?    Suggestion LGBM + TFIDF GRU-ATT Results", "link": "https://www.kaggle.com/hoonkeng/how-to-get-81-gru-att-lgbm-tf-idf-eda", "tags": ["Exploratory Data Analysis", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "nltk", "theano", "lightgbm", "sklearn", "textblob"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-03-12 03:51:06", "date_scraped": "2020-12-12 19:01:17", "words": 190, "sentences": 6, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.5250660181045532, "description_category_runtime": 16.381, "description_subcategory": "School", "description_subcategory_score": 0.7599503397941589, "description_subcategory_runtime": 25.891, "category": "Education & Research", "category_score": 0.5250660181045532, "subcategory": "School", "subcategory_score": 0.7599503397941589, "runtime_cat": 42.272, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.717", "language_code": "en", "language_score": "0.9999950985227875", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "hi welcome kernel show achieve 80 challengeif find helpful please support uswe focus rate rejected according different factor may help design model feature truly matter donorschoose u organisation provide funding school teacher wish improve education environment received approximately thounsands project proposal every year challange facing dealing enormous proposal limited volunteer writing kernel help organizer participant filter insignificant feature designing prescreening algorithmlets see going analyze kernel introduction datasetimporting library data preparation analysiswhich state highest rate rejected relationship funding amount rate rejected grade category affect rate rejected combination category subcategory highest rate rejected relationship essay sentiment rate rejected suggestion lgbm tfidf gruatt result", "tags_descriptive": ["Exploratory Data Analysis", "Feature Engineering"]}