{"title": "Cervix EDA & Model selection", "description": "Cervix EDAIn this competition we have a multi-class classification problem with three classes. We are asked, given an image, to identify the cervix type. From the data description: In this competition, you will develop algorithms to correctly classify cervix types based on cervical images. These different types of cervix in our data set are all considered normal (not cancerous), but since the transformation zones aren't always visible, some of the patients require further testing while some don't. This decision is very important for the healthcare provider and critical for the patient. Identifying the transformation zones is not an easy task for the healthcare providers, therefore, an algorithm-aided decision will significantly improve the quality and efficiency of cervical cancer screening for these patients. The submission format is asking for a probability for each of the three different cervix types. In this notebook we will be looking at:  basic dataset stats like number of samples per class, image sizes different embeddings of RGB image space pairwise distances and a clustermap of images in RGB space (linear) model selection with basic multi class evaluation metrics.  If you like this kernel, please give an upvote, thanks! :)", "link": "https://www.kaggle.com/philschmidt/cervix-eda-model-selection", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "skimage", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-04-12 23:00:51", "date_scraped": "2020-12-13 11:58:48", "words": 195, "sentences": 9, "runtime": 0.0, "description_category": "Healthcare", "description_category_score": 0.31983792781829834, "description_category_runtime": 16.689, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.5764016509056091, "description_subcategory_runtime": 26.582, "category": "Healthcare", "category_score": 0.31983792781829834, "subcategory": "Machine Learning", "subcategory_score": 0.5764016509056091, "runtime_cat": 43.27, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.783", "language_code": "en", "language_score": "0.9999968275510019", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "cervix edain competition multiclass classification problem three class asked given image identify cervix type data description competition develop algorithm correctly classify cervix type based cervical image different type cervix data set considered normal cancerous since transformation zone arent always visible patient require testing dont decision important healthcare provider critical patient identifying transformation zone easy task healthcare provider therefore algorithmaided decision significantly improve quality efficiency cervical cancer screening patient submission format asking probability three different cervix type notebook looking basic dataset stats like number sample per class image size different embeddings rgb image space pairwise distance clustermap image rgb space linear model selection basic multi class evaluation metric like kernel please give upvote thanks", "tags_descriptive": []}