{"title": "kmeans_applications", "description": "Introduction The task is to predict whether a passenger in an airport could be a Threat because he could have any kind of dangerous object ( gun, knifes ...). This objects could be detected by a millimetre wave scanner called the High Definition-Advanced Imaging Technology (HD-AIT) system. The scanner generates a complete set of body scanner images and we want to find any kind of anomalies in the image it could think us that the passenger could have an object and it could be a threat for the rest of passengers. We are going to apply clustering techniques for detection of anomalies in the image, and previously we are going to generate a complete training dataset with image that we are viewed before checking that the passenger don't have any kind of internal object.", "link": "https://www.kaggle.com/ramirobmar/kmeans-applications", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-12-15 14:56:55", "date_scraped": "2020-12-13 15:06:52", "words": 134, "sentences": 4, "runtime": 0.002, "description_category": "Justice, Law and Regulations", "description_category_score": 0.0907483920454979, "description_category_runtime": 11.162, "description_subcategory": "Transportation", "description_subcategory_score": 0.8279215693473816, "description_subcategory_runtime": 17.092, "category": "Justice, Law and Regulations", "category_score": 0.0907483920454979, "subcategory": "Transportation", "subcategory_score": 0.8279215693473816, "runtime_cat": 28.254, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.655", "language_code": "en", "language_score": "0.9999977041576124", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introduction task predict whether passenger airport could threat could kind dangerous object gun knife object could detected millimetre wave scanner called high definitionadvanced imaging technology hdait system scanner generates complete set body scanner image want find kind anomaly image could think u passenger could object could threat rest passenger going apply clustering technique detection anomaly image previously going generate complete training dataset image viewed checking passenger dont kind internal object", "tags_descriptive": []}