{"title": "Siamese (pretrained) 0.822", "description": "Updated TL;DRI am just using the pretrained weights from  @martinpiotte. Thanks to @suicaokhoailang for creating the updated kernel. I think the important steps to improve to 0.9 are:  Get rid of lapjv dependency. It really slows down training/trying different ideas. Load images as RGB (and retrain). I can't find where, but the current first place wrote that it helps by ~0.1.  Interesting: The mpiotte-bootstrap-model only scored 0.697. Though, it was better on the playgroud competition.  TL;DRI tried to refactor @martinpiotte's original kernel here. I changed almost nothing beside commenting out the latter 380 epochs since it can't fit into a kernel. I also generated the new bounding boxes in my kernel here and saved it as a .csv instead of pickle for readability. A few things to point out:  Training more will probably improve your score, maybe as many as 500 epochs. We only train for 20 epochs in this kernel.  You may try to improve your training time by applying this technique (thanks Brian): https://www.kaggle.com/c/humpback-whale-identification/discussion/74402#444476 .  Consider using a pretrained model(s), good for blending.", "link": "https://www.kaggle.com/seesee/siamese-pretrained-0-822", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-12-29 15:17:14", "date_scraped": "2020-12-12 21:28:20", "words": 182, "sentences": 15, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.3462674021720886, "description_category_runtime": 20.126, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9395114183425903, "description_subcategory_runtime": 32.278, "category": "Finance", "category_score": 0.3462674021720886, "subcategory": "Machine Learning", "subcategory_score": 0.9395114183425903, "runtime_cat": 52.405, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.794", "language_code": "en", "language_score": "0.999996682487838", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "updated tldri using pretrained weight martinpiotte thanks suicaokhoailang creating updated kernel think important step improve 09 get rid lapjv dependency really slows trainingtrying different idea load image rgb retrain cant find current first place wrote help 01 interesting mpiottebootstrapmodel scored 0697 though better playgroud competition tldri tried refactor martinpiottes original kernel changed almost nothing beside commenting latter 380 epoch since cant fit kernel also generated new bounding box kernel saved csv instead pickle readability thing point training probably improve score maybe many 500 epoch train 20 epoch kernel may try improve training time applying technique thanks brian httpswwwkagglecomchumpbackwhaleidentificationdiscussion74402444476 consider using pretrained model good blending", "tags_descriptive": []}