{"title": "PetFinder Simple LGBM Baseline", "description": "Links to orginal kernel https://www.kaggle.com/tunguz/annoying-ab-shreck-and-bluetooth https://www.kaggle.com/domcastro/let-s-annoy-abhishek https://www.kaggle.com/abhishek/maybe-something-interesting-here EAS - All I have done is change the parameters for the LGB. I am also abandoning the OptimizedRounder and have hand-tuned the coefficients to match the distribution of the test predictions to the distribution of the train targets. McCartney Taylor provided the tweaks to the learning rate and lambda.  Change Log   v19 - added regularization lambda (0.2) v21 - lowered lambda (0.05) v22 - lowered lambda again (0.02) v23 - lambda up to (0.075) v24 - lambda back to 0.05, commenting out tfidf code that causes error v25 - uncommenting commented out code v26 - fixed bug that was throwing error for tf-idf code v27 - examining code that had been throwing error, fixing the error lowers the score v28 - passing list of categorical features v29 - tuning params v30 - using more tfidf features v31, 32 - playing with tfidf params v35 - back to 120 tfidf svd features v36 - reverting to baseline and not using OptimizedRounder, hand-tuning coefs instead v38 - Changing lambda and learning rate.", "link": "https://www.kaggle.com/skooch/petfinder-simple-lgbm-baseline", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-02-07 09:20:17", "date_scraped": "2020-12-13 15:07:40", "words": 181, "sentences": 4, "runtime": 0.003, "description_category": "Manufacturing", "description_category_score": 0.14689941704273224, "description_category_runtime": 22.487, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.6637207865715027, "description_subcategory_runtime": 36.503, "category": "Manufacturing", "category_score": 0.14689941704273224, "subcategory": "Machine Learning", "subcategory_score": 0.6637207865715027, "runtime_cat": 58.99, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.741", "language_code": "en", "language_score": "0.9999943690682789", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "link orginal kernel httpswwwkagglecomtunguzannoyingabshreckandbluetooth httpswwwkagglecomdomcastroletsannoyabhishek httpswwwkagglecomabhishekmaybesomethinginterestinghere ea done change parameter lgb also abandoning optimizedrounder handtuned coefficient match distribution test prediction distribution train target mccartney taylor provided tweak learning rate lambda change log v19 added regularization lambda 02 v21 lowered lambda 005 v22 lowered lambda 002 v23 lambda 0075 v24 lambda back 005 commenting tfidf code cause error v25 uncommenting commented code v26 fixed bug throwing error tfidf code v27 examining code throwing error fixing error lower score v28 passing list categorical feature v29 tuning params v30 using tfidf feature v31 32 playing tfidf params v35 back 120 tfidf svd feature v36 reverting baseline using optimizedrounder handtuning coefs instead v38 changing lambda learning rate", "tags_descriptive": []}