{"title": "iNaturalist 2019 EDA + DL", "description": "iNaturalist 2019 EDA + DLAs part of the FGVC6 workshop at CVPR 2019, Kaggle is conducting the iNat Challenge 2019, the large scale species classification competition, sponsored by Microsoft. It is estimated that the natural world contains several million species of plants and animals. Without expert knowledge, many of these species are extremely difficult to accurately classify due to their visual similarity. The goal of this competition is to push the state of the art in automatic image classification for real world data that features a large number of fine-grained categories. This Kernel will use the idea of \"Transfer Learning\", various pre-trained model will be used be used for the problem of multiclassification. Kudos and main ideas / reference:  hsinwenchang/keras-data-augmentation-visualize ateplyuk/inat2019-starter-keras-efficientnet", "link": "https://www.kaggle.com/praxitelisk/inaturalist-2019-eda-dl", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-06 00:02:45", "date_scraped": "2020-12-13 11:42:48", "words": 122, "sentences": 6, "runtime": 0.001, "description_category": "Education & Research", "description_category_score": 0.16810214519500732, "description_category_runtime": 12.903, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.6265503764152527, "description_subcategory_runtime": 19.963, "category": "Education & Research", "category_score": 0.16810214519500732, "subcategory": "Machine Learning", "subcategory_score": 0.6265503764152527, "runtime_cat": 32.866, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.599", "language_code": "en", "language_score": "0.9999978834139771", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "inaturalist 2019 eda dlas part fgvc6 workshop cvpr 2019 kaggle conducting inat challenge 2019 large scale specie classification competition sponsored microsoft estimated natural world contains several million specie plant animal without expert knowledge many specie extremely difficult accurately classify due visual similarity goal competition push state art automatic image classification real world data feature large number finegrained category kernel use idea transfer learning various pretrained model used used problem multiclassification kudos main idea reference hsinwenchangkerasdataaugmentationvisualize ateplyukinat2019starterkerasefficientnet", "tags_descriptive": []}