{"title": "trends_EDA", "description": "First Look at the DataHi there,  I am currently finishing my PhD in cognitive neuroscience, so this is a nice distraction next to the writing process, so a little bit of domain knowledge might be here :) On the other hand, age prediction, resting state analysis, and structural imaging are not my area of expertise - so I don't know much about the different ICA algorithms used here. I will try to provide you with some high-level overview over the different kinds of data. And will update this notebook, when I have the time and get around to read up on some of the literature. We got many different files here, which are of course described on the Web-Page but let's see what we can learn by looking at it.  Also if you don't know too much nilearn yet, it's a great toolset and maybe you find some useful functions here! (final version so far, still missing links to more and better information - which I still might add later) Also please forgive me some weird sentences and typos :)", "link": "https://www.kaggle.com/srsteinkamp/trends-eda", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-04 08:57:01", "date_scraped": "2020-12-13 17:52:38", "words": 182, "sentences": 5, "runtime": 0.0, "description_category": "Real Estate, Rental & Leasing", "description_category_score": 0.18636618554592133, "description_category_runtime": 14.749, "description_subcategory": "Student", "description_subcategory_score": 0.3036175072193146, "description_subcategory_runtime": 23.502, "category": "Real Estate, Rental & Leasing", "category_score": 0.18636618554592133, "subcategory": "Student", "subcategory_score": 0.3036175072193146, "runtime_cat": 38.253, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.685", "language_code": "en", "language_score": "0.9999995535584998", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "first look datahi currently finishing phd cognitive neuroscience nice distraction next writing process little bit domain knowledge might hand age prediction resting state analysis structural imaging area expertise dont know much different ica algorithm used try provide highlevel overview different kind data update notebook time get around read literature got many different file course described webpage let see learn looking also dont know much nilearn yet great toolset maybe find useful function final version far still missing link better information still might add later also please forgive weird sentence typo", "tags_descriptive": ["Exploratory Data Analysis"]}