{"title": "#1 Smart Robots. Complete Compilation ", "description": "CareerCon 2019 - Help Navigate RobotsTop Solutions Compilation  Robots are smart… by design. To fully understand and properly navigate a task, however, they need input about their environment. In this competition, you’ll help robots recognize the floor surface they’re standing on using data collected from Inertial Measurement Units (IMU sensors).  This is just a compilation of all the best solutions I have found, different types of analysis and posts (discussions). The purpose of this is to have in a single kernel all the relevant information/solutions of this competition, so that if in the future there is a similar competition this material can be used as baseline, and maybe the authors delete the kernel or make it private, so we would lose all that amazing information. Please comment bellow if you want me to add something, or if I missed something important... and please support the original kernels and their authors.  My best/original kernel in this competition is #1 Smart Robots. Most Complete Notebook  References #16 Solution by @ilhamfp31 Submission (Fourier, Neighbour Detection, SVM) by Thomas Rohwer Starter Code for 3rd place Solution https://www.kaggle.com/ilhamfp31/16-solution-0-76 https://www.kaggle.com/whoiskk/15-solution-private-0-77", "link": "https://www.kaggle.com/jesucristo/1-smart-robots-complete-compilation", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-19 14:48:26", "date_scraped": "2020-12-12 17:33:04", "words": 188, "sentences": 9, "runtime": 0.002, "description_category": "Manufacturing", "description_category_score": 0.18225440382957458, "description_category_runtime": 19.872, "description_subcategory": "Quality", "description_subcategory_score": 0.4608246982097626, "description_subcategory_runtime": 32.06, "category": "Manufacturing", "category_score": 0.18225440382957458, "subcategory": "Quality", "subcategory_score": 0.4608246982097626, "runtime_cat": 51.932, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.69", "language_code": "en", "language_score": "0.9999940980401311", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "careercon 2019 help navigate robotstop solution compilation robot smart design fully understand properly navigate task however need input environment competition youll help robot recognize floor surface theyre standing using data collected inertial measurement unit imu sensor compilation best solution found different type analysis post discussion purpose single kernel relevant informationsolutions competition future similar competition material used baseline maybe author delete kernel make private would lose amazing information please comment bellow want add something missed something important please support original kernel author bestoriginal kernel competition 1 smart robot complete notebook reference 16 solution ilhamfp31 submission fourier neighbour detection svm thomas rohwer starter code 3rd place solution httpswwwkagglecomilhamfp3116solution076 httpswwwkagglecomwhoiskk15solutionprivate077", "tags_descriptive": []}