{"title": "Exploratory Analysis - GA Customer Revenue", "description": "Google Analytics Customer Revenue PredictionContents of this Kernel Problem Statement   Dataset Understanding   Exploration   Visitor Profile   Baseline Model    1. Problem StatementIn this competition, the aim is to analyze a Google Merchandise Store (also known as GStore, where Google swag is sold) customer dataset to predict revenue per customer. The results of predictions and analysis might lead to more actionable operational changes and a better use of marketing budgets for those companies who choose to use data analysis on top of GA data. This is the starter baseline kernel, I will be updating it frequently. As the first step, lets load the required libraries.", "link": "https://www.kaggle.com/shivamb/exploratory-analysis-ga-customer-revenue", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-09-14 18:17:19", "date_scraped": "2020-12-12 20:08:17", "words": 113, "sentences": 5, "runtime": 0.001, "description_category": "Utilities", "description_category_score": 0.016545744612812996, "description_category_runtime": 9.882, "description_subcategory": "Marketing", "description_subcategory_score": 0.24645890295505524, "description_subcategory_runtime": 15.138, "category": "Utilities", "category_score": 0.016545744612812996, "subcategory": "Marketing", "subcategory_score": 0.24645890295505524, "runtime_cat": 25.022, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.752", "language_code": "en", "language_score": "0.9999979556209839", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "google analytics customer revenue predictioncontents kernel problem statement dataset understanding exploration visitor profile baseline model 1 problem statementin competition aim analyze google merchandise store also known gstore google swag sold customer dataset predict revenue per customer result prediction analysis might lead actionable operational change better use marketing budget company choose use data analysis top ga data starter baseline kernel updating frequently first step let load required library", "tags_descriptive": ["Exploratory Data Analysis"]}