{"title": "Buldozers price prediction using RandomForest", "description": "Predicting the sale price of bulldozer using MLIn this notebook , I am going to go through with the goal of predicting the sale price of Bulldozers. 1. Problem definition :Predict the sale price of a particular piece of heavy equipment at auction based on it's usage, equipment type, and configuration. 2. DataThe data is downloaded from the Kaggle \"Blue Book for bulldozer\" competition.  https://www.kaggle.com/c/bluebook-for-bulldozers/data There are 3 main datasets:  Train.csv is the training set, which contains data through the end of 2011. Valid.csv is the validation set, which contains data from January 1, 2012 - April 30, 2012 You make predictions on this set throughout the majority of the competition. Your score on this set is used to create the public Leaderboard. Test.csv is the test set, which won't be released until the last week of the competition. It contains data from May 1, 2012 - November 2012. Your score on the test set determines your final rank for the competition.  3. EvaluationRMSLE (root mean squared log error) between the actual and predicted auction prices. 4 .Featureshttps://docs.google.com/spreadsheets/d/1epPQnzxSONR2ZwnVLg92luVi7XEJCs_KXqj3I1lmfQg/edit?usp=sharing", "link": "https://www.kaggle.com/vijitkam/buldozers-price-prediction-using-randomforest", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-21 17:07:29", "date_scraped": "2020-12-12 17:19:45", "words": 181, "sentences": 14, "runtime": 0.0, "description_category": "Construction & Engineering", "description_category_score": 0.2458220273256302, "description_category_runtime": 20.788, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.968493640422821, "description_subcategory_runtime": 33.718, "category": "Construction & Engineering", "category_score": 0.2458220273256302, "subcategory": "Machine Learning", "subcategory_score": 0.968493640422821, "runtime_cat": 54.507, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.622", "language_code": "en", "language_score": "0.9999991897994776", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "predicting sale price bulldozer using mlin notebook going go goal predicting sale price bulldozer 1 problem definition predict sale price particular piece heavy equipment auction based usage equipment type configuration 2 datathe data downloaded kaggle blue book bulldozer competition httpswwwkagglecomcbluebookforbulldozersdata 3 main datasets traincsv training set contains data end 2011 validcsv validation set contains data january 1 2012 april 30 2012 make prediction set throughout majority competition score set used create public leaderboard testcsv test set wont released last week competition contains data may 1 2012 november 2012 score test set determines final rank competition 3 evaluationrmsle root mean squared log error actual predicted auction price 4 featureshttpsdocsgooglecomspreadsheetsd1eppqnzxsonr2zwnvlg92luvi7xejcs_kxqj3i1lmfqgedituspsharing", "tags_descriptive": []}