{"title": "Quantify the Madness, a study of competitiveness", "description": "What keeps your eyes glued to the screen while you are watching a basketball game?Arguably, the answer is in the lines of  your love for the game your support for one of the contending teams how hard-fought the game is  In this notebook, we will try to quantify the last point or, by abusing the terminology of the competition, define how competitive a college basketball game can be. Trying to describe in numbers the emotion rushing through the crowd while the ball is flying towards the basket and ends in a buzzer-beater might be too ambitious. However, the core assumption of this notebook is that a score for competitiveness can be extracted by observing how the game unfolded. To do so, we will make extensive use of play-by-play data that tells us what happened during the game and when. For the past 6 Seasons, we have this information for both the Men's and the Women's tournaments and, while some differences between the two tournaments can be found, we found that the way the game can unfold, either by turning out to be competitive or not, is the same for both. We will thus model them together as we are interested in finding out how to create such a score for a generic basketball game. This notebook is organized as follows  Data preparation: everything can be found in this utility script and the key concept will be summarized in this section. A hard definition for a competitive game: what conditions a game should satisfy to be considered competitive. A score for competitiveness: where a Machine Learning model will guide us towards the definition of our score. Finding the Madness: here we will analyse how the score relates to the key characteristics of a game. Limits and next steps: where we will conclude our journey.  Data preparationThe functions that create the data we are going to use can be found in this utility script, where the non-trivial statistics were generated by following these definitions. In summary,  By using the scoring events, we get the game result during the game. We focus on 3 moments: the full game, the second half, the last 3 minutes. We get how many times the lead of the game changed in each of these (overlapping) periods. We aggregate and count the events in each period, for example the number of TO in the last 3 minutes.  Here a sample of the final result", "link": "https://www.kaggle.com/lucabasa/quantify-the-madness-a-study-of-competitiveness", "tags": ["Model Explainability", "Sports", "Sports"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-29 00:04:23", "date_scraped": "2020-12-13 13:49:58", "words": 412, "sentences": 17, "sum_nltk": "However, the core assumption of this notebook is that a score for competitiveness can be extracted by observing how the game unfolded.\nWe will thus model them together as we are interested in finding out how to create such a score for a generic basketball game.\nThis notebook is organized as follows  Data preparation: everything can be found in this utility script and the key concept will be summarized in this section.\nA hard definition for a competitive game: what conditions a game should satisfy to be considered competitive.\nFinding the Madness: here we will analyse how the score relates to the key characteristics of a game.\nData preparationThe functions that create the data we are going to use can be found in this utility script, where the non-trivial statistics were generated by following these definitions.\nIn summary,  By using the scoring events, we get the game result during the game.\nWe aggregate and count the events in each period, for example the number of TO in the last 3 minutes.", "sum_nltk_words": 166, "sum_nltk_runtime": 0.003, "sum_t5": "a notebook will try to define how competitive a college basketball game can be. the notebook will make extensive use of play-by-play data. the goal is to find out how to create a score for competitiveness. the notebook will be available in a few days. a final result will be published in a book later this year. a saturday, november 14th, u.s. open, will be held in london.", "sum_t5_words": 68, "sum_t5_runtime": 6.713, "runtime": 0.003, "nltk_category": "Utilities", "nltk_category_score": 0.6957322955131531, "nltk_category_runtime": 13.789, "nltk_subcategory": "Transportation", "nltk_subcategory_score": 0.9406248927116394, "nltk_subcategory_runtime": 22.785, "category": "Utilities", "category_score": 0.6957322955131531, "subcategory": "Transportation", "subcategory_score": 0.9406248927116394, "runtime_cat": 36.574, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.684", "language_code": "en", "language_score": "0.9999949670762424", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "keep eye glued screen watching basketball gamearguably answer line love game support one contending team hardfought game notebook try quantify last point abusing terminology competition define competitive college basketball game trying describe number emotion rushing crowd ball flying towards basket end buzzerbeater might ambitious however core assumption notebook score competitiveness extracted observing game unfolded make extensive use playbyplay data tell u happened game past 6 season information men woman tournament difference two tournament found found way game unfold either turning competitive thus model together interested finding create score generic basketball game notebook organized follows data preparation everything found utility script key concept summarized section hard definition competitive game condition game satisfy considered competitive score competitiveness machine learning model guide u towards definition score finding madness analyse score relates key characteristic game limit next step conclude journey data preparationthe function create data going use found utility script nontrivial statistic generated following definition summary using scoring event get game result game focus 3 moment full game second half last 3 minute get many time lead game changed overlapping period aggregate count event period example number last 3 minute sample final result", "tags_descriptive": ["Model Explainability", "Sports", "Sports"]}