{"title": "ALASKA2 Competition: Multiclass PyTorch EffNetB2", "description": "Alaska2 Competiton: EDA and Understanding1. Competition Outline Steganography is the method of hiding secret data in any image/audio/video. In a nutshell, the main motive of steganography is to hide the intended information within any image/audio/video that doesn’t appear to be secret just by looking at 1.1 Description Current Methods : Produce unreliable results, raising false alarms Data : images acquired with ~ 50 different cameras and processed in different fashions  1.2 Evaluation submissions are evaluated on the weighted AUC each region of the ROC curve is weighted according to these chosen parameters: tpr_thresholds = [0.0, 0.4, 1.0] weights = [2, 1]     1.3 Sumbission fileFor each Id (image) in the test set, you must provide a score that indicates how likely this image contains hidden data: the higher the score, the more it is assumed that image contains secret data. 1.4 DataFiles  Cover/ contains 75k unaltered images meant for use in training. JMiPOD/ contains 75k examples of the JMiPOD algorithm applied to the cover images. JUNIWARD/ contains 75k examples of the JUNIWARD algorithm applied to the cover images. UERD/ contains 75k examples of the UERD algorithm applied to the cover images. Test/ contains 5k test set images. These are the images for which you are predicting. sample_submission.csv contains an example submission in the correct format.", "link": "https://www.kaggle.com/andradaolteanu/alaska2-competition-multiclass-pytorch-effnetb2", "tags": ["DL", "Classification"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch", "albumentations", "Pillow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-07-03 16:22:38", "date_scraped": "2020-12-12 16:29:23", "words": 220, "sentences": 10, "sum_nltk": "Competition Outline Steganography is the method of hiding secret data in any image/audio/video.\nIn a nutshell, the main motive of steganography is to hide the intended information within any image/audio/video that doesn’t appear to be secret just by looking at 1.1 Description Current Methods : Produce unreliable results, raising false alarms Data : images acquired with ~ 50 different cameras and processed in different fashions  1.2 Evaluation submissions are evaluated on the weighted AUC each region of the ROC curve is weighted according to these chosen parameters: tpr_thresholds = [0.0, 0.4, 1.0] weights = [2, 1]     1.3 Sumbission fileFor each Id (image) in the test set, you must provide a score that indicates how likely this image contains hidden data: the higher the score, the more it is assumed that image contains secret data.\n1.4 DataFiles  Cover/ contains 75k unaltered images meant for use in training.\nJMiPOD/ contains 75k examples of the JMiPOD algorithm applied to the cover images.\nJUNIWARD/ contains 75k examples of the JUNIWARD algorithm applied to the cover images.\nUERD/ contains 75k examples of the UERD algorithm applied to the cover images.\nTest/ contains 5k test set images.\nThese are the images for which you are predicting.", "sum_nltk_words": 199, "sum_nltk_runtime": 0.003, "sum_t5": "steganography is the method of hiding secret data in any image/audio/video. the higher the score, the more it is assumed that image contains secret data. steganography is a technique used to hide information that doesn’t appear to be secret. the technique is used by  50 different cameras and processed in different fashions. steganography is a technique used to hide information that doesn’t appear to be secret.", "sum_t5_words": 67, "sum_t5_runtime": 5.624, "runtime": 0.002, "nltk_category": "Construction & Engineering", "nltk_category_score": 0.34482720494270325, "nltk_category_runtime": 21.192, "nltk_subcategory": "Restaurant", "nltk_subcategory_score": 0.41266360878944397, "nltk_subcategory_runtime": 34.153, "category": "Construction & Engineering", "category_score": 0.34482720494270325, "subcategory": "Restaurant", "subcategory_score": 0.41266360878944397, "runtime_cat": 55.345, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.728", "language_code": "en", "language_score": "0.9999960299817204", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "alaska2 competiton eda understanding1 competition outline steganography method hiding secret data imageaudiovideo nutshell main motive steganography hide intended information within imageaudiovideo doesnt appear secret looking 11 description current method produce unreliable result raising false alarm data image acquired 50 different camera processed different fashion 12 evaluation submission evaluated weighted auc region roc curve weighted according chosen parameter tpr_thresholds 00 04 10 weight 2 1 13 sumbission filefor id image test set must provide score indicates likely image contains hidden data higher score assumed image contains secret data 14 datafiles cover contains 75k unaltered image meant use training jmipod contains 75k example jmipod algorithm applied cover image juniward contains 75k example juniward algorithm applied cover image uerd contains 75k example uerd algorithm applied cover image test contains 5k test set image image predicting sample_submissioncsv contains example submission correct format", "tags_descriptive": ["Deep Learning (DL)", "Classification"]}