{"title": "Sea Lion Correlations & CV2 Template matching", "description": "Countless Sea LionsIn this challenge we are given a set of images and are asked to calculate the number of sea lions in each image, split by a few categories that are indicated in extra overlay images:  red: adult males magenta: subadult males brown: adult females blue: juveniles green: pups   In this notebook we will be looking in detail at:  numeric (counts of sea lions) feature exploration, both with correlation analysis and clustermaps marker images and how we can use them to extract location and image patches for the marked sea lions template matching to build a sea lion detector with OpenCV.  Let's get started with an initial peek at the stats of the data and later plot some sample images.", "link": "https://www.kaggle.com/philschmidt/sea-lion-correlations-cv2-template-matching", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["skimage", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-04-02 22:45:28", "date_scraped": "2020-12-13 14:32:38", "words": 126, "sentences": 2, "runtime": 0.0, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.21211937069892883, "description_category_runtime": 11.081, "description_subcategory": "Life-sciences", "description_subcategory_score": 0.39643970131874084, "description_subcategory_runtime": 16.781, "category": "Biotechnological & Life Sciences", "category_score": 0.21211937069892883, "subcategory": "Life-sciences", "subcategory_score": 0.39643970131874084, "runtime_cat": 27.864, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.743", "language_code": "en", "language_score": "0.9999976224410911", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "countless sea lionsin challenge given set image asked calculate number sea lion image split category indicated extra overlay image red adult male magenta subadult male brown adult female blue juvenile green pup notebook looking detail numeric count sea lion feature exploration correlation analysis clustermaps marker image use extract location image patch marked sea lion template matching build sea lion detector opencv let get started initial peek stats data later plot sample image", "tags_descriptive": []}