{"title": "EDA and Audio Processing with Python", "description": "Improving the accuracy of soundscape analyses.ObjectiveIt is often easier to hear birds than see them. With proper sound detection and classification, researchers could automatically intuit factors about an area’s quality of life based on a changing bird population.The objective of the competition as stated on the competitions page is to identify a wide variety of bird vocalizations in soundscape recordings. However, the recordings are complex and may contain anthropogenic sounds (e.g., airplane overflights) or other bird and non-bird (e.g., chipmunk) calls in the background, with a particular labeled bird species in the foreground. Understanding the Evaluation MetricThe metric in this competition is the row-wise micro averaged F1 score.The F1 score or F measure, is a measure of a test’s accuracy. The F score is defined as the weighted harmonic mean of the test’s precision and recall.  DataFollowing files have been provided to the participants:  train_audio : Trainign data consisting of short recordings train_csv : metadata for training data test_audio : The hidden test set audio consists of approximately 150 recordings in mp3 format, each                       roughly 10 minutes long.  test_audio.csv : metadata for test set.It is important to note that only the first three rows are available for download; the full test.csv is in the hidden test set.  Exploring the Training metadataTo begin with let's explore the training metadata file to gather some information", "link": "https://www.kaggle.com/parulpandey/eda-and-audio-processing-with-python", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-07-02 13:11:13", "date_scraped": "2020-12-12 17:18:49", "words": 249, "sentences": 8, "sum_nltk": "Improving the accuracy of soundscape analyses.ObjectiveIt is often easier to hear birds than see them.\nWith proper sound detection and classification, researchers could automatically intuit factors about an area’s quality of life based on a changing bird population.The objective of the competition as stated on the competitions page is to identify a wide variety of bird vocalizations in soundscape recordings.\nHowever, the recordings are complex and may contain anthropogenic sounds (e.g., airplane overflights) or other bird and non-bird (e.g., chipmunk) calls in the background, with a particular labeled bird species in the foreground.\nUnderstanding the Evaluation MetricThe metric in this competition is the row-wise micro averaged F1 score.The F1 score or F measure, is a measure of a test’s accuracy.\nDataFollowing files have been provided to the participants:  train_audio : Trainign data consisting of short recordings train_csv : metadata for training data test_audio : The hidden test set audio consists of approximately 150 recordings in mp3 format, each                       roughly 10 minutes long.\ntest_audio.csv : metadata for test set.It is important to note that only the first three rows are available for download; the full test.csv is in the hidden test set.\nExploring the Training metadataTo begin with let's explore the training metadata file to gather some information", "sum_nltk_words": 224, "sum_nltk_runtime": 0.002, "sum_t5": "the objective of the competition as stated on the competitions page is to identify a wide variety of bird vocalizations in soundscape recordings. the recordings are complex and may contain anthropogenic sounds (e.g., airplane overflights) or other bird and non-bird (e.g., chipmunk) calls in the background, with a particular labeled bird species in the foreground. the F1 score or F measure, is a measure of a test’s accuracy.", "sum_t5_words": 68, "sum_t5_runtime": 6.203, "runtime": 0.002, "nltk_category": "Utilities", "nltk_category_score": 0.7580540180206299, "nltk_category_runtime": 21.223, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.8802393674850464, "nltk_subcategory_runtime": 34.038, "category": "Utilities", "category_score": 0.7580540180206299, "subcategory": "Quality", "subcategory_score": 0.8802393674850464, "runtime_cat": 55.261, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.738", "language_code": "en", "language_score": "0.9999951095366015", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "improving accuracy soundscape analysesobjectiveit often easier hear bird see proper sound detection classification researcher could automatically intuit factor area quality life based changing bird populationthe objective competition stated competition page identify wide variety bird vocalization soundscape recording however recording complex may contain anthropogenic sound eg airplane overflight bird nonbird eg chipmunk call background particular labeled bird specie foreground understanding evaluation metricthe metric competition rowwise micro averaged f1 scorethe f1 score f measure measure test accuracy f score defined weighted harmonic mean test precision recall datafollowing file provided participant train_audio trainign data consisting short recording train_csv metadata training data test_audio hidden test set audio consists approximately 150 recording mp3 format roughly 10 minute long test_audiocsv metadata test setit important note first three row available download full testcsv hidden test set exploring training metadatato begin let explore training metadata file gather information", "tags_descriptive": []}