{"title": "Evolving the Punt Play - NFL Data Formal Report", "description": "Evolving The Punt PlayGithub Repo with Additional Code Link to Slide Deck Reducing Injuries while maintaining the integrity of the gameThe NFL Punt Analytics Competition is being held by the NFL to elicit the public's proposal for modifications to punt rules. The overarching goal of this challenge is to reduce injuries to players during punt plays. Submissions will be judged by the NFL on (1) Solution Efficacy This parameter is looking for submissions to clearly demonstrate, through analysis, an understanding for the play features associated with conncussions and how proposed rule changes will reduce these injuries. (2) Game Integrity This parameter is looking for submissions to be actionable ... ideas that the NFL could implement while maintaining the integrity of the game. One must also consider changes to game dynamics and any potential new risks to player safety as a result of downstream consequences. High Level OverviewPunt plays have the potential to be some of the most exciting and game changing moments in football. Specialized positions such as punters and punt returners have worked to hone their craft and are an essential part of the game. As part of our research for this challenge, we interviewed College Football Hall of Fame coach Frank Beamer, known for his innovative approach to special teams at the college level. He was adamant that punt plays have the potential to be the most exciting part of the game and the integrity of the game needs to be considered when implementing rule changes. We agree with Frank Beamer- it is our utmost priority to minimize the number of unnecessary dangerous plays while keeping the integrity of the game. Football is a dangerous sport, and removing all risk is impossible, but by focusing on plays that are not pivotal to the game (like short punt returns or returns for no gain), we can allow the data to speak to some of the current challenges of these football moments. Our kernel is organized similar to our overall analytical approach to the problem: Kernel Outline Section I. High Level Analysis of All Punts What are the types of results for punt plays and how common are each of them? What the distribution of return yards on punts? What are the common formations for punts and punt returns?   Section II. Focused Analysis of Punts Resulting in Concussions Which players are commonly involved in injuries? What are the types of returns which result in injuries? Clustering similar types of punt plays resulting in concussions.   What is the velocity/direction of players hurt? Looking at common trends with players changing direction prior to impact.     Section III. Analysis of Fair Catch vs. Returned What are the players' positions on the field at the time of fair catch / return What are the distances between the coverage team and the punt returner during fair catches?   Section IV. Exploration of the Routes Run by Role Types What are all routes by position? What players are injured in the play?  What are the identifiable trends? What routes do punt returners tend to take?   Section V. Using Physics to Calculate Play and Player Risk Can we calculate a heuristic that captures the risk of each pair of players in a given play? Can we aggregate risk to the play level to rank reach play's risk? What trends in the risk can be associated with certain types of plays?   Section VI Our Proposed Rule Changes Incentivize the fair catch. Expand the definition of a defenseless player to include punting team players in pursuit of the returner. Restrict double teaming gunners to balance the starting position of opposing players.   Section VII Solution Efficacy and Impact on Game Integrity Explanation of how these proposed rule changes would reduce the type of plays associated with concussions. Details about how the integrity of the game will remain intact with these changes. Possible negative impacts of the proposed rule changes.", "link": "https://www.kaggle.com/robikscube/evolving-the-punt-play-nfl-data-formal-report", "tags": ["Physics", "Sports"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-01-13 17:29:45", "date_scraped": "2020-12-13 14:25:09", "words": 664, "sentences": 26, "sum_nltk": "Submissions will be judged by the NFL on (1) Solution Efficacy This parameter is looking for submissions to clearly demonstrate, through analysis, an understanding for the play features associated with conncussions and how proposed rule changes will reduce these injuries.\nOne must also consider changes to game dynamics and any potential new risks to player safety as a result of downstream consequences.\nHigh Level OverviewPunt plays have the potential to be some of the most exciting and game changing moments in football.\nHe was adamant that punt plays have the potential to be the most exciting part of the game and the integrity of the game needs to be considered when implementing rule changes.\nHigh Level Analysis of All Punts What are the types of results for punt plays and how common are each of them?\nFocused Analysis of Punts Resulting in Concussions Which players are commonly involved in injuries?\nClustering similar types of punt plays resulting in concussions.\nLooking at common trends with players changing direction prior to impact.\nSection VII Solution Efficacy and Impact on Game Integrity Explanation of how these proposed rule changes would reduce the type of plays associated with concussions.", "sum_nltk_words": 187, "sum_nltk_runtime": 0.009, "sum_t5": "the NFL is eliciting proposals for modifications to punt rules. the goal is to reduce injuries to players during punt plays. the team interviewed college football hall of fame coach Frank Beamer. the team's goal is to minimize the number of unnecessary dangerous plays. the team's goal is to improve the integrity of the game. a spokesman for the league says the competition is open to the public. a spokesman for the league says the competition is open to the public.", "sum_t5_words": 81, "sum_t5_runtime": 6.887, "runtime": 0.008, "nltk_category": "Utilities", "nltk_category_score": 0.25206178426742554, "nltk_category_runtime": 16.14, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.3245249092578888, "nltk_subcategory_runtime": 25.603, "category": "Utilities", "category_score": 0.25206178426742554, "subcategory": "Student", "subcategory_score": 0.3245249092578888, "runtime_cat": 41.743, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.71", "language_code": "en", "language_score": "0.9999973297185851", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "evolving punt playgithub repo additional code link slide deck reducing injury maintaining integrity gamethe nfl punt analytics competition held nfl elicit public proposal modification punt rule overarching goal challenge reduce injury player punt play submission judged nfl 1 solution efficacy parameter looking submission clearly demonstrate analysis understanding play feature associated conncussions proposed rule change reduce injury 2 game integrity parameter looking submission actionable idea nfl could implement maintaining integrity game one must also consider change game dynamic potential new risk player safety result downstream consequence high level overviewpunt play potential exciting game changing moment football specialized position punter punt returners worked hone craft essential part game part research challenge interviewed college football hall fame coach frank beamer known innovative approach special team college level adamant punt play potential exciting part game integrity game need considered implementing rule change agree frank beamer utmost priority minimize number unnecessary dangerous play keeping integrity game football dangerous sport removing risk impossible focusing play pivotal game like short punt return return gain allow data speak current challenge football moment kernel organized similar overall analytical approach problem kernel outline section high level analysis punt type result punt play common distribution return yard punt common formation punt punt return section ii focused analysis punt resulting concussion player commonly involved injury type return result injury clustering similar type punt play resulting concussion velocitydirection player hurt looking common trend player changing direction prior impact section iii analysis fair catch v returned player position field time fair catch return distance coverage team punt returner fair catch section iv exploration route run role type route position player injured play identifiable trend route punt returners tend take section v using physic calculate play player risk calculate heuristic capture risk pair player given play aggregate risk play level rank reach play risk trend risk associated certain type play section vi proposed rule change incentivize fair catch expand definition defenseless player include punting team player pursuit returner restrict double teaming gunner balance starting position opposing player section vii solution efficacy impact game integrity explanation proposed rule change would reduce type play associated concussion detail integrity game remain intact change possible negative impact proposed rule change", "tags_descriptive": ["Physics", "Sports"]}