{"title": "Nuclei DSB 2018 TensorFlow U-Net Score 0.352", "description": "Author: Raoul Malm Abstract: The 2018 Data Science Bowl \"Find the nuclei in divergent images to advance medical discovery\" provides in its first stage a training and test data set consisting of 670 and 65 microscopic images of varying size showing ensembles of cells and their nuclei. For the training images the nuclei are segmented by humans such that we know their number and location within each image. The goal is to find the correct number and location of all nuclei shown in the test images. The performance of an algorithm is evaluated on the mean average precision at different intersection over union (IoU) thresholds, which will be referred to as the score in the following. For the task we implement a deep neural network of the U-Net type consisting of several convolutional and max-pooling layers. The network is written in TensorFlow. Each model can be saved/loaded and the training process can be visualized with TensorBoard. The input of the network are images of shape (height, width, channels) while the output are corresponding binary masks of shape (height, width, 1). Prior to training the network we resize, normalize and transform the images. We use 10% of the training data for validation. Furthermore, we implement data augmentation by making use of translations, rotations, horizontal/vertical flipping and zoom. Choosing an image size of 384x384 pixels the network requires roughly 30 training epochs before the training seems to converge. The network achieves a score of 0.56/0.352 on the validation/test set. A major reason for the score discrepancy can be explained by overlapping/touching nuclei that are identified as a single nucleous by the current implementation. Furthermore, we have not tuned the hyperparameters, so there is still a lot of room for improvement. Being constrained on kaggel hardware and running time, we can choose an image size of 256x256 pixels and train for 4 epochs, which takes roughly 40 minutes. The network can achieve a score of 0.45 on the validation set. Outline:  Modules and global settings Analyse data Manipulate data Score Metric Implement the Neural Network class Train the Neural Network Validate the Neural Network Make Test Prediction Submit  Reference: U-Net: Convolutional Networks for Biomedical Image Segmentation", "link": "https://www.kaggle.com/raoulma/nuclei-dsb-2018-tensorflow-u-net-score-0-352", "tags": ["DL", "CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-02-16 18:38:02", "date_scraped": "2020-12-12 18:38:54", "words": 365, "sentences": 18, "sum_nltk": "Author: Raoul Malm Abstract: The 2018 Data Science Bowl \"Find the nuclei in divergent images to advance medical discovery\" provides in its first stage a training and test data set consisting of 670 and 65 microscopic images of varying size showing ensembles of cells and their nuclei.\nFor the training images the nuclei are segmented by humans such that we know their number and location within each image.\nThe goal is to find the correct number and location of all nuclei shown in the test images.\nWe use 10% of the training data for validation.\nChoosing an image size of 384x384 pixels the network requires roughly 30 training epochs before the training seems to converge.\nThe network achieves a score of 0.56/0.352 on the validation/test set.\nBeing constrained on kaggel hardware and running time, we can choose an image size of 256x256 pixels and train for 4 epochs, which takes roughly 40 minutes.\nThe network can achieve a score of 0.45 on the validation set.\nOutline:  Modules and global settings Analyse data Manipulate data Score Metric Implement the Neural Network class Train the Neural Network Validate the Neural Network Make Test Prediction Submit  Reference: U-Net: Convolutional Networks for Biomedical Image Segmentation", "sum_nltk_words": 195, "sum_nltk_runtime": 0.005, "sum_t5": "Raoul Malm: the goal is to find the correct number and location of nuclei in test images. he says the network can achieve a score of 0.56/0.352 on the validation set. malm: the network can be used to train for 4 epochs, which takes roughly 40 minutes. he says the network can be used to train for a variety of tasks, including a spline. a spline can be used to train a network of", "sum_t5_words": 74, "sum_t5_runtime": 6.889, "runtime": 0.005, "nltk_category": "Biotechnological & Life Sciences", "nltk_category_score": 0.22642962634563446, "nltk_category_runtime": 18.508, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8339715600013733, "nltk_subcategory_runtime": 29.602, "category": "Biotechnological & Life Sciences", "category_score": 0.22642962634563446, "subcategory": "Machine Learning", "subcategory_score": 0.8339715600013733, "runtime_cat": 48.11, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.759", "language_code": "en", "language_score": "0.9999968848809307", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "author raoul malm abstract 2018 data science bowl find nucleus divergent image advance medical discovery provides first stage training test data set consisting 670 65 microscopic image varying size showing ensemble cell nucleus training image nucleus segmented human know number location within image goal find correct number location nucleus shown test image performance algorithm evaluated mean average precision different intersection union iou threshold referred score following task implement deep neural network unet type consisting several convolutional maxpooling layer network written tensorflow model savedloaded training process visualized tensorboard input network image shape height width channel output corresponding binary mask shape height width 1 prior training network resize normalize transform image use 10 training data validation furthermore implement data augmentation making use translation rotation horizontalvertical flipping zoom choosing image size 384x384 pixel network requires roughly 30 training epoch training seems converge network achieves score 0560352 validationtest set major reason score discrepancy explained overlappingtouching nucleus identified single nucleous current implementation furthermore tuned hyperparameters still lot room improvement constrained kaggel hardware running time choose image size 256x256 pixel train 4 epoch take roughly 40 minute network achieve score 045 validation set outline module global setting analyse data manipulate data score metric implement neural network class train neural network validate neural network make test prediction submit reference unet convolutional network biomedical image segmentation", "tags_descriptive": ["Deep Learning (DL)", "Convolutional Neural Network (CNN)"]}