{"title": "Uncovering Cinderellaness", "description": "Uncovering March Madness® Cinderella StoriesGoogle Cloud & NCAA® March Madness Analytics 2020Kaggle Analytics Prediction Competition April 30, 2020 CONTENTS OF THIS FILE I. Definition 1.1. Project Overview 1.2. Problem Statement 1.3. Methodology   II. Implementation 2.1. The Basics, 1985-2020 2.2. Geography, 2010-2020 2.3. Team Box Scores, 2003-2019 2.4. Play-by-play, 2015-2020 2.5. Individual Statistics, 2015-2020 2.6. Public Rankings, 2003-2020 2.7. Prediction Experiment   III. Results 3.1. General Findings 3.2. Uncovering Cinderellaness 3.3. Predicting Cinderellas   References   A Note to the ReaderEditorial \"we\" is used in place of \"I\" and in the meaning of \"the author and the reader\". I recommend reading the I. Definition and III. Results sections before the II. Implementation.  ABSTRACTOur analysis aimed to define common features and specific trends among \"Cinderella\" teams in NCAA® men's basketball. In this context, Cinderella was defined as any basketball team seeded 10th or worse that has advanced to the Round 3 in NCAA® tournament. We have divided all the remaining teams into two more categories - Top and Ordinary. We explored, filtered and analyzed NCAA® data across different dimensions and used descriptive statistics and exploratory visualizations to summarize main characteristics about the data in general, and in particular about \"Cinderellaness\" as our target of interest. Our analysis demonstrated that a typical Cinderella team is ranked between 20 and 65 in a pre-tournament rankings of a popular ranking systems. Cinderellas are good at shooting 2-pointers in the regular season, but not so much in the tournaments. The opposite is true for the three-point goals - Cinderellas have the highest three-point field goal ratio in NCAA® tournaments of all team categories. Cinderellas are successful in defensive rebounding and will likely have a positive Rebound Margin in the regular season games. They typically win with a high scoring margin in Round 2 of NCAA® tournament, but it is harder for them to keep it as high in the later rounds. For this research, we have trained eXtreme Gradient Boosting (XGBoost) machine learning algorithm to predict which team had the best potential to become a Cinderella before the March Madness was canceled. Our model predicted that ETSU (East Tennessee State University) was the most likely candidate for a Cinderella team of the 2020 season.  I. Definition1.1. Project OverviewProject Origin Each season there are thousands of men's and women's NCAA® basketball games played between Division I teams, culminating in March Madness®, the national championship tournaments that start in the middle of March [1]. The men's and women's NCAA basketball tournaments are beloved American sports traditions. These are single-elimination tournaments, which means that the championship team has to win at least six games in a row to claim the title. This high-stakes environment — plus the chance to witness a crazy \"Cinderella-story\" upset, gives the tournament its March Madness® nickname [4]. The challenge of the \"Google Cloud & NCAA® March Madness Analytics\" competition, sponsored by Google Cloud and hosted by Kaggle, is to present an exploratory analysis of the March Madness® using a Kaggle Notebook. Prerequisite Knowledge In this study, we assume that the reader is familiar with the basic NCAA® men's basketball rules and terminology. For those new to basketball, we recommend [4] and [26] for a quick introduction. Input Data The input NCAA® data is provided for this competition and is available from the competition website. The data is about college basketball games and teams and is divided into 6 sections - The Basics, Team Box Scores, Geography, Public Rankings, Play-by-play and Supplements. Please refer to the Data [1] section at the bottom of this notebook for a full description of each file. On March 12, 2020, NCAA® canceled the Division I men's and women's 2020 basketball tournaments, as well as all remaining winter and spring NCAA® championships based on the evolving COVID-19 public health threat [2], so the 2020 data is incomplete and does not have an information about 2020 NCAA® tournament bracket. 1.2. Problem StatementThe goal of our project is to use data analysis to explain \"cinderellaness\" - define common features and specific trends among \"Cinderella\" teams in NCAA® men's basketball. The intended solution is to:  Define and filter out our target of interest - \"Cinderella\" teams Preprocess, filter and analyze input data Build visualizations to provide insights into the data & metrics Use machine learning to predict which team had the potential to become a Cinderella in a 2020 season Communicate the results of the analysis  1.3. MethodologyData Exploration and Preprocessing Scientific computing and analysis packages such as NumPy and Pandas will be used to explore and preprocess the data. Data cleaning will be performed where necessary. We will filter data across different categories, such as regular season vs. NCAA® tournament, all games vs. games won, team segment vs. metric vs. season. Data SegmentationThe essential part of our analysis is to divide men's NCAA® basketball teams into 3 groups - Cinderella, Top and Ordinary. A March Madness Cinderella is a team that greatly exceeds its NCAA® tournament expectations. They are generally afterthoughts on the Selection Sunday bracket, but wind up becoming one of the biggest stories of the tournament [3]. In NCAA®, the field of teams is divided into four geographical regions. Each region has between 16 and 18 teams, which are assigned a seed number of one through 18, with the best team in the region awarded the No. 1 seed. Traditionally, the highest seeds (Nos. 1 through 8) have enjoyed more success than the lower seeds (Nos. 9 through 16). The lower seeds represent potential Cinderellas of the tournament. A Cinderella team is one that unexpectedly achieves success in the tournament. Traditionally, Cinderella's chariot turns back into a pumpkin before getting to the Final Four [4] (also see Figure 1). Considering the above definition, we decided to use the following segmentation as the foundation for our discussion and analysis:  CINDERELLA - any basketball team seeded 10th or worse that has advanced to the Round 3 in NCAA® tournament. This group is our target of interest. TOP - top-seeded (Nos. 1 through 4) teams who have advanced to the Round 3 in NCAA® tournament. This group will represent the most competitive teams - teams that match expectations. ORDINARY - all the other NCAA® tournament teams not falling under two previous categories, for example seeded No 2. but lost in the first-round game. Note that all seed Nos. 5 through 9 will always fall under this category.", "link": "https://www.kaggle.com/evanca/uncovering-cinderellaness", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "xgboost", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-04-30 11:07:35", "date_scraped": "2020-12-13 13:49:58", "words": 1074, "sentences": 76, "sum_nltk": "ABSTRACTOur analysis aimed to define common features and specific trends among \"Cinderella\" teams in NCAA® men's basketball.\nIn this context, Cinderella was defined as any basketball team seeded 10th or worse that has advanced to the Round 3 in NCAA® tournament.\nProject OverviewProject Origin Each season there are thousands of men's and women's NCAA® basketball games played between Division I teams, culminating in March Madness®, the national championship tournaments that start in the middle of March [1].\nThe data is about college basketball games and teams and is divided into 6 sections - The Basics, Team Box Scores, Geography, Public Rankings, Play-by-play and Supplements.\nProblem StatementThe goal of our project is to use data analysis to explain \"cinderellaness\" - define common features and specific trends among \"Cinderella\" teams in NCAA® men's basketball.\nData SegmentationThe essential part of our analysis is to divide men's NCAA® basketball teams into 3 groups - Cinderella, Top and Ordinary.\nConsidering the above definition, we decided to use the following segmentation as the foundation for our discussion and analysis:  CINDERELLA - any basketball team seeded 10th or worse that has advanced to the Round 3 in NCAA® tournament.", "sum_nltk_words": 187, "sum_nltk_runtime": 0.017, "sum_t5": "a typical Cinderella team is ranked between 20 and 65 in a pre-tournament rankings. a typical Cinderella team is ranked between 20 and 65 in a popular ranking system. a typical Cinderella team is ranked between 20 and 65 in a pre-tournament rankings. a typical Cinderella team is ranked between 20 and 65 in a pre-tournament rankings.", "sum_t5_words": 57, "sum_t5_runtime": 6.229, "runtime": 0.007, "nltk_category": "Utilities", "nltk_category_score": 0.2673744857311249, "nltk_category_runtime": 17.98, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.643837034702301, "nltk_subcategory_runtime": 28.908, "category": "Utilities", "category_score": 0.2673744857311249, "subcategory": "Judicial Applied", "subcategory_score": 0.643837034702301, "runtime_cat": 46.889, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.614", "language_code": "en", "language_score": "0.9999954735171436", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "uncovering march madness cinderella storiesgoogle cloud ncaa march madness analytics 2020kaggle analytics prediction competition april 30 2020 content file definition 11 project overview 12 problem statement 13 methodology ii implementation 21 basic 19852020 22 geography 20102020 23 team box score 20032019 24 playbyplay 20152020 25 individual statistic 20152020 26 public ranking 20032020 27 prediction experiment iii result 31 general finding 32 uncovering cinderellaness 33 predicting cinderella reference note readereditorial used place meaning author reader recommend reading definition iii result section ii implementation abstractour analysis aimed define common feature specific trend among cinderella team ncaa men basketball context cinderella defined basketball team seeded 10th worse advanced round 3 ncaa tournament divided remaining team two category top ordinary explored filtered analyzed ncaa data across different dimension used descriptive statistic exploratory visualization summarize main characteristic data general particular cinderellaness target interest analysis demonstrated typical cinderella team ranked 20 65 pretournament ranking popular ranking system cinderella good shooting 2pointers regular season much tournament opposite true threepoint goal cinderella highest threepoint field goal ratio ncaa tournament team category cinderella successful defensive rebounding likely positive rebound margin regular season game typically win high scoring margin round 2 ncaa tournament harder keep high later round research trained extreme gradient boosting xgboost machine learning algorithm predict team best potential become cinderella march madness canceled model predicted etsu east tennessee state university likely candidate cinderella team 2020 season definition11 project overviewproject origin season thousand men woman ncaa basketball game played division team culminating march madness national championship tournament start middle march 1 men woman ncaa basketball tournament beloved american sport tradition singleelimination tournament mean championship team win least six game row claim title highstakes environment plus chance witness crazy cinderellastory upset give tournament march madness nickname 4 challenge google cloud ncaa march madness analytics competition sponsored google cloud hosted kaggle present exploratory analysis march madness using kaggle notebook prerequisite knowledge study assume reader familiar basic ncaa men basketball rule terminology new basketball recommend 4 26 quick introduction input data input ncaa data provided competition available competition website data college basketball game team divided 6 section basic team box score geography public ranking playbyplay supplement please refer data 1 section bottom notebook full description file march 12 2020 ncaa canceled division men woman 2020 basketball tournament well remaining winter spring ncaa championship based evolving covid19 public health threat 2 2020 data incomplete information 2020 ncaa tournament bracket 12 problem statementthe goal project use data analysis explain cinderellaness define common feature specific trend among cinderella team ncaa men basketball intended solution define filter target interest cinderella team preprocess filter analyze input data build visualization provide insight data metric use machine learning predict team potential become cinderella 2020 season communicate result analysis 13 methodologydata exploration preprocessing scientific computing analysis package numpy panda used explore preprocess data data cleaning performed necessary filter data across different category regular season v ncaa tournament game v game team segment v metric v season data segmentationthe essential part analysis divide men ncaa basketball team 3 group cinderella top ordinary march madness cinderella team greatly exceeds ncaa tournament expectation generally afterthought selection sunday bracket wind becoming one biggest story tournament 3 ncaa field team divided four geographical region region 16 18 team assigned seed number one 18 best team region awarded 1 seed traditionally highest seed no 1 8 enjoyed success lower seed no 9 16 lower seed represent potential cinderella tournament cinderella team one unexpectedly achieves success tournament traditionally cinderella chariot turn back pumpkin getting final four 4 also see figure 1 considering definition decided use following segmentation foundation discussion analysis cinderella basketball team seeded 10th worse advanced round 3 ncaa tournament group target interest top topseeded no 1 4 team advanced round 3 ncaa tournament group represent competitive team team match expectation ordinary ncaa tournament team falling two previous category example seeded 2 lost firstround game note seed no 5 9 always fall category", "tags_descriptive": []}