{"title": "Comprehensive Python and D3.js Favorita analytics", "description": "IntroductionThis competition is hosted by a large grocery company in Ecuador called \"Corporacion Favorita\" where the aim of the game is to accurately predict and forecast the unit sales for items sold at various Favorita supermarket chains across Ecuador. Apart from the usual training and test data files provided, there are also quite a handful of other supplementary data files (5 extra files to be exact) provided to us. This notebook aims to take a deep-dive analysis into each of the files provided in this competition and to investigate what types of insights or observations can be derived from each. The structure of this analysis is as follows: 1. Data loading and inspection - Loading the data as Python dataframes and conducting data quality checks 2. Supplementary Data exploration - Exploration of all 5 supplementary files with a mix of D3.js visualizations and stacked barplots 3. Training data exploration  4. Feature ranking with learning models - Training a", "link": "https://www.kaggle.com/arthurtok/comprehensive-python-and-d3-js-favorita-analytics", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-12-26 18:43:50", "date_scraped": "2020-12-12 19:41:27", "words": 159, "sentences": 8, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.23781538009643555, "description_category_runtime": 13.316, "description_subcategory": "Tools", "description_subcategory_score": 0.5256751775741577, "description_subcategory_runtime": 20.867, "category": "Utilities", "category_score": 0.23781538009643555, "subcategory": "Tools", "subcategory_score": 0.5256751775741577, "runtime_cat": 34.183, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.787", "language_code": "en", "language_score": "0.9999966689325253", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionthis competition hosted large grocery company ecuador called corporacion favorita aim game accurately predict forecast unit sale item sold various favorita supermarket chain across ecuador apart usual training test data file provided also quite handful supplementary data file 5 extra file exact provided u notebook aim take deepdive analysis file provided competition investigate type insight observation derived structure analysis follows 1 data loading inspection loading data python dataframes conducting data quality check 2 supplementary data exploration exploration 5 supplementary file mix d3js visualization stacked barplots 3 training data exploration 4 feature ranking learning model training", "tags_descriptive": []}