{"title": "Facial_Keypoint_Detection", "description": "Multi-Stage Heatmap RegressionHello everyone! In this notebook I will be sharing with you guys what I learned in keypoint detection using neural networks. I am currently doing some research into the human pose estimation problem and thought it would be fun to use what I learned on this simple dataset. The challenge presented with this dataset is to figure out the Cartesian (x,y) coordinates of keypoints in facial images. Some of these keypoints include: left_eye_center, right_eye_center, etc... The simplest approach with deep learning is to try and directly map image input to Cartesian coordinates output. This idea was first introduced by Toshev et al. in his scientific paper about the DeepPose network. However, people have speculated that the direct mapping from image to Cartesian coordinates is really complex and hence any model with sufficient accuracy will also be likely to overfit and not generalize well to new data. Introduce heatmap regression, in which the problem gets slightly changed. Instead of predicting Cartesian coordinates, we will be building a deep net to predict a different heatmap for every keypoint we want to find. A heatmap is simply just a picture that shows the likelyhood of a specific keypoint residing at that pixel. Please follow along this notebook to learn more!", "link": "https://www.kaggle.com/fmak95/facial-keypoint-detection", "tags": ["DL", "Regression"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-11-04 18:44:24", "date_scraped": "2020-12-12 19:34:30", "words": 209, "sentences": 12, "sum_nltk": "Multi-Stage Heatmap RegressionHello everyone!\nIn this notebook I will be sharing with you guys what I learned in keypoint detection using neural networks.\nI am currently doing some research into the human pose estimation problem and thought it would be fun to use what I learned on this simple dataset.\nThe challenge presented with this dataset is to figure out the Cartesian (x,y) coordinates of keypoints in facial images.\nThe simplest approach with deep learning is to try and directly map image input to Cartesian coordinates output.\nThis idea was first introduced by Toshev et al.\nin his scientific paper about the DeepPose network.\nHowever, people have speculated that the direct mapping from image to Cartesian coordinates is really complex and hence any model with sufficient accuracy will also be likely to overfit and not generalize well to new data.\nIntroduce heatmap regression, in which the problem gets slightly changed.\nInstead of predicting Cartesian coordinates, we will be building a deep net to predict a different heatmap for every keypoint we want to find.\nA heatmap is simply just a picture that shows the likelyhood of a specific keypoint residing at that pixel.\nPlease follow along this notebook to learn more!", "sum_nltk_words": 190, "sum_nltk_runtime": 0.003, "sum_t5": "a notebook will show you what I learned in keypoint detection using neural networks. the challenge is to figure out the Cartesian (x,y) coordinates of keypoints in facial images. the notebook will be available on cnn.com/deeplearning. the author will also be sharing his findings in a future notebook. back to mail online home. back to the page you came from. back to the page you came from.", "sum_t5_words": 67, "sum_t5_runtime": 4.675, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.5021457076072693, "nltk_category_runtime": 17.636, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9187713861465454, "nltk_subcategory_runtime": 27.685, "category": "Utilities", "category_score": 0.5021457076072693, "subcategory": "Machine Learning", "subcategory_score": 0.9187713861465454, "runtime_cat": 45.321, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.676", "language_code": "en", "language_score": "0.9999953470786711", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "multistage heatmap regressionhello everyone notebook sharing guy learned keypoint detection using neural network currently research human pose estimation problem thought would fun use learned simple dataset challenge presented dataset figure cartesian xy coordinate keypoints facial image keypoints include left_eye_center right_eye_center etc simplest approach deep learning try directly map image input cartesian coordinate output idea first introduced toshev et al scientific paper deeppose network however people speculated direct mapping image cartesian coordinate really complex hence model sufficient accuracy also likely overfit generalize well new data introduce heatmap regression problem get slightly changed instead predicting cartesian coordinate building deep net predict different heatmap every keypoint want find heatmap simply picture show likelyhood specific keypoint residing pixel please follow along notebook learn", "tags_descriptive": ["Deep Learning (DL)", "Regression"]}