{"title": "pilote", "description": "INTRODUCTION Dans cet ensemble de données, vous disposez de données physiologiques réelles provenant de dix-huit pilotes qui ont été soumis à divers événements perturbateurs. L'ensemble de formation de référence comprend un ensemble d'expériences contrôlées collectées dans un environnement autre que le vol, à l'extérieur d'un simulateur de vol. L'ensemble de test (abrégé LOFT= entraînement au vol orienté ligne) consiste en un vol complet (décollage, vol et atterrissage) dans un simulateur de vol. Les pilotes ont expérimenté des distractions destinées à induire l’un des trois états cognitifs suivants: L'attention canalisée (AC) est, grosso modo, le fait d'être concentré sur une tâche à l'exclusion de toutes les autres. Cela est induit dans l’analyse comparative par le fait que les sujets jouent un jeu vidéo captivant basé sur un puzzle. L'attention détournée (AD) est le fait de faire détourner son attention par des actions ou des processus de pensée associés à une décision. Ceci est induit par le fait que les sujets effectuent une tâche de surveillance d'affichage. Périodiquement, un problème mathématique apparaissait qu'il fallait résoudre avant de revenir à la tâche de surveillance. La surprise ou le sursaut (SS) est provoquée par le fait que les sujets regardent des clips avec des craintes de saut. Pour chaque expérience, une paire de pilotes (chacun avec son propre crewidentifiant) a été enregistrée au fil du temps et soumise aux états cognitifs CA, DA ou SS. L'ensemble de formation contient trois expériences (une pour chaque État) dans lesquelles les pilotes ont expérimenté un seul de ces États. Par exemple, dans l' experimentautorité de certification =, les pilotes étaient dans un état de base (aucun événement) ou dans l'état de l'autorité de certification. L'ensemble d'essai contient une simulation de vol complète au cours de laquelle les pilotes peuvent expérimenter n'importe lequel des états (mais jamais plus d'un à la fois). Le but de cette compétition est de prédire la probabilité de chaque état pour chacun timedes ensembles de test. Chaque capteur fonctionnait à une fréquence d'échantillonnage de 256 Hz. Veuillez noter que puisqu'il s'agit de données physiologiques provenant de personnes réelles, il y aura du bruit et des artefacts dans les données. Champs de données Les variables avec le eegpréfixe sont des enregistrements électroencéphalographiques. id- (test.csv et sample_submission.csv uniquement) Identifiant unique pour une combinaison équipage + heure. Vous devez prévoir les probabilités pour chacun id. crew- un identifiant unique pour une paire de pilotes. Il y a 9 équipages dans les données. experiment- L' un des CA, DA, SSou LOFT. Les 3 premiers constituent l’ensemble d’entraînement. Ce dernier la série de test. time - secondes dans l'expérience seat - le pilote est-il assis à gauche (0) ou à droite (1) eeg_fp1 eeg_f7 eeg_f8 eeg_t4 eeg_t6 eeg_t5 eeg_t3 eeg_fp2 eeg_o1 eeg_p3 eeg_pz eeg_f3 eeg_fz eeg_f4 eeg_c4 eeg_p4 eeg_poz eeg_c3 eeg_cz eeg_o2 ecg- Signal d'électrocardiogramme à 3 points. Le capteur avait une résolution / bit de 0,012215 µV et une plage de -100 mV à + 100 mV. Les données sont fournies en microvolts. r- La respiration, une mesure de la montée et de la chute de la poitrine. Le capteur avait une résolution / bit de 0,2384186 µV et une plage de -2,0V à + 2,0V. Les données sont fournies en microvolts. gsr- Réponse galvanique de la peau, une mesure de l'activité électrodermale. Le capteur avait une résolution / bit de 0,2384186 µV et une plage de -2,0V à + 2,0V. Les données sont fournies en microvolts. event- L’état du pilote à l’heure donnée: un de A= base, B= SS, C= CA, D= DA", "link": "https://www.kaggle.com/mahmoud86/eda-rdf-boosting-kn", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["xgboost"], "host": "kaggle.com", "license": "Apache-2.0", "language": "french", "date_project": "2019-01-19 02:07:28", "date_scraped": "2020-12-13 16:35:26", "words": 587, "sentences": 34, "sum_nltk": "Les pilotes ont expérimenté des distractions destinées à induire l’un des trois états cognitifs suivants: L'attention canalisée (AC) est, grosso modo, le fait d'être concentré sur une tâche à l'exclusion de toutes les autres.\nCela est induit dans l’analyse comparative par le fait que les sujets jouent un jeu vidéo captivant basé sur un puzzle.\nCeci est induit par le fait que les sujets effectuent une tâche de surveillance d'affichage.\nLa surprise ou le sursaut (SS) est provoquée par le fait que les sujets regardent des clips avec des craintes de saut.\nPour chaque expérience, une paire de pilotes (chacun avec son propre crewidentifiant) a été enregistrée au fil du temps et soumise aux états cognitifs CA, DA ou SS.\nL'ensemble de formation contient trois expériences (une pour chaque État) dans lesquelles les pilotes ont expérimenté un seul de ces États.\nLe but de cette compétition est de prédire la probabilité de chaque état pour chacun timedes ensembles de test.\nChaque capteur fonctionnait à une fréquence d'échantillonnage de 256 Hz. Veuillez noter que puisqu'il s'agit de données physiologiques provenant de personnes réelles, il y aura du bruit et des artefacts dans les données.", "sum_nltk_words": 186, "sum_nltk_runtime": 0.009, "sum_t5": "dix-huit pilotes ont été soumis à divers événements perturbateurs. l'ensemble de formation de référence comprend un ensemble d'expériences contrôlées. l'ensemble de test consiste en un vol complet (décollage, vol et atterrissage) dans un simulateur de vol. les pilotes ont expérimenté des distractions destinées à induire l’un des trois états cognitifs suivants :", "sum_t5_words": 52, "sum_t5_runtime": 7.026, "runtime": 0.009, "nltk_category": "Utilities", "nltk_category_score": 0.4689553678035736, "nltk_category_runtime": 29.237, "nltk_subcategory": "Transportation", "nltk_subcategory_score": 0.40877610445022583, "nltk_subcategory_runtime": 47.186, "category": "Utilities", "category_score": 0.4689553678035736, "subcategory": "Transportation", "subcategory_score": 0.40877610445022583, "runtime_cat": 76.423, "programming_language": "R notebook", "ml_score": "1.0", "engagement_score": "0.623", "language_code": "fr", "language_score": "0.9999953741994485", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introduction dans cet ensemble de donnees vous disposez de donnees physiologiques reelles provenant de dixhuit pilotes qui ont ete soumis diver evenements perturbateurs lensemble de formation de reference comprend un ensemble dexperiences controlees collectees dans un environnement autre que le vol lexterieur dun simulateur de vol lensemble de test abrege loft entrainement au vol oriente ligne consiste en un vol complet decollage vol et atterrissage dans un simulateur de vol le pilotes ont experimente de distraction destinees induire lun de trois etats cognitifs suivants lattention canalisee ac est grosso modo le fait detre concentre sur une tache lexclusion de toutes le autres cela est induit dans lanalyse comparative par le fait que le sujets jouent un jeu video captivant base sur un puzzle lattention detournee ad est le fait de faire detourner son attention par de action ou de processus de pensee associes une decision ceci est induit par le fait que le sujets effectuent une tache de surveillance daffichage periodiquement un probleme mathematique apparaissait quil fallait resoudre avant de revenir la tache de surveillance la surprise ou le sursaut s est provoquee par le fait que le sujets regardent de clip avec de craintes de saut pour chaque experience une paire de pilotes chacun avec son propre crewidentifiant ete enregistree au fil du temp et soumise aux etats cognitifs ca da ou s lensemble de formation contient trois experience une pour chaque etat dans lesquelles le pilotes ont experimente un seul de ce etats par exemple dans l experimentautorite de certification le pilotes etaient dans un etat de base aucun evenement ou dans letat de lautorite de certification lensemble dessai contient une simulation de vol complete au cours de laquelle le pilotes peuvent experimenter nimporte lequel de etats mais jamais plus dun la fois le de cette competition est de predire la probabilite de chaque etat pour chacun timedes ensemble de test chaque capteur fonctionnait une frequence dechantillonnage de 256 hz veuillez noter que puisquil sagit de donnees physiologiques provenant de personnes reelles il aura du bruit et de artefact dans le donnees champ de donnees le variable avec le eegprefixe sont de enregistrements electroencephalographiques id testcsv et sample_submissioncsv uniquement identifiant unique pour une combinaison equipage heure vous devez prevoir le probabilites pour chacun id crew un identifiant unique pour une paire de pilotes il 9 equipage dans le donnees experiment l un de ca da ssou loft le 3 premier constituent lensemble dentrainement ce dernier la serie de test time secondes dans lexperience seat le pilote estil assis gauche 0 ou droite 1 eeg_fp1 eeg_f7 eeg_f8 eeg_t4 eeg_t6 eeg_t5 eeg_t3 eeg_fp2 eeg_o1 eeg_p3 eeg_pz eeg_f3 eeg_fz eeg_f4 eeg_c4 eeg_p4 eeg_poz eeg_c3 eeg_cz eeg_o2 ecg signal delectrocardiogramme 3 point le capteur avait une resolution bit de 0012215 v et une plage de 100 mv 100 mv le donnees sont fournies en microvolt r la respiration une mesure de la montee et de la chute de la poitrine le capteur avait une resolution bit de 02384186 v et une plage de 20v 20v le donnees sont fournies en microvolt gsr reponse galvanique de la peau une mesure de lactivite electrodermale le capteur avait une resolution bit de 02384186 v et une plage de 20v 20v le donnees sont fournies en microvolt event letat du pilote lheure donnee un de base b s c ca da", "tags_descriptive": []}