{"title": "Exploring the channel energies", "description": "Taking a look at the energy distributions for particular sensor channels throws up some interesting results.  For all patients, some of the sensor channels exhibit a bi-modal behaviour with high and low energy states, perhaps corresponding to whether the patient was awake or asleep.  For patient 2, we find that some of the channels exhibit glitchy behaviour whereby the channel energy drops to near zero for extended periods of time (which is distinct from the all zero dropouts common to all patients). Furthermore, some of this glitchy behaviour is confined to only the training set suggesting that the train and test data sets may cover two disjoint time intervals.", "link": "https://www.kaggle.com/andy101/exploring-the-channel-energies", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2016-10-02 17:50:13", "date_scraped": "2020-12-13 13:55:26", "words": 111, "sentences": 4, "runtime": 0.002, "description_category": "Healthcare", "description_category_score": 0.11619099229574203, "description_category_runtime": 9.373, "description_subcategory": "Valuation", "description_subcategory_score": 0.16885139048099518, "description_subcategory_runtime": 14.685, "category": "Healthcare", "category_score": 0.11619099229574203, "subcategory": "Valuation", "subcategory_score": 0.16885139048099518, "runtime_cat": 24.058, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.657", "language_code": "en", "language_score": "0.9999983971181681", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "taking look energy distribution particular sensor channel throw interesting result patient sensor channel exhibit bimodal behaviour high low energy state perhaps corresponding whether patient awake asleep patient 2 find channel exhibit glitchy behaviour whereby channel energy drop near zero extended period time distinct zero dropout common patient furthermore glitchy behaviour confined training set suggesting train test data set may cover two disjoint time interval", "tags_descriptive": []}