{"title": "event-recommendation-mldm-EDA", "description": "train.csv has six columns:  user, event, invited, timestamp, interested, and not_interested.  Test.csv contains the same columns as train.csv, except for interested and not_interested. Each row corresponds to an event that was shown to a user in our application.  event is an id identifying an event in a our system.  user is an id representing a user in our system.  invited is a binary variable indicated whether the user has been invited to the event. timestamp is a ISO-8601 UTC time string representing the approximate time (+/- 2 hours) when the user saw the event in our application. interested is a binary variable indicating whether a user clicked on the \"Interested\" button for this event; it is 1 if the user clicked Interested and 0 if the user did not click the button.  Similarly, not_interested is a binary variable indicating whether a user clicked on the \"Not Interested\" button for this event; it is 1 if the user clicked the button and 0 if not.  It is possible that the user saw an event and clicked neither Interested nor Not Interested, and hence there are rows that contain 0,0 as values for interested,not_interested.", "link": "https://www.kaggle.com/tombalu/event-recommendation-mldm-eda", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-10-05 16:55:47", "date_scraped": "2020-12-12 19:19:39", "words": 199, "sentences": 10, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.6156561970710754, "description_category_runtime": 17.137, "description_subcategory": "Quality", "description_subcategory_score": 0.7337242364883423, "description_subcategory_runtime": 27.305, "category": "Utilities", "category_score": 0.6156561970710754, "subcategory": "Quality", "subcategory_score": 0.7337242364883423, "runtime_cat": 44.443, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.551", "language_code": "en", "language_score": "0.99999751111588", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "traincsv six column user event invited timestamp interested not_interested testcsv contains column traincsv except interested not_interested row corresponds event shown user application event id identifying event system user id representing user system invited binary variable indicated whether user invited event timestamp iso8601 utc time string representing approximate time 2 hour user saw event application interested binary variable indicating whether user clicked interested button event 1 user clicked interested 0 user click button similarly not_interested binary variable indicating whether user clicked interested button event 1 user clicked button 0 possible user saw event clicked neither interested interested hence row contain 00 value interestednot_interested", "tags_descriptive": []}