{"title": "1st and Future 2019 - Playing Surface Analysis", "description": "Playing Surface Analysis Lateral movement and increased injury risk.This report contains my analysis for the 2019 NFL 1st and Future competition. The competition tasked data scientists to investigate the relationship between the playing surface and the injury and performance of National Football League (NFL) athletes and to examine factors that may contribute to lower extremity injuries. I propose a metric for measuring the angle between athlete's body orientation and movement direction. I categorize player movements into three groups: forward, lateral, and backpedaling. I find that increased lateral player movement is strongly correlated with plays involving non-contact (NC) lower limb injuries. I then look to see if we can find a measurable link between increased lateral movement and playing surface. I then propose a hypothesis that if injury rate is linked to playing surface, then we may see a link between playing surface and lateral movement. My findings show that there is no link between lateral movement and playing surface. Last, I offer three suggestions that I believe may help to identify players at high risk of injuries: 1) Monitor the percentage of lateral movement of players during game play and provide summary statistics on players, and play types. This could be integrated into already existing monitoring protocols.  2) Monitor  the orientation of players’ hips, shoulders and head. I also suggest collecting data that might elucidate the link between playing surface and injuries: player cleat data and dampness of playing surface could be a place to start. 3) Allow strength and conditioning coaches to play a role in injury prevention by educating them about the link between lateral movement and injuries for Linebackers, Wide Receivers and Defensive backs.  They may be able to use  data that I’ve suggested  they develop individualized workout plans.", "link": "https://www.kaggle.com/robikscube/1st-and-future-2019-playing-surface-analysis", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "lightgbm", "pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-01-03 00:36:57", "date_scraped": "2020-12-13 14:23:02", "words": 297, "sentences": 14, "sum_nltk": "Playing Surface Analysis Lateral movement and increased injury risk.This report contains my analysis for the 2019 NFL 1st and Future competition.\nThe competition tasked data scientists to investigate the relationship between the playing surface and the injury and performance of National Football League (NFL) athletes and to examine factors that may contribute to lower extremity injuries.\nI find that increased lateral player movement is strongly correlated with plays involving non-contact (NC) lower limb injuries.\nI then look to see if we can find a measurable link between increased lateral movement and playing surface.\nI then propose a hypothesis that if injury rate is linked to playing surface, then we may see a link between playing surface and lateral movement.\nMy findings show that there is no link between lateral movement and playing surface.\nLast, I offer three suggestions that I believe may help to identify players at high risk of injuries: 1) Monitor the percentage of lateral movement of players during game play and provide summary statistics on players, and play types.\nI also suggest collecting data that might elucidate the link between playing surface and injuries: player cleat data and dampness of playing surface could be a place to start.", "sum_nltk_words": 194, "sum_nltk_runtime": 0.004, "sum_t5": "analysis for the 2019 NFL 1st and Future competition. lateral movement is strongly correlated with plays involving non-contact injuries. no link between lateral movement and playing surface. lateral movement is not linked to injury rate. analysis suggests that strength and conditioning coaches can play a role in injury prevention. lateral movement is linked to injuries in linebackers, wide receivers and defensive backs. lateral movement is strongly correlated with plays involving non-contact injuries.", "sum_t5_words": 72, "sum_t5_runtime": 6.094, "runtime": 0.004, "nltk_category": "Utilities", "nltk_category_score": 0.3847861886024475, "nltk_category_runtime": 16.63, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.6430197358131409, "nltk_subcategory_runtime": 26.003, "category": "Utilities", "category_score": 0.3847861886024475, "subcategory": "Tools", "subcategory_score": 0.6430197358131409, "runtime_cat": 42.635, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.664", "language_code": "en", "language_score": "0.9999978786839915", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "playing surface analysis lateral movement increased injury riskthis report contains analysis 2019 nfl 1st future competition competition tasked data scientist investigate relationship playing surface injury performance national football league nfl athlete examine factor may contribute lower extremity injury propose metric measuring angle athlete body orientation movement direction categorize player movement three group forward lateral backpedaling find increased lateral player movement strongly correlated play involving noncontact nc lower limb injury look see find measurable link increased lateral movement playing surface propose hypothesis injury rate linked playing surface may see link playing surface lateral movement finding show link lateral movement playing surface last offer three suggestion believe may help identify player high risk injury 1 monitor percentage lateral movement player game play provide summary statistic player play type could integrated already existing monitoring protocol 2 monitor orientation player hip shoulder head also suggest collecting data might elucidate link playing surface injury player cleat data dampness playing surface could place start 3 allow strength conditioning coach play role injury prevention educating link lateral movement injury linebacker wide receiver defensive back may able use data ive suggested develop individualized workout plan", "tags_descriptive": []}