{"title": "Beginner's Guide to Capsule Networks", "description": "Beginner's Guide to Capsule NetworksAuthor: Zafar Last Updated: 03/30/18  In the recently concluded Toxic Comments Classification Challenge, Capsule Network (aka CapsNet) proved to be a huge success. This notebook introduces and implements a Capsule Network in Keras and evaluates its performance in the DonorsChoose.Org Application Screening Competition. Contents Introduction to Capsule Networks 1.1 Human Visual Recognition 1.2 Capsules 1.3 Routing by Agreement 1.4 Mathematics behind CapsNet 1.5 The Dyanmic Routing Algorithm 1.6 A word about squash function 1.7 The advantage of Capsule Networks   Boilerplate Code CapsNet implementation Training Submission Conclusion References  Before you read further, it is important to note that the examples presented here are just for the purpose of understanding.", "link": "https://www.kaggle.com/fizzbuzz/beginner-s-guide-to-capsule-networks", "tags": ["DL", "NLP"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow", "nltk"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-03-30 02:46:50", "date_scraped": "2020-12-12 19:01:17", "words": 116, "sentences": 3, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.037781085819005966, "description_category_runtime": 12.206, "description_subcategory": "Student", "description_subcategory_score": 0.15180231630802155, "description_subcategory_runtime": 19.173, "category": "Education & Research", "category_score": 0.037781085819005966, "subcategory": "Student", "subcategory_score": 0.15180231630802155, "runtime_cat": 31.38, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.798", "language_code": "en", "language_score": "0.9999946205746567", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "beginner guide capsule networksauthor zafar last updated 033018 recently concluded toxic comment classification challenge capsule network aka capsnet proved huge success notebook introduces implement capsule network kera evaluates performance donorschooseorg application screening competition content introduction capsule network 11 human visual recognition 12 capsule 13 routing agreement 14 mathematics behind capsnet 15 dyanmic routing algorithm 16 word squash function 17 advantage capsule network boilerplate code capsnet implementation training submission conclusion reference read important note example presented purpose understanding", "tags_descriptive": ["Deep Learning (DL)", "Natural Language Processing (NLP)"]}