{"title": "Google Analytics - Simple Exploration", "description": "Google Analytics Customer Revenue Prediction - Simple Exploration + LGBM Model LB 1.291Problem StatementThe 80/20 rule has proven true for many businesses–only a small percentage of customers produce most of the revenue. As such, marketing teams are challenged to make appropriate investments in promotional strategies. GStoreRStudio, the developer of free and open tools for R and enterprise-ready products for teams to scale and share work, has partnered with Google Cloud and Kaggle to demonstrate the business impact that thorough data analysis can have. In this kaggle competition,we are challenged to analyze a Google Merchandise Store (also known as GStore, where Google swag is sold) customer dataset to predict revenue per customer. File Descriptions train.csv - the training set - contains the same data as the BigQuery rstudio_train_set. test.csv - the test set - contains the same data as the BigQuery rstudio_test_set. sampleSubmission.csv - a sample submission file in the correct format. Contains all fullVisitorIds in test.csv.  Data Fields fullVisitorId- A unique identifier for each user of the Google Merchandise Store. channelGrouping - The channel via which the user came to the Store. date - The date on which the user visited the Store. device - The specifications for the device used to access the Store. geoNetwork - This section contains information about the geography of the user. sessionId - A unique identifier for this visit to the store. socialEngagementType - Engagement type, either \"Socially Engaged\" or \"Not Socially Engaged\". totals - This section contains aggregate values across the session. trafficSource - This section contains information about the Traffic Source from which the session originated. visitId - An identifier for this session. This is part of the value usually stored as the _utmb cookie. This is only unique to the user. For a completely unique ID, we should use a combination of fullVisitorId and visitId. visitNumber - The session number for this user. If this is the first session, then this is set to 1. visitStartTime - The timestamp (expressed as POSIX time).", "link": "https://www.kaggle.com/pavansanagapati/google-analytics-simple-exploration", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-11 18:28:40", "date_scraped": "2020-12-12 20:08:17", "words": 333, "sentences": 24, "sum_nltk": "In this kaggle competition,we are challenged to analyze a Google Merchandise Store (also known as GStore, where Google swag is sold) customer dataset to predict revenue per customer.\nFile Descriptions train.csv - the training set - contains the same data as the BigQuery rstudio_train_set.\ntest.csv - the test set - contains the same data as the BigQuery rstudio_test_set.\nContains all fullVisitorIds in test.csv.\nData Fields fullVisitorId- A unique identifier for each user of the Google Merchandise Store.\nchannelGrouping - The channel via which the user came to the Store.\ndate - The date on which the user visited the Store.\ngeoNetwork - This section contains information about the geography of the user.\nsessionId - A unique identifier for this visit to the store.\ntotals - This section contains aggregate values across the session.\ntrafficSource - This section contains information about the Traffic Source from which the session originated.\nvisitId - An identifier for this session.\nThis is only unique to the user.\nFor a completely unique ID, we should use a combination of fullVisitorId and visitId. visitNumber - The session number for this user.", "sum_nltk_words": 171, "sum_nltk_runtime": 0.005, "sum_t5": "kaggle and google cloud teams are analyzing a dataset of customers. the data is used to predict revenue per customer. the competition is designed to show the business impact of data analysis. the results will be presented in a kaggle presentation on thursday. the results will be presented in a kaggle presentation on thursday. a total of 2,000 users will be able to enter the competition.", "sum_t5_words": 66, "sum_t5_runtime": 6.226, "runtime": 0.003, "nltk_category": "Finance", "nltk_category_score": 0.19064581394195557, "nltk_category_runtime": 18.676, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.3956691324710846, "nltk_subcategory_runtime": 29.596, "category": "Finance", "category_score": 0.19064581394195557, "subcategory": "Machine Learning", "subcategory_score": 0.3956691324710846, "runtime_cat": 48.273, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.758", "language_code": "en", "language_score": "0.9999942077098726", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "google analytics customer revenue prediction simple exploration lgbm model lb 1291problem statementthe 8020 rule proven true many businessesonly small percentage customer produce revenue marketing team challenged make appropriate investment promotional strategy gstorerstudio developer free open tool r enterpriseready product team scale share work partnered google cloud kaggle demonstrate business impact thorough data analysis kaggle competitionwe challenged analyze google merchandise store also known gstore google swag sold customer dataset predict revenue per customer file description traincsv training set contains data bigquery rstudio_train_set testcsv test set contains data bigquery rstudio_test_set samplesubmissioncsv sample submission file correct format contains fullvisitorids testcsv data field fullvisitorid unique identifier user google merchandise store channelgrouping channel via user came store date date user visited store device specification device used access store geonetwork section contains information geography user sessionid unique identifier visit store socialengagementtype engagement type either socially engaged socially engaged total section contains aggregate value across session trafficsource section contains information traffic source session originated visitid identifier session part value usually stored _utmb cookie unique user completely unique id use combination fullvisitorid visitid visitnumber session number user first session set 1 visitstarttime timestamp expressed posix time", "tags_descriptive": ["Exploratory Data Analysis"]}