{"title": "Covid-19 Interleukin-6", "description": "Interleukins are a group of naturally occurring proteins that mediate communication between cells. Interleukins manage cell growth and differentiation. Interleukins are also important in regulating immune responses, such as inflammation. Interleukins are part of a bigger group of messenger molecules called cytokines. They are a part of the “inflammatory cascade” that involves the coordinated, sequential activation of immune response pathways. Cytokines are produced by a broad range of cells, including immune cells like macrophages, B lymphocytes, T lymphocytes and mast cells, as well as endothelial cells, fibroblasts, and various stromal cells.https://blog.healthmatters.io/2018/08/23/what-is-interleukin-6/ Interleukin-6 (IL-6) is an endogenous chemical which is active in inflammation, and in B cell maturation. Besides being an immune protein, it is also a pyrogen, and is responsible for fever in autoimmune, infectious or non-infectious disease", "link": "https://www.kaggle.com/mpwolke/covid-19-interleukin-6", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["caffe"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-27 23:22:14", "date_scraped": "2020-12-13 17:51:06", "words": 128, "sentences": 7, "runtime": 0.001, "description_category": "Healthcare", "description_category_score": 0.8878574371337891, "description_category_runtime": 15.212, "description_subcategory": "Physical", "description_subcategory_score": 0.6528893113136292, "description_subcategory_runtime": 24.097, "category": "Healthcare", "category_score": 0.8878574371337891, "subcategory": "Physical", "subcategory_score": 0.6528893113136292, "runtime_cat": 39.31, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.542", "language_code": "en", "language_score": "0.999996676167033", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "interleukin group naturally occurring protein mediate communication cell interleukin manage cell growth differentiation interleukin also important regulating immune response inflammation interleukin part bigger group messenger molecule called cytokine part inflammatory cascade involves coordinated sequential activation immune response pathway cytokine produced broad range cell including immune cell like macrophage b lymphocyte lymphocyte mast cell well endothelial cell fibroblast various stromal cellshttpsbloghealthmattersio20180823whatisinterleukin6 interleukin6 il6 endogenous chemical active inflammation b cell maturation besides immune protein also pyrogen responsible fever autoimmune infectious noninfectious disease", "tags_descriptive": []}