{"title": "NYC Taxi Fare - Data Exploration", "description": "New York City Taxi Fare Prediction Playground CompetitionThis is my notebook I used to explore the NYC Taxi Fare dataset. Use this yourself to explore the dataset. If you have question, sent me a message! Have fun! Albert van Breemen 27/7/2018 Update 2018/08/27  Corrected error in calculating min/max coordinates. This error has no consequence for the remaining analysis. [Thanks to Pegah]  2018/08/10  Added visuals to analyse the importance of the direction of a trip  2018/08/08  Using the insights from this notebook, I trained a model that got a #1 position on 2018/08/07 (LB score 2.88396) Added pickup traffic density plots to see how busy it is in Manhatten by the hour  2018/08/04  Thanks for all the feedback! This notebook is becoming rather long, but there is so much fun stuff to analyse!! ;) updated the boundingbox and NYC maps, as one test point was not within the bounding box added zoomed in map of NYC added hiresolution NYC/Manhattan map plot added function to remove datapoints from water small update in datapoints per sq miles calculation  2018/07/30  Corrected 'ewr'/'lgr' typo [Thanks to Lu Mingming] Small update plot_on_map function Converted distances to miles [Thanks to sandy1112] Add Taxi pricing rules [Thanks to sandy1112] Added density plots (datapoints per sq mile)  2018/07/28  Added a graph with estimated drive time for two trips using Google Map Traffic info. This could explain how fare depends on hour of the day.  Reading data and first explorationFirst thing I like to do with a new dataset is to explore the data. This means investigating the number of features, their datatype, their meaning and statistics.", "link": "https://www.kaggle.com/breemen/nyc-taxi-fare-data-exploration", "tags": ["Geospatial Analysis", "Linear Regression"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-08-27 10:30:57", "date_scraped": "2020-12-13 14:20:01", "words": 279, "sentences": 8, "sum_nltk": "New York City Taxi Fare Prediction Playground CompetitionThis is my notebook I used to explore the NYC Taxi Fare dataset.\nUse this yourself to explore the dataset.\nAlbert van Breemen 27/7/2018 Update 2018/08/27  Corrected error in calculating min/max coordinates.\n[Thanks to Pegah]  2018/08/10  Added visuals to analyse the importance of the direction of a trip  2018/08/08  Using the insights from this notebook, I trained a model that got a #1 position on 2018/08/07 (LB score 2.88396) Added pickup traffic density plots to see how busy it is in Manhatten by the hour  2018/08/04  Thanks for all the feedback!\nThis notebook is becoming rather long, but there is so much fun stuff to analyse!!\n;) updated the boundingbox and NYC maps, as one test point was not within the bounding box added zoomed in map of NYC added hiresolution NYC/Manhattan map plot added function to remove datapoints from water small update in datapoints per sq miles calculation  2018/07/30  Corrected 'ewr'/'lgr' typo [Thanks to Lu Mingming] Small update plot_on_map function Converted distances to miles [Thanks to sandy1112] Add Taxi pricing rules [Thanks to sandy1112] Added density plots (datapoints per sq mile)  2018/07/28  Added a graph with estimated drive time for two trips using Google Map Traffic info.\nReading data and first explorationFirst thing I like to do with a new dataset is to explore the data.", "sum_nltk_words": 229, "sum_nltk_runtime": 0.003, "sum_t5": "this notebook was created to explore the dataset. it was used to train a model that got a #1 position on 2018/08/07. a new graph could explain how fare depends on hour of the day. it also includes a graph with estimated drive time for two trips using google map Traffic info. a new version of the notebook is available for download here. if you have question, send me a message! Have fun!.", "sum_t5_words": 73, "sum_t5_runtime": 5.969, "runtime": 0.005, "nltk_category": "Finance", "nltk_category_score": 0.3806927800178528, "nltk_category_runtime": 23.943, "nltk_subcategory": "Transportation", "nltk_subcategory_score": 0.7883296012878418, "nltk_subcategory_runtime": 38.219, "category": "Finance", "category_score": 0.3806927800178528, "subcategory": "Transportation", "subcategory_score": 0.7883296012878418, "runtime_cat": 62.162, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.813", "language_code": "en", "language_score": "0.9999965745667001", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "new york city taxi fare prediction playground competitionthis notebook used explore nyc taxi fare dataset use explore dataset question sent message fun albert van breemen 2772018 update 20180827 corrected error calculating minmax coordinate error consequence remaining analysis thanks pegah 20180810 added visuals analyse importance direction trip 20180808 using insight notebook trained model got 1 position 20180807 lb score 288396 added pickup traffic density plot see busy manhatten hour 20180804 thanks feedback notebook becoming rather long much fun stuff analyse updated boundingbox nyc map one test point within bounding box added zoomed map nyc added hiresolution nycmanhattan map plot added function remove datapoints water small update datapoints per sq mile calculation 20180730 corrected ewrlgr typo thanks lu mingming small update plot_on_map function converted distance mile thanks sandy1112 add taxi pricing rule thanks sandy1112 added density plot datapoints per sq mile 20180728 added graph estimated drive time two trip using google map traffic info could explain fare depends hour day reading data first explorationfirst thing like new dataset explore data mean investigating number feature datatype meaning statistic", "tags_descriptive": ["Geospatial Analysis", "Linear Regression"]}