{"title": "Spending $$$ for MS in Data Science -  Worth it ? ", "description": "Is Spending $$$ for MS in Data Science worth it ? A detailed comparative analysis of people with and without university degrees for data science  2019 was an important year for me, Not only I got engaged this year but also I completed my higher education degree. After working for several years in the industry I decided to take a short break, go back to academics and pursue higher education. No doubt, it was one of the best learning experiences I had but there was also a huge investment of time and money. Many people often contact me regularly asking about my experience and viewpoint about such degrees. They ask questions like - whether is it worth spending huge chunks of money for such degrees? Well, there is no fixed answer for such questions because every individual have a different viewpoint and their opinion might be biased. The best way to answer this question is to make use of data, analyse the cohorts of people (example - data scientists) who are well settled in the industry, measure and compare if there are any significant differences in their roles, position, responsibilities, and annual compensation. This type of analysis can provide many interesting insights and help in looking at the broader view of the scenario. In this notebook, I decided to take a stab at this scenario and have shared my experience along with the key insights and a detailed analysis of Kaggle's annual data science survey data.   Source: UpslashThere are one set of people who wants to pursue higher education degrees due to their passion and interest. For these people, it makes sense to get enrol in the relevant university courses and pursue their passion. On the other hand, there is another set of people, who wants to obtain these degrees only to get a specific job title, a specific job role, or a position that get them more money. For this set, university degrees are not the only option, there are many alternatives which can also result in the same outcomes. The most obvious example is in the field of Data Science and Analytics. In recent years, university degrees such as \"Masters in Data Science\" or \"Masters in Analytics\" are sought as one of the must-haves to enter into this field. It is not astonishing that Data Scientist is one of the fastest-growing job titles across the globe and the demand for skilled data scientists is increasing. This has given the universities an option to attract students and make immense money. Several universities have started dedicated degree courses specialized in data science and analytics. Those want to become a data scientist or to switch from another profession to data science profession are now strongly considering these university degrees as the only pathway. But these university courses are not easy to get in and affordable for everyone. These degrees don’t come for free, tuition fees can be exorbitant and can range anything from USD 30,000 to USD 100,000. And that doesn’t include the actual cost of living. Many consider applying for student loans but they add a huge lump sum to the existing mountain of debts. A common myth is that the earning potential for those with postgraduate qualifications is higher but of course, there is no guarantee that one will get a stable job at the end of it. Additionally, Pursuing a university’s higher degree takes anything from one to three years, depending on different factors. This can seem like a long time, especially when the fellow peers are getting started on their careers, while one is still studying. The question of interest here is -  does one need to get that expensive higher education degree, do they create a difference from those who do not have university degrees?. Some resources online also suggest that one can get the depth of knowledge, variety of skills and learn something new. But again, is it possible to get the same skills, same profile, or even better compensation without such degrees?.  Kaggle conducted their Annual Data Science survey and it was full of interesting questions. Participants of this survey were asked different questions about their demographics, profiles, companies, what they use etc. I analysed this data intending to dig deeper into the profiles of people who completed the university degrees to learn data science and those who did not. The focus of the story in this notebook is to identify if the working data scientists with official higher education degrees differ significantly from the other group. The analysis and storyline are segmented according to different factors. Note - For the analysis, I removed the respondents who were \"students\" and \"not employed\". The two groups were selected based on the respondent's choice if they completed the university degrees to learn data science or not. Contents 1. Sources of Learning Data Science     - Why People Choose Higher Education Degrees     - The Academic Landscape : Masters in Data Science Degrees 2. Proportion of Individuals with University Degrees 3. Are there a Significant Differences - With and Without University Degrees ?     3.1 Compensation         - Key Characteristics : Data Scientists earning > USD 150K     3.2 Job Roles     3.3 Job Profiles         - Other Tools : Usage and Comparison 4. Identifying Key Traits 5. Conclusions 6. References  1. Sources of Learning Data Science Data science skills are straightforward to obtain, they need experience and learning. Nowadays there are many online and offline which teaches them in detail. While some prefer online courses such as Coursera or Udacity, some prefer to go to universities for a year or two-year long dedicated courses. Let's look at what are the most popular sources of learning data science among the respondents of the kaggle survey. In this question, one participant could have chosen multiple choices, hence the x-axis represents \"percentage\" of respondents who selected a particular choice.", "link": "https://www.kaggle.com/shivamb/spending-for-ms-in-data-science-worth-it", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-12-02 16:05:44", "date_scraped": "2020-12-13 12:25:09", "words": 979, "sentences": 47, "sum_nltk": "A detailed comparative analysis of people with and without university degrees for data science  2019 was an important year for me, Not only I got engaged this year but also I completed my higher education degree.\nThe best way to answer this question is to make use of data, analyse the cohorts of people (example - data scientists) who are well settled in the industry, measure and compare if there are any significant differences in their roles, position, responsibilities, and annual compensation.\nIn this notebook, I decided to take a stab at this scenario and have shared my experience along with the key insights and a detailed analysis of Kaggle's annual data science survey data.\nSource: UpslashThere are one set of people who wants to pursue higher education degrees due to their passion and interest.\nSeveral universities have started dedicated degree courses specialized in data science and analytics.\nI analysed this data intending to dig deeper into the profiles of people who completed the university degrees to learn data science and those who did not.\nThe two groups were selected based on the respondent's choice if they completed the university degrees to learn data science or not.", "sum_nltk_words": 192, "sum_nltk_runtime": 0.012, "sum_t5": "data scientist joanna mccartney completed her degree in data science. she is now a data analyst and has shared her experience. mccartney: 'there is no fixed answer for such questions'. mccartney: 'there is no fixed answer for such questions'. mccartney: 'there is no fixed answer for such questions'. mccartney: 'there is no fixed answer for such questions'", "sum_t5_words": 57, "sum_t5_runtime": 6.828, "runtime": 0.015, "nltk_category": "Healthcare", "nltk_category_score": 0.32200750708580017, "nltk_category_runtime": 15.626, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.451742559671402, "nltk_subcategory_runtime": 25.181, "category": "Healthcare", "category_score": 0.32200750708580017, "subcategory": "Student", "subcategory_score": 0.451742559671402, "runtime_cat": 40.808, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.776", "language_code": "en", "language_score": "0.9999944764368429", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "spending m data science worth detailed comparative analysis people without university degree data science 2019 important year got engaged year also completed higher education degree working several year industry decided take short break go back academic pursue higher education doubt one best learning experience also huge investment time money many people often contact regularly asking experience viewpoint degree ask question like whether worth spending huge chunk money degree well fixed answer question every individual different viewpoint opinion might biased best way answer question make use data analyse cohort people example data scientist well settled industry measure compare significant difference role position responsibility annual compensation type analysis provide many interesting insight help looking broader view scenario notebook decided take stab scenario shared experience along key insight detailed analysis kaggles annual data science survey data source upslashthere one set people want pursue higher education degree due passion interest people make sense get enrol relevant university course pursue passion hand another set people want obtain degree get specific job title specific job role position get money set university degree option many alternative also result outcome obvious example field data science analytics recent year university degree master data science master analytics sought one musthaves enter field astonishing data scientist one fastestgrowing job title across globe demand skilled data scientist increasing given university option attract student make immense money several university started dedicated degree course specialized data science analytics want become data scientist switch another profession data science profession strongly considering university degree pathway university course easy get affordable everyone degree dont come free tuition fee exorbitant range anything usd 30000 usd 100000 doesnt include actual cost living many consider applying student loan add huge lump sum existing mountain debt common myth earning potential postgraduate qualification higher course guarantee one get stable job end additionally pursuing university higher degree take anything one three year depending different factor seem like long time especially fellow peer getting started career one still studying question interest one need get expensive higher education degree create difference university degree resource online also suggest one get depth knowledge variety skill learn something new possible get skill profile even better compensation without degree kaggle conducted annual data science survey full interesting question participant survey asked different question demographic profile company use etc analysed data intending dig deeper profile people completed university degree learn data science focus story notebook identify working data scientist official higher education degree differ significantly group analysis storyline segmented according different factor note analysis removed respondent student employed two group selected based respondent choice completed university degree learn data science content 1 source learning data science people choose higher education degree academic landscape master data science degree 2 proportion individual university degree 3 significant difference without university degree 31 compensation key characteristic data scientist earning usd 150k 32 job role 33 job profile tool usage comparison 4 identifying key trait 5 conclusion 6 reference 1 source learning data science data science skill straightforward obtain need experience learning nowadays many online offline teach detail prefer online course coursera udacity prefer go university year twoyear long dedicated course let look popular source learning data science among respondent kaggle survey question one participant could chosen multiple choice hence xaxis represents percentage respondent selected particular choice", "tags_descriptive": []}