{"title": "How to attack a machine learning model?", "description": "This kernel flows.... work in progress! I currently work on better story telling & visualisations. ;-) Welcome Kaggler!... Do you know what your machine model has learnt after training?   ... Does your model know what a dog is if it makes perfect predictions for dog or cat classification?   ... How vulnerable is a model with almost prefect prediction performance to hacker attacks?   ... How can we attack and defense our algorithms?   ... It's some time ago, but there was a competition on kaggle that addressed these questions and asked the community to build attacks and defenses for deep learning models. It was hosted by the google brain group  and you can find more information as well as a github repository on their own website cleverhans.io. The time when this competition was active I heard the first time about fooling machine learning models and as I always like to understand why and how, I wrote this notebook that fools a simpler model, namely logistic regression, on the MNIST digit dataset.  Do you know this guy and his horse? The man on this image was Wilhelm von Osten and his horse was named Kluger Hans (cleverhans). In years before the First World War this horse was famous as one belived that it was able to count and to do arithmetic computations. Which sounds like a miracle turned out to be a more nebulous skill of Kugler Hans: Instead of doing computations the horse analyzed the gestures and body postures of the audiance in the show. Dependent on their expressions Kluger Hans made its decisions which result to choose. Even though one is not sure about the true skills of Kluger Hans and on which factors the horse made its decisions, this is still an analogy to our loved machine learning models. Do you know what they really learn? Within this kernel I invite you to open your eyes and get to know the illusion. If you like my kernel, you can make me very happy with an upvote! ;-)", "link": "https://www.kaggle.com/utkunal/how-to-attack-a-machine-learning-model", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow", "sklearn", "pattern", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-02-13 22:05:59", "date_scraped": "2020-12-13 14:28:32", "words": 347, "sentences": 17, "sum_nltk": "work in progress!\nI currently work on better story telling & visualisations.\nDo you know what your machine model has learnt after training?\nDoes your model know what a dog is if it makes perfect predictions for dog or cat classification?\nIt's some time ago, but there was a competition on kaggle that addressed these questions and asked the community to build attacks and defenses for deep learning models.\nThe time when this competition was active I heard the first time about fooling machine learning models and as I always like to understand why and how, I wrote this notebook that fools a simpler model, namely logistic regression, on the MNIST digit dataset.\nThe man on this image was Wilhelm von Osten and his horse was named Kluger Hans (cleverhans).\nWhich sounds like a miracle turned out to be a more nebulous skill of Kugler Hans: Instead of doing computations the horse analyzed the gestures and body postures of the audiance in the show.\nEven though one is not sure about the true skills of Kluger Hans and on which factors the horse made its decisions, this is still an analogy to our loved machine learning models.\nDo you know what they really learn?", "sum_nltk_words": 195, "sum_nltk_runtime": 0.003, "sum_t5": "a competition on kaggle asked the community to build attacks and defenses for deep learning models. the winner will be announced on november 14. a kernel that fools a model on the MNIST digit dataset is available on github. the winner will be announced on november 14. a kernel called \"the illusion\" will be released on november 14. a kernel called \"the illusion\" will be released on november 14.", "sum_t5_words": 69, "sum_t5_runtime": 6.489, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.4626908004283905, "nltk_category_runtime": 17.393, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9552674293518066, "nltk_subcategory_runtime": 28.1, "category": "Utilities", "category_score": 0.4626908004283905, "subcategory": "Machine Learning", "subcategory_score": 0.9552674293518066, "runtime_cat": 45.493, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.6", "language_code": "en", "language_score": "0.9999962355075679", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "kernel flow work progress currently work better story telling visualisation welcome kaggler know machine model learnt training model know dog make perfect prediction dog cat classification vulnerable model almost prefect prediction performance hacker attack attack defense algorithm time ago competition kaggle addressed question asked community build attack defense deep learning model hosted google brain group find information well github repository website cleverhansio time competition active heard first time fooling machine learning model always like understand wrote notebook fool simpler model namely logistic regression mnist digit dataset know guy horse man image wilhelm von osten horse named kluger han cleverhans year first world war horse famous one belived able count arithmetic computation sound like miracle turned nebulous skill kugler han instead computation horse analyzed gesture body posture audiance show dependent expression kluger han made decision result choose even though one sure true skill kluger han factor horse made decision still analogy loved machine learning model know really learn within kernel invite open eye get know illusion like kernel make happy upvote", "tags_descriptive": []}