{"title": "Analyzing Quora for the Insinceres", "description": "About the datasetAn existential problem for any major website today is how to handle toxic and divisive content. Quora wants to tackle this problem head-on to keep their platform a place where users can feel safe sharing their knowledge with the world. Quora is a platform that empowers people to learn from each other. On Quora, people can ask questions and connect with others who contribute unique insights and quality answers. A key challenge is to weed out insincere questions -- those founded upon false premises, or that intend to make a statement rather than look for helpful answers. In this competition, Kagglers will develop models that identify and flag insincere questions. To date, Quora has employed both machine learning and manual review to address this problem. With your help, they can develop more scalable methods to detect toxic and misleading content. Here's your chance to combat online trolls at scale. Help Quora uphold their policy of “Be Nice, Be Respectful” and continue to be a place for sharing and growing the world’s knowledge.", "link": "https://www.kaggle.com/thebrownviking20/analyzing-quora-for-the-insinceres", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "nltk", "spacy", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-12-03 18:13:10", "date_scraped": "2020-12-13 16:20:42", "words": 174, "sentences": 10, "runtime": 0.002, "description_category": "Education & Research", "description_category_score": 0.4788828492164612, "description_category_runtime": 14.779, "description_subcategory": "General", "description_subcategory_score": 0.719389796257019, "description_subcategory_runtime": 23.684, "category": "Education & Research", "category_score": 0.4788828492164612, "subcategory": "General", "subcategory_score": 0.719389796257019, "runtime_cat": 38.464, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.749", "language_code": "en", "language_score": "0.9999968618144529", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "datasetan existential problem major website today handle toxic divisive content quora want tackle problem headon keep platform place user feel safe sharing knowledge world quora platform empowers people learn quora people ask question connect others contribute unique insight quality answer key challenge weed insincere question founded upon false premise intend make statement rather look helpful answer competition kagglers develop model identify flag insincere question date quora employed machine learning manual review address problem help develop scalable method detect toxic misleading content here chance combat online troll scale help quora uphold policy nice respectful continue place sharing growing world knowledge", "tags_descriptive": ["Exploratory Data Analysis"]}