{"title": "HR-Vehicle Spatial-UNet Segmentation", "description": "OverviewThe notebook aims to organize the data and hack Keras so that we can train a model in a fairly simple way. The aim here is to get a model working that can reliably segment the images into objects and then we can make a model that handles grouping the objects into categories based on the labels. As you will see the Keras requires a fair bit of hackery to get it to load images from a dataframe and then get it to read the label images correctly (uint16 isn't supported well). Once that is done, training a U-Net model is really easy. FocusThe focus here is to get the vehicles as accurately as possible without looking at the other classes. We can also try to differentiate between the various class", "link": "https://www.kaggle.com/kmader/hr-vehicle-spatial-unet-segmentation", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-07-10 20:57:53", "date_scraped": "2020-12-12 18:34:37", "words": 131, "sentences": 6, "runtime": 0.0, "description_category": "Manufacturing", "description_category_score": 0.1960161030292511, "description_category_runtime": 10.866, "description_subcategory": "Transportation", "description_subcategory_score": 0.5329644680023193, "description_subcategory_runtime": 16.934, "category": "Manufacturing", "category_score": 0.1960161030292511, "subcategory": "Transportation", "subcategory_score": 0.5329644680023193, "runtime_cat": 27.8, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.605", "language_code": "en", "language_score": "0.999996229473123", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "overviewthe notebook aim organize data hack kera train model fairly simple way aim get model working reliably segment image object make model handle grouping object category based label see kera requires fair bit hackery get load image dataframe get read label image correctly uint16 isnt supported well done training unet model really easy focusthe focus get vehicle accurately possible without looking class also try differentiate various class", "tags_descriptive": []}