{"title": "APTOS Augmentation& Visualize Diabetic Retinopathy", "description": "0. Spotting Blindness -- Real or Spurious?Above is the old title I used, in this new version I also show how to analyze robustness of our model using the great albumentation  Therefore, I decide to change the title to more appropriately reflect the techniques I used here. Please see Section 5 below for the updated material. 1. Introduction : This eye is in danger, I estimate severity level 4Do you want to understand, when the model saying the above statement, how does it know? Does the model look at the same bloody or cotton wool spots like us? Below are what CNN actually see. Does this make sense? Look at the picture below, in the first case, it seems that the model works great! It is able to identify important spots in the eye. In the second case, however, even though the model estimate the severity to be level 3, it almost entirely misses the big wool spots in the middle. It might infer that our model still doesn't grasp an important concept of 'hard exudates' well enough. (ref. https://www.eyeops.com/)", "link": "https://www.kaggle.com/ratthachat/aptos-augmentation-visualize-diabetic-retinopathy", "tags": ["CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "albumentations", "tensorflow", "sklearn", "pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-09-10 19:01:49", "date_scraped": "2020-12-12 16:39:24", "words": 181, "sentences": 10, "runtime": 0.002, "description_category": "Healthcare", "description_category_score": 0.16803142428398132, "description_category_runtime": 15.541, "description_subcategory": "Physical", "description_subcategory_score": 0.4213981330394745, "description_subcategory_runtime": 25.366, "category": "Healthcare", "category_score": 0.16803142428398132, "subcategory": "Physical", "subcategory_score": 0.4213981330394745, "runtime_cat": 40.907, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.832", "language_code": "en", "language_score": "0.9999967143762102", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "0 spotting blindness real spuriousabove old title used new version also show analyze robustness model using great albumentation therefore decide change title appropriately reflect technique used please see section 5 updated material 1 introduction eye danger estimate severity level 4do want understand model saying statement know model look bloody cotton wool spot like u cnn actually see make sense look picture first case seems model work great able identify important spot eye second case however even though model estimate severity level 3 almost entirely miss big wool spot middle might infer model still doesnt grasp important concept hard exudate well enough ref httpswwweyeopscom", "tags_descriptive": ["Convolutional Neural Network (CNN)"]}