{"title": "CNN 2D Basic #2, Preprocessed Dataset, Noisy", "description": "CNN 2D Basic Solution #2.5This is 2nd version of https://www.kaggle.com/daisukelab/cnn-2d-basic-solution-powered-by-fast-ai.  Based on fast.ai library, solving issue as image multi-label classification. Using mel-spectrogram preprocessing. Using preprocessed dataset additionally. https://www.kaggle.com/daisukelab/fat2019_prep_mels1  What's new in 14-Apr version Smaller subset of noisy training data was added; The best 50s. (I should call random 50 actually...) Training uses both curated and this subset of noisy data.  Important notice for final submissionThis kernel is not preprocessing test set, then this doesn't work for final submission. We should be ready for preprocessing new test set used in re-evaluation after deadline: \"Note, as this competition is a Kernels-only, two-stage competition, following the final submission deadline for the competition, your kernel code will be re-run on a privately-held test set that is not provided to you. It is your model's score against this private test set that will determine your ranking on the private leaderboard and final standing in the competition. The leaderboard will be updated in the days following the competition's completion, and our team will announce that the re-run has been completed and leaderboard finalized with an announcement made on the competition forums.\" Link: https://www.kaggle.com/c/freesound-audio-tagging-2019/overview/timeline", "link": "https://www.kaggle.com/daisukelab/cnn-2d-basic-2-preprocessed-dataset-noisy", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-04-16 11:46:20", "date_scraped": "2020-12-12 20:05:18", "words": 190, "sentences": 10, "runtime": 0.005, "description_category": "Healthcare", "description_category_score": 0.3376460373401642, "description_category_runtime": 23.508, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9010696411132812, "description_subcategory_runtime": 37.807, "category": "Healthcare", "category_score": 0.3376460373401642, "subcategory": "Machine Learning", "subcategory_score": 0.9010696411132812, "runtime_cat": 61.315, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.696", "language_code": "en", "language_score": "0.999995594732944", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "cnn 2d basic solution 25this 2nd version httpswwwkagglecomdaisukelabcnn2dbasicsolutionpoweredbyfastai based fastai library solving issue image multilabel classification using melspectrogram preprocessing using preprocessed dataset additionally httpswwwkagglecomdaisukelabfat2019_prep_mels1 whats new 14apr version smaller subset noisy training data added best 50 call random 50 actually training us curated subset noisy data important notice final submissionthis kernel preprocessing test set doesnt work final submission ready preprocessing new test set used reevaluation deadline note competition kernelsonly twostage competition following final submission deadline competition kernel code rerun privatelyheld test set provided model score private test set determine ranking private leaderboard final standing competition leaderboard updated day following competition completion team announce rerun completed leaderboard finalized announcement made competition forum link httpswwwkagglecomcfreesoundaudiotagging2019overviewtimeline", "tags_descriptive": []}