{"title": "UPDATE 5: text processing", "description": "IntroductionThe U.S. has almost 500 students for every guidance counselor. Underserved youth lack the network to find their career role models, making CareerVillage.org the only option for millions of young people in America and around the globe with nowhere else to turn. Our goal is to develop a method to recommend relevant questions to the professionals who are most likely to answer them. Outline of kernel is as follows:  Exploring questions and answers (1) Exploring questions and answers (2) and mind-blowing observation Exploring students Exploring professionals (added filtering active professionals) Exploring professionals and answers Exploring tags Exploring questions bigram Building tag_chart Content Based Recommender (added get similar professionals) t-SNE visualization  Please remember to upvote if you find the work useful! Thank you for visiting.", "link": "https://www.kaggle.com/wjshenggggg/update-5-text-processing", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "nltk", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-03-06 00:47:43", "date_scraped": "2020-12-12 18:41:32", "words": 126, "sentences": 5, "runtime": 0.002, "description_category": "Utilities", "description_category_score": 0.2331199049949646, "description_category_runtime": 12.006, "description_subcategory": "Student", "description_subcategory_score": 0.6641269326210022, "description_subcategory_runtime": 18.788, "category": "Utilities", "category_score": 0.2331199049949646, "subcategory": "Student", "subcategory_score": 0.6641269326210022, "runtime_cat": 30.794, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.703", "language_code": "en", "language_score": "0.9999961280412983", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionthe u almost 500 student every guidance counselor underserved youth lack network find career role model making careervillageorg option million young people america around globe nowhere else turn goal develop method recommend relevant question professional likely answer outline kernel follows exploring question answer 1 exploring question answer 2 mindblowing observation exploring student exploring professional added filtering active professional exploring professional answer exploring tag exploring question bigram building tag_chart content based recommender added get similar professional tsne visualization please remember upvote find work useful thank visiting", "tags_descriptive": ["Exploratory Data Analysis"]}