{"title": "Diabetic retinopathy detection (bronze place)", "description": "Diabetic retinopathy (DR) is the leading cause of blindness in the working-age population of the developed world. It is estimated to affect over 93 million people. Progression to vision impairment can be slowed or averted if DR is detected in time, however this can be difficult as the disease often shows few symptoms until it is too late to provide effective treatment. What is Diabetic Retinopathy?Diabetic Retinopathy is an eye disease associated with long-standing diabetes. This happens when high blood sugar levels cause damage to blood vessels in the retina. These blood vessels can swell and leak. Or they can close, stopping blood from passing through. Sometimes abnormal new blood vessels grow on the retina. All of these changes can steal your vision. You can follow this link to find more about it.  How can we help?Currently, detecting Diabetic Retinopathy (DR) is a time-consuming and manual process that requires a trained clinician to examine and evaluate digital color fundus photographs of the retina. Expertise and equipment required to diagnose the disease often lacks in the areas where rate of diabetes in local populations is high and DR detection is most needed. As the number of individuals with diabetes continues to grow, the infrastructure needed to prevent blindness due to DR will become even more insufficient. We need a comprehensive and automated method for DR screening. With color fundus photography as input, we need to detect whether eye has DR or not automatically. If there is DR, we can go even further and rate how severe the disease is in the eye. In this blog post, I will write about how we participated in the Diabetic retinopathy detection challenge on Kaggle using Intelec AI and built an automated DR detector. Let's get started. DataWe were provided with a large set of high-resolution retina images taken under a variety of imaging conditions. A clinician had rated the presence of diabetic retinopathy in each image between 0 and 4, according to the following scale: 0 - No DR 1 - Mild 2 - Moderate 3 - Severe 4 - Proliferative DR Our task was to create an automated DR detector capable of assigning a score to a given image based on this scale. So we donwloaded the dataset from the Data page of the competition and extracted it:  The images in this dataset came from different models and types of cameras and featured very mixed quality. There was noise in both the images and labels. Some images contained artifacts - were out of focus, underexposed, or overexposed. A major aim of this competition was to develop robust algorithms that can function in the presence of noise and variation.  Install machine learning toolsWe used Intelec AI to train diabetic retinopathy detectors. You can download and install it for free from here. Training first modelWe decided to start from \"Simple image classifier\" to train a small neural network to classifiy given images into 5 categories (0 - 4). Small neural networks train fast, which is helpful in getting the first benchmark accuracy in short time. But there was a problem, images were very big (minimum resolution 2500x1900), which, if used as given, might have slowed down our training significantly. We solved this problem by shrinking all images 20 times. Shrinking the training images can decrease accuracy of final model but it is usually a good idea to start working on small images, before using the original images to get best accuracy. So we trained a small neural network on the training images, which were shrinked 20 times:  The training took 50 minutes and had 75% accuracy in the end. A nice start!  Increasing accuracy with deep neural networkOne way of increasing the detection accuracy is training a deeper network. It usually takes longer but produces a better accuracy. Hence we decided to train a deep neural network to see whether it would increase our detection accuracy.  The training took ~6.5hours and achieved 79% accuracy. Training time was 6-7 times more than our previous training but it improved the accuracy by 5%.  Increasing input image sizeOur previous models were trained with images, which were 20 times smaller than the original ones. Small input size allowed us to train our first models in relatively short time. However, by shrinking our training images so much we loose a lot of small details, especially in our case, because important decision factors, like hemorrhages, microaneurysms and even exudates, are usually small spots in the picture (see the image above). By shrinking our images a lot, we get rid of them. This results in images with DR not having any DR related features and hence been classified as \"No DR\". Therefore we decided to decrease the shrink factor hoping to get some of the important small details back. This time we decided to shrink the images only 10 times.   As you can already guess, it took significantly more time to train the model but it achieved higher accuracy.  Accuracy of our final model was 82%. Perhaps it could be further increased by decreasing the shrink factor even more. But we decided to stop here in order to keep our demo short. Test final modelNext, we deployed our model and ran it on some sample images. One of the results looked like the following:  You can see here the result (prediction) and the activation map. Activation map shows where the model gave more attention while calculating the result. In the above picture, the bright spots got more attention than the dark ones. Submit results to KaggleHow good is our final accuracy 82%? To answer this question, we needed to run our final model on the test images, submit the results to Kaggle and see where we stand on the leaderboard of the competition. So we created a task to classify all our test images in \"/diabetic retinopathy/test\" using the final model \"Deep DR classifier medRes\".  We then went ahead and downloaded the results,  converted them into the Kaggle submission format  and submitted to Kaggle.  Our score was ~0.58. If we compare it with another results on the leaderboard, we were at 57-58th place, which falls into bronze place range.  SummaryWow, that was a lot of work. We were able to train a diabetic retinopathy detector with 82% accuracy. The accuracy can be increased further  by training a model on even bigger images by training a separate model, which recognizes different details of DR (hemorrhages, microaneurysms and exudates) and combining its results with the results of our original DR detector to make final decision  But we decided to stop here in order to keep our demo short. I hope you enjoyed it. I have also prepared a video demo of this work, where I show eveything, which we did in this blog post, step-by-step. You can watch it here References Detect eye disease using Artificial Intelligence (step by step demo) What is Diabetic Retinopathy? Diabetic Retinopathy detection through integration of Deep Learning classification Diabetic retinopathy detection challenge on Kaggle", "link": "https://www.kaggle.com/intelecai/diabetic-retinopathy-detection-bronze-place", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-03-25 17:59:10", "date_scraped": "2020-12-12 18:54:56", "words": 1184, "sentences": 63, "sum_nltk": "How can we help?Currently, detecting Diabetic Retinopathy (DR) is a time-consuming and manual process that requires a trained clinician to examine and evaluate digital color fundus photographs of the retina.\nA clinician had rated the presence of diabetic retinopathy in each image between 0 and 4, according to the following scale: 0 - No DR 1 - Mild 2 - Moderate 3 - Severe 4 - Proliferative DR Our task was to create an automated DR detector capable of assigning a score to a given image based on this scale.\nShrinking the training images can decrease accuracy of final model but it is usually a good idea to start working on small images, before using the original images to get best accuracy.\nSo we trained a small neural network on the training images, which were shrinked 20 times:  The training took 50 minutes and had 75% accuracy in the end.\nHence we decided to train a deep neural network to see whether it would increase our detection accuracy.\nTo answer this question, we needed to run our final model on the test images, submit the results to Kaggle and see where we stand on the leaderboard of the competition.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.016, "sum_t5": "a team of scientists from u.s. and uk created an automated DR detector. the detector was based on a scale of 0 to 4. if there is DR, we can rate how severe the disease is in the eye. the detector is based on a'score' of 0 to 4. the team is currently working on a prototype to detect DR. the system is currently in development.", "sum_t5_words": 66, "sum_t5_runtime": 6.327, "runtime": 0.01, "nltk_category": "Healthcare", "nltk_category_score": 0.40196675062179565, "nltk_category_runtime": 17.223, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9577608108520508, "nltk_subcategory_runtime": 26.81, "category": "Healthcare", "category_score": 0.40196675062179565, "subcategory": "Machine Learning", "subcategory_score": 0.9577608108520508, "runtime_cat": 44.033, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.607", "language_code": "en", "language_score": "0.9999983263001103", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "diabetic retinopathy dr leading cause blindness workingage population developed world estimated affect 93 million people progression vision impairment slowed averted dr detected time however difficult disease often show symptom late provide effective treatment diabetic retinopathydiabetic retinopathy eye disease associated longstanding diabetes happens high blood sugar level cause damage blood vessel retina blood vessel swell leak close stopping blood passing sometimes abnormal new blood vessel grow retina change steal vision follow link find helpcurrently detecting diabetic retinopathy dr timeconsuming manual process requires trained clinician examine evaluate digital color fundus photograph retina expertise equipment required diagnose disease often lack area rate diabetes local population high dr detection needed number individual diabetes continues grow infrastructure needed prevent blindness due dr become even insufficient need comprehensive automated method dr screening color fundus photography input need detect whether eye dr automatically dr go even rate severe disease eye blog post write participated diabetic retinopathy detection challenge kaggle using intelec ai built automated dr detector let get started datawe provided large set highresolution retina image taken variety imaging condition clinician rated presence diabetic retinopathy image 0 4 according following scale 0 dr 1 mild 2 moderate 3 severe 4 proliferative dr task create automated dr detector capable assigning score given image based scale donwloaded dataset data page competition extracted image dataset came different model type camera featured mixed quality noise image label image contained artifact focus underexposed overexposed major aim competition develop robust algorithm function presence noise variation install machine learning toolswe used intelec ai train diabetic retinopathy detector download install free training first modelwe decided start simple image classifier train small neural network classifiy given image 5 category 0 4 small neural network train fast helpful getting first benchmark accuracy short time problem image big minimum resolution 2500x1900 used given might slowed training significantly solved problem shrinking image 20 time shrinking training image decrease accuracy final model usually good idea start working small image using original image get best accuracy trained small neural network training image shrinked 20 time training took 50 minute 75 accuracy end nice start increasing accuracy deep neural networkone way increasing detection accuracy training deeper network usually take longer produce better accuracy hence decided train deep neural network see whether would increase detection accuracy training took 65hours achieved 79 accuracy training time 67 time previous training improved accuracy 5 increasing input image sizeour previous model trained image 20 time smaller original one small input size allowed u train first model relatively short time however shrinking training image much loose lot small detail especially case important decision factor like hemorrhage microaneurysms even exudate usually small spot picture see image shrinking image lot get rid result image dr dr related feature hence classified dr therefore decided decrease shrink factor hoping get important small detail back time decided shrink image 10 time already guess took significantly time train model achieved higher accuracy accuracy final model 82 perhaps could increased decreasing shrink factor even decided stop order keep demo short test final modelnext deployed model ran sample image one result looked like following see result prediction activation map activation map show model gave attention calculating result picture bright spot got attention dark one submit result kagglehow good final accuracy 82 answer question needed run final model test image submit result kaggle see stand leaderboard competition created task classify test image diabetic retinopathytest using final model deep dr classifier medres went ahead downloaded result converted kaggle submission format submitted kaggle score 058 compare another result leaderboard 5758th place fall bronze place range summarywow lot work able train diabetic retinopathy detector 82 accuracy accuracy increased training model even bigger image training separate model recognizes different detail dr hemorrhage microaneurysms exudate combining result result original dr detector make final decision decided stop order keep demo short hope enjoyed also prepared video demo work show eveything blog post stepbystep watch reference detect eye disease using artificial intelligence step step demo diabetic retinopathy diabetic retinopathy detection integration deep learning classification diabetic retinopathy detection challenge kaggle", "tags_descriptive": []}