{"title": "Keras Warm-up: Cats vs Dogs CNN with VGG16", "description": "Keras Warm-up: Cats vs Dogs CNN with VGG16In this notebook, I'm replicating the technique mentioned at Building powerful image classification models using very little data. Using the pretrained model and build the model on-top of embeddings have been a norm in industry. Fine-tuning VGG model may be my next notebook. Steps:  Image Data Preparation. VGG16 Image Embeddings Backfill. Training Multi-layer Perceptron Classifier. Submission. Appendix: PCA of VGG16 Embeddings (for inspection only)  If you find this notebook useful, please help vote it. Thanks! 1. Library ImportStandard library import. Checking if the execution environment contains GPU at our disposal.", "link": "https://www.kaggle.com/shaochuanwang/keras-warm-up-cats-vs-dogs-cnn-with-vgg16", "tags": ["Classification", "CNN"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "keras", "tensorflow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-04-29 08:40:13", "date_scraped": "2020-12-12 18:58:25", "words": 99, "sentences": 11, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.027681643143296242, "description_category_runtime": 11.147, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8578600883483887, "description_subcategory_runtime": 17.019, "category": "Utilities", "category_score": 0.027681643143296242, "subcategory": "Machine Learning", "subcategory_score": 0.8578600883483887, "runtime_cat": 28.165, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.743", "language_code": "en", "language_score": "0.9999962791353749", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "kera warmup cat v dog cnn vgg16in notebook im replicating technique mentioned building powerful image classification model using little data using pretrained model build model ontop embeddings norm industry finetuning vgg model may next notebook step image data preparation vgg16 image embeddings backfill training multilayer perceptron classifier submission appendix pca vgg16 embeddings inspection find notebook useful please help vote thanks 1 library importstandard library import checking execution environment contains gpu disposal", "tags_descriptive": ["Classification", "Convolutional Neural Network (CNN)"]}