{"title": "Understanding Approval-DonorsChoose-EDA,FE,ELI5", "description": "Understanding Approval:- Donor Choose EDA Contents: Introduction About Donors Choose Competition Objective Kernel objective   Imports and overview Custom Helper Functions Plotting Functions Text functions Extract text stats Make Wordclouds     Individual Feature impact on Approval rates Categorical features - Teacher-prefix, Gender, Grade/class Cleaning up - Subject category and Subject sub-category   Text columns exploration Title Student description Project description Resource summary   Resources dataset Custom Word Vectors (Word2Vec) Product Descriptions Similar Products Primer to product clustering    Product Clustering Are teachers asking for the same type of products getting rejected?   Price points Exploring some costly items   Pre-processing and cleaning text Feature Engineering Label encoding Create date features Custom Vectorizer for ELI5 compatability   Baseline Models -- XGBoost and LightGBM ROC curve and    Understanding how the model predicts - ELI5 Explore correct classifications Explore mis-classifications    1. Introduction:1.1 About Donors Choose:Donorschoose.org is a crowdfunding platform which connects Public school teachers and Donors.   As per their website, they have raised $645,575,280 till date and claim that 77 percent of all the public schools in America have at least one teacher who has posted a project on DonorsChoose.org. Amazing! With such high numbers, the number of applications they receive is increasing every year and the current screening process is manually vetting the applications by a team of volunteers. As a result, there are three main problems they need to solve:  How to scale current manual processes and resources to screen 500,000 projects so that they can be posted as quickly and as efficiently as possible How to increase the consistency of project vetting across different volunteers to improve the experience for teachers How to focus volunteer time on the applications that need the most assistance  1.2 Competition Objective:The goal of the competition is to predict whether or not a DonorsChoose.org project proposal submitted by a teacher will be approved, using the text of project descriptions as well as additional metadata about the project, teacher, and school. DonorsChoose.org can then use this information to identify projects most likely to need further review before approval. 1.3 Kernel objective:To explore and understand factors that make a successful project and hopefully create an approval process pipeline/algorithm to help Donorschoose.org with the vetting process of approving a project. 2. Imports and overview:Lets get started by importing all the required packages and performing basic sanity checks like the test-train split ratio, Missing value checks,etc.", "link": "https://www.kaggle.com/jagangupta/understanding-approval-donorschoose-eda-fe-eli5", "tags": ["NLP", "Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["nltk", "gensim", "xgboost", "lightgbm", "sklearn", "pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-04-19 07:52:28", "date_scraped": "2020-12-12 19:01:17", "words": 418, "sentences": 9, "sum_nltk": "Understanding Approval:- Donor Choose EDA Contents: Introduction About Donors Choose Competition Objective Kernel objective   Imports and overview Custom Helper Functions Plotting Functions Text functions Extract text stats Make Wordclouds     Individual Feature impact on Approval rates Categorical features - Teacher-prefix, Gender, Grade/class Cleaning up - Subject category and Subject sub-category   Text columns exploration Title Student description Project description Resource summary   Resources dataset Custom Word Vectors (Word2Vec) Product Descriptions Similar Products Primer to product clustering    Product Clustering Are teachers asking for the same type of products getting rejected?\nAs a result, there are three main problems they need to solve:  How to scale current manual processes and resources to screen 500,000 projects so that they can be posted as quickly and as efficiently as possible How to increase the consistency of project vetting across different volunteers to improve the experience for teachers How to focus volunteer time on the applications that need the most assistance  1.2 Competition Objective:The goal of the competition is to predict whether or not a DonorsChoose.org project proposal submitted by a teacher will be approved, using the text of project descriptions as well as additional metadata about the project, teacher, and school.", "sum_nltk_words": 208, "sum_nltk_runtime": 0.004, "sum_t5": "DonorsChoose.org is a crowdfunding platform which connects Public school teachers and Donors. they claim that 77 percent of all the public schools in the u.s. have at least one teacher who has posted a project on the platform. they are currently vetting the applications manually by a team of volunteers. they are also looking for ways to increase the consistency of project vetting across different volunteers. they are also looking for ways to improve the experience for teachers.", "sum_t5_words": 78, "sum_t5_runtime": 6.878, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.39808928966522217, "nltk_category_runtime": 17.891, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.7246271371841431, "nltk_subcategory_runtime": 28.686, "category": "Education & Research", "category_score": 0.39808928966522217, "subcategory": "Student", "subcategory_score": 0.7246271371841431, "runtime_cat": 46.576, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.72", "language_code": "en", "language_score": "0.9999954473681235", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "understanding approval donor choose eda content introduction donor choose competition objective kernel objective import overview custom helper function plotting function text function extract text stats make wordclouds individual feature impact approval rate categorical feature teacherprefix gender gradeclass cleaning subject category subject subcategory text column exploration title student description project description resource summary resource dataset custom word vector word2vec product description similar product primer product clustering product clustering teacher asking type product getting rejected price point exploring costly item preprocessing cleaning text feature engineering label encoding create date feature custom vectorizer eli5 compatability baseline model xgboost lightgbm roc curve understanding model predicts eli5 explore correct classification explore misclassifications 1 introduction11 donor choosedonorschooseorg crowdfunding platform connects public school teacher donor per website raised 645575280 till date claim 77 percent public school america least one teacher posted project donorschooseorg amazing high number number application receive increasing every year current screening process manually vetting application team volunteer result three main problem need solve scale current manual process resource screen 500000 project posted quickly efficiently possible increase consistency project vetting across different volunteer improve experience teacher focus volunteer time application need assistance 12 competition objectivethe goal competition predict whether donorschooseorg project proposal submitted teacher approved using text project description well additional metadata project teacher school donorschooseorg use information identify project likely need review approval 13 kernel objectiveto explore understand factor make successful project hopefully create approval process pipelinealgorithm help donorschooseorg vetting process approving project 2 import overviewlets get started importing required package performing basic sanity check like testtrain split ratio missing value checksetc", "tags_descriptive": ["Natural Language Processing (NLP)", "Exploratory Data Analysis"]}