{"title": "What are lung opacities? ", "description": "OverviewI love this competition! But the title \"Pneumonia Detection\" for the competition is misleading because you actually have to do \"Lung Opacities Detection\", and lung opacities are not the same as pneumonia. Lung opacities are vague, fuzzy clouds of white in the darkness of the lungs, which makes detecting them a real challenge. This kernel is for people who want to understand what lung opacities are and how come there are \"No Lung Opacity / Not Normal\" images. In this kernel I will show images from different classes (Normal; No Lung Opacity / Not Normal; Lung Opacity) and write my interpretation of the opacities in the image. I will cover some basics of chest radiography and focus only on the lungs because \"Lung Opacities\" appear only in the lungs. Write your questions in the comments section and I'll answer them as best that I can. My name is Guy Zahavi, I am a physician (anesthesiology resident) and graduate bioinformatics student. I am not affiliated with the competition hosts or Kaggle, I'm just excited about this competition :) I took the code for this kernel from Peter Chang's awesome Exploratory Data Analysis. Thank you Peter!", "link": "https://www.kaggle.com/zahaviguy/what-are-lung-opacities", "tags": ["Healthcare"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-09-15 11:13:49", "date_scraped": "2020-12-13 16:48:20", "words": 194, "sentences": 9, "runtime": 0.003, "description_category": "Healthcare", "description_category_score": 0.3888048529624939, "description_category_runtime": 17.487, "description_subcategory": "Student", "description_subcategory_score": 0.842828094959259, "description_subcategory_runtime": 28.933, "category": "Healthcare", "category_score": 0.3888048529624939, "subcategory": "Student", "subcategory_score": 0.842828094959259, "runtime_cat": 46.42, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.828", "language_code": "en", "language_score": "0.999996557261975", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "overviewi love competition title pneumonia detection competition misleading actually lung opacity detection lung opacity pneumonia lung opacity vague fuzzy cloud white darkness lung make detecting real challenge kernel people want understand lung opacity come lung opacity normal image kernel show image different class normal lung opacity normal lung opacity write interpretation opacity image cover basic chest radiography focus lung lung opacity appear lung write question comment section ill answer best name guy zahavi physician anesthesiology resident graduate bioinformatics student affiliated competition host kaggle im excited competition took code kernel peter chang awesome exploratory data analysis thank peter", "tags_descriptive": ["Healthcare"]}