{"title": "Starter kernel", "description": "HowdyYour job in this Data Science for Good competition is to develop a recommendation engine that will suggest relevant questions to professionals via email. Students ask questons on the CareerVillage.org platform and Professionals answer them. CareerVillage.org has a pretty good recommendation system inplace that's based on hard-coded rules. They would love to make it more efficient and improve it's performance. That's where you come in :) Since questions and answers are the main focus of this competition, I thought it would be helpful to join a few tables together to help get things started. This is totally not an exhaustive list of things to do and there's a lot more data to explore so go get wild!", "link": "https://www.kaggle.com/crawford/starter-kernel", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-02-27 01:11:22", "date_scraped": "2020-12-12 18:41:32", "words": 117, "sentences": 6, "runtime": 0.0, "description_category": "Education & Research", "description_category_score": 0.3014620542526245, "description_category_runtime": 10.743, "description_subcategory": "Student", "description_subcategory_score": 0.6613835096359253, "description_subcategory_runtime": 16.211, "category": "Education & Research", "category_score": 0.3014620542526245, "subcategory": "Student", "subcategory_score": 0.6613835096359253, "runtime_cat": 26.955, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.692", "language_code": "en", "language_score": "0.9999963942187635", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "howdyyour job data science good competition develop recommendation engine suggest relevant question professional via email student ask questons careervillageorg platform professional answer careervillageorg pretty good recommendation system inplace thats based hardcoded rule would love make efficient improve performance thats come since question answer main focus competition thought would helpful join table together help get thing started totally exhaustive list thing there lot data explore go get wild", "tags_descriptive": []}