{"title": "Object Detection with Pytorch-Lightning", "description": "General information To get large and accurate data about wheat fields worldwide, plant scientists use image detection of \"wheat heads\"—spikes atop the plant containing grain. These images are used to estimate the density and size of wheat heads in different varieties. Farmers can use the data to assess health and maturity when making management decisions in their fields. However, accurate wheat head detection in outdoor field images can be visually challenging. There is often overlap of dense wheat plants, and the wind can blur the photographs. Both make it difficult to identify single heads. Additionally, appearances vary due to maturity, color, genotype, and head orientation. Finally, because wheat is grown worldwide, different varieties, planting densities, patterns, and field conditions must be considered. In this competition we detect wheat heads on images and return coordinates of bboxes and their confidence. You can see a repository with code (can be run as a script) here: https://github.com/Erlemar/wheat The metric is IoU:  It is calculated at at different thresholds from 0.5 to 0.75 with a step size of 0.05. My kernel is based on official tutorial: https://pytorch.org/tutorials/intermediate/torchvision_tutorial.html and could intersect with this cool kernel by Peter: https://www.kaggle.com/pestipeti/pytorch-starter-fasterrcnn-train But this kernel I want to show you how to use Pytorch-Lightning framework for deep learning. I like the concept of this library and hope you will also find it useful. UPD: code updated for pytorch-lightning 0.7.6 Version 8: update pytorch-lightning to 0.8.1 and add various small fixes.", "link": "https://www.kaggle.com/artgor/object-detection-with-pytorch-lightning", "tags": ["DL"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch", "albumentations", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-28 18:01:08", "date_scraped": "2020-12-12 20:14:55", "words": 242, "sentences": 13, "sum_nltk": "General information To get large and accurate data about wheat fields worldwide, plant scientists use image detection of \"wheat heads\"—spikes atop the plant containing grain.\nThese images are used to estimate the density and size of wheat heads in different varieties.\nFarmers can use the data to assess health and maturity when making management decisions in their fields.\nHowever, accurate wheat head detection in outdoor field images can be visually challenging.\nAdditionally, appearances vary due to maturity, color, genotype, and head orientation.\nFinally, because wheat is grown worldwide, different varieties, planting densities, patterns, and field conditions must be considered.\nIn this competition we detect wheat heads on images and return coordinates of bboxes and their confidence.\nYou can see a repository with code (can be run as a script) here: https://github.com/Erlemar/wheat The metric is IoU:  It is calculated at at different thresholds from 0.5 to 0.75 with a step size of 0.05.\nMy kernel is based on official tutorial: https://pytorch.org/tutorials/intermediate/torchvision_tutorial.html and could intersect with this cool kernel by Peter: https://www.kaggle.com/pestipeti/pytorch-starter-fasterrcnn-train But this kernel I want to show you how to use Pytorch-Lightning framework for deep learning.\nI like the concept of this library and hope you will also find it useful.", "sum_nltk_words": 193, "sum_nltk_runtime": 0.003, "sum_t5": "accurate wheat head detection in outdoor field images can be visually challenging. there is often overlap of dense wheat plants, and the wind can blur the photographs. appearances vary due to maturity, color, genotype, and head orientation. pytorch-lightning 0.7.6 is now available for download. pytorch-lightning is a free open source framework for deep learning. a kernel based on pytorch-lightning is available for download here", "sum_t5_words": 64, "sum_t5_runtime": 6.605, "runtime": 0.0, "nltk_category": "Agriculture", "nltk_category_score": 0.5532425045967102, "nltk_category_runtime": 21.832, "nltk_subcategory": "General", "nltk_subcategory_score": 0.967551052570343, "nltk_subcategory_runtime": 34.824, "category": "Agriculture", "category_score": 0.5532425045967102, "subcategory": "General", "subcategory_score": 0.967551052570343, "runtime_cat": 56.656, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.761", "language_code": "en", "language_score": "0.999998601342192", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "general information get large accurate data wheat field worldwide plant scientist use image detection wheat headsspikes atop plant containing grain image used estimate density size wheat head different variety farmer use data ass health maturity making management decision field however accurate wheat head detection outdoor field image visually challenging often overlap dense wheat plant wind blur photograph make difficult identify single head additionally appearance vary due maturity color genotype head orientation finally wheat grown worldwide different variety planting density pattern field condition must considered competition detect wheat head image return coordinate bboxes confidence see repository code run script httpsgithubcomerlemarwheat metric iou calculated different threshold 05 075 step size 005 kernel based official tutorial httpspytorchorgtutorialsintermediatetorchvision_tutorialhtml could intersect cool kernel peter httpswwwkagglecompestipetipytorchstarterfasterrcnntrain kernel want show use pytorchlightning framework deep learning like concept library hope also find useful upd code updated pytorchlightning 076 version 8 update pytorchlightning 081 add various small fix", "tags_descriptive": ["Deep Learning (DL)"]}