{"title": "Understand ARIMA and tune P, D, Q", "description": "IntroductionARIMA is one of the most classic time series forecasting models. During the modeling process, we mainly want to find 3 parameters. Auto-regression(AR) term, namly the lags of previous value; Integral(I) term for non-stationary differencing and Moving Average(MA) for error term. I'm a newbie in this field. Found many online tutorials used grid search technique(auto.arima in R). Meanwhile I also found many hypothesis test to validate the time series, i.e. see if it's stationary, looking at ACF and PACF to suggest a AR term etc... Facebook has a package called prophet, which is quite complex and consider many things automaticlly. But out of curiosity, I want to understand what's the reasoning behind the model. ARIMA is definitely a good starting point. My goal for this notebook: Understand ARIMA, SARIMA, ARIMAX   Walkthrough the necessary tests that ARIMA needs to statisfy Find a set of reasonable parameters base on a statistic tests and visualizations     Notebook Outline: ARIMA introduction   Decompose the ts Stationarize the data   Interpret ACF and PACF   Determine p, d, q Adding seasonality: S-ARMIA Adding holiday factors to be SARIMA-X  A few things on my TODO list: mulitple seasonality outlier detection", "link": "https://www.kaggle.com/sumi25/understand-arima-and-tune-p-d-q", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-08-20 07:28:05", "date_scraped": "2020-12-12 18:46:39", "words": 203, "sentences": 11, "sum_nltk": "IntroductionARIMA is one of the most classic time series forecasting models.\nDuring the modeling process, we mainly want to find 3 parameters.\nAuto-regression(AR) term, namly the lags of previous value; Integral(I) term for non-stationary differencing and Moving Average(MA) for error term.\nI'm a newbie in this field.\nFound many online tutorials used grid search technique(auto.arima in R).\nMeanwhile I also found many hypothesis test to validate the time series, i.e. see if it's stationary, looking at ACF and PACF to suggest a AR term etc...\nFacebook has a package called prophet, which is quite complex and consider many things automaticlly.\nBut out of curiosity, I want to understand what's the reasoning behind the model.\nARIMA is definitely a good starting point.\nMy goal for this notebook: Understand ARIMA, SARIMA, ARIMAX   Walkthrough the necessary tests that ARIMA needs to statisfy Find a set of reasonable parameters base on a statistic tests and visualizations     Notebook Outline: ARIMA introduction   Decompose the ts Stationarize the data   Interpret ACF and PACF   Determine p, d, q Adding seasonality: S-ARMIA Adding holiday factors to be SARIMA-X  A few things on my TODO list: mulitple seasonality outlier detection", "sum_nltk_words": 194, "sum_nltk_runtime": 0.003, "sum_t5": "a newbie in time series forecasting, john sutter writes a notebook. he says he wants to understand the reasoning behind the model. sutter: \"arIMA is definitely a good starting point\" he says he's working on a few things: mulitple seasonality outlier detection. sutter: \"the model is a good starting point\". sutter: \"the model is a good starting point\"", "sum_t5_words": 58, "sum_t5_runtime": 4.929, "runtime": 0.0, "nltk_category": "Economics", "nltk_category_score": 0.4020223021507263, "nltk_category_runtime": 21.333, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.4721093773841858, "nltk_subcategory_runtime": 34.267, "category": "Economics", "category_score": 0.4020223021507263, "subcategory": "Tools", "subcategory_score": 0.4721093773841858, "runtime_cat": 55.602, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.811", "language_code": "en", "language_score": "0.9999966001884704", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionarima one classic time series forecasting model modeling process mainly want find 3 parameter autoregressionar term namly lag previous value integrali term nonstationary differencing moving averagema error term im newbie field found many online tutorial used grid search techniqueautoarima r meanwhile also found many hypothesis test validate time series ie see stationary looking acf pacf suggest ar term etc facebook package called prophet quite complex consider many thing automaticlly curiosity want understand whats reasoning behind model arima definitely good starting point goal notebook understand arima sarima arimax walkthrough necessary test arima need statisfy find set reasonable parameter base statistic test visualization notebook outline arima introduction decompose t stationarize data interpret acf pacf determine p q adding seasonality sarmia adding holiday factor sarimax thing todo list mulitple seasonality outlier detection", "tags_descriptive": []}