{"title": "Better image tiles - Removing white spaces", "description": "Better image tiles - Simple heuristic to suppress blank regions As you might know, for this competition, it is critical to come up with an efficient way to pre-process the images. One of the key aspects that I show in my previous notebook https://www.kaggle.com/rftexas/gradcam-comparing-resnet-and-se-resnext is that as expected white regions don't convey any information, hence the need to get rid of them. Actually, one need to zoom enough in the biopsy image to make sure there is as little white as possible. This is why in this notebook, we will code a simple heuristic to generate better images that have no more blank parts. The algorithm is pretty simple actually: having a sliding window moving across the images and calculating for each region the proporition of white color in the image. Then select k regions with the lowest proportion of white. We will define the algorithm as follows:  Define a sliding window of a fixed size Slide the window with a certain stride For each region on which we slide, compute the amount of white pixels Do this for all the regions in the image Select the top k results where k is a hyperparameter   If you like those kinds of tutorials, upvote this notebook! It encourages me to keep writing some ;)  V5: I'll try to tackle pen markers now! Stay tuned! Contents 1. Importing dependencies 2. Compute statistics 3. Select k-best regions 4. Slide over the image 5. Show the results  5.1. Window size: 200, stride: 128 5.2. Window size: 128, stride: 64 5.3. Window size: 512, stride: 256", "link": "https://www.kaggle.com/rftexas/better-image-tiles-removing-white-spaces", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-22 10:36:42", "date_scraped": "2020-12-13 16:03:25", "words": 266, "sentences": 15, "sum_nltk": "Better image tiles - Simple heuristic to suppress blank regions As you might know, for this competition, it is critical to come up with an efficient way to pre-process the images.\nOne of the key aspects that I show in my previous notebook https://www.kaggle.com/rftexas/gradcam-comparing-resnet-and-se-resnext is that as expected white regions don't convey any information, hence the need to get rid of them.\nActually, one need to zoom enough in the biopsy image to make sure there is as little white as possible.\nThis is why in this notebook, we will code a simple heuristic to generate better images that have no more blank parts.\nThe algorithm is pretty simple actually: having a sliding window moving across the images and calculating for each region the proporition of white color in the image.\nThen select k regions with the lowest proportion of white.\nWe will define the algorithm as follows:  Define a sliding window of a fixed size Slide the window with a certain stride For each region on which we slide, compute the amount of white pixels Do this for all the regions in the image Select the top k results where k is a hyperparameter   If you like those kinds of tutorials, upvote this notebook!", "sum_nltk_words": 202, "sum_nltk_runtime": 0.003, "sum_t5": "a sliding window is used to select regions with the lowest proportion of white. the algorithm is pretty simple actually. if you like those kinds of tutorials, upvote this notebook!. if you like those kinds of tutorials, upvote this notebook!. cnn.com/video/v5: gradcam-comparing-resnet-and-se-resnext...", "sum_t5_words": 42, "sum_t5_runtime": 5.683, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.5914627313613892, "nltk_category_runtime": 18.441, "nltk_subcategory": "Tools", "nltk_subcategory_score": 0.7284599542617798, "nltk_subcategory_runtime": 29.248, "category": "Utilities", "category_score": 0.5914627313613892, "subcategory": "Tools", "subcategory_score": 0.7284599542617798, "runtime_cat": 47.689, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.691", "language_code": "en", "language_score": "0.9999956111617786", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "better image tile simple heuristic suppress blank region might know competition critical come efficient way preprocess image one key aspect show previous notebook httpswwwkagglecomrftexasgradcamcomparingresnetandseresnext expected white region dont convey information hence need get rid actually one need zoom enough biopsy image make sure little white possible notebook code simple heuristic generate better image blank part algorithm pretty simple actually sliding window moving across image calculating region proporition white color image select k region lowest proportion white define algorithm follows define sliding window fixed size slide window certain stride region slide compute amount white pixel region image select top k result k hyperparameter like kind tutorial upvote notebook encourages keep writing v5 ill try tackle pen marker stay tuned content 1 importing dependency 2 compute statistic 3 select kbest region 4 slide image 5 show result 51 window size 200 stride 128 52 window size 128 stride 64 53 window size 512 stride 256", "tags_descriptive": []}