{"title": "Single_QDA_LB_0.96610_time<_1_min", "description": "DescriptionUPDATE: In this version of the kernel we will try to test the idea of selecting features using LOFO. For more details about LOFO please see Ahmet Erdem's kernel available at this link. The feature selection step is going to slow down the training process, so this new version will run longer than 1 minute. If you want to see the original kernel that runs less than a minute please refer to Version 1 of this kernel. The original kernel scores 0.99610 on the LB. Unfortunately, we won't be able to use this result as a baseline for comparison because we won't be able to submit our work to LB: in order for LOFO to work, an external package, lofo-importance, must be loaded but the usage of external packages is banned by the competion rules. However, it is possible to compute the cross-validation score for the QDA model without LOFO. As a matter of fact, I have already done it in a different kernel: link (see the \"Repeat Using the Standard Parameters\" section). The result was a CV score of 0.96629.  Let's see if selecting features with LOFO can improve this baseline. SPOILER: Basically, the resutl is very inconclusive -- the combined AUC went up from 0.96629 to 0.96727, the fold-average AUC went down from 0.96628 to 0.96213, and the standard deviation increased from 9e-05 to 0.0097. It would be nice to submit it to the LB to see how well it performs.", "link": "https://www.kaggle.com/graf10a/single-qda-lb-0-96610-time-1-min", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-06-03 19:57:26", "date_scraped": "2020-12-13 11:53:26", "words": 244, "sentences": 12, "sum_nltk": "DescriptionUPDATE: In this version of the kernel we will try to test the idea of selecting features using LOFO.\nFor more details about LOFO please see Ahmet Erdem's kernel available at this link.\nThe feature selection step is going to slow down the training process, so this new version will run longer than 1 minute.\nIf you want to see the original kernel that runs less than a minute please refer to Version 1 of this kernel.\nThe original kernel scores 0.99610 on the LB.\nUnfortunately, we won't be able to use this result as a baseline for comparison because we won't be able to submit our work to LB: in order for LOFO to work, an external package, lofo-importance, must be loaded but the usage of external packages is banned by the competion rules.\nHowever, it is possible to compute the cross-validation score for the QDA model without LOFO.\nAs a matter of fact, I have already done it in a different kernel: link (see the \"Repeat Using the Standard Parameters\" section).\nThe result was a CV score of 0.96629.\nLet's see if selecting features with LOFO can improve this baseline.\nIt would be nice to submit it to the LB to see how well it performs.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.003, "sum_t5": "a new kernel will try to test the idea of selecting features using LOFO. the feature selection step is going to slow down the training process. the original kernel scores 0.99610 on the LB. it is possible to compute the cross-validation score without LOFO. the result was a CV score of 0.96629. a similar test was done in a different kernel. a similar test was done in a different kernel.", "sum_t5_words": 70, "sum_t5_runtime": 5.845, "runtime": 0.006, "nltk_category": "Utilities", "nltk_category_score": 0.4731261432170868, "nltk_category_runtime": 18.744, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.7433253526687622, "nltk_subcategory_runtime": 29.815, "category": "Utilities", "category_score": 0.4731261432170868, "subcategory": "Machine Learning", "subcategory_score": 0.7433253526687622, "runtime_cat": 48.56, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.711", "language_code": "en", "language_score": "0.9999961121593252", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "descriptionupdate version kernel try test idea selecting feature using lofo detail lofo please see ahmet erdems kernel available link feature selection step going slow training process new version run longer 1 minute want see original kernel run le minute please refer version 1 kernel original kernel score 099610 lb unfortunately wont able use result baseline comparison wont able submit work lb order lofo work external package lofoimportance must loaded usage external package banned competion rule however possible compute crossvalidation score qda model without lofo matter fact already done different kernel link see repeat using standard parameter section result cv score 096629 let see selecting feature lofo improve baseline spoiler basically resutl inconclusive combined auc went 096629 096727 foldaverage auc went 096628 096213 standard deviation increased 9e05 00097 would nice submit lb see well performs", "tags_descriptive": []}