{"title": " Kaggle DeepFake Detection Introduction", "description": "Can you detect the deepfake? Come here for a summary? Here is a tl;dr:  I strongly encourage you start first with the official Getting Started guide here. What is the goal of the Deepfake Detection Challenge? According to the FAQ \"The AI technologies that power deepfakes and other tampered media are rapidly evolving, making deepfakes so hard to detect that, at times, even human evaluators can’t reliably tell the difference. The Deepfake Detection Challenge is designed to incentivize rapid progress in this area by inviting participants to compete to create new ways of detecting and preventing manipulated media.\" This is a Code Competition: CPU Notebook <= 9 hours run-time, GPU Notebook <= 9 hours run-time on Kaggle's P100 GPUs, No internet access enabled External data is allowed up to 1 GB in size. External data must be freely & publicly available, including pre-trained models   This code competition's training set is not available directly on Kaggle, as its size is prohibitively large to train in Kaggle. Instead, it's strongly recommended that you train offline and load the externally trained model as an external dataset into Kaggle Notebooks to perform inference on the Test Set. Review Getting Started for more detailed information.", "link": "https://www.kaggle.com/robikscube/kaggle-deepfake-detection-introduction", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "face_recognition", "Pillow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-12-22 14:50:28", "date_scraped": "2020-12-12 18:44:56", "words": 203, "sentences": 6, "sum_nltk": "Can you detect the deepfake?\nCome here for a summary?\nHere is a tl;dr:  I strongly encourage you start first with the official Getting Started guide here.\nWhat is the goal of the Deepfake Detection Challenge?\nAccording to the FAQ \"The AI technologies that power deepfakes and other tampered media are rapidly evolving, making deepfakes so hard to detect that, at times, even human evaluators can’t reliably tell the difference.\nThe Deepfake Detection Challenge is designed to incentivize rapid progress in this area by inviting participants to compete to create new ways of detecting and preventing manipulated media.\" This is a Code Competition: CPU Notebook <= 9 hours run-time, GPU Notebook <= 9 hours run-time on Kaggle's P100 GPUs, No internet access enabled External data is allowed up to 1 GB in size.\nExternal data must be freely & publicly available, including pre-trained models   This code competition's training set is not available directly on Kaggle, as its size is prohibitively large to train in Kaggle.\nInstead, it's strongly recommended that you train offline and load the externally trained model as an external dataset into Kaggle Notebooks to perform inference on the Test Set. Review Getting Started for more detailed information.", "sum_nltk_words": 196, "sum_nltk_runtime": 0.002, "sum_t5": "the deepfake Detection challenge is designed to incentivize rapid progress in this area. it's designed to incentivize rapid progress in this area by inviting participants to compete. this is a code competition: CPU Notebook = 9 hours run-time, GPU Notebook = 9 hours run-time. external data is allowed up to 1 GB in size. it's strongly recommended that you train offline and load the externally trained model as an external dataset.", "sum_t5_words": 71, "sum_t5_runtime": 5.105, "runtime": 0.01, "nltk_category": "Justice, Law and Regulations", "nltk_category_score": 0.3733714520931244, "nltk_category_runtime": 18.515, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.660641610622406, "nltk_subcategory_runtime": 29.566, "category": "Justice, Law and Regulations", "category_score": 0.3733714520931244, "subcategory": "Machine Learning", "subcategory_score": 0.660641610622406, "runtime_cat": 48.081, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.797", "language_code": "en", "language_score": "0.9999953874820989", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "detect deepfake come summary tldr strongly encourage start first official getting started guide goal deepfake detection challenge according faq ai technology power deepfakes tampered medium rapidly evolving making deepfakes hard detect time even human evaluator cant reliably tell difference deepfake detection challenge designed incentivize rapid progress area inviting participant compete create new way detecting preventing manipulated medium code competition cpu notebook 9 hour runtime gpu notebook 9 hour runtime kaggles p100 gpus internet access enabled external data allowed 1 gb size external data must freely publicly available including pretrained model code competition training set available directly kaggle size prohibitively large train kaggle instead strongly recommended train offline load externally trained model external dataset kaggle notebook perform inference test set review getting started detailed information", "tags_descriptive": []}