{"title": "Protein Atlas - Exploration and Baseline", "description": "Welcome to the Human Protein Atlas Competition!I started this kernel notebook to explore the data and build a simple baseline model to play with. I have never mind that the results are useful for many kagglers that like to start with the competition but need some starter code or some inspiration. Thank you for pushing this kernel that far! :-) If you have just found this kernel, here is a short summary of what you can find:  Encoding of binary target labels out of the given multilabel list per image, Visual analysis of target protein distribution in the train set, A simple image generator that yields images of a target-protein-wishlist. Each sample that has at least one match with this list is returned. Some ideas on validation. A baseline model build with keras that is supported by: A modelparameter class that holds all parameters that are necessary to build the model, to load the data and to preprocess the images. A data generator that can be used with CPU/GPU computing to perform training and validation. An image preprocessor that rescales, reshapes and normalizes the images for feeding into the model.   Ideas on how to improve the baseline model by tracking loss with a keras callback.  Some ideas on how to proceed. (coming soon)", "link": "https://www.kaggle.com/allunia/protein-atlas-exploration-and-baseline", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["keras", "tensorflow", "sklearn", "pattern", "skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-07-12 14:17:33", "date_scraped": "2020-12-12 21:26:50", "words": 217, "sentences": 11, "sum_nltk": "Welcome to the Human Protein Atlas Competition!I started this kernel notebook to explore the data and build a simple baseline model to play with.\nI have never mind that the results are useful for many kagglers that like to start with the competition but need some starter code or some inspiration.\n:-) If you have just found this kernel, here is a short summary of what you can find:  Encoding of binary target labels out of the given multilabel list per image, Visual analysis of target protein distribution in the train set, A simple image generator that yields images of a target-protein-wishlist.\nEach sample that has at least one match with this list is returned.\nSome ideas on validation.\nA baseline model build with keras that is supported by: A modelparameter class that holds all parameters that are necessary to build the model, to load the data and to preprocess the images.\nA data generator that can be used with CPU/GPU computing to perform training and validation.\nAn image preprocessor that rescales, reshapes and normalizes the images for feeding into the model.\nIdeas on how to improve the baseline model by tracking loss with a keras callback.\nSome ideas on how to proceed.", "sum_nltk_words": 195, "sum_nltk_runtime": 0.002, "sum_t5": "a kernel notebook was created to explore the data and build a simple baseline model. the results are useful for many kagglers that like to start with the competition but need some inspiration. a data generator that can be used with CPU/GPU computing to perform training and validation. a kernel notebook is available for download here. a kernel notebook is available for download here...... a kernel notebook is available for download here.", "sum_t5_words": 72, "sum_t5_runtime": 4.888, "runtime": 0.0, "nltk_category": "Utilities", "nltk_category_score": 0.3554336130619049, "nltk_category_runtime": 17.315, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.8757966756820679, "nltk_subcategory_runtime": 28.057, "category": "Utilities", "category_score": 0.3554336130619049, "subcategory": "Machine Learning", "subcategory_score": 0.8757966756820679, "runtime_cat": 45.372, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.81", "language_code": "en", "language_score": "0.9999973484213993", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "welcome human protein atlas competitioni started kernel notebook explore data build simple baseline model play never mind result useful many kagglers like start competition need starter code inspiration thank pushing kernel far found kernel short summary find encoding binary target label given multilabel list per image visual analysis target protein distribution train set simple image generator yield image targetproteinwishlist sample least one match list returned idea validation baseline model build kera supported modelparameter class hold parameter necessary build model load data preprocess image data generator used cpugpu computing perform training validation image preprocessor rescales reshapes normalizes image feeding model idea improve baseline model tracking loss kera callback idea proceed coming soon", "tags_descriptive": ["Exploratory Data Analysis"]}