{"title": "VSB Power Line Fault Detection Approach", "description": "VSB Power Line Fault DetectionMedium voltage overhead power lines run for hundreds of miles to supply power to cities. These great distances make it expensive to manually inspect the lines for damage that doesn't immediately lead to a power outage, such as a tree branch hitting the line or a flaw in the insulator. These modes of damage lead to a phenomenon known as partial discharge — an electrical discharge which does not bridge the electrodes between an insulation system completely. Partial discharges slowly damage the power line, so left unrepaired they will eventually lead to a power outage or start a fire. Your challenge is to detect partial discharge patterns in signals acquired from these power lines with a new meter designed at the ENET Centre at VŠB. Effective classifiers using this data will make it possible to continuously monitor power lines for faults. ENET Centre researches and develops renewable energy resources with the goal of reducing or eliminating harmful environmental impacts. Their efforts focus on developing technology solutions around transportation and processing of energy raw materials. By developing a solution to detect partial discharge you’ll help reduce maintenance costs, and prevent power outages. The full git repo for my approach to this project is at: https://github.com/jeffreyegan/VSB_Power_Line_Fault_Detection  Data Exploration and PreparationData DescriptionFaults in electric transmission lines can lead to a destructive phenomenon called partial discharge. If left alone, partial discharges can damage equipment to the point that it stops functioning entirely. Your challenge is to detect partial discharges so that repairs can be made before any lasting harm occurs. Each signal contains 800,000 measurements of a power line's voltage, taken over 20 milliseconds. As the underlying electric grid operates at 50 Hz, this means each signal covers a single complete grid cycle. The grid itself operates on a 3-phase power scheme, and all three phases are measured simultaneously. File Descriptionsmetadata_[train/test].csv  id_measurement: the ID code for a trio of signals recorded at the same time. signal_id: the foreign key for the signal data. Each signal ID is unique across both train and test, so the first ID in train is '0' but the first ID in test is '8712'. phase: the phase ID code within the signal trio. The phases may or may not all be impacted by a fault on the line. target: 0 if the power line is undamaged, 1 if there is a fault.  [train/test].parquet : The signal data. Each column contains one signal; 800,000 int8 measurements as exported with pyarrow.parquet version 0.11. Please note that this is different than our usual data orientation of one row per observation; the switch makes it possible loading a subset of the signals efficiently. If you haven't worked with Apache Parquet before, please refer to either the Python data loading starter kernel. sample_submission.csv: a valid sample submission. Data Background InformationAs you may notice, the signal data comes from the real environment, not a lab, and they contain a lot of background noise. These signals are measured by our patented device with lower sampling rate (cost efficiency purpose) therefore I do not recommend to use any other publicly available dataset containing partial discharge patterns (PD patterns). - also we deployed the metering devices on more than 20 different locations. This implies that the spectrum of noise and quality of PD's are so different from each other, that the correct and robust classification is a still ongoing problem (the main motivation of this competition). The comparison and broadening of our view is also considered as beneficial and necessary in our research. PD pattern is therefore the main star tonight and there is a lot of literature about this phenomenon. I would recommend to read some papers, during my dissertation I tried a lot of different feature extraction models, but those based on fundamentals worked the best. In general the imbalanced dataset is very natural because PD pattern implies some degradation or damage of the observed system which is happening (fortunately) less often than the states when the system is operating correctly. In our case, the measurements on the medium voltage overhead lines, PD pattern may look like this (pd_pattern.png). But because of a lot of various noise interference (overhead lines work as a huge antena grabbing all signals around), a lot of interpolated patterns may look similar (see samples.png). To use any kind of wavelet transformation is very reasonable, butterworth filter was helpful for me to suppress the sine shape, DWT to obtain its close approximation - sometimes it is disrupted, and denoising with feature extractions are the alchemy of this competition. Load Data", "link": "https://www.kaggle.com/jeffreyegan/vsb-power-line-fault-detection-approach", "tags": ["Random Forest", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern", "statsmodels"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-03-09 23:21:55", "date_scraped": "2020-12-13 18:09:07", "words": 765, "sentences": 38, "sum_nltk": "Partial discharges slowly damage the power line, so left unrepaired they will eventually lead to a power outage or start a fire.\nYour challenge is to detect partial discharge patterns in signals acquired from these power lines with a new meter designed at the ENET Centre at VŠB.\nEffective classifiers using this data will make it possible to continuously monitor power lines for faults.\nBy developing a solution to detect partial discharge you’ll help reduce maintenance costs, and prevent power outages.\nThe full git repo for my approach to this project is at: https://github.com/jeffreyegan/VSB_Power_Line_Fault_Detection  Data Exploration and PreparationData DescriptionFaults in electric transmission lines can lead to a destructive phenomenon called partial discharge.\nEach signal contains 800,000 measurements of a power line's voltage, taken over 20 milliseconds.\nFile Descriptionsmetadata_[train/test].csv  id_measurement: the ID code for a trio of signals recorded at the same time.\nThese signals are measured by our patented device with lower sampling rate (cost efficiency purpose) therefore I do not recommend to use any other publicly available dataset containing partial discharge patterns (PD patterns).\nBut because of a lot of various noise interference (overhead lines work as a huge antena grabbing all signals around), a lot of interpolated patterns may look similar (see samples.png).", "sum_nltk_words": 199, "sum_nltk_runtime": 0.01, "sum_t5": "a new meter is being developed at the vb power plant. it will detect partial discharge patterns in signals acquired from power lines. this will help reduce maintenance costs, and prevent power outages. the meter will also be able to detect faults before they are even discovered. the meter will be available in january and will be available in november. if successful, it will be available in november.", "sum_t5_words": 68, "sum_t5_runtime": 6.214, "runtime": 0.009, "nltk_category": "Finance", "nltk_category_score": 0.6206687092781067, "nltk_category_runtime": 20.326, "nltk_subcategory": "Physical", "nltk_subcategory_score": 0.7236891984939575, "nltk_subcategory_runtime": 32.387, "category": "Finance", "category_score": 0.6206687092781067, "subcategory": "Physical", "subcategory_score": 0.7236891984939575, "runtime_cat": 52.714, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.717", "language_code": "en", "language_score": "0.9999973547124942", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "vsb power line fault detectionmedium voltage overhead power line run hundred mile supply power city great distance make expensive manually inspect line damage doesnt immediately lead power outage tree branch hitting line flaw insulator mode damage lead phenomenon known partial discharge electrical discharge bridge electrode insulation system completely partial discharge slowly damage power line left unrepaired eventually lead power outage start fire challenge detect partial discharge pattern signal acquired power line new meter designed enet centre vsb effective classifier using data make possible continuously monitor power line fault enet centre research develops renewable energy resource goal reducing eliminating harmful environmental impact effort focus developing technology solution around transportation processing energy raw material developing solution detect partial discharge youll help reduce maintenance cost prevent power outage full git repo approach project httpsgithubcomjeffreyeganvsb_power_line_fault_detection data exploration preparationdata descriptionfaults electric transmission line lead destructive phenomenon called partial discharge left alone partial discharge damage equipment point stop functioning entirely challenge detect partial discharge repair made lasting harm occurs signal contains 800000 measurement power line voltage taken 20 millisecond underlying electric grid operates 50 hz mean signal cover single complete grid cycle grid operates 3phase power scheme three phase measured simultaneously file descriptionsmetadata_traintestcsv id_measurement id code trio signal recorded time signal_id foreign key signal data signal id unique across train test first id train 0 first id test 8712 phase phase id code within signal trio phase may may impacted fault line target 0 power line undamaged 1 fault traintestparquet signal data column contains one signal 800000 int8 measurement exported pyarrowparquet version 011 please note different usual data orientation one row per observation switch make possible loading subset signal efficiently havent worked apache parquet please refer either python data loading starter kernel sample_submissioncsv valid sample submission data background informationas may notice signal data come real environment lab contain lot background noise signal measured patented device lower sampling rate cost efficiency purpose therefore recommend use publicly available dataset containing partial discharge pattern pd pattern also deployed metering device 20 different location implies spectrum noise quality pd different correct robust classification still ongoing problem main motivation competition comparison broadening view also considered beneficial necessary research pd pattern therefore main star tonight lot literature phenomenon would recommend read paper dissertation tried lot different feature extraction model based fundamental worked best general imbalanced dataset natural pd pattern implies degradation damage observed system happening fortunately le often state system operating correctly case measurement medium voltage overhead line pd pattern may look like pd_patternpng lot various noise interference overhead line work huge antena grabbing signal around lot interpolated pattern may look similar see samplespng use kind wavelet transformation reasonable butterworth filter helpful suppress sine shape dwt obtain close approximation sometimes disrupted denoising feature extraction alchemy competition load data", "tags_descriptive": ["Random Forest", "Feature Engineering"]}