{"title": "What The No*ise? ", "description": "A Quick Look at Selected Text Noise In this notebook, I am exploring the noise in the dataset. I analysed the selected_text column in the original dataset. I compared selected_text with the prediction of a reference model to find out why I am getting low performance in positive and negative sentiment predictions.  Reference ModelI am using prediction of a trained model (5 fold ensemble of a RoBERTa-Base with public LB 0.712) to find out anamolies. I can identify many of them by performing error analysis. In particular, when my Jaccard score is very low, many times it's due to the inherent noise in the data.  Can We Use It For Our Benefits?   If you find it useful, please upvote! Thank you!  N.B. I just listed a few noise. At the end of the notebook you can generate random samples to find more variety of noise.", "link": "https://www.kaggle.com/debanga/what-the-no-ise", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-05 06:20:29", "date_scraped": "2020-12-13 17:53:52", "words": 150, "sentences": 9, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.40685054659843445, "description_category_runtime": 13.255, "description_subcategory": "Tools", "description_subcategory_score": 0.6312244534492493, "description_subcategory_runtime": 20.833, "category": "Finance", "category_score": 0.40685054659843445, "subcategory": "Tools", "subcategory_score": 0.6312244534492493, "runtime_cat": 34.088, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.689", "language_code": "en", "language_score": "0.9999971174618015", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "quick look selected text noise notebook exploring noise dataset analysed selected_text column original dataset compared selected_text prediction reference model find getting low performance positive negative sentiment prediction reference modeli using prediction trained model 5 fold ensemble robertabase public lb 0712 find anamolies identify many performing error analysis particular jaccard score low many time due inherent noise data use benefit find useful please upvote thank nb listed noise end notebook generate random sample find variety noise", "tags_descriptive": ["Exploratory Data Analysis"]}