{"title": "Google Analytics EDA + LightGBM + Screenshots", "description": "IntroductionKaggle describes this competition as follows: In this competition, you’re challenged to analyze a Google Merchandise Store (also known as GStore, where Google swag is sold) customer dataset to predict revenue per customer. Hopefully, the outcome will be more actionable operational changes and a better use of marketing budgets for those companies who choose to use data analysis on top of GA data. For each fullVisitorId in the test set, you must predict the natural log of their total revenue. Submissions are scored on the root mean squared error (RMSE).  This kernel contains an EDA, a Baseline LightGBM model, and also Screenshots of the app. Since I am familiar with Google Analytics and also have the Google Mechandising store setup as a property in my personal environment, I though it would be good to start with some screen shots of the actual application. In the comments, the question was raised \"how I did this\". Well, actually this is pretty easy to setup, and you can find out how to do that through this link: Learn by experimenting with data from the Google Merchandise Store.. However, once I really got started with the EDA, I increasingly found the large screenshots to become a bit distracting and I decided to separate these from the EDA and move them to an Appendix. To go straight to the screenshots: Appendix: Screenshots. Table of contents 1. Loading libraries and data  2. EDA  2.1 Missing data 2.2 The response variable; transactionRevenue 2.3 Time series and grouping by workday and by month 2.3.1 Time series of sessions and revenues by Date 2.3.2 Sessions and revenues by Workday 2.3.3 Sessions and revenues by Month   2.4 Channel grouping and the source/medium dimension 2.4.1 Channel grouping 2.4.2 The source/medium dimension   2.5 Operating system, browser and device category 2.5.1 Device category 2.5.2 Operating system 2.5.3 Browser   2.6 Pageviews, Bounces and Hits 2.6.1 Pageviews; all sessions. 2.6.2 Pageviews; only sessions with any transaction revenue. 2.6.3 Pageviews versus percent transactions 2.6.4 Bounces 2.6.5 Hits   2.7 Sessions, revenues and transactions by country   3. LightGBM Model  Appendix: Screenshots of the app", "link": "https://www.kaggle.com/erikbruin/google-analytics-eda-lightgbm-screenshots", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern", "lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-11 11:34:27", "date_scraped": "2020-12-12 20:08:17", "words": 360, "sentences": 16, "sum_nltk": "IntroductionKaggle describes this competition as follows: In this competition, you’re challenged to analyze a Google Merchandise Store (also known as GStore, where Google swag is sold) customer dataset to predict revenue per customer.\nThis kernel contains an EDA, a Baseline LightGBM model, and also Screenshots of the app.\nSince I am familiar with Google Analytics and also have the Google Mechandising store setup as a property in my personal environment, I though it would be good to start with some screen shots of the actual application.\nWell, actually this is pretty easy to setup, and you can find out how to do that through this link: Learn by experimenting with data from the Google Merchandise Store..\nHowever, once I really got started with the EDA, I increasingly found the large screenshots to become a bit distracting and I decided to separate these from the EDA and move them to an Appendix.\n2.6.2 Pageviews; only sessions with any transaction revenue.\n2.6.3 Pageviews versus percent transactions 2.6.4 Bounces 2.6.5 Hits   2.7 Sessions, revenues and transactions by country   3.\nLightGBM Model  Appendix: Screenshots of the app", "sum_nltk_words": 181, "sum_nltk_runtime": 0.004, "sum_t5": "this kernel contains an EDA, a Baseline LightGBM model, and also Screenshots of the app. if you’re a developer, you’ll need to use a gapp to analyze data. if you’re a developer, you’ll need to use a gapp to analyze data. if you’re a developer, you’ll need to use a gapp to analyze data.", "sum_t5_words": 54, "sum_t5_runtime": 6.293, "runtime": 0.005, "nltk_category": "Economics", "nltk_category_score": 0.18120896816253662, "nltk_category_runtime": 18.128, "nltk_subcategory": "Student", "nltk_subcategory_score": 0.2881525158882141, "nltk_subcategory_runtime": 28.768, "category": "Economics", "category_score": 0.18120896816253662, "subcategory": "Student", "subcategory_score": 0.2881525158882141, "runtime_cat": 46.897, "programming_language": "R notebook", "ml_score": "1.0", "engagement_score": "0.794", "language_code": "en", "language_score": "0.9999964758734968", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionkaggle describes competition follows competition youre challenged analyze google merchandise store also known gstore google swag sold customer dataset predict revenue per customer hopefully outcome actionable operational change better use marketing budget company choose use data analysis top ga data fullvisitorid test set must predict natural log total revenue submission scored root mean squared error rmse kernel contains eda baseline lightgbm model also screenshots app since familiar google analytics also google mechandising store setup property personal environment though would good start screen shot actual application comment question raised well actually pretty easy setup find link learn experimenting data google merchandise store however really got started eda increasingly found large screenshots become bit distracting decided separate eda move appendix go straight screenshots appendix screenshots table content 1 loading library data 2 eda 21 missing data 22 response variable transactionrevenue 23 time series grouping workday month 231 time series session revenue date 232 session revenue workday 233 session revenue month 24 channel grouping sourcemedium dimension 241 channel grouping 242 sourcemedium dimension 25 operating system browser device category 251 device category 252 operating system 253 browser 26 pageviews bounce hit 261 pageviews session 262 pageviews session transaction revenue 263 pageviews versus percent transaction 264 bounce 265 hit 27 session revenue transaction country 3 lightgbm model appendix screenshots app", "tags_descriptive": ["Exploratory Data Analysis"]}