{"title": "Santa Finances - A Closer Look at the Costs", "description": "How to Schedule Cost Effective Santa Workshop Tours?Seems like the Santa underestimated the families enthusiasm! In order to make everyone happy and not blow a hole in his pocket, lets show Santa some plots to help him understanding his financial costs! Key Discussions : How big are the families interested in the tour? How much would the consolation gifts cost the Santa, if families can't get their preferred choices? How does the accounting cost behave, given different combination of tour plans?  Important Update: Fixed the formula for accounting cost, in the previous version, the absolute of difference was not taken. Fixed the exponent formula (+ instead of -), seems like the evaluation metric page got updated.", "link": "https://www.kaggle.com/chewzy/santa-finances-a-closer-look-at-the-costs", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-11-28 04:17:00", "date_scraped": "2020-12-13 16:58:59", "words": 117, "sentences": 2, "runtime": 0.002, "description_category": "Finance", "description_category_score": 0.7478252649307251, "description_category_runtime": 10.034, "description_subcategory": "Preventative and Reactive", "description_subcategory_score": 0.7718306183815002, "description_subcategory_runtime": 15.415, "category": "Finance", "category_score": 0.7478252649307251, "subcategory": "Preventative and Reactive", "subcategory_score": 0.7718306183815002, "runtime_cat": 25.449, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.747", "language_code": "en", "language_score": "0.9999973090026519", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "schedule cost effective santa workshop toursseems like santa underestimated family enthusiasm order make everyone happy blow hole pocket let show santa plot help understanding financial cost key discussion big family interested tour much would consolation gift cost santa family cant get preferred choice accounting cost behave given different combination tour plan important update fixed formula accounting cost previous version absolute difference taken fixed exponent formula instead seems like evaluation metric page got updated", "tags_descriptive": ["Exploratory Data Analysis"]}