{"title": "Summary - Budapest Pythons", "description": "Summary Slides PDFIntroductionSince 2002 alone, the NFL has made 50 rules changes intended to eliminate potentially dangerous tactics and reduce the risk of injuries. Yet the yearly reported concussions does not decrease. We are glad that player safety gets more and more attention. Big Data and Data Science was probably used to improve NFL athlete performance before the term became sexy.  Now it's our turn to make punts safer! Beside the challenging problem and dataset, the competition gave us a good excuse to watch as many games as possible. Previously punts were not our favorite part of the game, however as we watched them more closely we must admit they could be pretty cool! Blocked punts, fake punts, punt return TDs even the lucky out of bounds were exciting. Unfortunately injury or concussion happens way more often than blocked punts or TDs. Obviously we would not want to eliminate punts or turn it into a ceremonial play. However, things has to be changed. Low sample high diversityWe got detailed description and video footage for 37 concussions that happened during more than 6600 punt plays. The low number of control events made the task more challenging.  While 6600 punt plays might feel like a lot, with the low overall concussion probability you have to be careful to not to overfit. It is especially true when you crunch the data for a month you will likely find patterns that are not significant. The tale of the left and right gunnersWe found that 4 left gunners and 1 right gunner suffered concussions. Does it really mean that being a left gunner is more dangerous? It would be surprising, right?  The truth is that we don't know. Statistically speaking the difference is insignificant. When we check all the collisions on the field we see symmetric distributions.  On the other hand we watched the injury videos over and over again to understand the dataset and the problem better.  It became clear that there is not a single rule that fits all the incidents. Many of the injuries were unfortunate accidents (e.g. friendly fire) injured players had different activity (blocked, blocking, tackled, tackling) impact type (body or helmet) role (returner, gunner, wing, guard, line). We also hope that the recently introduced weapon as a helmet rule already reduced the most serious impacts. We could not confirm it though as we don't have concussion results for the current season. External dataThe competition provided only punt plays. However punts are not isolated. They are often the last desperate event after an exhausting drive. How successful is the punt? That depends a lot on the next drive. We used additional external data be able to better understand the game overall.  Special thanks to Maksim Horowitz for providing detailed play data for seasons 2009-2017 with more than 400,000 plays. We find it crucial to use all available data to answer game integrity related questions. Since we had to deal with different data sources and sometimes noisy free text fields we often used available aggregated statistics for sanity check. Methodology Overview the collisions frame by frame Collect more data Understand relevant medical studies Calculate important features (speed, acceleration, collision) from NGS Derive insights from detailed play descriptions and overall statistics Check the current NFL, NCAA rules and recent modifications Consult with coaches  KernelsReproducibility is crucial for research and we took it seriously. Please check out our kernels for more details with interactive plots and source code.  Exploratory Data Analysis & External Data The Speed, the Acceleration and the Collision  Example injury video", "link": "https://www.kaggle.com/gaborfodor/summary-budapest-pythons", "tags": ["Exploratory Data Analysis", "Sports"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-01-22 14:44:46", "date_scraped": "2020-12-13 14:25:09", "words": 600, "sentences": 34, "sum_nltk": "Summary Slides PDFIntroductionSince 2002 alone, the NFL has made 50 rules changes intended to eliminate potentially dangerous tactics and reduce the risk of injuries.\nUnfortunately injury or concussion happens way more often than blocked punts or TDs. Obviously we would not want to eliminate punts or turn it into a ceremonial play.\nLow sample high diversityWe got detailed description and video footage for 37 concussions that happened during more than 6600 punt plays.\nWhile 6600 punt plays might feel like a lot, with the low overall concussion probability you have to be careful to not to overfit.\nOn the other hand we watched the injury videos over and over again to understand the dataset and the problem better.\nExternal dataThe competition provided only punt plays.\nSince we had to deal with different data sources and sometimes noisy free text fields we often used available aggregated statistics for sanity check.\nMethodology Overview the collisions frame by frame Collect more data Understand relevant medical studies Calculate important features (speed, acceleration, collision) from NGS Derive insights from detailed play descriptions and overall statistics Check the current NFL, NCAA rules and recent modifications Consult with coaches  KernelsReproducibility is crucial for research and we took it seriously.", "sum_nltk_words": 196, "sum_nltk_runtime": 0.007, "sum_t5": "the NFL has made 50 rules changes intended to eliminate potentially dangerous tactics. yet the yearly reported concussions does not decrease. the nfl is working on improving punt safety by implementing a new rule. the nfl is also working on a new rule that will make punts safer. the nfl is also working on a new rule that will make punts safer. a new rule will allow players to be more cautious when playing punts.", "sum_t5_words": 75, "sum_t5_runtime": 7.025, "runtime": 0.005, "nltk_category": "Education & Research", "nltk_category_score": 0.8106157183647156, "nltk_category_runtime": 17.089, "nltk_subcategory": "Preventative and Reactive", "nltk_subcategory_score": 0.8470455408096313, "nltk_subcategory_runtime": 26.997, "category": "Education & Research", "category_score": 0.8106157183647156, "subcategory": "Preventative and Reactive", "subcategory_score": 0.8470455408096313, "runtime_cat": 44.087, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.698", "language_code": "en", "language_score": "0.9999961901923871", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "summary slide pdfintroductionsince 2002 alone nfl made 50 rule change intended eliminate potentially dangerous tactic reduce risk injury yet yearly reported concussion decrease glad player safety get attention big data data science probably used improve nfl athlete performance term became sexy turn make punt safer beside challenging problem dataset competition gave u good excuse watch many game possible previously punt favorite part game however watched closely must admit could pretty cool blocked punt fake punt punt return tds even lucky bound exciting unfortunately injury concussion happens way often blocked punt tds obviously would want eliminate punt turn ceremonial play however thing changed low sample high diversitywe got detailed description video footage 37 concussion happened 6600 punt play low number control event made task challenging 6600 punt play might feel like lot low overall concussion probability careful overfit especially true crunch data month likely find pattern significant tale left right gunnerswe found 4 left gunner 1 right gunner suffered concussion really mean left gunner dangerous would surprising right truth dont know statistically speaking difference insignificant check collision field see symmetric distribution hand watched injury video understand dataset problem better became clear single rule fit incident many injury unfortunate accident eg friendly fire injured player different activity blocked blocking tackled tackling impact type body helmet role returner gunner wing guard line also hope recently introduced weapon helmet rule already reduced serious impact could confirm though dont concussion result current season external datathe competition provided punt play however punt isolated often last desperate event exhausting drive successful punt depends lot next drive used additional external data able better understand game overall special thanks maksim horowitz providing detailed play data season 20092017 400000 play find crucial use available data answer game integrity related question since deal different data source sometimes noisy free text field often used available aggregated statistic sanity check methodology overview collision frame frame collect data understand relevant medical study calculate important feature speed acceleration collision ng derive insight detailed play description overall statistic check current nfl ncaa rule recent modification consult coach kernelsreproducibility crucial research took seriously please check kernel detail interactive plot source code exploratory data analysis external data speed acceleration collision example injury video", "tags_descriptive": ["Exploratory Data Analysis", "Sports"]}