{"title": "EDA->EfficientNet->Creating video [PyTorch]", "description": "Some notesThis notebook contains EDA, EfficientNet, and Creating video from training images. Likbez on topic:  Structure of a cell: [en] playlist or [rus] playlist Generation and action of siRNAs and miRNAs:  [en] 7 min video or [rus] 5 min video Brief introduction from rxrx: https://www.rxrx.ai/  Some notes about the data (as i understood them) The images from data are generated by carrying out biological experiments using reagents known as siRNAs. Each images instance has 6 individual channel different organelles of the cells - the nucleus, endoplasmic reticulum, actin cytoskeleton, nucleolus, mitochondria, and golgi apparatus. Each six-channel image is one of the types of cells:  HUVEC RPE HepG2 U2OS  You can view all RGB images from the competition's training data in this video or short videos from each experiment in the output of this kernel.", "link": "https://www.kaggle.com/bonhart/eda-efficientnet-creating-video-pytorch", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch", "Pillow"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-08-05 18:19:30", "date_scraped": "2020-12-13 16:34:09", "words": 139, "sentences": 4, "runtime": 0.002, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.6042508482933044, "description_category_runtime": 14.911, "description_subcategory": "Tools", "description_subcategory_score": 0.43631434440612793, "description_subcategory_runtime": 23.197, "category": "Biotechnological & Life Sciences", "category_score": 0.6042508482933044, "subcategory": "Tools", "subcategory_score": 0.43631434440612793, "runtime_cat": 38.108, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.651", "language_code": "en", "language_score": "0.9999947001529905", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "notesthis notebook contains eda efficientnet creating video training image likbez topic structure cell en playlist ru playlist generation action sirnas mirnas en 7 min video ru 5 min video brief introduction rxrx httpswwwrxrxai note data understood image data generated carrying biological experiment using reagent known sirnas image instance 6 individual channel different organelle cell nucleus endoplasmic reticulum actin cytoskeleton nucleolus mitochondrion golgi apparatus sixchannel image one type cell huvec rpe hepg2 u2os view rgb image competition training data video short video experiment output kernel", "tags_descriptive": []}