{"title": "Covid-19 Predictions, Growth Factor, and Calculus", "description": "Covid-19 Growth Factor by Country Please watch the following 9-minute video on exponential growth and the spread of disease...https://www.youtube.com/watch?v=Kas0tIxDvrg The versions before Version 16 explored Savitzky–Golay filter (https://en.wikipedia.org/wiki/File:Lissage_sg3_anim.gif) for smoothing data however it seems that that filter is too good at retaining the original trends in data. So here we change to a different smoothing technique. Disclaimer: This notebook demonstrates a very simple mathematical model, a differential equation called the logistic equation which is a special case of the Bernoulli equation. The purpose of this notebook was to illustrate mathematical modeling with simple ordinary differential equations to my introductory mathematical modeling class. I am not a health expert, this notebook should not be taken too seriously.", "link": "https://www.kaggle.com/dferhadi/covid-19-predictions-growth-factor-and-calculus", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-08-22 19:58:54", "date_scraped": "2020-12-12 18:15:06", "words": 116, "sentences": 5, "runtime": 0.002, "description_category": "Healthcare", "description_category_score": 0.21475133299827576, "description_category_runtime": 13.485, "description_subcategory": "Tools", "description_subcategory_score": 0.592934787273407, "description_subcategory_runtime": 20.613, "category": "Healthcare", "category_score": 0.21475133299827576, "subcategory": "Tools", "subcategory_score": 0.592934787273407, "runtime_cat": 34.098, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.765", "language_code": "en", "language_score": "0.999996556781511", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "covid19 growth factor country please watch following 9minute video exponential growth spread diseasehttpswwwyoutubecomwatchvkas0tixdvrg version version 16 explored savitzkygolay filter httpsenwikipediaorgwikifilelissage_sg3_animgif smoothing data however seems filter good retaining original trend data change different smoothing technique disclaimer notebook demonstrates simple mathematical model differential equation called logistic equation special case bernoulli equation purpose notebook illustrate mathematical modeling simple ordinary differential equation introductory mathematical modeling class health expert notebook taken seriously", "tags_descriptive": ["Exploratory Data Analysis"]}