{"title": "2 - Understanding and plotting rle bounding boxes", "description": "2. Understanding and plotting rle bounding boxesAirbus Ship Detection Challenge - A quick overview for computer vision noobs  Hi, and welcome! This is the second kernel of the series Airbus Ship Detection Challenge - A quick overview for computer vision noobs. In this short kernel we will explain the run-length encoded bounding boxes, translate the rle code into a list of pixels with pure python and plot that list of pixels as a mask on top of the pictures with matplotlib. The full series consist of the following notebooks:  Loading and visualizing the images Understanding and plotting rle bounding boxes Basic exploratory analysis Exploring public models 1.0 submission: submitting the test file  This is an ongoing project, so expect more notebooks to be added to the series soon. Actually, we are currently working on the following ones:  Understanding and exploiting the data leak A quick overview of image segmentation domain Jumping into Pytorch Understanding U-net Proposing a simple improvement to U-net model", "link": "https://www.kaggle.com/julian3833/2-understanding-and-plotting-rle-bounding-boxes", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-10-30 01:38:41", "date_scraped": "2020-12-12 16:28:05", "words": 165, "sentences": 5, "runtime": 0.0, "description_category": "Wholesale & Retail", "description_category_score": 0.13377289474010468, "description_category_runtime": 14.344, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.46178677678108215, "description_subcategory_runtime": 22.752, "category": "Wholesale & Retail", "category_score": 0.13377289474010468, "subcategory": "Machine Learning", "subcategory_score": 0.46178677678108215, "runtime_cat": 37.096, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.72", "language_code": "en", "language_score": "0.9999944838775982", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "2 understanding plotting rle bounding boxesairbus ship detection challenge quick overview computer vision noobs hi welcome second kernel series airbus ship detection challenge quick overview computer vision noobs short kernel explain runlength encoded bounding box translate rle code list pixel pure python plot list pixel mask top picture matplotlib full series consist following notebook loading visualizing image understanding plotting rle bounding box basic exploratory analysis exploring public model 10 submission submitting test file ongoing project expect notebook added series soon actually currently working following one understanding exploiting data leak quick overview image segmentation domain jumping pytorch understanding unet proposing simple improvement unet model", "tags_descriptive": []}