{"title": "TMDB - Detailed EDA and Time Series", "description": "TMDB - Detailed EDA and Time Series   TMDB (The Movie Database) is a community-built portal containing data about movies and TV shows thus becoming a direct competition of IMDb. As the film industry grows every year, more and more movies are being released - and as the taste of cinema-goers changes with time, film indutry has to adapt as well. Amount of money flowing to and from this market is immense so the interest in trends prediction is growing. On other side, for a common person it would be difficult to follow all the news from this world and websites like TMDB allow them to get a good overview of what is currently played. The database given to us in this competition is a movie database containing a vast amount of information about movies dating back to 70s. This will give us a great opportunity to learn how the film industry developed over the years, who are the biggest players and what trends can we observe. And of course finally, we can hone our data analysis and machine learning skills. Let's start our investigation!  (screenshot of the main page of TMDB) Content: 1-EDA a-Number of titles per year b-Revenue per year c-Budget per year d-Runtime per year    2-Correlations a-Overview of numerical variables   3-Categorical variables   SOME INSIGHTS  Average length of a movie is about 107 minutes The longest movie: \"Carlos\" is 5hrs 38min long The most popular movies: \"Wonder Woman\" and \"Beauty and the Beast\" Movies with the biggest budget: \"Pirates of the Caribbean: On Stranger Tides\" and \"Pirates of the Caribbean: At World's End\" The biggest movie producers: Warner Bros. and Universal Pictures The most popular genres: Drama and Comedy  Much more you will find in the analysis itself so enjoy!  First loading of required libraries:", "link": "https://www.kaggle.com/datark1/tmdb-detailed-eda-and-time-series", "tags": ["Exploratory Data Analysis", "Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-06-17 11:54:40", "date_scraped": "2020-12-13 17:40:32", "words": 309, "sentences": 9, "sum_nltk": "TMDB - Detailed EDA and Time Series   TMDB (The Movie Database) is a community-built portal containing data about movies and TV shows thus becoming a direct competition of IMDb. As the film industry grows every year, more and more movies are being released - and as the taste of cinema-goers changes with time, film indutry has to adapt as well.\nThis will give us a great opportunity to learn how the film industry developed over the years, who are the biggest players and what trends can we observe.\nAnd of course finally, we can hone our data analysis and machine learning skills.\n(screenshot of the main page of TMDB) Content: 1-EDA a-Number of titles per year b-Revenue per year c-Budget per year d-Runtime per year    2-Correlations a-Overview of numerical variables   3-Categorical variables   SOME INSIGHTS  Average length of a movie is about 107 minutes The longest movie: \"Carlos\" is 5hrs 38min long The most popular movies: \"Wonder Woman\" and \"Beauty and the Beast\" Movies with the biggest budget: \"Pirates of the Caribbean: On Stranger Tides\" and \"Pirates of the Caribbean: At World's End\" The biggest movie producers: Warner Bros.\nand Universal Pictures The most popular genres: Drama and Comedy  Much more you will find in the analysis itself so enjoy!", "sum_nltk_words": 216, "sum_nltk_runtime": 0.003, "sum_t5": "Detailed EDA and Time Series TMDB (The Movie Database) is a community-built portal containing data about movies and TV shows. as the film industry grows every year, more and more movies are being released. a vast amount of information about movies dating back to 70s is given to us in this competition. TMDB is a movie database containing a vast amount of information about movies dating back to 70s. it will give us a great opportunity to learn how the film industry developed over the", "sum_t5_words": 85, "sum_t5_runtime": 6.62, "runtime": 0.003, "nltk_category": "Education & Research", "nltk_category_score": 0.5094038248062134, "nltk_category_runtime": 20.489, "nltk_subcategory": "Quality", "nltk_subcategory_score": 0.6750572919845581, "nltk_subcategory_runtime": 33.248, "category": "Education & Research", "category_score": 0.5094038248062134, "subcategory": "Quality", "subcategory_score": 0.6750572919845581, "runtime_cat": 53.736, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.717", "language_code": "en", "language_score": "0.9999974544731189", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "tmdb detailed eda time series tmdb movie database communitybuilt portal containing data movie tv show thus becoming direct competition imdb film industry grows every year movie released taste cinemagoers change time film indutry adapt well amount money flowing market immense interest trend prediction growing side common person would difficult follow news world website like tmdb allow get good overview currently played database given u competition movie database containing vast amount information movie dating back 70 give u great opportunity learn film industry developed year biggest player trend observe course finally hone data analysis machine learning skill let start investigation screenshot main page tmdb content 1eda anumber title per year brevenue per year cbudget per year druntime per year 2correlations aoverview numerical variable 3categorical variable insight average length movie 107 minute longest movie carlos 5hrs 38min long popular movie wonder woman beauty beast movie biggest budget pirate caribbean stranger tide pirate caribbean world end biggest movie producer warner bros universal picture popular genre drama comedy much find analysis enjoy first loading required library", "tags_descriptive": ["Exploratory Data Analysis", "Feature Engineering"]}