{"title": "Grapheme fast.ai starter", "description": "DescriptionGreetings, this kernel provides fast.ai starter code for Bengali.AI Handwritten Grapheme Classification competition. The task proposed in this competition is recognition of handwritten Bengali letters. In contrast to similar competitions such as mnist digit recognition or the recent Kannada MNIST, Bengali alphabet is quite complex and may include ~13,000 different grapheme variations. Fortunately, each grapheme can be decomposed into 3 parts: grapheme_root, vowel_diacritic, and consonant_diacritic (168, 11, and 7 independent classes, respectively). Therefore, the task of grapheme recognition is significantly simplified in comparison with 13k-way classification. Though, additional consideration may be required for this multitask classification, like checking if 3 independent models, or a single model one head, or a single model with 3 heads (this kernel) works the best. This kernel is mostly based on my findings in a recent Kannada MNIST toy competition. In addition to this kernel I have prepared a code for data preprocessing and generation of cropped images rescaled to 128x128. Because the data has much higher resolution than MNIST or CIFAR, the things that work there may be less applicable to this data, while ImageNet based solutions should be more suitable. So, I've choosen DenseNet121 as a starter network. In addition to this kernel I will prepare a submission kernel posted separately.", "link": "https://www.kaggle.com/iafoss/grapheme-fast-ai-starter-lb-0-964", "tags": ["DL", "Classification"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-12-31 20:55:41", "date_scraped": "2020-12-12 17:09:20", "words": 208, "sentences": 11, "sum_nltk": "DescriptionGreetings, this kernel provides fast.ai starter code for Bengali.AI Handwritten Grapheme Classification competition.\nThe task proposed in this competition is recognition of handwritten Bengali letters.\nIn contrast to similar competitions such as mnist digit recognition or the recent Kannada MNIST, Bengali alphabet is quite complex and may include ~13,000 different grapheme variations.\nFortunately, each grapheme can be decomposed into 3 parts: grapheme_root, vowel_diacritic, and consonant_diacritic (168, 11, and 7 independent classes, respectively).\nTherefore, the task of grapheme recognition is significantly simplified in comparison with 13k-way classification.\nThough, additional consideration may be required for this multitask classification, like checking if 3 independent models, or a single model one head, or a single model with 3 heads (this kernel) works the best.\nThis kernel is mostly based on my findings in a recent Kannada MNIST toy competition.\nIn addition to this kernel I have prepared a code for data preprocessing and generation of cropped images rescaled to 128x128.\nBecause the data has much higher resolution than MNIST or CIFAR, the things that work there may be less applicable to this data, while ImageNet based solutions should be more suitable.\nSo, I've choosen DenseNet121 as a starter network.\nIn addition to this kernel I will prepare a submission kernel posted separately.", "sum_nltk_words": 198, "sum_nltk_runtime": 0.003, "sum_t5": "this kernel provides fast.ai starter code for Bengali.AI Handwritten Grapheme Classification. task proposed in this competition is recognition of handwritten Bengali letters. each grapheme can be decomposed into 3 parts: grapheme_root, vowel_diacritic, and consonant_diacritic. a kernel is mostly based on findings in a recent Kannada MNIST toy competition.", "sum_t5_words": 48, "sum_t5_runtime": 4.884, "runtime": 0.002, "nltk_category": "Utilities", "nltk_category_score": 0.5963826775550842, "nltk_category_runtime": 21.0, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.9388138651847839, "nltk_subcategory_runtime": 34.007, "category": "Utilities", "category_score": 0.5963826775550842, "subcategory": "Machine Learning", "subcategory_score": 0.9388138651847839, "runtime_cat": 55.007, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.765", "language_code": "en", "language_score": "0.9999978295154716", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "descriptiongreetings kernel provides fastai starter code bengaliai handwritten grapheme classification competition task proposed competition recognition handwritten bengali letter contrast similar competition mnist digit recognition recent kannada mnist bengali alphabet quite complex may include 13000 different grapheme variation fortunately grapheme decomposed 3 part grapheme_root vowel_diacritic consonant_diacritic 168 11 7 independent class respectively therefore task grapheme recognition significantly simplified comparison 13kway classification though additional consideration may required multitask classification like checking 3 independent model single model one head single model 3 head kernel work best kernel mostly based finding recent kannada mnist toy competition addition kernel prepared code data preprocessing generation cropped image rescaled 128x128 data much higher resolution mnist cifar thing work may le applicable data imagenet based solution suitable ive choosen densenet121 starter network addition kernel prepare submission kernel posted separately", "tags_descriptive": ["Deep Learning (DL)", "Classification"]}