{"title": "Improved Lung Segmentation using Watershed", "description": "The previously suggested Lung Segmentation methods in the challenge Kernels mainly involve thresholding the lung tissue based on its hounsfield value and using morphological dilation to include nodules in border regions. These methods have the severe drawback of also including lots of tissue that is neither lung, nor a region of interest. I coded up an algorithm based on the one presented in R Shojaii et al (2005, DOI: 10.1109/ICIP.2005.1530294) with some modifications, that I will present here. Some preprocessing and presentation code for this is also taken from the Kernels presented by Guido Zuidhof and ArnavJain. Lots of thanks to them for sharing their code. The resulting CT Images are in HU and have the same (not necessarily equidistant) scale as the original scans.", "link": "https://www.kaggle.com/ankasor/improved-lung-segmentation-using-watershed", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["skimage"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-01-24 23:23:13", "date_scraped": "2020-12-12 18:38:03", "words": 125, "sentences": 6, "runtime": 0.003, "description_category": "Healthcare", "description_category_score": 0.4298926293849945, "description_category_runtime": 12.494, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.49075549840927124, "description_subcategory_runtime": 19.526, "category": "Healthcare", "category_score": 0.4298926293849945, "subcategory": "Judicial Applied", "subcategory_score": 0.49075549840927124, "runtime_cat": 32.02, "programming_language": "Jupyter Notebook", "ml_score": "0.7", "engagement_score": "0.775", "language_code": "en", "language_score": "0.9999974011593579", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "previously suggested lung segmentation method challenge kernel mainly involve thresholding lung tissue based hounsfield value using morphological dilation include nodule border region method severe drawback also including lot tissue neither lung region interest coded algorithm based one presented r shojaii et al 2005 doi 101109icip20051530294 modification present preprocessing presentation code also taken kernel presented guido zuidhof arnavjain lot thanks sharing code resulting ct image hu necessarily equidistant scale original scan", "tags_descriptive": []}