{"title": "Inference Demo", "description": "Inference Kernel DemoThis is the kernel I’ve used for my recent submissions. It takes about 5-6 hours on the test set, using only CPU. I’ve provided this kernel because a lot of people have problems making submissions. This method works and has never errored out for me. (Although I haven't tried making a submission using the GPU yet -- so no guarantees there.) It uses BlazeFace for face extraction (see also my BlazeFace kernel) and ResNeXt50 as the classifier model. We take the average prediction over 17 frames from each video. (Why 17? Using more frames makes the kernel slower, but doesn't appear to improve the score much. I used an odd number so we don't always land on even frames.) Please use this kernel only to learn from... Included is the checkpoint for a ResNeXt50 model that hasn't really been trained very well yet. I'm sure you can improve on it by training your own model! You could use the included trained weights to get yourself an easy top-50 score on the leaderboard (as of 24 Jan 2020) but it’s nicer to use it as a starting point for your own work. :-)", "link": "https://www.kaggle.com/humananalog/inference-demo", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pytorch"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-01-24 23:27:35", "date_scraped": "2020-12-12 18:44:56", "words": 194, "sentences": 11, "runtime": 0.0, "description_category": "Finance", "description_category_score": 0.16500025987625122, "description_category_runtime": 16.942, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.9683818221092224, "description_subcategory_runtime": 28.014, "category": "Finance", "category_score": 0.16500025987625122, "subcategory": "Machine Learning", "subcategory_score": 0.9683818221092224, "runtime_cat": 44.956, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.775", "language_code": "en", "language_score": "0.9999970537838613", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "inference kernel demothis kernel ive used recent submission take 56 hour test set using cpu ive provided kernel lot people problem making submission method work never errored although havent tried making submission using gpu yet guarantee us blazeface face extraction see also blazeface kernel resnext50 classifier model take average prediction 17 frame video 17 using frame make kernel slower doesnt appear improve score much used odd number dont always land even frame please use kernel learn included checkpoint resnext50 model hasnt really trained well yet im sure improve training model could use included trained weight get easy top50 score leaderboard 24 jan 2020 nicer use starting point work", "tags_descriptive": []}