{"title": "NCAA At-Large Selection and Seeding Automation", "description": "At-Large and Seeding Automation via Machine Learning:The NCAA Men's basketball season can be viewed in three distinct sections. The first is the regular season. This is when all non-conference and conference games are played. The second and shortest is the conference tournament where teams can earn a chance to play in the NCAA Tournament. Lastly, the third section - reserved for only 68 teams - is the tournament used to crown the champion.  It could be fairly stated the reason NCAA men's basketball teams play the regular season is for the opportunity to play in the NCAA tournament. Some teams are guaranteed this opportunity by winning their end of season conference tournament. Teams that don't win their conference tournament may still receive an invitation via an at-large selection as a result of the high quality of their regular season and conference tournament play. After the selection committee chooses the at-large teams, it must assign all teams, both conference tournament winners and at-large selections, a seed. The purpose of this notebook is two-fold: first, to model the at-large teams and second, to assign each team a seed. Both processes will use machine learning approaches to derive the results. Along the way, we'll compare the expected versus actual results. Who made it into the at-large field under the wire and who was left standing in the cold? Who received higher or lower seeding than expected? With a high degree of accuracy, can we automate the at-large and seeding process for the NCAA Men's Basketball Tournament? How do we handle the 2020 season?", "link": "https://www.kaggle.com/btesch/ncaa-at-large-selection-and-seeding-automation", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["lightgbm"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-05-01 01:37:01", "date_scraped": "2020-12-13 13:49:58", "words": 261, "sentences": 13, "sum_nltk": "At-Large and Seeding Automation via Machine Learning:The NCAA Men's basketball season can be viewed in three distinct sections.\nThe second and shortest is the conference tournament where teams can earn a chance to play in the NCAA Tournament.\nLastly, the third section - reserved for only 68 teams - is the tournament used to crown the champion.\nIt could be fairly stated the reason NCAA men's basketball teams play the regular season is for the opportunity to play in the NCAA tournament.\nSome teams are guaranteed this opportunity by winning their end of season conference tournament.\nTeams that don't win their conference tournament may still receive an invitation via an at-large selection as a result of the high quality of their regular season and conference tournament play.\nAfter the selection committee chooses the at-large teams, it must assign all teams, both conference tournament winners and at-large selections, a seed.\nThe purpose of this notebook is two-fold: first, to model the at-large teams and second, to assign each team a seed.\nBoth processes will use machine learning approaches to derive the results.\nWho received higher or lower seeding than expected?\nWith a high degree of accuracy, can we automate the at-large and seeding process for the NCAA Men's Basketball Tournament?", "sum_nltk_words": 199, "sum_nltk_runtime": 0.003, "sum_t5": "the regular season is when all non-conference and conference games are played. the conference tournament is where teams can earn a chance to play in the NCAA Tournament. the tournament is reserved for only 68 teams. can we automate the at-large and seeding process for the NCAA Men's Basketball Tournament? how do we handle the 2020 season?...................", "sum_t5_words": 57, "sum_t5_runtime": 6.246, "runtime": 0.002, "nltk_category": "Construction & Engineering", "nltk_category_score": 0.5852715373039246, "nltk_category_runtime": 17.944, "nltk_subcategory": "Machine Learning", "nltk_subcategory_score": 0.957923948764801, "nltk_subcategory_runtime": 28.996, "category": "Construction & Engineering", "category_score": 0.5852715373039246, "subcategory": "Machine Learning", "subcategory_score": 0.957923948764801, "runtime_cat": 46.942, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.579", "language_code": "en", "language_score": "0.9999975054556356", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "atlarge seeding automation via machine learningthe ncaa men basketball season viewed three distinct section first regular season nonconference conference game played second shortest conference tournament team earn chance play ncaa tournament lastly third section reserved 68 team tournament used crown champion could fairly stated reason ncaa men basketball team play regular season opportunity play ncaa tournament team guaranteed opportunity winning end season conference tournament team dont win conference tournament may still receive invitation via atlarge selection result high quality regular season conference tournament play selection committee chooses atlarge team must assign team conference tournament winner atlarge selection seed purpose notebook twofold first model atlarge team second assign team seed process use machine learning approach derive result along way well compare expected versus actual result made atlarge field wire left standing cold received higher lower seeding expected high degree accuracy automate atlarge seeding process ncaa men basketball tournament handle 2020 season", "tags_descriptive": []}