{"title": "Simple Exploration Notebook - NFL", "description": "About NFLThe National Football League (NFL) is a professional American football league consisting of 32 teams. The NFL is one of the four major professional sports leagues in North America and the highest professional level of American football in the world. Source: Wikipedia  Rules of NFLIf you are a newbie (just like me) to the world of NFL, there you can read about the basics from this discussion thread. Competition ObjectiveIn the National Football League (NFL), roughly a third of teams’ offensive yardage comes from run plays. A running play or rushing play is a tactic in which the football is advanced up the field by a player running it rather than passing it. Competition is to develop a model to predict how many yards a team will gain on given rushing plays as they happen. We are given the data when the ball is handed off (TimeHandoff) to forecast the yardage gained on that play. Notebook objectiveObjective of the notebook is to explore the data and find some interesting insights along the way. References:This wonderful kernel by Rob is the basis for this notebook Let us first look at the top few rows to understand the data.", "link": "https://www.kaggle.com/sudalairajkumar/simple-exploration-notebook-nfl", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-10-16 09:44:39", "date_scraped": "2020-12-13 14:21:44", "words": 199, "sentences": 9, "runtime": 0.002, "description_category": "Media & Publishing", "description_category_score": 0.3345038890838623, "description_category_runtime": 15.941, "description_subcategory": "Physical", "description_subcategory_score": 0.5395061373710632, "description_subcategory_runtime": 25.451, "category": "Media & Publishing", "category_score": 0.3345038890838623, "subcategory": "Physical", "subcategory_score": 0.5395061373710632, "runtime_cat": 41.393, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.724", "language_code": "en", "language_score": "0.9999971458581606", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "nflthe national football league nfl professional american football league consisting 32 team nfl one four major professional sport league north america highest professional level american football world source wikipedia rule nflif newbie like world nfl read basic discussion thread competition objectivein national football league nfl roughly third team offensive yardage come run play running play rushing play tactic football advanced field player running rather passing competition develop model predict many yard team gain given rushing play happen given data ball handed timehandoff forecast yardage gained play notebook objectiveobjective notebook explore data find interesting insight along way referencesthis wonderful kernel rob basis notebook let u first look top row understand data", "tags_descriptive": []}