{"title": "Genetic Variants to Protein Features", "description": "Some initial features from the Variants Note: As this is my first published Kernel, forgive my coding style and brevity.  The bulk of the features I've generated so far involve the mutations/Variants and their effects. My background is in Proteins/Neuropeptides, so I took some ideas from my Thesis, which was a number of Feature engineering libraries for Protein sequences. You can read up on feature engineering/ML with proteins/peptides in one of the papers, and the code+toolkits are all freely available (NeuroPID, ProFET, ASAP).  If you use it, please cite :).  NeuroPID: a predictor for identifying neuropeptide precursors https://www.ncbi.nlm.nih.gov/pubmed/24336809   ProFET: Feature engineering captures high-level protein functions.   * https://www.ncbi.nlm.nih.gov/pubmed/26130574    * https://github.com/ddofer/ProFET/blob/master/ProFET/feat_extract/AAlphabets.py   I'll try to add some additional techniques/tricks as the competition progresses, but no promises. (I'm lazy, and my code is not just in Python. I'm hoping to lead by example here, and that others will upload rather better code than this).", "link": "https://www.kaggle.com/danofer/genetic-variants-to-protein-features", "tags": ["Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2017-07-08 14:45:36", "date_scraped": "2020-12-13 14:17:31", "words": 162, "sentences": 9, "runtime": 0.0, "description_category": "Biotechnological & Life Sciences", "description_category_score": 0.2868606150150299, "description_category_runtime": 20.867, "description_subcategory": "Judicial Applied", "description_subcategory_score": 0.32055866718292236, "description_subcategory_runtime": 33.146, "category": "Biotechnological & Life Sciences", "category_score": 0.2868606150150299, "subcategory": "Judicial Applied", "subcategory_score": 0.32055866718292236, "runtime_cat": 54.013, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.732", "language_code": "en", "language_score": "0.9999979133673718", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "initial feature variant note first published kernel forgive coding style brevity bulk feature ive generated far involve mutationsvariants effect background proteinsneuropeptides took idea thesis number feature engineering library protein sequence read feature engineeringml proteinspeptides one paper codetoolkits freely available neuropid profet asap use please cite neuropid predictor identifying neuropeptide precursor httpswwwncbinlmnihgovpubmed24336809 profet feature engineering capture highlevel protein function httpswwwncbinlmnihgovpubmed26130574 httpsgithubcomddoferprofetblobmasterprofetfeat_extractaalphabetspy ill try add additional techniquestricks competition progress promise im lazy code python im hoping lead example others upload rather better code", "tags_descriptive": ["Feature Engineering"]}