{"title": "Classification of Series", "description": "Classification of SeriesI am not a math expert. I am trying to find clever tricks to solve this problem. We need to divide the series into bins for ML to work better on them. There are different kind of series. We will try to categorize them into groups. Lets start with simple classification: oscillating (OS) or non oscillating (NOS). Other way to classify is to check if it is increasing (I), decreasing (D), or range bound (RB). We can further classify the a series as arthematic series (AS) or exponential series (ES). We can trian a different machine learning algorithm for each type of series and hopefully be more successful. Let us read the data and examine it.", "link": "https://www.kaggle.com/shivaramkrs/classification-of-series", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2016-07-14 16:13:37", "date_scraped": "2020-12-13 11:57:13", "words": 118, "sentences": 10, "runtime": 0.0, "description_category": "Utilities", "description_category_score": 0.18881835043430328, "description_category_runtime": 10.99, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.8834177851676941, "description_subcategory_runtime": 16.753, "category": "Utilities", "category_score": 0.18881835043430328, "subcategory": "Machine Learning", "subcategory_score": 0.8834177851676941, "runtime_cat": 27.744, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.667", "language_code": "en", "language_score": "0.9999987230249548", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "classification seriesi math expert trying find clever trick solve problem need divide series bin ml work better different kind series try categorize group let start simple classification oscillating o non oscillating no way classify check increasing decreasing range bound rb classify series arthematic series exponential series e trian different machine learning algorithm type series hopefully successful let u read data examine", "tags_descriptive": []}