{"title": "Mercari Interactive EDA + Topic Modelling", "description": "IntroductionThis is an initial Explanatory Data Analysis for the Mercari Price Suggestion Challenge with matplotlib. bokeh and Plot.ly - a visualization tool that creates beautiful interactive plots and dashboards.  The competition is hosted by Mercari, the biggest Japanese community-powered shopping app with the main objective to predict an accurate price that Mercari should suggest to its sellers, given the item's information. Update: The abundant amount of food from my family's Thanksgiving dinner has really energized me to continue working on this model. I decided to dive deeper into the NLP analysis and found an amazing tutorial by Ahmed BESBES. The framework below is  based on his source code.  It provides guidance on pre-processing documents and  machine learning techniques (K-means and LDA) to clustering topics.  So that this kernel will be divided into 2 parts:  Explanatory Data Analysis  Text Processing  2.1. Tokenizing and  tf-idf algorithm  2.2. K-means Clustering  2.3. Latent Dirichlet Allocation (LDA)  / Topic Modelling", "link": "https://www.kaggle.com/thykhuely/mercari-interactive-eda-topic-modelling", "tags": ["Exploratory Data Analysis"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "nltk", "vocabulary"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2018-04-22 10:23:34", "date_scraped": "2020-12-13 14:05:42", "words": 167, "sentences": 11, "runtime": 0.002, "description_category": "Wholesale & Retail", "description_category_score": 0.08351301401853561, "description_category_runtime": 16.283, "description_subcategory": "Machine Learning", "description_subcategory_score": 0.5350804924964905, "description_subcategory_runtime": 26.032, "category": "Wholesale & Retail", "category_score": 0.08351301401853561, "subcategory": "Machine Learning", "subcategory_score": 0.5350804924964905, "runtime_cat": 42.315, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.814", "language_code": "en", "language_score": "0.9999968265240053", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "introductionthis initial explanatory data analysis mercari price suggestion challenge matplotlib bokeh plotly visualization tool creates beautiful interactive plot dashboard competition hosted mercari biggest japanese communitypowered shopping app main objective predict accurate price mercari suggest seller given item information update abundant amount food family thanksgiving dinner really energized continue working model decided dive deeper nlp analysis found amazing tutorial ahmed besbes framework based source code provides guidance preprocessing document machine learning technique kmeans lda clustering topic kernel divided 2 part explanatory data analysis text processing 21 tokenizing tfidf algorithm 22 kmeans clustering 23 latent dirichlet allocation lda topic modelling", "tags_descriptive": ["Exploratory Data Analysis"]}