{"title": "Birdcall Starter: Tablular+Image data", "description": "Feel free to comment any suggestions or criticism you might have. Please refer to the table of contents below for structural navigation.Upvote and share if you find the notebook useful! Thank you :)Table of contents: Intro Exploring the training data Analysis of \"Relevant Fields\" ebird location recordist   Audio Representation Waveform or PCM Spectrogram   Audio Feature Extraction Spectral Centroid Spectral Roll-off Spectral Bandwidth Spectral Flux Spectral Contrast Spectral Flatness Zero-crossing rate Autocorrelation Fundamental Frequency Tempo Estimation   Mel-Frequency Cepstral Coefficients Chromogram   References Further Readings   Introduction Bird vocalization includes both bird calls and bird songs. In non-technical use, bird songs are the bird sounds that are melodious to the human ear. The distinction between songs and calls is based upon complexity, length, and context. Songs are longer and more complex and are associated with territory and courtship and mating, while calls tend to serve such functions as alarms or keeping members of a flock in contact.  Song is usually delivered from prominent perches, although some species may sing when flying (we find such recordings in the training data).  Purpose behind calls & songs:  One of the two main functions of bird song is mate attraction. Experiments also suggest that parasites and diseases may directly affect song characteristics such as song rate, which thereby act as reliable indicators of health. Therefore, a female bird may select males based on the quality of their songs and the size of their song repertoire.    The second principal function of bird song is territory defense. Territorial birds will interact with each other using song to negotiate territory boundaries. Since song may be a reliable indicator of quality, individuals may be able to discern the quality of rivals and prevent an energetically costly fight. Song complexity is also linked to male territorial defense, with more complex songs being perceived as a greater territorial threat.  Communication through bird calls can be between individuals of the same species or even across species. Birds communicate alarm through vocalizations and movements that are specific to the threat, and bird alarms can be understood by other animal species, including other birds, in order to identify and protect against the specific threat. Many birds engage in duet calls. In some cases, the duets are so perfectly timed as to appear almost as one call(something we need to keep in mind while working on the data).", "link": "https://www.kaggle.com/navinmundhra/birdcall-starter-tablular-image-data", "tags": ["Feature Engineering"], "kind": ["Project", "(Notebook)"], "ml_libs": ["sklearn", "pattern"], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2020-08-13 12:05:23", "date_scraped": "2020-12-12 17:18:50", "words": 407, "sentences": 17, "sum_nltk": "Thank you :)Table of contents: Intro Exploring the training data Analysis of \"Relevant Fields\" ebird location recordist   Audio Representation Waveform or PCM Spectrogram   Audio Feature Extraction Spectral Centroid Spectral Roll-off Spectral Bandwidth Spectral Flux Spectral Contrast Spectral Flatness Zero-crossing rate Autocorrelation Fundamental Frequency Tempo Estimation   Mel-Frequency Cepstral Coefficients Chromogram   References Further Readings   Introduction Bird vocalization includes both bird calls and bird songs.\nSongs are longer and more complex and are associated with territory and courtship and mating, while calls tend to serve such functions as alarms or keeping members of a flock in contact.\nPurpose behind calls & songs:  One of the two main functions of bird song is mate attraction.\nExperiments also suggest that parasites and diseases may directly affect song characteristics such as song rate, which thereby act as reliable indicators of health.\nTherefore, a female bird may select males based on the quality of their songs and the size of their song repertoire.\nThe second principal function of bird song is territory defense.\nSong complexity is also linked to male territorial defense, with more complex songs being perceived as a greater territorial threat.\nCommunication through bird calls can be between individuals of the same species or even across species.\nMany birds engage in duet calls.", "sum_nltk_words": 211, "sum_nltk_runtime": 0.005, "sum_t5": "bird vocalization includes both bird calls and bird songs. birds communicate alarm through vocalizations and movements that are specific to the threat. bird songs are the bird sounds that are melodious to the human ear. the notebook is available for download at ebird.com/ebird/training/. click here to share your thoughts on the notebook. a cnn user can comment on the notebook.. if you find it useful, share it with others.", "sum_t5_words": 69, "sum_t5_runtime": 6.524, "runtime": 0.004, "nltk_category": "Emergency & Relief", "nltk_category_score": 0.6876404881477356, "nltk_category_runtime": 20.125, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.7449891567230225, "nltk_subcategory_runtime": 31.882, "category": "Emergency & Relief", "category_score": 0.6876404881477356, "subcategory": "Judicial Applied", "subcategory_score": 0.7449891567230225, "runtime_cat": 52.008, "programming_language": "Jupyter Notebook", "ml_score": "1.0", "engagement_score": "0.678", "language_code": "en", "language_score": "0.9999956023192296", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "feel free comment suggestion criticism might please refer table content structural navigationupvote share find notebook useful thank table content intro exploring training data analysis relevant field ebird location recordist audio representation waveform pcm spectrogram audio feature extraction spectral centroid spectral rolloff spectral bandwidth spectral flux spectral contrast spectral flatness zerocrossing rate autocorrelation fundamental frequency tempo estimation melfrequency cepstral coefficient chromogram reference reading introduction bird vocalization includes bird call bird song nontechnical use bird song bird sound melodious human ear distinction song call based upon complexity length context song longer complex associated territory courtship mating call tend serve function alarm keeping member flock contact song usually delivered prominent perch although specie may sing flying find recording training data purpose behind call song one two main function bird song mate attraction experiment also suggest parasite disease may directly affect song characteristic song rate thereby act reliable indicator health therefore female bird may select male based quality song size song repertoire second principal function bird song territory defense territorial bird interact using song negotiate territory boundary since song may reliable indicator quality individual may able discern quality rival prevent energetically costly fight song complexity also linked male territorial defense complex song perceived greater territorial threat communication bird call individual specie even across specie bird communicate alarm vocalization movement specific threat bird alarm understood animal specie including bird order identify protect specific threat many bird engage duet call case duet perfectly timed appear almost one callsomething need keep mind working data", "tags_descriptive": ["Feature Engineering"]}