{"title": "4. Promotional Pathway Discoverability - CoLA", "description": "Data Science For Good : CoLA A Complete Pipeline for Structuring, Analysis and Recommendation Improve Hiring Process and Decisions  Key Objectives: Keeping these challenges in mind, an ideal solution for the City of Los Angeles has following key objectives: Develop an nlp framework to accurately structurize the job descriptions. Develop an analysis framework to identify the implict bias in the text and encourage diversity. Develop a system which can clearly identify the promotion pathways within the organization.My Submission: Following are parts of Kernels Submissions in order:  Part 1: Job Bulletin Structuring Engine - City of Los Angeles   Part 2: Encourage Diversity and Remove Unconsious Bias from Job Bulletins - A Deep Analysis  Part 3: Impact of Content, Tone, and Language : CTL Analysis for CoLA  Part 4: Increasing the Discoverability of Promotional Pathways (Explicit)  Part 5: Implicit Promotional Pathways DiscoverabilityPart 4: Increasing the Discoverability of Promotional Pathways  Other Parts: Part 1 | Part 2 | Part 3 | Part 4 | Part 5 The aim of this kernel is to provide an easy solution to identify the explict promotion pathways in City of Los Angeles. I developed a reusable python module in which the program identifies which job roles are required to fill another particular job class. Using this class, one can identify: What are the possible pathways of Job Class which are required to fill a particular Job Class?      What are the possible Job Classes an Employee can be promoted to?   Table of Contents1. Possible Pathways to fill a Job Class  2. Possible Promotion Pathways for a Job Class   1. Possible Pathways to fill a ClassSometimes, it is very hard to find qualified candidates to fill a particular job class. Infact, City of Los Angeles has mentioned that there are atleast 17 job classes int which it is very challenging to find the right qualified candidates. These include Accountant, Accounting Clerk, Applications Programmer, Assistant Street Lighting Electrician, Building Mechanical, Inspector, Detention Officer, Electrical Mechanic, Equipment Mechanic, Field Engineering Aide, Housing Inspector, Housing Investigator, Librarian, Security Officer, Senior Administrative Clerk, Senior Custodian, Senior Equipment Mechanic, Tree Surgeon. The following framework analyzes the structured data, specifically the requirements of a particular job and identifies which other job classes are required to fill the particular job class. In the end, City of LA can use this piece of code to generate all possible promotion pathways using a single line of code.", "link": "https://www.kaggle.com/shivamb/4-promotional-pathway-discoverability-cola", "tags": [], "kind": ["Project", "(Notebook)"], "ml_libs": [], "host": "kaggle.com", "license": "Apache-2.0", "language": "english", "date_project": "2019-06-21 12:02:40", "date_scraped": "2020-12-12 18:42:37", "words": 417, "sentences": 12, "sum_nltk": "Data Science For Good : CoLA A Complete Pipeline for Structuring, Analysis and Recommendation Improve Hiring Process and Decisions  Key Objectives: Keeping these challenges in mind, an ideal solution for the City of Los Angeles has following key objectives: Develop an nlp framework to accurately structurize the job descriptions.\nDevelop a system which can clearly identify the promotion pathways within the organization.My Submission: Following are parts of Kernels Submissions in order:  Part 1: Job Bulletin Structuring Engine - City of Los Angeles   Part 2: Encourage Diversity and Remove Unconsious Bias from Job Bulletins - A Deep Analysis  Part 3: Impact of Content, Tone, and Language : CTL Analysis for CoLA  Part 4: Increasing the Discoverability of Promotional Pathways (Explicit)  Part 5: Implicit Promotional Pathways DiscoverabilityPart 4: Increasing the Discoverability of Promotional Pathways  Other Parts: Part 1 | Part 2 | Part 3 | Part 4 | Part 5 The aim of this kernel is to provide an easy solution to identify the explict promotion pathways in City of Los Angeles.\nUsing this class, one can identify: What are the possible pathways of Job Class which are required to fill a particular Job Class?", "sum_nltk_words": 199, "sum_nltk_runtime": 0.004, "sum_t5": "the aim of this kernel is to provide an easy solution to identify the promotion pathways in City of Los Angeles. the kernel analyzes the structured data to identify the implict bias in the text and encourage diversity. the kernel also analyzes the impact of content, tone, and language. the kernel also analyzes the impact of the nlp framework on the city's hiring process. the kernel is available at http://www.datascienceforgood.org/.", "sum_t5_words": 70, "sum_t5_runtime": 6.315, "runtime": 0.005, "nltk_category": "Construction & Engineering", "nltk_category_score": 0.3813350200653076, "nltk_category_runtime": 17.839, "nltk_subcategory": "Judicial Applied", "nltk_subcategory_score": 0.5825658440589905, "nltk_subcategory_runtime": 28.282, "category": "Construction & Engineering", "category_score": 0.3813350200653076, "subcategory": "Judicial Applied", "subcategory_score": 0.5825658440589905, "runtime_cat": 46.122, "programming_language": "Jupyter Notebook", "ml_score": "0.5", "engagement_score": "0.638", "language_code": "en", "language_score": "0.9999972631239413", "learn_score": 1, "explore_score": 0, "compete_score": 0, "description_lemmatized": "data science good cola complete pipeline structuring analysis recommendation improve hiring process decision key objective keeping challenge mind ideal solution city los angeles following key objective develop nlp framework accurately structurize job description develop analysis framework identify implict bias text encourage diversity develop system clearly identify promotion pathway within organizationmy submission following part kernel submission order part 1 job bulletin structuring engine city los angeles part 2 encourage diversity remove unconsious bias job bulletin deep analysis part 3 impact content tone language ctl analysis cola part 4 increasing discoverability promotional pathway explicit part 5 implicit promotional pathway discoverabilitypart 4 increasing discoverability promotional pathway part part 1 part 2 part 3 part 4 part 5 aim kernel provide easy solution identify explict promotion pathway city los angeles developed reusable python module program identifies job role required fill another particular job class using class one identify possible pathway job class required fill particular job class possible job class employee promoted table contents1 possible pathway fill job class 2 possible promotion pathway job class 1 possible pathway fill classsometimes hard find qualified candidate fill particular job class infact city los angeles mentioned atleast 17 job class int challenging find right qualified candidate include accountant accounting clerk application programmer assistant street lighting electrician building mechanical inspector detention officer electrical mechanic equipment mechanic field engineering aide housing inspector housing investigator librarian security officer senior administrative clerk senior custodian senior equipment mechanic tree surgeon following framework analyzes structured data specifically requirement particular job identifies job class required fill particular job class end city la use piece code generate possible promotion pathway using single line code", "tags_descriptive": []}